{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"], ["Name", "ExplicitShawty Is Da Sh*! (feat. Fabolous)", "ExplicitI Luv Your Girl", "ExplicitFast Car", "ExplicitNikki", "ExplicitShe Needs My Love", "ExplicitFalsetto", "ExplicitPlayin' In Her Hair", "ExplicitPurple Kisses", "ExplicitDitch That...", "ExplicitLuv Songs", "ExplicitLivin' a Lie (feat. Rihanna)", "ExplicitMama"], ["Artist", "The-Dream & Fabolous", "The-Dream", "The-Dream", "The-Dream", "The-Dream", "The-Dream", "The-Dream", "The-Dream", "The-Dream", "The-Dream", "The-Dream", "The-Dream"], ["Time", "4:22", "4:27", "4:50", "4:05", "4:29", "4:31", "3:14", "5:13", "4:59", "4:41", "4:16", "4:01"], ["Price", "$1.29", "$1.29", "$1.29", "$1.29", "$0.99", "$1.29", "$1.29", "$1.29", "$0.99", "$1.29", "$1.29", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Lovehate by The-Dream", "title": "", "url": "https://itunes.apple.com/us/album/lovehate/id269581534", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00318-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 880979063, "recordOffset": 880949257, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{23322=Released at the tail end of 2007, Lovehate capped a year in which The-Dream was responsible for the biggest song in the world, Rihanna’s “Umbrella.” Written in twelve minutes flat, “Umbrella” came out of nowhere to become a colossal success, and when Def Jam requested to rush-release a solo debut, The-Dream was up to the challenge. In keeping with his efficient working streak, he delivered Lovehate in just nine days, thus avoiding the \"too much time to gestate in the studio to overwork and overproduce\" disease, delivering instead songs like “I Luv Your Girl,” “Fast Car,” and “Luv Songs” that float on air. As was the case for The-Dream's primary influence — Prince — being in the studio seems to be as much fun as it is work. “Shawty Is the Sh*!,” “Purple Kisses,” and the R. Kelly-esque “Falsetto” are all about imaginative production and clever song design — they manage to sound futuristic and retro at the same time. In an era where hype is instantaneous and trends change in the time it takes to load a webpage, Lovehate is still a few steps ahead., 132144=Copyright © 2014 Apple Inc. All rights reserved., 32087=Born: September 21, 1977 in Rockingham, NC}", "lastModified": "Fri, 31 Jul 2015 08:31:25 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist The-Dream Lovehate iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Lovehate by The-Dream, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "12 Songs Editors’ Notes Released at the tail end of 2007, Lovehate capped a year in which The-Dream was responsible for the biggest song in the world, Rihanna’s “Umbrella.” Written in twelve minutes flat, “Umbrella” came out of nowhere to become a colossal success, and when Def Jam requested to rush-release a solo debut, The-Dream was up to the challenge. In keeping with his efficient working streak, he delivered Lovehate in just nine days, thus avoiding the \"too much time to gestate in the studio to overwork and overproduce\" disease, delivering instead songs like “I Luv Your Girl,” “Fast Car,” and “Luv Songs” that float on air. As was the case for The-Dream's primary influence — Prince — being in the studio seems to be as much fun as it is work. “Shawty Is the Sh*!,” “Purple Kisses,” and the R. Kelly-esque “Falsetto” are all about imaginative production and clever song design — they manage to sound futuristic and retro at the same time. In an era where hype is instantaneous and trends change in the time it takes to load a webpage, Lovehate is still a few steps ahead. Customer Reviews A legend in the making!      ", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}