{"relation": [["Title", "Jurassic Park", "The Lost World: Jurassic Park", "Jurassic Park Vol. 1: Redemption", "Jurassic Park: The Devils in the Desert", "Jurassic Park: Dangerous Games", "Classic Jurassic Park Volume 1", "Classic Jurassic Park Volume 2: Raptors' Revenge", "Classic Jurassic Park Volume 3: Amazon Adventure!", "Classic Jurassic Park Volume 4: Return to Jurassic Park, Part 1", "Classic Jurassic Park Volume 5: Return to Jurassic Park, Part 2", "Classic Jurassic Park Volume 6: The Lost World"], ["Material collected", "Jurassic Park #1–4", "The Lost World: Jurassic Park #1–4", "Jurassic Park Redemption #1–5", "Jurassic Park: The Devils in the Desert #1–4", "Jurassic Park: Dangerous Games #1–5", "Jurassic Park #1–4", "Juassic Park #0, Jurassic Park: Raptor #1–2, Jurassic Park: Raptors Attack #1–4", "Jurassic Park: Raptors Hijack #1–4, Jurassic Park: Annual #1", "Return to Jurassic Park #1–4", "Return to Jurassic Park #5–9", "The Lost World: Jurassic Park #1–4"], ["No. of Pages", "", "", "120 pages", "104 pages", "112 pages", "104 pages", "192 pages", "124 pages", "128 pages", "108 pages", "104 pages"], ["ISBN", "ISBN 1-85286-502-4", "ISBN 1-85286-885-6", "ISBN 1-60010-850-4", "ISBN 1-60010-923-3", "ISBN 1-61377-002-2", "ISBN 1-60010-760-5", "ISBN 1-60010-885-7", "ISBN 1-61377-042-1", "ISBN 1-61377-117-7", "ISBN 978-1613775332", "ISBN 978-1613779156"]], "pageTitle": "Jurassic Park - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/Jurassic_Park_(franchise)", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 7, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00146-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 868134071, "recordOffset": 868091428, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{29456=Jurassic Park was converted into 3D and it was re-released on April 5, 2013 for its 20th Anniversary, which resulted in the film passing the $1 billion mark at the worldwide box office.[16][17][18], 10395=The Jurassic Park Ultimate Trilogy was released on DVD and Blu-ray on October 25, 2011 in North America. The first film was re-released in 3D on April 5, 2013.[1] On June 21, 1996, Universal Studios Hollywood and Universal's Islands of Adventure opened Jurassic Park: The Ride and Jurassic Park River Adventure. The rides are heavily themed on the main trilogy. The rides are similar to Thorpe Park's Tidal Wave and Parc Asterix's Le Grand Splash (En: The Big Splash)., 9687=The book was successful, as was the 1993 film adaptation, which led to three sequels, although the third and fourth films were not based on novels, as the first two were. The software developers Ocean Software, BlueSky Software, Sega of America, and Telltale Games have had the rights to develop video games since the 1993 film, and numerous games have been produced., 26212=Before Crichton's book was even published, studios such as Warner Bros., Columbia TriStar, 20th Century Fox, and Universal had already begun bidding to acquire the picture rights. Spielberg, with the backing of Universal Studios, acquired the rights to the novel before its publication in 1990, and Crichton was hired by Universal Studios for an additional US$500,000 to adapt the novel into a proper screenplay. David Koepp wrote the final draft, which left out much of the novel's exposition and violence, and made numerous changes to the characters., 18572=Steven Spielberg learned of the novel in October 1989 while he and Crichton were discussing a screenplay that would become the TV series ER. Before the book was published, Crichton put up a non-negotiable fee for $1.5 million as well as a substantial percentage of the gross. Warner Bros. and Tim Burton, Columbia Pictures and Richard Donner, and 20th Century Fox and Joe Dante also bid for the rights,[5] Universal further paid Crichton $500,000 to adapt his own novel,[6] but in May 1990, Universal eventually decided on Spielberg making the adaptation.[5] Universal desperately needed money to keep their company alive, and partially succeeded with Jurassic Park, as it became a critical[7] and commercial[8] success., 42070=The film features a new park, Jurassic World, built on the remains of the original park on Isla Nublar.[49] The film sees the park run by Simon Masrani (Irrfan Khan) and Masrani Corp, and features the return of Dr. Henry Wu (B.D. Wong) from the first film, who harbors a grudge against his former employer.[50] Chris Pratt, Bryce Dallas Howard, and Jake Johnson star, while Vincent D'Onofrio portrayed the main antagonist, Vic Hoskins. The cast also includes Lauren Lapkus,[51] Ty Simpkins, Nick Robinson, Omar Sy, and Judy Greer. The primary dinosaur antagonist is Indominus rex, a genetically-modified hybrid of Tyrannosaurus rex and several other species including Velociraptor and cuttlefish., 31225=As soon as the novel was published, a film was in pre-production, with a target release date of mid-1997. The film was a commercial success, breaking many box-office records when released. The film had mixed reviews, similar to its predecessor in terms of characterization. Much like the first film, The Lost World made a number of changes to the plot and characters from the book, replacing the corporate rivals with an internal power struggle and changing the roles/characterizations of several protagonists., 77673=From June 1993 to August 1997 the now-defunct Topps Comics published comic adaptions of Jurassic Park and The Lost World: Jurassic Park, as well as several tie-in series., 92484=An episodic video game based on the Jurassic Park franchise, bridging the story of the first two movies and entitled Jurassic Park: The Game, was developed by Telltale Games in a deal with Universal.[80] It was released on November 15, 2011 to a generally good reception. The game was acknowledged canon with Jurassic Park continuity by writers of the original Jurassic Park. The game takes place during and after the events of the original film, and features Troodon and a Mosasaur, amongst other creatures. The game is available on PC, Mac and iPads., 81988=Beginning in June 2010, IDW Publishing began publishing Jurassic Park comics. They also acquired the rights to reprint the issues published by Topps in the 1990s, which they began to do in trade paperback format starting in November 2010. Mark Schultz will be drawing a future cover., 46270=On June 3, 2015, Trevorrow stated that Jurassic World left story possibilities open for the sequel's director that could potentially allow the film to take place in a different location, rather than on an island. Trevorrow hinted that the next film could involve dinosaurs being used by other companies for non-entertainment purposes, possibly in agriculture, medicine, and war: \"I really like the idea that this group of geneticists aren't the only people who can make a dinosaur [...] when you think of the differences between Apple and PC – the minute something goes open-source, there are all kinds of entities and interests that may be able to utilise that technology.\"[56], 20342=After Jurassic Park was released to home video, Crichton was pressured from many sources for a sequel novel.[9] Crichton declined all offers until Spielberg himself told him that he would be keen to direct a movie adaptation of the sequel, if one were written. Crichton began work almost immediately and in 1995 published The Lost World. Crichton confirmed that his novel had elements taken from Sir Arthur Conan Doyle's novel of the same name.[10] The book was also an outstanding success, both with professional and amateur critics.[9], 9005=Jurassic Park is an American franchise centering on a disastrous attempt to create a theme park of cloned dinosaurs. It began in 1990 when Universal Studios bought the rights to the novel by Michael Crichton before it was even published., 37147=Steven Spielberg devised a story idea for a fourth film in 2001, during production of Jurassic Park III.[22] In 2002, William Monahan was hired to write the script,[23] with the film's release scheduled for 2005.[24] Monahan finished the first draft of the script in 2003,[25] with the film's plot revolving around dinosaurs escaping to the mainland.[26][27][28] Sam Neill and Richard Attenborough were set to reprise their characters,[28][29] while Keira Knightley was in talks for two separate roles.[30] In 2004, John Sayles wrote two drafts of the script.[31][32] Sayles' first draft involved a team of deinonychus being trained for use in rescue missions.[33][34][35] His second draft involved genetically modified dinosaur-human mercenaries.[36] Both drafts were scrapped. In 2006, a new script was being worked on.[37][38][39] Laura Dern was contacted to reprise her role, with the film expected for release in 2008.[40][41] The film was further delayed by the 2007–08 Writers Guild of America strike.[42] Mark Protosevich wrote two film treatments in 2011, which were rejected.[43] Rise of the Planet of the Apes screenwriters Rick Jaffa and Amanda Silver were hired in 2012 to write an early draft of the script.[44] In 2013, Colin Trevorrow was announced as a director and co-writer,[45][46] with the film scheduled for release on June 12, 2015.[47] The film was shot in 3D.[48], 90300=When the first film was released in 1993, two different video game publishers were given the rights to publish games based on it, Sega and Ocean Software. Both produced several different games based on the movie for several different game systems, including the NES and Sega Genesis. In 1994, Ocean Software produced a sequel to the first game in the series for the Game Boy and SNES systems. Universal Interactive also produced an interactive game for the ill-fated 3DO system., 48389=In July 2015, Trevorrow said the series \"isn't always going to be limited to theme parks,\" and confirmed that the film would not involve \"a bunch of dinosaurs chasing people on an island. That'll get old real fast.\"[62], 91919=In 2003, Jurassic Park: Operation Genesis was released for the Xbox, PlayStation 2 and PC., 11744=The fourth film Jurassic World was initially scheduled to be released in the summer of 2005, but was delayed numerous times and was ultimately released in June 2015. It has grossed $1.54 billion, making it the third highest-grossing film of all time. In March 2013, Colin Trevorrow was announced as the director.[2] A fifth film is scheduled for a June 22, 2018 release date., 21416=The film adaptation, The Lost World: Jurassic Park began production in September 1996.[11], 87782=After the success of Jurassic Park in 1993, artist Will Meugniot contacted artist William Stout to ask if he would be interested in designing a Jurassic Park animated series. According to Stout, \"This was not going to be a kiddy show (although kids of all ages, including myself, could enjoy it). They wanted the show to be a mature prime time series with top writers and state-of-the-art television animation augmented with quite a bit of CG animation.\" Universal Cartoon Studios wanted the show to have the look of a graphic novel.[77], 93841=Lego Jurassic World is a 2015 Lego action-adventure video game developed by Traveller's Tales and published by Warner Bros. Interactive Entertainment, for the PlayStation 4, PlayStation 3, PlayStation Vita, Nintendo 3DS, Wii U, Xbox One, Xbox 360, and Microsoft Windows. It followed the plots of the series' four films, including Jurassic World, and was released on June 12, 2015., 89183=In 1998, Kenner introduced Jurassic Park: Chaos Effect, a series of dinosaur toys based on a premise that scientists had created dinosaur hybrids consisting of DNA from different creatures.[78] An animated television series was planned to accompany the toyline, but was never produced, for unknown reasons.[79], 33904=Joe Johnston had been interested in directing the sequel to Jurassic Park and approached his friend Steven Spielberg about the project. While Spielberg wanted to direct the first sequel, he agreed that if there was ever a third film, Johnston could direct.[19] Spielberg, nevertheless, stayed involved in this film by becoming its executive producer. Production began on August 30, 2000[20] with filming in California, Oahu, and Molokai.[21] It is the first Jurassic Park film not to be based on a novel. The film was a success and had mixed reviews from critics. Most were split on whether the third installment was better or worse than its predecessor. The film once again suffered reviews mentioning little to no characterization., 47078=On June 8, 2015, Frank Marshall met with Trevorrow and Universal Studios to discuss a Jurassic World sequel.[57] Later that month, Trevorrow said the series is \"not always gonna be about a Jurassic Park,\" saying he felt that future films could explore the idea of dinosaurs and humans co-existing together.[53] That same month, Trevorrow also hinted that the next film may not involve the Jurassic World theme park.[58] Also that month, Trevorrow said he would be interested in seeing a Jurassic Park film made by one of several Spanish horror film directors, whose names he did not mention.[59] Pratt and Simpkins are signed on for future films.[60][61], 44410=A fifth film is set for a June 22, 2018 release date. Trevorrow and Connolly will write the script. The film will be produced by Frank Marshall. Spielberg will act as executive producer with Trevorrow. Chris Pratt and Bryce Dallas Howard will reprise their roles from the previous film.[52] During early conversations on Jurassic World, Spielberg told Trevorrow that he was interested in having several more films made.[53] In April 2014, Trevorrow announced that sequels had been discussed: \"We wanted to create something that would be a little bit less arbitrary and episodic, and something that could potentially arc into a series that would feel like a complete story.\"[54] Trevorrow hinted that Chris Pratt and Omar Sy could reprise their roles for the next film, and said he would direct the film if asked.[54] Trevorrow later told Spielberg that he would only focus on directing one film in the series.[53] In May 2015, Trevorrow announced that he would not direct another film in the series: \"I would be involved in some way, but not as director.\" Trevorrow felt that different directors could bring different qualities to future films.[55]}", "lastModified": "Sat, 01 Aug 2015 00:47:59 GMT", "textBeforeTable": "This series has been collected in the following trade paperbacks: Jurassic Park: Dangerous Games #1–5 (September 2011 – January 2012) Five-issue series written by Greg Bear and Erik Bear, with art by Jorge Jiménez and a variant cover by Geof Darrow. Jurassic Park: The Devils in the Desert #1–4 (January 2011 – April 2011) Four-issue series written and illustrated by John Byrne. Jurassic Park: Redemption #1–5 (June 2010 – October 2010). Five-issue series written by Bob Schreck with art by Nate van Dyke. Each issue has a main cover penciled by Tom Yeates, with variant covers by Frank Miller, Arthur Adams, Paul Pope, Bernie Wrightson, and Bill Stout, respectively. Beginning in June 2010, IDW Publishing began publishing Jurassic Park comics. They also acquired the rights to reprint the issues published by Topps in the 1990s, which they began to do in trade paperback format starting in November 2010. Mark Schultz will be drawing a future cover. IDW Comics[edit] The Lost World: Jurassic Park #1–4 (May – August 1997). Adaptation of the second film. Adapted by Don McGregor and pencilled by Jeff Butler (#1–2) and", "textAfterTable": "Cancelled animated series[edit] After the success of Jurassic Park in 1993, artist Will Meugniot contacted artist William Stout to ask if he would be interested in designing a Jurassic Park animated series. According to Stout, \"This was not going to be a kiddy show (although kids of all ages, including myself, could enjoy it). They wanted the show to be a mature prime time series with top writers and state-of-the-art television animation augmented with quite a bit of CG animation.\" Universal Cartoon Studios wanted the show to have the look of a graphic novel.[77] Stout was hired to work on the series and subsequently made a trailer to demonstrate how the series would look, and how it would combine traditional animation with computer animation. The series required Spielberg's final approval before it could go into production. However, Spielberg had grown tired of the massive promotion and merchandise revolving around the film, and never watched the trailer. The series was never put into production.[77] In 1998, Kenner introduced Jurassic Park: Chaos Effect, a series of dinosaur toys based on a premise that scientists had created dinosaur hybrids consisting of DNA from different creatures.[78] An animated television series was planned to accompany the toyline, but was never produced, for unknown reasons.[79] Video games[", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}