{"relation": [["Side A Titles", "1. Black Dog", "2. Rock And Roll", "3. The Battle Of Evermore", "4. Stairway To Heaven"], ["Artist", "Led Zeppelin", "Led Zeppelin", "Led Zeppelin", "Led Zeppelin"], ["Length", "04:57", "03:40", "05:52", "08:03"]], "pageTitle": "Led Zeppelin - Led Zeppelin IV [Deluxe] (Vinyl LP) - Amoeba Music", "title": "", "url": "http://www.amoeba.com/led-zeppelin-iv-deluxe-lp-led-zeppelin/albums/3333891/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00161-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 278640251, "recordOffset": 278623838, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{3499=Billy Gil 10/27/2014}", "TableContextTimeStampAfterTable": "{14688=Copyright © 2015 Amoeba, All Rights Reserved. Amoeba and the Amoeba Music mark and logo are trademarks of Amoeba Music Inc.}", "lastModified": "Fri, 31 Jul 2015 07:43:05 GMT", "textBeforeTable": "Track Listing Like these other Led Zeppelin reissues, the bonus tracks feel essential as well for a number of reasons. Firstly, these are songs many of us have heard so many times that hearing them differently helps us re-appreciate them. Secondly, audiophiles and musicians get to hear these songs taken apart and stripped down a bit, unraveling some of the mystery. And finally, it’s just more Led Zeppelin, something we could all use. Whereas some artists’ outtakes could feel like filler, these alternate versions from one of the greatest albums even count as essential listening for fans. This album doesn’t even need “Stairway to Heaven.” To me, the song doesn’t compare with the two that immediately follow it. “Misty Mountain Hop” focuses all of Led Zeppelin’s estimable kinetic energy into a singular three-note boogie that absolutely pulverizes. That moment when Robert Plant pulls back and Jimmy Page lays harmonic notes over it and the whole band falls into complete lockstep is so exciting that it makes you feel happy to be alive when you hear it. John Bonham’s rumbling beat and Plant’s absolutely possessed vocals on “Four Sticks” are hypnotic, spiritual even. On an album that is perfectly paced, “Going to California” again provides a breather. It is a simple yet emotionally pleasing folk song befitting of Joni Mitchell, something that showed the band could write delicate songs alongside massive rock epics. And “When the", "textAfterTable": "Side B Titles Artist Length 1. Misty Mountain Hop Led Zeppelin 04:38 2. Four Sticks Led Zeppelin 04:45 3. Going To California Led Zeppelin 03:31 4. When The Levee Breaks Led Zeppelin 07:08 Side C Titles Artist Length 1. Black Dog (Basic Track With Guitar Overdubs) Led Zeppelin 2. Rock And Roll (Alternate Mix) Led Zeppelin", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}