{"relation": [["Title", "Complete Pyramids, The (Solving the Ancient Mysteries)", "Illustrated Guide to the Pyramids, The", "Oxford Encyclopedia of Ancient Egypt, The", "Pyramids, The (The Mystery, Culture, and Science of Egypt's Great Monuments)", "Treasures of the Pyramids, The"], ["Author", "Lehner, Mark", "Hawass, Zahi; Siliotti, Alberto", "Redford, Donald B. (Editor)", "Verner, Miroslav", "Hawass, Zahi"], ["Date", "1997", "2003", "2001", "2001", "2003"], ["Publisher", "Thames and Hudson, Ltd", "American University in Cairo Press, The", "American University in Cairo Press, The", "Grove Press", "American University in Cairo Press, The"], ["Reference Number", "ISBN 0-500-05084-8", "ISBN 977 424 825 2", "ISBN 977 424 581 4", "ISBN 0-8021-1703-1", "ISBN 977 424 798 1"]], "pageTitle": "Early travelers to the Pyramids, Part I", "title": "", "url": "http://www.touregypt.net/featurestories/pyramidtravelers1.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00100-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 775359280, "recordOffset": 775342886, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{24003=Another scholar, Benoit de Maillet, the French Consul-General in Egypt between 1692 and 1708, visited Khufu's pyramid over forty times while he was in Egypt. His plan and section of the superstructure are not as good as those of Greaves, but his drawing of the passages and chambers is more accurate. The lengths and proportions of the Ascending Passage and the Grand Gallery are nearly correct, as are the different parts of the well shaft. At that time, the Descending Passage was still unknown beyond its juncture with the Ascending Passage., 25447=Throughout the 18th century, travelers poured into Egypt, not only to describe what they saw but also sometimes to make accurate records. Simple travelogues evolved into geographical catalogues, and included the ancient sites and monuments. One of the earliest 18th century travelers was a Jesuit priest named Claude Sicard, who visited Egypt between 1707 and 1726. He documented 20 of the major pyramids, 24 complete temples and over 50 decorated tombs., 27530=Norden's Travels, published in 1755, marks a great advance in documentation, no doubt owing to his profession as an artist and naval marine architect. he was sent to Egypt by King Christian VI of Denmark and he traveled as far south as Derr in Nubia., 19160=Then, when Egypt came under Turkish rule in 1517, travel became safer. Sultan Selim I provided protection for French traders and pilgrims, and then when the printing press was invented in the mid 15th century, details and images of travelers became more widely disseminated, encouraging more people to make the voyage to Egypt., 19924=Many of these early antiquaries, such as Kircher, considered by some as \"the Father of Egyptology\", even though he apparently never visited Egypt, promoted the idea, still potent today, that the pyramids contained some mystic significance. However, while these fanciful notions were still current, some early visitors such as George Sandys who visited the pyramids in 1610, accepted the idea that the pyramids were the tombs of kings., 20528=These reports of early travelers, though ambiguous at times, are useful in determining the condition of the pyramids over time. For example, in 1546, Pierre Belon observed that the third pyramid at Giza was in perfect condition, as if it had just been built. Jean Chesneau mentioned that the other two pyramids at Giza were not \"made in degrees\". Did this mean that their inner, stepped core were not exposed? Also, Prosper Alpinus, one of the first Europeans to attempt an accurate measurement of the pyramids, wrote in 1591 that the viceroy of Egypt, Ibrahim Pash, enlarged the entrance to the Great Pyramid \"so that a man could stand upright in it\". This must have indicated a widening of the passage of al-Mamun., 21749=John Greaves (1602-1652), professor of astronomy at the University of Oxford, first reviewed the existing literature and then went to Egypt to study the pyramids for himself. He dismissed all the accounts of the Giza pyramids having been built by biblical figures or legendary kings. From the classical sources, it was he who concluded that these monuments were erected by Cheops (Khufu), Chephren (Khafre) and Mycerinus (Menkaure), as tombs for the security of the body because of an ancient Egyptian conviction that this would ensure the endurance of the soul., 24695=Apparently, between 1639, when Greaves was at Giza, and 1692, when Benoit de Maillet first visited Giza, the second pyramid must have been stripped to its present condition, because de Maillet mentions that the casing stones remained only at the top. It was also Maillet who called for a survey to produce an accurate map and documentation of all the ancient Egyptian sites, which the Napoleonic Expedition executed a century later., 26017=However, foremost among the 18th century antiquaries were the Englishman Richard Pococke and the Dane Friderik Norden. Both visited Egypt in 1737. Pococke made a map of Giza that was extremely schematic, while his profile of the Great Pyramid was borrowed from de Maillet. He seems to describe Khufu's causeway, describing it as being seven meters wide and 914 meters long, built of stone and reinforced by 61 circular buttresses. Of course, this bears no resemblance to Khufu's causeway. It turns out that he was describing the arches in the floodplain north of Khufu's pyramid built under Saladin from blocks taken from the Giza pyramid., 38613=Copyright © 1996-2013 Tour Egypt. All Rights Reserved. Web Development & Design By AKN Solutions, 27852=Another English diplomat and traveler, Nathaniel Davison, also visited the pyramids later during the 18th century. He is credited, probably incorrectly, with being the first to enter the lowest of the five stress-relieving chambers above the King's Chamber in the Pyramid of Khufu. This chamber, which he entered on July 8th, 1765, now bears his name. Recent rains had also washed away some of the sand and debris choking the Descending Passage, and Davison saw that it sloped away into the bedrock beneath. He followed it into the darkness for 39.6 meters before finding it sealed off by debris. He also investigated the well shaft, descending from the bottom of the Grand Gallery to a depth of 47.2 meters where it, too, was closed off with rubble.}", "textBeforeTable": "Resources:     Early Pyramid Travelers and Explorers, Part III Early Pyramid Travelers and Explorers, Part II Early Pyramid Travelers and Explorers, Part I See also:     It is perhaps ironic that with the massive scholarly French effort was soon followed by the era of plunder, destruction and non-systematic excavations that were a hallmark of the Egyptian archaeology and pyramid exploration of the 19th century.     Of course, some of the most important early visitors to Egypt came with the Napoleon Expedition at the end of the 18th century, but that is a story all to itself. However, the artists of the commission with Napoleon created precise views of many of the pyramids in Egypt. Colonel Coutelle and the architect J.M. Lepere undertook a detailed study of the interior of Khufu's pyramid while the surveyor E. F. Jomard and engineer and artist Cecile re-measured the superstructure, including event he height of each course of stones.     Another English diplomat and traveler, Nathaniel Davison, also visited the pyramids later during the 18th century. He is credited, probably incorrectly, with being the first to enter the lowest of the five stress-relieving chambers above the King's Chamber in the Pyramid of Khufu. This chamber, which he entered on July 8th, 1765, now bears his name. Recent rains had also washed away", "textAfterTable": "        Archives     Who are we? Tour Egypt aims to offer the ultimate Egyptian adventure and intimate knowledge about the country. We offer this unique experience in two ways, the first one is by organizing a tour and coming to Egypt for a visit, whether alone or in a group, and living it firsthand. The second way to experience Egypt is from the comfort of your own home: online. Popular Pages Egypt Pyramids Monuments & Ancient Sites Egyptian Kings Ancient Temples Pharaohs General Travel What to Take Destinations Egypt Travel Articles Budget Travel Fees to Monuments Shopping Guide Beach Vacations Interactive Pages Picture of the Day Reader Pictures Recipe of the Week Weekly Crossword Puzzle Send Postcard Hieroglyph Converter Egyptian Money Specific Activities Scuba Diving", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}