{"relation": [["", "1.", "2.", "3."], ["Date", "01 Oct 2007", "22 Dec 2006", "12 Dec 2006"], ["Author", "Randy Smith", "Johann", "Johann"], ["Subject", "(0) MARS/CAP Mod.", "(0) LCD Display", "(0) Kenwood 2530A"], ["", "", "", ""]], "pageTitle": "mods.dk - Articles for Kenwood 'TM-2530'", "title": "", "url": "http://www.mods.dk/index.php?ModelId=480&RadioId=1-kenwood&ModelRec=tm-2530", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 13, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00183-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 580264690, "recordOffset": 580256488, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{15653=This forum message list include all message for that is related to TM-2530, this include message that also is related to articles. If the message is relate to an article, the article can be selected next to each message., 18647=Click here to see the article list for TM-2530.}", "textBeforeTable": "This forum message list include all message for that is related to TM-2530, this include message that also is related to articles. If the message is relate to an article, the article can be selected next to each message. Note that page can take a while to load, if there are many modifications. Click here to view all the ABOVE modifications for tm-2530 in one page. TM-2530/2550/2570 MARS/CAP 19 Jul 1998 Description Uploaded Articles for Kenwood 'TM-2530'   Other TNC", "textAfterTable": "Click here to write a new message or comment for TM-2530 Note that the message is not related to any article. Click here to see the article list for TM-2530. Do you have any tricks, modifications or constructions for homebrewed equipment that are not on mods.dk, please send the information to mods.dk. If you prefer to be anonymous write it in the message.   Kenwood Menu Manuals Pictures", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}