{"relation": [["Title", "A Moveable Feast", "Chocolat", "Dangerous Liaisons", "I'll Never be French (no matter what I do)", "A Year in Provence", "A Very Long Engagement", "Marie Antoinette: The Journey"], ["Author", "Ernest Hemingway", "Joanne Harris", "Pierre Choderlos De Laclos", "Mark Greenside", "Peter Mayle", "Sebastien Japrisot", "Antonia Fraser"]], "pageTitle": "France Tours & Holidays | Intrepid Travel US", "title": "", "url": "http://www.intrepidtravel.com/us/france", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00224-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 521275407, "recordOffset": 521215759, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{187968=Review submitted 25 Jul 2015, 87408=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 86089=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o...}", "TableContextTimeStampAfterTable": "{73508=Depending on what you want to get out of your trip, there is always a good time to visit France. Winter is a great time to enjoy snow sports in the Alps and Pyrenees, while the summer is great for soaking up the sun on the beaches of the Cote d’Azur. Generally, France enjoys a temperate climate with cool winters and warm summers, except for the Mediterranean areas that bask in warm temperatures most of the year. Popular tourist spots can get crowded during the peak holiday periods of Christmas, Easter and the school holiday months of July and August; if travelling during these times, be prepared to share France with many other travellers and holidaying locals., 89307=Commissioned by pint-sized Napoleon Bonaparte in 1806, the grand Arc de Triomphe monument signifies triumph and victory. Best seen at night, the luminous golden hues provide atmospheric photographic opportunities}", "textBeforeTable": "Recommended reading Further reading 6. Please ask and receive permission before taking photos of people, including children. 5. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 4. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 3. Always dispose of litter thoughtfully, including cigarette butts. 2. For environmental reasons, try to avoid buying bottled water. Fill a reusable water bottle or canteen with filtered water instead. 1. Be considerate of France’s customs, traditions, religion and culture. Top responsible travel tips for France Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this in mind while travelling. France Travel Tips Responsible Travel also provides useful health information: Go to: http://www.who.int/en/ The World Health Organisation Go to: http://www.fco.gov.uk/en/ From UK? Go to: http://travel.state.gov/ From US? Go to: http://www.voyage.gc.ca/ From Canada? Go to: http://www.safetravel.govt.nz/ From New Zealand?", "textAfterTable": "Handy links www.worldtravelguide.net/france www.lonelyplanet.com/france × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwaitKyrgyzstanLaosLatvia", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}