{"relation": [["Author", "PSI322", "PSI322", "PSI322", "PSI322", "PSI322"], ["Title", "Miracle", "Musical Hearts, Part 1: The Party's Over", "Musical Hearts, Part 2: I've Gotta Be Me", "The Twinning Ray: Part 1", "The Twinning Ray: Part 2"], ["Description", "A look at Jeff", "Life and love during college.", "Life and love during college.", "Summer seems boring for the gang but Jeff has a little invention to makes things interesting. The Twinning Ray. Fear it.", "The second part of the ongoing series. A twin has been made, but what to do with it?"], ["Date", "1/23/05", "2/21/05", "2/21/05", "3/27/05", "3/27/05"], ["Rank", "0.00", "0.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=14816&stuff=DateASC", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00264-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 225094270, "recordOffset": 225086068, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> 1 < Other Submissions by PSI322 December 30, 2000 Juliana Tritone I leave you with this, my final impression on the site. I am very disappointed that such an article has been written, and even more disappointed that it has appeared on Starmen.Net. And to think some people wondered why I ran away. I actually can't believe that an article like this has been posted on the site I used to love. Young women of Starmen.Net: Don't take this abuse. Stand up for yourselves... beat back this lamer with all you've got, and don't let anyone tell you that you're \"just a girl.\" Never allow sick people like him to walk all over you... be strong. Your promotion of the demeaning view that far too many hold of women is sickening. If I were still at this site, I swear to you, I'd up and resign completely as of this very moment. But I'm not around anymore, and I'm so glad of it too... you sicken me to no end, Casey Toner. The females of the site should rise up in rebellion... that is, if anyone would listen to them. They're", "textAfterTable": "1 2 3 4 5 6 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day. Activities:", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}