{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"], ["Name", "Santa Rosa", "Cain't Nobody", "Trickle Down", "(Welcome To) Pagan Place", "I Want You Gone", "Starkweather", "Can I Get a Wet Nurse?", "Little Black Beetle", "Happy Little Song", "Fly Like an Eagle/Come Together", "Talk About Sufferin'"], ["Artist", "Laura Love", "Laura Love", "Laura Love", "Laura Love", "Laura Love", "Laura Love", "Laura Love", "Laura Love", "Laura Love", "Laura Love", "Laura Love"], ["Time", "4:01", "4:45", "4:36", "4:40", "5:21", "4:34", "3:25", "3:50", "3:28", "4:17", "2:04"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Welcome to Pagan Place by Laura Love", "title": "", "url": "https://itunes.apple.com/pl/album/welcome-to-pagan-place/id3200921", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00078-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 883694267, "recordOffset": 883664551, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{120712=Copyright © 2014 Apple Inc. Wszelkie prawa zastrzeżone., 22802=Born: 1960 in Omaha, NE}", "lastModified": "Fri, 31 Jul 2015 08:22:22 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Laura Love Welcome to Pagan Place iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Welcome to Pagan Place by Laura Love, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes", "textAfterTable": "11 Songs Album Review Welcome to Pagan Place may be Laura Love's most consistent and successful recording to date, with a seamless weaving of folk, pop, jazz, a tad of rock and blues, and some shimmering reggae here and there. Compositionally Love is always engaging and often even remarkable. She doesn't pretend to be anybody other than what she is, a singer and songwriter. In her genre, she is peerless as a composer. Her deep understanding of rhythm, textures, and instrumental phrasing is singular in the \"folk\" world. And surrounding herself with musicians such as violinist Barbara Lamb and guitarist Rod Cook doesn't hurt either. A highlight of Welcome to Pagan Place is the gorgeous country ballad \"Gonna Rain Hard.\" The simplicity of the lyric with the earthy sensibility of the acoustic guitars and single-note bassline is perfect, and Love's voice is sublime on the track. The layered vocals on the stomping bluegrass is super, so much so the words just go by until the funky break at the end of the refrain. The fusion of Steve Miller's \"Fly Like an Eagle\" and the Beatles \"Come Together\" is clever, and the bass groove is tremendous. \"I Want You Gone\" feels like something Wendy & Lisa would do and has the same sexy funkiness that is oh so greasy but squeaky", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}