{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14"], ["Name", "Colour Me In", "Pendulum", "Before We Begin", "Valerie", "Man Is Not a Bird", "Minim", "Lunch Hour Pops", "Black Umbrellas", "Ominous Cloud", "Distorsion", "O How I Miss You", "The Little Bell", "Winter Now", "Hawk"], ["Artist", "Broadcast", "Broadcast", "Broadcast", "Broadcast", "Broadcast", "Broadcast", "Broadcast", "Broadcast", "Broadcast", "Broadcast", "Broadcast", "Broadcast", "Broadcast", "Broadcast"], ["Time", "2:51", "4:21", "3:22", "4:04", "4:52", "3:00", "3:36", "1:08", "3:46", "2:02", "1:17", "2:48", "3:48", "3:42"], ["Price", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Haha Sound by Broadcast", "title": "", "url": "https://itunes.apple.com/gb/album/before-we-begin/id281220023?i=281220034", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00145-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 879972956, "recordOffset": 879944050, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{135594=Copyright © 2014 Apple Inc. All rights reserved., 31605=Formed: 1995 in Birmingham, England}", "lastModified": "Fri, 31 Jul 2015 08:49:38 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Broadcast Haha Sound iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Haha Sound by Broadcast, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "14 Songs Album Review On their early singles and brilliant debut album, The Noise Made by People, Broadcast's commitment to crafting meticulously, ethereally beautiful atmospheres gave their music a detached quality that made them somewhat difficult to embrace fully. This isn't the case on Haha Sound, the band's second album. While their music still sounds like it could've been crafted by ghosts in the machine, now Broadcast give it flesh and blood through more warmth and texture. As with the Pendulum EP, Haha Sound's more human touch comes through in its looser, more intimate, and rougher sound. But aside from being warmer and more textured, the album is simply more, as its first three songs reveal. The delicately spooky nursery rhyme \"Colour Me In\" begins the album with the wistful, childlike viewpoint that creeps into Haha Sound from time to time, its layers of chopped up, sawing strings giving it an oddly and sweetly tentative feel. \"Pendulum\" finds the band digging deeper into their psychedelic influences, with acid rock drumming and flashback-like washes of sound making it one of the most tense, driving tracks they've recorded. The Pendulum EP suggested that the entire album might be as wired and dissonant as this song, but tracks like \"Before We Begin\" quickly prove otherwise. A superstitious song about reuniting lovers, it's gorgeous", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}