{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"], ["Name", "Make You Smile", "Too Cool for the Room", "The Message", "Between the Sun and the Moon (feat. Patti Austin)", "I Know You By Heart", "When You Comin' Back to Me", "Let Somebody Know", "The Tracks of My Tears (feat. Lee Ritenour)", "Different Eyes", "Ain't No Smoke", "You Know Our Day Will Come", "It's a Jazz Day"], ["Artist", "Brenda Russell", "Brenda Russell", "Brenda Russell", "Brenda Russell", "Brenda Russell", "Brenda Russell", "Brenda Russell", "Brenda Russell", "Brenda Russell", "Brenda Russell", "Brenda Russell", "Brenda Russell"], ["Time", "4:35", "4:07", "4:39", "4:40", "4:48", "4:56", "5:22", "4:46", "4:23", "4:40", "4:38", "3:46"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Between the Sun and the Moon by Brenda Russell", "title": "", "url": "https://itunes.apple.com/lt/album/between-the-sun-and-the-moon/id465335799", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00249-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 878632571, "recordOffset": 878608452, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{121010=© „Apple Inc.“, 2014. Visos teisės saugomos., 25155=Born: 08 April 1949 in Brooklyn, NY}", "lastModified": "Sat, 01 Aug 2015 04:44:21 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Brenda Russell Between the Sun and the Moon iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Between the Sun and the Moon by Brenda Russell, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on", "textAfterTable": "12 Songs Album Review Every handful of years, the soulful honey-voiced vocalist and brilliant songwriter puts out a solid adult-oriented collection with likable tunes that seek to equal the success of her oft-played classics \"Piano in the Dark\" and \"Get Here\" (popularized by Oleta Adams). Her Narada Jazz debut throws a few lush, emotionally resonant candidates in the ring, including the spiritually uplifting inspirations \"The Message\" and \"Let Somebody Know,\" both of which go down easy and allow her to show off her emotional vocals. But Russell is most effective when she waxes exotic, as on the wildly percussive samba-flavored opener, \"Make You Smile\" (a Top Ten U.K. smooth jazz hit even before the album's release Stateside) and, even more delightfully, on the African-tinged title track. \"Between the Sun and the Moon\" begins with jungly soundscaping and a native choir accenting lyrics about what we may find in the shadows. Then guest star Patti Austin chimes in (or rather, rushes in with a joyful hurricane force) on some verses, and the tune builds on various vocal textures before exploding into a rolling uptempo fiesta, with Austin going wild, doing her Ella-like vocal scatting (trading fours with the choir). There's a late-night jazz edge on a few other tracks, and \"It's a Jazz Day\" pays loving and humorous homage to traditional", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}