{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Starmaker", "I Can Do Anything Better Than You Can", "I Still Believe In Me", "Life Is a Celebration", "Step Up to the Mike", "Hi-Fidelity", "We Got the Power", "It's Gonna Be a Long Night", "Desdemona", "Be My Music"], ["Artist", "The Kids From \"Fame\"", "The Kids From \"Fame\"", "The Kids From \"Fame\"", "The Kids From \"Fame\"", "The Kids From \"Fame\"", "The Kids From \"Fame\"", "The Kids From \"Fame\"", "The Kids From \"Fame\"", "The Kids From \"Fame\"", "The Kids From \"Fame\""], ["Time", "4:06", "3:05", "3:25", "3:05", "3:32", "2:45", "3:22", "4:01", "3:37", "3:35"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - The Kids from \"Fame\" by The Kids From \"Fame\"", "title": "", "url": "https://itunes.apple.com/gr/album/step-up-to-the-mike/id351997317?i=351997479", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00164-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 892794371, "recordOffset": 892768985, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{109890=Copyright © 2014 Apple Inc. Με επιφύλαξη παντός δικαιώματος., 19672=The first Kids from Fame album was an absolute sensation in 1982 spending a total of 12 weeks at number one and ending the year as the second best-seller of the year (behind Barbra Streisand's Love Songs). Created by Christopher Gore, the weekly TV series based on the Alan Parker film followed the exploits and adventures of the students and teachers at the New York High School of Performing Arts. Being an hour-long weekly series as opposed to a one- of two-hour film, there was a lot more scope to develop the characters and delve into their personal lives and fans, particularly in the U.K., grew to associate and love the individual characters, all of whom were flawed in some way, but all of whom had the same aspirations of millions of ordinary people: to become famous. Each week there was an excuse for the troupe to break into a song (and dance) routine, sometimes organized but sometimes totally spontaneous and usually bringing tears to the eyes of either the parents or teachers or a guest star who happened to be passing and found themselves involved with the school in some way. For copyright reasons, and despite being the theme song to the program, the most famous song, \"Fame,\" originally sung by Irene Cara but sung on the TV show by Erica Gimpel, the new actress playing Coco Hernandez on the series, was not allowed to be on the Kids from Fame album, but having a weekly audience of millions, they set out to create their own classics and during 1982 came up with two very different songs as singles, \"Hi Fidelity,\" the uptempo, singalong, dance-along happy song with Valerie Lansburg as Doris Schwartz on lead vocals, bouncing along and grinning from ear to ear, and \"Starmarker,\" the ballad that the kids all took a line each to sing to the drama teacher Mr. Crandall on his retirement. The songs on the album ranged between the two extremes, of ensemble dance numbers (\"I Can Do Anything Better Than You Can,\" \"Life Is a Celebration,\" and \"Desdemona\") to solo ballads (\"I Still Believe in Me,\" \"It's Gonna Be a Long Night\" and \"Be My Music\"). The album hasn't aged well but was the perfect soundtrack to the early '80s, and 1982 in particular.}", "lastModified": "Fri, 31 Jul 2015 08:47:11 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist The Kids From \"Fame\" The Kids from \"Fame\" iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from The Kids from \"Fame\" by The Kids From \"Fame\", download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on", "textAfterTable": "10 Songs Album Review The first Kids from Fame album was an absolute sensation in 1982 spending a total of 12 weeks at number one and ending the year as the second best-seller of the year (behind Barbra Streisand's Love Songs). Created by Christopher Gore, the weekly TV series based on the Alan Parker film followed the exploits and adventures of the students and teachers at the New York High School of Performing Arts. Being an hour-long weekly series as opposed to a one- of two-hour film, there was a lot more scope to develop the characters and delve into their personal lives and fans, particularly in the U.K., grew to associate and love the individual characters, all of whom were flawed in some way, but all of whom had the same aspirations of millions of ordinary people: to become famous. Each week there was an excuse for the troupe to break into a song (and dance) routine, sometimes organized but sometimes totally spontaneous and usually bringing tears to the eyes of either the parents or teachers or a guest star who happened to be passing and found themselves involved with the school in some way. For copyright reasons, and despite being the theme song to the program, the most famous song, \"Fame,\" originally sung by Irene Cara but sung", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}