{"relation": [["Title", "Super Metroid FX Editor", "Samus Aran Beauty Salon", "Super Metroid Editor", "SMILE (Super Metroid Integrated Level Editor)"], ["Author", "Smibes1994", "Jathys", "Smibes1994", "Jathys"], ["Description", "Here is an FX editor for Super Metroid. Don’t forget to run the language change program to use in English.", "A Super Metroid palette editor.", "Here is a utility that allows you to tweak with some of the settings in Super Metroid. Before running this program be sure to run the language selector to change it to English for those who do not read Japanese.", "An editor for Super Metroid coded in VB with some C dll’s. Lots of bug fixes, tweaks, and a bit more streamlined than before. Translation files for English, French, Finnish, and Latin. Plugins are now supported."], ["Category", "Game Specific", "Game Specific", "Game Specific", "Level Editors"], ["Platform", "SNES", "SNES", "SNES", "SNES"], ["Game", "Super Metroid", "Super Metroid", "Super Metroid", "Super Metroid"], ["OS", "Win", "Win", "Win", "Win"], ["Ver", "0.01", "02-27-02", "2.06", "2.50"], ["Level", "Int", "Beg", "Int", "Beg"], ["Date", "11 Aug 2012", "None", "10 Nov 2013", "None"]], "pageTitle": "Romhacking.net - Utilities", "title": "(1 to 4) of 4 Results", "url": "http://www.romhacking.net/?page=utilities&game=729&order=Ver", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00067-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 691749373, "recordOffset": 691733730, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Button Search Description Search Title Text Search Results Per Page None Selected 10 20 30 40 50 Level None Selected Advanced Beginner Intermediate OS None Selected BeOS DOS Indep Java Mac OS Mac OS X Unix Win Author None Selected Aether Knight (wraith) +daniel+ -=Fx3=- A7mad AamirM Aaron Jacobson Abe Abstract Crouton Productions Abyssonym AcidPhire acmlm ADnova Agemo AgentGeo Ajax Alcaro ALXR André Fachat Android 18 angel-team Anime_World AnusP AnyoneEB Archaemic Arcnor Atarius Maximus (Steve Engelhardt) Atrius AvatarofHonor Barubary Bas Steendijk bbitmaster Ben Beneficii Benjamin Cutler Benjamin Popp BigNailCow Black Rabite Blades blank blueMSX Bob Colbert Bob Rost bobmcjr Bongo` Boris Timofeev Borra Bouche BouKiChi Brandon Koopa breech Bregalad Brendon James Bruno Costa Bryan M.", "textAfterTable": "1 ﻿ Information ©2005-2014 RHDN 2.6.0 by Nightcrawler. All Rights Reserved. Execution time - 0.0708 sec. - Number of Queries: 2 About Us | RHDN Policy | XHTML | CSS", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}