{"relation": [["Author", "Shamanic Shaymin", "Shamanic Shaymin", "Shamanic Shaymin", "Shamanic Shaymin", "Shamanic Shaymin"], ["Title", "At Least It's Not Happy-Happy Village", "Blast Down the Wall!", "Cabaret in my Mind", "Concentration", "Flowers Blooming in the Church"], ["Description", "Always, always, they return Trick-Or-Treating to Threed every year. Why? Because zombies aren't as creepy as Happy-Happy Cultists. Paula = Carrie White of Stephen King fame. (And hey, they're both psychic!) Ness = Indiana Jones (Popular costume this year...) Poo = Erik/The Phantom of the Opera. (Needless to say, the Dalaam girls still swoon over him) Jeff = Who you gonna call? GHOSTBUSTERS! Plugging in a cameo appearance with my favorite Mother 1 characters Loid and Pippi, dressing up as the Scarecrow and Dorothy from the famed Wizard of Oz.", "Only you can properly handle the bazooka, Jeff! Hint: it helps picking it up. (This should end my massive upload spree now. XDD;;;)", "My mom commented Tony's hat looked like a cabaret hat, so that brought wild ideas there. Now we've got Tony in a suit, dancing onstage what used to be Jackie's Cafe at Moonside. Sounds like you shouldn't have left him alone so long, Jeff! Lyrics are from the song 'Spoiled and Rotten' by Darling Violetta.", "I don't have much to caption unless you're not Ness, in which case the best to say is \"Uh oh.\"", "Ana dressed like Aeris from FF7, mainly 'cause I really like the design and thought it would look cute on her. I like Ana's dad, so I put him in playing the piano. Stained glass from left-to-right: EVE on Mt. Itoi. Robot!Paula praying against Giygas. Pink Cloud of Dalaam. Buzz-Buzz and the Meteorite."], ["Date", "11/3/07", "11/24/08", "8/19/08", "11/24/08", "2/4/08"], ["Rank", "0.00", "0.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=24161", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00266-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 230340263, "recordOffset": 230332061, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> T S N M L H G F C B A < Other Submissions by Shamanic Shaymin Only you can properly handle the bazooka, Jeff! Hint: it helps picking it up. (This should end my massive upload spree now. XDD;;;) This image has been resized for your convenience. Click on it to view the full size version. Blast Down the Wall! Blast Down the Wall! - by Shamanic Shaymin  SuperSmashBrosBrawl Go Back! --> } } } ThisImgResized.style.display = \"\"; //alert (ThisImgResized.style.display); ThisImgResized = document.getElementById('ImgResized') what.width=(winW-275); what.style.cursor = \"pointer\"; saveWidth = what.width; { else what.width=saveWidth; if (what.width==(winW-275)) if (what.width>(winW-275) || saveWidth>(winW-275)) { what = document.getElementById(what); function scaleImg(what){ } winW = document.body.offsetWidth; if (navigator.appName.indexOf(\"Microsoft\")!=-1) { winW =", "textAfterTable": "1 2 3 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day. Activities:", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}