{"relation": [["Subject", "RE: Storing and titling photos of text pages", "RE: Storing and titling photos of text pages", "RE: Storing and titling photos of text pages", "RE: Storing and titling photos of text pages", "RE: Storing and titling photos of text pages"], ["Author", "robsb", "barrywesthead", "gkaiseril", "ericbowles", "cliddell"], ["Message Date", "23rd Aug 2012", "23rd Aug 2012", "23rd Aug 2012", "30th Aug 2012", "31st Aug 2012"], ["ID", "1", "2", "3", "4", "5"]], "pageTitle": "Storing and titling photos of text pages | Nikonians", "title": "", "url": "http://www.nikonians.org/forums/dcboard.php?az=show_topic&forum=133&topic_id=9222&mesg_id=9222&page=2", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00100-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 610158663, "recordOffset": 610138560, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{33406=Copyright © Nikonians 2000, 2015, 22816=If you are using Nikon View NX2 and the related Nikon Transfer program accessed from within View, you should be fine. The corruption issue is with an old program called Nikon Transfer - version 1.5.3 - and it should not be used unless you have an old computer not compatible with View. I don't see any real problem with using the cable connection. It's a little slower than a card reader. Make sure your have at least 25% of your battery. George makes a good point about deleting images when they are transferred. Make sure you do not delete any images when they are transferred since any problems cannot be recovered if the original images are gone. Verify you have the images - and ideally make a backup copy - before you delete anything. You can review the settings under the Preferences in Nikon Transfer. Nikon Transfer allows you to have a lot of flexibility in naming files. Choose an approach that works for you. Spend a little extra time getting exposure right for the first image. There are several ways to get a good exposure - exposure compensation on an automated setting or simply use manual exposure. Eric Bowles Nikonians Team My Gallery Workshops - Smokies Oct 2012 Nikonians membership \u0097 my most important photographic investment, after the camera, 25455=Pietermaritzburg, ZA 1015 posts, 12695=Kleinburg, CA 1265 posts}", "textBeforeTable": "AlertQuoteReply I plan to use a Nikon camera (with ViewNX2 software) to photograph each of 100 pages of a document named, say, RED. I also plan to photograph each of 100 pages of a document named, say, GREEN. I will be transferring the photos from the camera to my pc (with XP) via the Nikon camera-to-PC cable. Q1: Where are these photos stored in the pc? \u0096 Can I designate a folder C:\\ RED to hold the Red pages and another GREEN to hold the Green pages? How do I do that? Q2: Is there an easy way to rename all the Red photos -- from the titles that VIEWNX2 assigns to, say, \u0093Redpage 1\u0094, \u0093Redpage 2\u0094.\\, etc. ? Thanks. wdc202 | | Mon 20-Aug-12 04:11 PM Registered since 16th Aug 2012", "textAfterTable": "San Jose, US 14022 posts #1. \"RE: Storing and titling photos of text pages\" | In response to Reply # 0 robsb", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}