{"relation": [["Artist", "Madvillain", "Madvillain", "Madvillain", "MF Doom"], ["Song Title", "Raid", "All Caps", "Strange Ways", "Raid"], ["Played When", "", "", "", ""]], "pageTitle": "The Boondocks Season 1 Episode 11 - Let's Nab Oprah (1x11) - Watch Online - s1 e11 Spoilers", "title": "", "url": "http://www.tvrage.com/The_Boondocks/episodes/319534?vote=4", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00221-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 796290718, "recordOffset": 796274324, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Music The song \"Booty Butt,\" heard in episode 2, and most of the episodes up until this episode is heard, but the video with the girls in thongs is not seen. Episode Notes Click here to add a recap for Let's Nab Oprah Next Episode --> <-- Previous Episode Recap Jazmine Dubois voiced Gabby Soleil Uncle Ruckus voiced Gary Anthony Williams Robert Jebediah \"Granddad\" Freeman voiced John Witherspoon Huey Freeman, Riley Freeman voiced Regina King Main Cast Recurring Bushido Brown voiced Kevin Michael Richardson", "textAfterTable": "Episode Quotes Ed Wuncler III: One of you will come and get me! Or you'll be sleeping in a haunted house tonight! Rummy: Swim, bitch! Rummy: (Talking about text messaging) It's all just nigga technology anyway. Wuncler III: What you call it? Rummy: Nigga technology! Technology for niggas! Don't start tripping and sh*t calling me a racist cause I don't mean nigga in a disrespectful way. I mean it as a term for ignorant mother f*cker. Anybody of any race can be an ignorant mother f*cker! Wuncler III: Sh*t! I'd be texting my ass off! Bitches like texting! Granddad: What the hell is wrong with you, Huey? If your brother wants to play with Ed and Rummy, that's his business. Huey: Granddad, Ed and Rummy are international criminals. Riley: There he go hatin' again. Granddad: Boy, stop hating! Rummy: Nigga technology is anything that doesn't plug into a printer. Does that plug into a printer? Ed III: No. Rummy: You know why? 'Cause niggas never have anything to print. Ed III: I sent that bitch a smiley face. Bitches love smiley faces.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}