{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Namn", "Watch the World Go By (feat. Lake Heartbeat)", "Mega Man II", "Spacer Woman from Mars (With Sally Shapiro)", "Outer Space Woman, Pts. 1 & 2 (With Sally Shapiro & Elitechnique)", "Deeper Space Woman (With Sally Shapiro & Rude 66)", "CleanSpacer Woman from Mars", "Casablanca Nights (feat. Sally Shapiro)", "Watch the World Go By (feat. Lake Heartbeat)", "Watch the World Go By (Skatebård Extended Remix) [feat. Lake Heartbeat]", "Le noir et le blanc sur le piano"], ["Album", "Watch the World Go By (feat. Lake Heartbeat) - EP", "Spacer Woman from Mars - EP", "Spacer Woman from Mars - EP", "Spacer Woman from Mars - EP", "Spacer Woman from Mars - EP", "Milky Disco", "Casablanca Nights", "Casablanca Nights", "Watch the World Go By (feat. Lake Heartbeat) - EP", "Casablanca Nights"], ["Tid", "4:40", "5:04", "4:40", "7:58", "7:24", "4:37", "4:01", "4:42", "7:54", "4:24"], ["Pris", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr"], ["", "Visa i iTunes", "Visa i iTunes", "Visa i iTunes", "Visa i iTunes", "Visa i iTunes", "Visa i iTunes", "Visa i iTunes", "Visa i iTunes", "Visa i iTunes", "Visa i iTunes"]], "pageTitle": "iTunes - Musik - Casablanca Nights av Johan Agebjörn", "title": "", "url": "https://itunes.apple.com/se/album/casablanca-nights/id431016586", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00186-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 878405895, "recordOffset": 878380153, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{131957=Copyright © 2014 Apple Inc. Alla rättigheter förbehålls., 26093=Johan Agebjörn is best known as the producer of Sally Shapiro’s two wonderful neo-Euro disco albums My Guilty Pleasure and Disco Romance. He’s also something of a new age composer, but on Casablanca Nights, he’s definitely in dance-pop mode. The album glitters like an ice-encrusted disco ball, giving off shards of brilliant light and warming the hearts of lovers of slick and slightly melancholy dancefloor jams. Almost every song (save for the glacial collaboration with CFCF on \"Memories of Satie\") is perfect for the moment of the night when the music takes off and reaches spectacular heights. Agebjörn brought in Shapiro to sing a handful of songs; he also brought in Wolfram, Ercola, Lovelock, Le Prix, and Roger Gunnarsson to produce, and Jan Kask of Lake Heartbeat, Queen of Hearts, and Fred Ventura to sing. From bits and pieces recorded all over the world, Agebjörn manages to construct a perfectly balanced work of dancefloor perfection with a real, beating heart. The matching of singers with songs is spot-on, Shapiro’s tender and slightly awkward vocals are lovely as usual but Queen of Hearts threatens to steal the show on the breathtaking \"The Last Day of Summer.\" Kask’s vocal is a reminder of why the Lake Heartbeat record was so affecting, his appearance here on \"Watch the World Go By\" is emotion-packed and soaring. Along with the tracks that head for the dance floor, there are a few electro ballads more suited for the train ride home from the club, like the vocoder-sung \"So Fine All the Time\" and the glitch-y remix of Halftone’s \"Stranger,\" which ends the record in a dreamy haze of synths and chopped-up vocals. These tracks give a nice contrast to the rest of the album and prove that Agebjörn isn’t just skilled at crafting amazing nu-disco classics. Casablanca Nights should serve as an inspiration to producers everywhere as an example of how to do an “And Friends” record the right way. For the rest of us, it’s a thrilling blast of heartbreak beats and sweet club emotion.}", "lastModified": "Sat, 01 Aug 2015 03:37:14 GMT", "textBeforeTable": "Visa i iTunes The Mountain Lake 5. Visa i iTunes Spacer Woman from Mars - EP 4. Visa i iTunes Mossebo 3. Visa i iTunes", "textAfterTable": "Andra som lyssnade köpte även Somewhere Else Sally Shapiro Visa i iTunes Warrior - EP Queen of Hearts Visa i iTunes Cocoon Queen of Hearts Visa i iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}