{"relation": [["Subject", "", "Repost of New Necklaces Linea by Louis Dell'Olio", "If you're into (the hobby of) coloring like I am now, how's it going for you? Home", "Anyone heard any cute puns lately? Community Chat", "On the Fence Tonight? Home", "If You Placed an Order.......... Home"], ["Replies", "", "1", "34", "80", "14", "31"], ["Author", "", "HAPPY LADY", "HappyDaze", "shoekitty", "Mary Bailey", "goldenlocks"], ["Hearts", "", "0", "1", "2", "1", "0"], ["Posted", "", "2m ago", "3m ago", "3m ago", "3m ago", "5m ago"]], "pageTitle": "Home - Blogs & Forums", "title": "", "url": "http://community.qvc.com/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00034-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 53389263, "recordOffset": 53337364, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{30841=Can’t believe we’re halfway through with 2015, time really flies when you’re #LOGOFIED! Hope everyone’s summer is going fabulously. July and August is so hot and muggy for so many of us — when it’s winter we look forward to the sun and outdoor lounging, but these months of being in such extreme heat makes me look forward to fall when I can curl up in some cozy cardigans! So while it might be hot outside, get a head start on your fall fashion with our August TSV!! We really elevated this cardigan to a whole new level for LOGO., 73494=© 1995–2015 QVC, Inc. All rights reserved. Trademark Notice}", "textBeforeTable": "Recent Forum Posts View All Susan Louise by an hour ago J9 Home I think I found those pretty cream porcelain trees... Adelina by 35m ago Sherrie08", "textAfterTable": "View All Forum Posts Recent Blog Topics All Dolled Up for Christmas in July!   I've been a doll collector for almost 30 years and I collect several different types and brands. But, my two most favorite dolls are ....... Read More Mary_Beth_Roe 5 hours ago Replies: 3 Hearts: 1 Fall into our photo shoot!   Our PM Style blog went pumpkin' patching this week. Ha! Joe and I were asked to participate in a Fall brand campaign photo shoot, so on a 96 degree summer day with what felt like 100% humidity, we donned flannel, boots, scarves, and layers. Ugh, modeling ain't easy man. Read More", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}