{"relation": [["Author", "Ninten1", "Ninten1", "Ninten1", "Ninten1", "Ninten1"], ["Title", "Suburbia Lost", "How Much Summer School Did Ness Really Need?", "The Article of Enlightenment", "Smiles and Tears (or; a Preteen Love Fest!)", "HarvestBound (concept)"], ["Description", "...some things will never be the same... (a sprite comic)", "759", "10118", "10069", "*sigh* If only things could have turned out so simple... (the concept for a much larger project I couldn't finish which would've shown what Tazmily Village would be like as a Harvest Moon-type game.)"], ["Date", "11/8/06", "7/31/06", "7/31/06", "7/31/06", "11/7/07"], ["Rank", "0.00", "0.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=14451&stuffPageNumber=5&stuff=DescDESC", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00292-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 222645107, "recordOffset": 222625038, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> W T S P N M L F D 7 1 < Other Submissions by Ninten1 Day 17: Wake up at the annoying knock to ??? Thank you for reading this article. It took a small amount of thought, but a an hour of typing. Please email me if you like it or PM me on the boards or something. So, Ness' adventure took approximately sixteen days. That's only three weeks and a day of school. Some people miss more than that with illness or operations, or vacations, or whatever. Plus, Ness saved the world and I think that'll give him a little leeway... Day 16: Travel to the beginning of time to fight Giygas to return home from adventure. Reasoning: After a good, long sleep, the four are ready for battle. They first travel to the Lost Underworld, then they undergo an operation to become robots so they can survive the journey through time.", "textAfterTable": "1 2 3 4 5 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day. Activities:", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}