{"relation": [["Disc 1 Titles", "1. I'm Not Talking", "2. Do Your Own Time", "3. You Could Get Lost Out Here", "4. Encyclopedia Of Classic Takedowns", "5. There's Money In New Wave", "6. Strings", "7. Hostages", "8. Wasted English", "9. The Troubadour", "10. They Should Have Shut Down The Streets"], ["Artist", "A.C. Newman", "A.C. Newman", "A.C. Newman", "A.C. Newman", "A.C. Newman", "A.C. Newman", "A.C. Newman", "A.C. Newman", "A.C. Newman", "A.C. Newman"], ["Length", "04:38", "04:33", "04:04", "03:59", "03:18", "04:37", "04:09", "03:22", "03:49", "03:51"]], "pageTitle": "A.C. Newman - Shut Down The Streets (CD) - Amoeba Music", "title": "", "url": "http://www.amoeba.com/shut-down-the-streets-cd-a-c-newman/albums/1474597/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00017-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 284617575, "recordOffset": 284595471, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1780=10/08/2012}", "TableContextTimeStampAfterTable": "{10552=Copyright © 2015 Amoeba, All Rights Reserved. Amoeba and the Amoeba Music mark and logo are trademarks of Amoeba Music Inc.}", "lastModified": "Fri, 31 Jul 2015 07:23:56 GMT", "textBeforeTable": "Track Listing AC Newman’s hooky, active songwriting has been one of the driving forces in The New Pornographers for years, but his solo material has been comparably fruitful. His latest release, Shut Down the Streets, is his most ambitious yet, adding more instrumental flourish to his palette of British invasion-inspired pop songwriting. “I’m Not Talking” opens the album lushly with keyboard washes taking the song to epic status. “Do Your Own Time” is the sort of thumping pop song he’s done so well in the past, featuring Neko Case on backup vocals, but the sound of it is boosted by tasteful touches of Italian-style guitar and vibraphone. His Pornographers bandmate appears again on “Encyclopedia of Classic Takedowns,” one of the album’s strongest tracks, which doesn’t feature too many classic takedowns, but does have a wonderfully bright chorus, thanks to Case, who’s both one of the best lead and backup vocalists in rock. When not aiming for hookiness as much, Newman’s lyrical wordplay comes into effect more — “I want to tell you that there’s money in new wave” is a weird but memorable chorus, on the album’s folksiest song. In the end, it’s what Newman does best that shines here — the soaring, singalong chorus. Even on a low-key song with obtuse verses like “Wasted English,” Newman can’t resist adding making a seemingly bummer chorus like “Is it too much to lose or too little left", "textAfterTable": "BUY $15.98 SHIPS FREE in U.S. Also available in: LP , Download User Reviews Overall Rating 0 Submissions RATE & REVIEW Who We Are Amoeblog Buy Sell Trade News & Contests Gift Certificates Contact Us Support & FAQ Sign-up for email news, sales alerts & more:", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}