{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15"], ["Name", "What Can I Say", "JoJo", "Miss Sun", "Hard Times", "Slow Dancer", "Harbor Lights", "Dinah Flo", "Look What You've Done to Me", "Breakdown Dead Ahead", "You Make It So Hard (To Say No)", "It's Over", "We're All Alone", "Heart of Mine", "Lowdown", "Lido Shuffle"], ["Artist", "Boz Scaggs", "Boz Scaggs", "Boz Scaggs", "Boz Scaggs", "Boz Scaggs", "Boz Scaggs", "Boz Scaggs", "Boz Scaggs", "Boz Scaggs", "Boz Scaggs", "Boz Scaggs", "Boz Scaggs", "Boz Scaggs", "Boz Scaggs", "Boz Scaggs"], ["Time", "3:00", "5:52", "5:31", "4:30", "3:13", "5:56", "3:02", "5:17", "4:34", "3:32", "2:49", "4:12", "4:12", "5:15", "3:43"], ["Price", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Hits! by Boz Scaggs", "title": "", "url": "https://itunes.apple.com/fi/album/jojo/id177422219?i=177422375", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00239-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 882075779, "recordOffset": 882047596, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{30197=Born: 08 June 1944 in Canton, OH, 27474=The original edition of Boz Scaggs Hits! appeared on CD in 1980 at the dawn of the CD era. It was unique in that it featured a few radio smashes that weren't available on his albums. As David Wild states in his liner notes that he didn't pick up the original Hits! \"...for the whole story, but for the lowdown....\" \"Miss Sun,\" (a 12\" single) and \"Look What You've Done to Me,\" (from the Urban Cowboy soundtrack) made this a special buy back then. They were later included on the two-disc My Time: Anthology, but for many, an introduction to Scaggs on a budget hits comp is a more attractive buy. Can't argue there; especially when Legacy has added increased the track listing from ten to 15. There are three additional cuts from the now legendary Silk Degrees record: the slippery, nocturnal disco groove \"What Can I Say?\"; the shimmering, sultry ballad \"Harbor Lights,\" and the big beat broken love song \"It's Over.\" The other two are the striking and original \"Hard Times\" from Down Two Then Left, and \"Heart of Mine\" from Other Roads. This is gutsy since neither of these album performed very well or were critically well-received at the time. No matter, these are stunners that add depth and dimension to the package and reflect the boom years for Scaggs. Certainly some of that production sounds dated now, but the songs that they frame are brilliant. While it's a shame there isn't anything cross-licensed from records like Some Change, Come on Home, and Dig — all recorded for Virgin and all excellent for different reasons — this is nothing short of a tight best-of from the Columbia years (and it includes \"Dinah Flo\" from the album My Time which isn't in print in the States currently) . In addition, \"Can You Loan Me a Dime\" featuring Duane Allman from the brief Warner era isn't here, but it's on Anthology, as are cuts from the out-of-print catalog. This is hopefully the beginning. Scaggs' writing and singing are made for the radio, the bedroom, the late-night party and for driving. While many of the tunes here focus on the pop side of soul and R&B — and even disco (a dirty word for some) — but noting Scaggs' long interest in jazz this makes sense. He's an artist who, the more adventurous he is, the more he ends up sounding like no one but himself. Surely Scaggs has models, Ray Charles being one, but you can also hear Curtis Mayfield's phrasing in the choruses, and Stevie Wonder's sense of drama, as well as Smokey Robinson's sense of poetry as a songwriter. Hits!, Rovi, 129772=Copyright © 2014 Apple Inc. Kaikki oikeudet pidätetään.}", "lastModified": "Fri, 31 Jul 2015 08:15:09 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Boz Scaggs Hits! iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Hits! by Boz Scaggs, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "15 Songs Album Review The original edition of Boz Scaggs Hits! appeared on CD in 1980 at the dawn of the CD era. It was unique in that it featured a few radio smashes that weren't available on his albums. As David Wild states in his liner notes that he didn't pick up the original Hits! \"...for the whole story, but for the lowdown....\" \"Miss Sun,\" (a 12\" single) and \"Look What You've Done to Me,\" (from the Urban Cowboy soundtrack) made this a special buy back then. They were later included on the two-disc My Time: Anthology, but for many, an introduction to Scaggs on a budget hits comp is a more attractive buy. Can't argue there; especially when Legacy has added increased the track listing from ten to 15. There are three additional cuts from the now legendary Silk Degrees record: the slippery, nocturnal disco groove \"What Can I Say?\"; the shimmering, sultry ballad \"Harbor Lights,\" and the big beat broken love song \"It's Over.\" The other two are the striking and original \"Hard Times\" from Down Two Then Left, and \"Heart of Mine\" from Other Roads. This is gutsy since neither of these album performed very well or were critically well-received at the time. No matter, these are stunners that add depth and dimension to the package", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}