{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"], ["Name", "Fiery Crash", "Imitosis", "Plasticities", "Heretics", "Armchairs", "Darkmatter", "Simple X", "The Supine", "Cataracts", "Scythian Empires", "Spare-Ohs", "Yawny At the Apocalypse"], ["Artist", "Andrew Bird", "Andrew Bird", "Andrew Bird", "Andrew Bird", "Andrew Bird", "Andrew Bird", "Andrew Bird", "Andrew Bird", "Andrew Bird", "Andrew Bird", "Andrew Bird", "Andrew Bird"], ["Time", "4:12", "4:00", "4:27", "3:33", "7:02", "5:07", "3:36", "0:58", "3:12", "4:34", "4:07", "3:48"], ["Price", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Armchair Apocrypha by Andrew Bird", "title": "", "url": "https://itunes.apple.com/us/album/fiery-crash/id293550516?i=293550519&ign-mpt=uo%3D4", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00151-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 877331911, "recordOffset": 877309983, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{86199=Copyright © 2014 Apple Inc. All rights reserved., 30447=Born: July 11, 1973 in Chicago, IL, 22521=With Armchair Apocrypha, Andrew Bird takes another developmental departure from his previous works, though not nearly in as drastic a fashion as his previous album-to-album jumps in style. This has become expected of Bird and is one of the merits that make each of his releases highly anticipated. Where in the past Bird has impressed listeners with his violin artistry and vocal delivery, and later his use of electronic looping and whistling, with Armchair he allows the songs to breathe more on their own, using the aforementioned elements to blend into the structural integrity of the songs rather than predominately featuring each component. This is not to say his previous approaches were ineffective, but rather an observation that is one of the essential reasons Armchair Apocrypha holds together more cohesively than Bird's previous outings. Perhaps the heavy inclusion of drummer and electric pianist Martin Dosh has much to do with this cohesion; it is the first time Dosh and Bird have teamed up on a recording, though the two had been touring together with regularity for a couple of years previous to this. Dosh provides excellent propulsion as a drummer and his Rhodes/Wurlitzer playing adds a deep and dynamic warmth to the entire album. With a few other guests, most noticeably bassist Chris Morrissey's playing on five of the 12 tracks, Armchair is the first album since the 2001 release of The Swimming Hour that feels like a band playing together rather than songs built in separate layers., 24046=The majority of the album feels so much more relaxed than much of Bird's previous works, due much in part to his almost laconic vocal delivery throughout. It's the first album that captures Bird's much lauded live approach, almost as if he had hit some completely transcendental place mentally, forgotten his place in the studio, and instead just sang while in some distant reverie — the way one sings unencumbered while washing the dishes in an empty house and, unknowingly, hones his artistic blade cleaning dirty knife by dirty knife. The most excellent example of this delivery is on the majestically sprawling \"Armchairs,\" a complex and dynamic number that unfolds cinematically in that it entirely captures attention and does not relent through nearly seven minutes, even without a single repeating melody. It is only fitting, then, that in the first climax of \"Armchairs,\" Bird belts out, \"Time, it's a crooked bow!\" over a dramatic musical descent. And he's right, the seven minutes in which \"Armchairs\" unfolds are so captivating, the time feels cut in half. That said, the entirety of Armchair Apocrypha does not completely have that level of looseness and adventure. \"Imitosis,\" a reworked version of \"I\" from the 2003 release Weather Systems, holds some of the stiffness of Bird's previous recordings which, to be fair, did not seem so stiff before Armchair Apocrypha was released. Still, as likeable a revision as \"Imitosis\" is, the song feels somewhat out of place alongside the bulk of these tracks and, being the second album in a row where Bird has updated a song from Weather Systems (\"Skin Is, My\" from The Mysterious Production of Eggs was an update of \"Skin\" from Weather Systems), it is hard not to begin listening to his back catalog searching for possibly half-baked ideas. This feeling generally dissipates when listening to songs such as \"Armchairs,\" the undeniably catchy \"Plasticities\" (that Bird's delivery of the chorus' lyric \"We'll fight...\" sounds like \"Whale fight...\" only makes the song more endearing), or the drum-loop based \"Simple X,\" co-written by Dosh, but is notable enough to contemplate whether or not Bird was confident in his previous albums or simply felt inspired to remake the past., 27952=In Feb 2008 when I was at Victory Base in my KBR trailer as alone as it's possible for a human to be, this album kept me sane. This album IS Iraq and the five day forecast is black tar rain and hellfire. We squandered our strength with abandon and time will tell if we wind up on the scrap heap of history through our recklessness. Sublime and way beyond music. Don't know how someone writes lyrics like this.}", "lastModified": "Sat, 01 Aug 2015 04:27:39 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Andrew Bird Armchair Apocrypha iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Armchair Apocrypha by Andrew Bird, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "12 Songs Album Review With Armchair Apocrypha, Andrew Bird takes another developmental departure from his previous works, though not nearly in as drastic a fashion as his previous album-to-album jumps in style. This has become expected of Bird and is one of the merits that make each of his releases highly anticipated. Where in the past Bird has impressed listeners with his violin artistry and vocal delivery, and later his use of electronic looping and whistling, with Armchair he allows the songs to breathe more on their own, using the aforementioned elements to blend into the structural integrity of the songs rather than predominately featuring each component. This is not to say his previous approaches were ineffective, but rather an observation that is one of the essential reasons Armchair Apocrypha holds together more cohesively than Bird's previous outings. Perhaps the heavy inclusion of drummer and electric pianist Martin Dosh has much to do with this cohesion; it is the first time Dosh and Bird have teamed up on a recording, though the two had been touring together with regularity for a couple of years previous to this. Dosh provides excellent propulsion as a drummer and his Rhodes/Wurlitzer playing adds a deep and dynamic warmth to the entire album. With a few other guests, most noticeably bassist Chris Morrissey's playing on", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}