{"relation": [["Author", "Stormlight", "Shadow-fox", "AbbyOnst"], ["Message", "Will a mod remove a certain story for me? Please?I hope this is the right place to post this. Yesterday I posted a story, Legacy, and there was some sort of glitch that occurred when I hit the submit button. Now, for some reason, it seems to be up on the site, but it isn't coming up at all in my account settings, so I can't edit it or add chapters to it or anything. Today I reposted the story, and this version IS up on my account settings so I can edit it and add chapters. Now my question is: How do I get rid of the first posting of the story? I have no way to delete it from my account. Is it possible for a mod to remove it for me? I don't want to get in trouble for having two versions of the same story up. The version with only one chapter is the one that needs to go. Thanks very much. Posted at 2007-04-26 6:39", "umm did u try deleting it? Posted at 2007-04-28 18:08", "I've had that happen to me with my one poem. It's not as much of a problem for me though as I don't need to edit it, but it would be nice to know what happened with it. Shadow-fox, if it's the same glitch that I have, there is no way for us to delete it. In the account settings where you can edit and delete it there is nothing for the piece. It doesn't show up there at all so nothing can be done with it. Posted at 2007-04-30 9:14"]], "pageTitle": "FicWad: fresh-picked original and fan fiction", "title": "", "url": "http://ficwad.com/forum/topic/890", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00131-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 87289234, "recordOffset": 87281032, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{2158=Site design Copyright 2005, K&D Lynch. All stories contained in this archive are the property of their respective authors, and the owners of this site claim no responsibility for their contents.}", "textBeforeTable": "Home > Site Issues > Will a mod remove a certain story for me? Please? Lost password Register Log in Remember me Log in ▼ Sign up to adjust the filter You won't see stories with a lower score when you browse or search. Filter Filter: 0 Help Forum Search Browse FicWad", "textAfterTable": "Site design Copyright 2005, K&D Lynch. All stories contained in this archive are the property of their respective authors, and the owners of this site claim no responsibility for their contents. Page created in 0.0162 seconds", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}