{"relation": [["", "1", "2", "3", "4", "5", "6"], ["Name", "Some of These Days", "Me and My Shadow", "Just in Time", "Ain't She Sweet", "By the Light of the Silvery Moon", "Keep the Home Fires Burning (1917)"], ["Album", "Rhythm Crazy: Popular Music from the 1920's", "Rhythm Crazy: Popular Music from the 1920's", "Bells Are Ringing (Original Broadway Cast)", "Rhythm Crazy: Popular Music from the 1920's", "Rhythm Crazy: Popular Music from the 1920's", "Oh! It's a Lovely War (Vol. 1) (Re-mastered)"], ["Artist", "Sophie Tucker", "'Whispering' Jack Smith", "Judy Holliday, Sydney Chaplin & Bells Are Ringing Ensemble", "Gene Austin", "Deep River Boys & Fats Waller And His Rhythm Band", "John McCormack"], ["Time", "2:56", "3:13", "3:42", "2:38", "3:13", "3:02"], ["Price", "0,99 €", "0,99 €", "1,29 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Merman sings Merman/Ethel's Ridin' High by Ethel Merman", "title": "", "url": "https://itunes.apple.com/fi/album/youre-just-in-love/id17853978?i=17854045", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00023-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 870847367, "recordOffset": 870816951, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{136359=Copyright © 2014 Apple Inc. Kaikki oikeudet pidätetään., 51493=Born: 16 January 1908 in New York, NY [Astoria], 49248=In the early 1970s, Ethel Merman, then in her 60s and having retired from the musical stage after 40 years on the boards, went to London and made three albums for the London and Decca labels, two of which, Merman Sings Merman and Ethel's Ridin' High, have been combined on this CD reissue. (This is not the first time that has happened, either. Eclipse Records has a disc called Merman Sings Merman ... and More [844 086-2] that contains the same material.) On Merman Sings Merman, Merman did what she had done more than once before: re-record some of her best-known stage songs in the recording studio. She betrayed some vocal deterioration, particularly with regard to her vibrato, but she was still able to hit her notes and hold them, particularly the long notes in \"I Got Rhythm,\" the song that had made her a star back in 1930 in Girl Crazy. By the time of Ethel's Ridin' High, she had largely gone through her existing catalog, although a few more of her oldies were included (\"Gee, But It's Good to Be Here\" from Happy Hunting, \"Some People\" from Gypsy, and \"Ridin' High\" from Red, Hot and Blue!). So, she cut a couple of songs from the '20s (\"Whispering\" and \"Someone to Watch Over Me\") and otherwise filled up the album with tunes from '60s musicals in which she did not appear. These turn out to be the most interesting performances on the album, if only because Merman is not known for them. She could hardly have portrayed Don Quixote on-stage, but \"The Impossible Dream\" is her kind of anthemic number; the only problem is that the dream doesn't sound remotely impossible when she sings about it. Similarly, \"On a Clear Day You Can See Forever\" is ideal for her clarion style. On the other hand, \"What Kind of Fool Am I\" seems unconvincing, if only because she lacks the kind of self-doubt (if not the self-regard) for which it calls. But her \"Sunrise, Sunset\" makes you think maybe she could have played the wife in Fiddler on the Roof, if they enlarged the part and gave her some of Tevye's numbers, that is!}", "lastModified": "Fri, 31 Jul 2015 07:33:16 GMT", "textBeforeTable": "View In iTunes Various Artists Rhythm Crazy: Popular Music from the 1920's Listeners Also Bought View In iTunes 0,99 € 1:55 Merman sings Merman/Ethel's Ridin' High Alexander's Ragtime Band 10", "textAfterTable": "View In iTunes 15,99 € Genres: Pop, Music, Soundtrack, Musicals, Rock, Vocal, Traditional Pop Released: 01 January 2004 ℗ 2004 Decca Music Group Limited Customer Ratings We have not received enough ratings to display an average for this album. Followers Eileen Farrell Barbra Streisand Contemporaries Betty Hutton Mary Martin Julie Andrews Judy Garland Liza Minnelli Irving Berlin Carol Channing Elaine Stritch Kaye Ballard Etsi ja jaa uusia ohjelmia. Seuraa meitä: @AppStore. Etsi ja jaa uusia musiikkikappaleita, elokuvia, kirjoja ja muuta.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}