{"relation": [["", "1", "2", "3", "4"], ["Name", "On Our Own", "I'll Wait For You", "Colorblind", "Fade"], ["Artist", "Egyptian", "Egyptian", "Egyptian", "Egyptian"], ["Time", "2:42", "3:19", "2:59", "3:02"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Egyptian - EP by Egyptian", "title": "", "url": "https://itunes.apple.com/us/album/egyptian-ep/id433029207", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00060-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 875859443, "recordOffset": 875843295, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{54546=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 05:09:53 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Egyptian Egyptian - EP iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Egyptian - EP by Egyptian, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "4 Songs Customer Reviews Great           by mermaidava98 Love both of their bands Nico Vega and Imagine Dragons. Great combo. More Aja!           by peacock blu Her vocals on these tracks don't even begin to grasp the power, the clarity, the strength & pure gorgeousness of her voice. Unfortunately, her talents seem to have a backseat on this album...the good news being, it leaves you wanting more. Check out Nico Vega for a real glimpse of what you're missing here. My Favorite!           by FalconFacee Can't even tell you how much I love it! These two have such beautiful souls and it makes for some beautiful music! Top Albums and Songs by Egyptian", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}