{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Deep Pockets", "Evolution", "Spirits Alike", "Consequence", "The Ascendent One", "Remembering Bob C, Vol. 1", "Lullaby for Imka", "Lady Bugg", "Alas Poor John", "Remembering Bob, Vol. 2"], ["Artist", "The Leaders", "The Leaders", "The Leaders", "The Leaders", "The Leaders", "The Leaders", "The Leaders", "The Leaders", "The Leaders", "The Leaders"], ["Time", "7:59", "5:20", "6:38", "5:58", "3:30", "2:32", "7:08", "7:55", "8:52", "3:01"], ["Price", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Spirits Alike by The Leaders", "title": "", "url": "https://itunes.apple.com/us/album/spirits-alike/id265174120", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00239-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 882240643, "recordOffset": 882221022, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{67385=Copyright © 2014 Apple Inc. All rights reserved., 19670=Formed: 1985}", "lastModified": "Fri, 31 Jul 2015 08:05:57 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist The Leaders Spirits Alike iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Spirits Alike by The Leaders, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "10 Songs Album Review In the late 1980s and early '90s, the Leaders was a part-time all-star group consisting of trumpeter Lester Bowie, tenor saxophonist Chico Freeman, altoist Arthur Blythe, pianist Kirk Lightsey, bassist Cecil McBee and drummer Don Moye. The new Leaders only retains Freeman and McBee, with trumpeter Eddie Henderson succeeding the late Bowie and altoist Bobby Watson, the lesser-known but talented pianist Fred Harris and drummer Billy Hart taking the places of Blythe, Lightsey and Moye. While Bowie in particular is missed, Eddie Henderson does a good job of filling in, and the new Leaders are of the same high quality as the original group. The music, all originals from bandmembers, ranges from advanced hard bop to hints of the avant-garde, from bluesy material to a pair of duets by Freeman and McBee. Watson and Freeman in particular consistently take solo honors although all of the musicians fare well. Recommended. Biography Formed: 1985 Genre: Jazz Years Active: '80s, '90s The Leaders was a veritable supergroup of leftward-leaning, mid-'80s jazz stars. Its front line was comprised of three of the era's important personalities — trumpeter Lester Bowie, from the decade's most critically acclaimed band, the Art Ensemble of Chicago; alto saxophonist Arthur", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}