{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Me Oh My", "Sad Sad Feet", "Shoeing the Bones", "Hollow Trees House Hounds", "It's Not the End", "Terror of the Man", "Eyes So Bright", "Digging Song", "Burn Until the End", "Out to Sea"], ["Artist", "Cate Le Bon", "Cate Le Bon", "Cate Le Bon", "Cate Le Bon", "Cate Le Bon", "Cate Le Bon", "Cate Le Bon", "Cate Le Bon", "Cate Le Bon", "Cate Le Bon"], ["Time", "3:47", "3:35", "3:39", "3:33", "3:23", "4:38", "4:10", "3:02", "3:30", "2:36"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Me Oh My by Cate Le Bon", "title": "", "url": "https://itunes.apple.com/us/album/me-oh-my/id360751452?i%3D360751548%26uo%3D4%26at%3D11l79Y", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00216-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 870634447, "recordOffset": 870603875, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{121078=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 04:27:10 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Cate Le Bon Me Oh My iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Me Oh My by Cate Le Bon, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "10 Songs Customer Reviews Hard Times to Fall in Love           by sugar cube After first hearing of Cate Le Bon at SXSW it drove me nuts trying to figure out who she reminded me of musically. After downloading 'Me Oh My' it hit me - Nico!! It's not simply Le Bon's voice that conjures up the Nico reference, the melancholy, lazy and melodic guitar in songs like 'Sad, Sad Feet' and other tracks on 'Me Oh My' is more than a subtle nod to Velvet Underground, it's a bow. But if the title track was the first you'd ever heard of Cate Le Bon you may not guess what other surprises she had in store. The opening track cranks up with 1970's sounding synth and feminine chaos that beckons PJ Harvey if it weren't for a much sweeter Cate. 'Hollow Trees House Hounds' moves away from 'Sad, Sad Feet' and 'Shoeing the Bone' ( a fantastic song I listened to repeatedly for days!!) to a 1960's surfer/hipster sound I am not sure fits Le Bon, but her serious vocal approach and minor keys somehow give the popular genre an interestingly", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}