{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Black Shuck", "Get Your Hands Off My Woman", "Growing On Me", "I Believe In a Thing Called Love", "Love Is Only a Feeling", "Givin' Up", "Stuck In a Rut", "Friday Night", "Love On the Rocks With No Ice", "Holding My Own"], ["Artist", "The Darkness", "The Darkness", "The Darkness", "The Darkness", "The Darkness", "The Darkness", "The Darkness", "The Darkness", "The Darkness", "The Darkness"], ["Time", "3:21", "2:46", "3:28", "3:36", "4:20", "3:33", "3:17", "2:55", "5:55", "4:57"], ["Price", "8,00 kr", "8,00 kr", "8,00 kr", "10,00 kr", "8,00 kr", "8,00 kr", "8,00 kr", "8,00 kr", "8,00 kr", "8,00 kr"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Permission to Land by The Darkness", "title": "", "url": "https://itunes.apple.com/dk/album/permission-to-land/id74912920", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00028-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 882486455, "recordOffset": 882459221, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{22676=Formed: 2000 in Norfolk, England, 123170=Copyright © 2014 Apple Inc. Alle rettigheder forbeholdes., 19427=Upon its U.K. release in summer 2003, Permission to Land, the debut album from spandex-clad retro metalheads the Darkness, was a surprise success, hitting the British charts at number two (behind only Beyoncé's Dangerously in Love). After hearing Permission to Land, it's easier to understand why the British public went crazy for it, and for the Darkness. The album is more or less straightforward pop/rock with some '80s metal window-dressing, and the Darkness themselves live up to traditional notions of what a rock band should be: louche, decadent, and harboring a don't-bore-us-get-to-the-chorus mentality. While the band is far from ironic in its homages to Kiss, Judas Priest, and Queen, the Darkness certainly are campy (and with a list of influences like that, they'd almost have to be), with a uniquely British sensibility, personified by singer Justin Hawkins. A one-man campaign to bring back the unitard as fashionable rock gear, Hawkins sings about sex, drugs, and Satan with the voice of a castrato, backed by arena-sized riffs and rhythms. The Darkness would be an utter failure if the band didn't write good songs, but miracle of miracles, they do. The first two-thirds of Permission to Land is nearly flawless, an eerily realistic simulation of '80s metal and '70s glam that manages to sound familiar but not rehashed. \"Black Shuck\" revels in pseudomystic gobbledygook like \"Flames licked round the sacred spire\"; on the great single \"Get Your Hands off My Woman,\" Hawkins sings \"woooomaaan\" higher than most women probably could. \"Growing on Me\" (which includes the great lyric \"I want to banish you from whence you came\") and \"I Believe in a Thing Called Love\" are tightly crafted songs that would sound good in almost any style, while \"Givin' Up\" is one of the jauntiest songs about heroin ever written. Even the prerequisite power ballad, \"Love Is Only a Feeling,\" stays on the fun side of cheesy, adrift on clouds of strummed guitars and gooey backing harmonies. The album has such a strong beginning and middle that it's not entirely surprising that Permission to Land runs out of steam near the end, although \"Stuck in a Rut\" is a crazed enough rocker — complete with demonic laughter — to nearly rival the album's earlier songs. Softer songs like \"Friday Night\" and \"Holding My Own\" make the collection unusually ballad-heavy; if anything, the Darkness could stand to rock a little harder. Even though Permission to Land isn't quite as metal as its singles suggested it might be, the album is surprisingly good, especially considering how bad the band's '80s metal revival could have been. It's hard to say whether or not the Darkness will take off in the States the way they did in their homeland; Hawkins' over-the-top vocals aside, the band may be hurt by the fact that most metal and hard rock popular in the U.S. is more concerned with brooding and angst than with having fun. But having fun is what Permission to Land is all about, even if it's just a guilty pleasure.}", "lastModified": "Fri, 31 Jul 2015 08:27:55 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist The Darkness Permission to Land iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Permission to Land by The Darkness, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "10 Songs Album Review Upon its U.K. release in summer 2003, Permission to Land, the debut album from spandex-clad retro metalheads the Darkness, was a surprise success, hitting the British charts at number two (behind only Beyoncé's Dangerously in Love). After hearing Permission to Land, it's easier to understand why the British public went crazy for it, and for the Darkness. The album is more or less straightforward pop/rock with some '80s metal window-dressing, and the Darkness themselves live up to traditional notions of what a rock band should be: louche, decadent, and harboring a don't-bore-us-get-to-the-chorus mentality. While the band is far from ironic in its homages to Kiss, Judas Priest, and Queen, the Darkness certainly are campy (and with a list of influences like that, they'd almost have to be), with a uniquely British sensibility, personified by singer Justin Hawkins. A one-man campaign to bring back the unitard as fashionable rock gear, Hawkins sings about sex, drugs, and Satan with the voice of a castrato, backed by arena-sized riffs and rhythms. The Darkness would be an utter failure if the band didn't write good songs, but miracle of miracles, they do. The first two-thirds of Permission to Land is nearly flawless, an eerily realistic simulation of '80s metal and '70s glam that manages to sound familiar but not rehashed.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}