{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25"], ["Name", "Just a Closer Walk With Thee", "West End Blues", "Singin' the Blues", "Mother In Law/Lipstick Traces", "What Do You Want the Girl to Do", "Victims of the Darkness", "Am I Expecting Too Much", "My Baby Is the Real Thing", "Goin' Down", "She Once Belonged to Me", "Out of the City (Into Country Life)", "Soul Sister", "Fingers and Toes", "I've Got to Convince Myself", "On Your Way Down", "Gone Too Far", "Electricity", "Last Train", "Worldwide", "Back In Baby's Arms", "Country John", "Basic Lady", "Southern Nights", "You Will Not Lose", "What Do You Want the Girl to Do?"], ["Album", "The Bright Mississippi", "The Bright Mississippi", "The Bright Mississippi", "Louisiana Live from Mountain Stage", "The Best of Mountain Stage, Vol. 4", "The Complete Warner Recordings", "The Complete Warner Recordings", "The Complete Warner Recordings", "The Complete Warner Recordings", "The Complete Warner Recordings", "The Complete Warner Recordings", "The Complete Warner Recordings", "The Complete Warner Recordings", "The Complete Warner Recordings", "The Complete Warner Recordings", "The Complete Warner Recordings", "The Complete Warner Recordings", "The Complete Warner Recordings", "The Complete Warner Recordings", "The Complete Warner Recordings", "The Complete Warner Recordings", "The Complete Warner Recordings", "The Complete Warner Recordings", "The Complete Warner Recordings", "The Complete Warner Recordings"], ["Time", "5:10", "3:51", "5:40", "5:14", "3:20", "3:30", "2:50", "3:05", "2:58", "2:51", "3:36", "2:49", "4:07", "2:43", "4:00", "3:27", "2:33", "3:01", "2:42", "4:49", "4:45", "2:58", "3:36", "3:42", "3:40"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Allen Toussaint", "title": "", "url": "https://itunes.apple.com/ee/artist/allen-toussaint/id333601?albumPage=1", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00130-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 882377755, "recordOffset": 882348886, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{38383=Upon his discharge in 1965, Toussaint teamed up with fellow producer Marshall Sehorn to form a production company and record label, Sansu Enterprises. Sansu recorded the likes of Betty Harris, Earl King, Chris Kenner, and Lou Johnson, among others, often leasing their singles to larger labels for official release. Their most profitable association was with Lee Dorsey, who returned to the upper reaches of the R&B charts with Toussaint-penned hits like \"Ride Your Pony,\" the oft-covered \"Get Out of My Life Woman,\" the immortal \"Working in a Coalmine,\" and \"Everything I Do Gonh Be Funky (From Now On)\" (covered by jazzman Lou Donaldson). In 1966, Sansu also engaged the services of a house band dubbed the Meters, who supplied backing for nearly all of the company's productions; after the Meters started making their own records in 1969 (produced by Toussaint), they developed into arguably the top instrumental funk ensemble of the '70s outside of the J.B.'s., 36076=In 1976, Toussaint produced the Meters-related group the Wild Tchoupitoulas, whose self-titled debut was hailed as a classic of New Orleans funk. The record's experimentalism signaled a growing desire to branch out in the Meters camp, though, which would soon cause the band's split with Toussaint and, eventually, each other. The absence of their unerring sense of groove was noticeable on Toussaint's final solo LP for quite some time, 1978's Motion. Toussaint's activities tailed off in the years that followed; he still produced, arranged, and played piano on selected projects, which included albums by blues artists Etta James and Albert King, and rockers Elvis Costello and Joe Cocker, among others. In the meantime, his extensive song catalog was still mined regularly for cover material; the Lee Dorsey period was the most fertile, not just for \"Working in a Coalmine\" (Devo, the Judds), but lesser-known items like \"Yes We Can\" (the Pointer Sisters), \"Sneakin' Sally Through the Alley\" (Robert Palmer), and \"Freedom for the Stallion\" (the Oak Ridge Boys, among others). In addition, \"Play Something Sweet (Brickyard Blues)\" was a hit for Three Dog Night, and Bonnie Raitt cut a well-received version of \"What Is Success.\" The Allen Toussaint Collection, a fine overview of his major-label recordings in the '70s, was released in 1991. In 1996, Toussaint formed a new label, NYNO, and recorded a full album of new material at his Sea-Saint studio titled Connected. Toussaint also began recording newer Crescent City artists in hopes of preserving the classic New Orleans sound. He was inducted into the Rock & Roll Hall of Fame in 1998 in the non-performer category. Going Places, attributed to Allen Toussaint's Jazzity Project, appeared in 2005, followed by the Joe Henry-produced The Bright Mississippi from Nonesuch Records in 2009. Four years later, the solo live album Songbook — its performances dating from 2006 — appeared on Rounder., 42771=Producer, songwriter, arranger, session pianist, solo artist — Allen Toussaint has worn all these hats over the course of his lengthy and prolific career, and his behind-the-scenes work alone would have been enough to make him a legend of New Orleans R&B. Thanks to his work with numerous other artists, Toussaint bore an enormous amount of responsibility for the sound of R&B in the Crescent City from the '60s on into the '70s. His productions kept with the times, moving from rollicking, earthy soul in the '60s to gritty, rambunctious funk in the '70s. As a composer, Toussaint proved himself a consistent hitmaker, penning more than a few gems that have since become R&B standards and been covered by countless artists working in many different styles. In keeping with that across-the-board appeal, Toussaint has worked in some supporting capacity for a wide variety of rock and blues legends, particularly from the '70s on. On top of all that, Toussaint waxed his own records from time to time, enjoying a creative peak in the '70s with several albums that highlighted his laid-back vocals and elegantly funky piano work. Even if he wasn't always the most visible figure, Toussaint's contributions to New Orleans music — and to rock & roll in general — were such that he earned induction into the Rock and Roll Hall of Fame in 1998., 39988=In 1960, Toussaint was hired by Joe Banashak as an A&R man for the brand-new Minit label; in practice, he wound up masterminding most of the label's recording sessions. It was here that Toussaint truly began to build his legend. His first national success as a producer came with Jessie Hill's R&B Top Five smash \"Ooh Poo Pah Doo\" in 1960, and the classic hits came fast and furious after that: Ernie K-Doe's pop and R&B number one \"Mother-in-Law\" (a Toussaint composition), Benny Spellman's \"Fortune Teller,\" and \"Lipstick Traces (On a Cigarette)\" (both Toussaint tunes written as Naomi Neville, with the former later covered by the Rolling Stones), Chris Kenner's original version of \"Land of 1000 Dances,\" Lee Dorsey's \"Ya Ya,\" and numerous sides with New Orleans soul queen Irma Thomas. Toussaint's singular touch on all these records redefined the sound of New Orleans R&B for a new decade. When Banashak left Minit to found another label, Instant, Toussaint went with him to fulfill much the same duties; he also freelanced elsewhere, most prominently with Dorsey's recordings for the Fury label, and cut a few low-profile singles of his own, mostly for Seville. In 1963, Toussaint was drafted into the military, during which time he recorded with his backing band the Stokes while on leave; one of their tunes, the Naomi Neville credit \"Whipped Cream,\" was covered by Herb Alpert in 1965 for an instrumental hit, which was in turn later adopted as the theme for TV's The Dating Game., 37346=In 1971, Toussaint recorded his first solo album in over a decade for Scepter, calling it simply Toussaint (it was later reissued in the U.K. as From a Whisper to a Scream, after its best-known track). The following year, he moved up to Reprise for Life, Love and Faith, and he and Sehorn opened a state-of-the-art recording studio in New Orleans called Sea-Saint, which became the site for most of his subsequent projects. In addition to his solo records, Toussaint was getting more high-profile offers for outside work during the first half of the '70s. He did horn arrangements for the Band, Paul Simon, Little Feat, and Sandy Denny, and his continued work with the Meters was moving him into contemporary funk with a harder edge than his own albums. In fact, he wound up producing two of New Orleans' greatest funk records: Dr. John's Top Ten hit \"Right Place, Wrong Time\" and LaBelle's number one disco-funk smash \"Lady Marmalade.\" In 1975, Toussaint released what many regarded as his finest solo album, Southern Nights; the title track went on to become a huge hit for country-pop superstar Glen Campbell, and \"What Do You Want the Girl to Do?\" was covered by Boz Scaggs, Lowell George, and Bonnie Raitt., 41388=Toussaint was born January 14, 1938, in New Orleans, and began learning piano at age seven, inspired by Professor Longhair; his style later grew to include elements of Fats Domino, Huey \"Piano\" Smith, and Ray Charles. As a teenager, he played in a band called the Flamingoes with bluesman Snooks Eaglin. Toussaint caught his first professional break at age 17, when Earl King tapped him to fill in for Smith at a live gig. Not long after, famed producer/songwriter Dave Bartholomew — whose role in New Orleans R&B during the '50s was fairly analogous to Toussaint's later career — hired him to lay down the piano parts at a Fats Domino recording session for which Domino himself was unavailable. Bartholomew made regular use of Toussaint, most notably on further sessions for Domino and Smiley Lewis, and demand for the young pianist's services grew quickly, especially after he first displayed his talent as an arranger on saxman Lee Allen's biggest hit, \"Walkin' with Mr. Lee.\" In 1958, Toussaint recorded an instrumental album for RCA called The Wild Sound of New Orleans, under the alias Tousan; one of his original compositions for the record, \"Java,\" went on to become a smash hit for Dixieland jazz trumpeter Al Hirt five years later. Toussaint also began writing under the pseudonym Naomi Neville, after his mother's maiden name.}", "TableContextTimeStampAfterTable": "{58978=14 January 1938 in New Orleans, LA, 62851=Autoriõigus © 2014, Apple Inc. Kõik õigused on reserveeritud.}", "lastModified": "Sat, 01 Aug 2015 04:31:27 GMT", "textBeforeTable": "Top Songs 4 3 2 1 View In iTunes Happy Times 20. View In iTunes Back Home Again in Indiana 19. View In iTunes Birdland - New Music for Flexible Instrumentation 2013-2014 18.", "textAfterTable": "1 2 3 4 5 6 7 8 9 10 Next Top Music Videos 1. On Your Way Down (Live) View In iTunes 2. I Changed My Mind View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}