{"relation": [["Headline", "A new twist to your next playthrough", "A good twist on a classic", "Very well done"], ["Author", "ShiningForceHero", "NovaSurge", "Ligeia"], ["Date", "03 Feb 2012", "16 Jul 2013", "26 Oct 2014"], ["Version", "N/A", "N/A", "N/A"], ["Recommended", "Yes", "Yes", "Yes"]], "pageTitle": "Romhacking.net - Hacks - Playable Golbez Edition", "title": "User Reviews", "url": "http://www.romhacking.net/hacks/850/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00113-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 677210011, "recordOffset": 677201809, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Credits: Screenshots: Download Readme File News Articles for this Hack Links: Patch Applied CRC32: 229DDF9D Unmodified ROM CRC32: EE345FBD Version 1.1 ROM / ISO Information: Thanks! Please visit my blog for more information on this and other projects. We are currently on Version 2.1, the seventh release of this hack. 2.1 repairs a glitch with Cid’s ability to equip heavy armors and helmets which was introduced in the last release. Thank you to everyone who tried this hack! Please note that the changes introduced by this hack are relatively minor up until Cecil and friends reach Troia. The changes become more pronounced after Cid rescues the team from the Tower of Bab-il. With that said, surprises are sprinkled along the way to hold the player’s interest. Other changes include: a modified party lineup at various points throughout the game, many new equipment and tool items, the restoration of dummied commands and spells, overall refinement of the script, and more. This hack alters events of the game such that Golbez joins the party after Cecil and friends destroy the Giant of Bab-il. The story has been tweaked in various ways so that this development makes sense in context. Edge is", "textAfterTable": "Date Version Recommended A new twist to your next playthrough ShiningForceHero 03 Feb 2012 N/A Yes A good twist on a classic NovaSurge 16 Jul 2013 N/A Yes Very well done Ligeia 26 Oct 2014 N/A Yes ADD REVIEW ﻿ Information ©2005-2014 RHDN 2.6.0 by Nightcrawler. All Rights Reserved. Execution time - 0.0086 sec. - Number of Queries: 5 About Us | RHDN Policy | XHTML | CSS", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}