{"relation": [["", "1", "2", "3", "4"], ["Name", "All In My Mind", "Oh No Not My Baby", "It’s Gonna Be Alright", "If You Gotta Make a Fool of Somebody"], ["Artist", "Maxine Brown", "Maxine Brown", "Maxine Brown", "Maxine Brown"], ["Time", "2:33", "2:37", "2:37", "2:08"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Gusto Top Hits - All In My Mind - EP by Maxine Brown", "title": "", "url": "https://itunes.apple.com/us/album/all-in-my-mind/id297715269?i=297715282", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00285-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 865609359, "recordOffset": 865586667, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{112316=Copyright © 2014 Apple Inc. All rights reserved., 9708=Born: August 18, 1939 in Kingstree, SC}", "lastModified": "Fri, 31 Jul 2015 07:28:43 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Maxine Brown Gusto Top Hits - All In My Mind - EP iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Gusto Top Hits - All In My Mind - EP by Maxine Brown, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't", "textAfterTable": "4 Songs Customer Reviews ORIGINAL HIT VERSIONS!           by D-J Ross Don't let the generic CD cover scare you away; these are the ORIGINAL Maxine Brown hit recordings [some even in stereo]. I know, Gusto Records has a reputation for re-recordings, but [in this case] they nabbed the original Wand-label masters from parent company Scepter Records. Only three stars for this release because I wanted a FULL ALBUM, not just an EP! Biography Born: August 18, 1939 in Kingstree, SC Genre: R&B/Soul Years Active: '60s, '70s, '80s, '90s, '00s, '10s Although she never had many hits, Maxine Brown was one of the most underrated soul and R&B vocalists of the '60s. During the '60s she released a series of singles for Nomar and Wand, with only a couple of songs — \"All in My Mind,\" \"Funny,\" \"Something You Got,\" \"Oh No Not My Baby\" — managing to become either pop or R&B hits. Despite her lack of hits, Brown is... Full Bio", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}