{"relation": [["Title", "BioHazard: Revelations", "Resident Evil: Revelations", "Resident Evil: Revelations", "Resident Evil: Revelations"], ["Publisher", "Capcom", "Capcom", "Capcom", "Capcom"], ["Region", "Japan", "Europe", "Europe", "North America"], ["Date", "26th January 2012", "27th January 2012", "27th January 2012", "07th February 2012"], ["Distribution", "Retail", "Retail", "Retail", "Retail"]], "pageTitle": "Resident Evil: Revelations (Nintendo 3DS) - Sales, Wiki, Cheats, Walkthrough, Release Date, Gameplay, ROM on VGChartz", "title": "", "url": "http://www.vgchartz.com/game/45684/resident-evil-revelations/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00293-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 801724367, "recordOffset": 801710342, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{22594=About Us | Terms of Use | Privacy Policy | Advertise | Staff | Contact © 2006-2015 VGChartz Ltd. All rights reserved. US, 5547=Resident Evil: Revelations (BioHazard: Revelations) is a survival horror video game developed by Capcom for the Nintendo 3DS, Microsoft Windows, PlayStation 3, Xbox 360, and Wii U. Taking place in 2005, between the events of Resident Evil 4 and Resident Evil 5, it follows Chris Redfield and Jill Valentine after the establishment of the Bioterrorism Security Assessment Alliance (BSAA).}", "textBeforeTable": "Release History 0.84m = Global 5.4% 0.05m + Rest of the World: 36.3% 0.30m + Japan: 24.7% 0.21m + Europe: 33.6% 0.28m North America: Total Units Comments Japan France Germany UK Europe USA Global Summary Genre: Action Developer: Capcom Also on: PlayStation 3, Xbox 360, Wii U, Microsoft Windows Platform: Nintendo 3DS 0.84m Global Total as of 27th Jun 2015 (units): Resident Evil: Revelations //--> document.write('');", "textAfterTable": "Game Overview Resident Evil: Revelations (BioHazard: Revelations) is a survival horror video game developed by Capcom for the Nintendo 3DS, Microsoft Windows, PlayStation 3, Xbox 360, and Wii U. Taking place in 2005, between the events of Resident Evil 4 and Resident Evil 5, it follows Chris Redfield and Jill Valentine after the establishment of the Bioterrorism Security Assessment Alliance (BSAA). When Jill and her new partner, Parker Luciani, are sent to search for Chris Redfield and Jessica Sherawat on the SS Queen Zenobia, they find a ship infected with B.O.W.s and a new T-Abyss virus, a marine virus derived from the deadly T-Virus. Meanwhile, Chris and Jessica find the base of operations for Veltro, but are cut short when they must return to the SS Queen Zenobia when Jill and Parker go missing themselves. Resident Evil: Revelations Wiki on Gamewise Overview Release Dates Credits Story Gameplay", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}