{"relation": [["Year", "1981", "1981", "1982", "1982", "1982", "1982", "1991", "2013"], ["Album", "Music For Listening To", "Music For Stowaways", "B.E.F.* Presents Sandie Shaw - Anyone Who Had A Heart", "B.E.F.* Featuring Tina Turner - Ball Of Confusion", "Music of Quality and Distinction Volume One", "Music Of Quality And Distinction Volume One", "Music of Quality and Distinction Volume Two", "Music of Quality and Distinction Volume Three"], ["UK", "-", "-", "-", "-", "25", "-", "-", "-"], ["Catalogue", "BEF 1", "TCV 2888", "VS 487", "VS 500", "V 2219", "VV 2219", "-", "-"], ["Label", "B.E.F./Virgin Records", "B.E.F./Virgin Records", "-", "-", "B.E.F./Virgin Records", "-", "B.E.F./Virgin Records", "-"], ["Notes", "Vinyl L.P. Album released by Virgin UK mainly for export to other countries, featuring selected tracks from the Music For Stowaways cassette (TCV 2888) plus exclusive track A Baby Called Billy", "Cassette only release (Limited number edition of 10,000 copies)", "Vinyl 7\"", "Vinyl 7\"", "-", "Vinyl 5 x 7\" singles", "-", "Standard CD and iTunes releases, plus 2-disc limited edition CD release autographed by Ware"]], "pageTitle": "British Electric Foundation - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/B.E.F._(British_Electric_Foundation)", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00122-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 867646431, "recordOffset": 867626565, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{8587=In March 2007 B.E.F. made their first live performance, as part of the line-up for the Tribute to Billy MacKenzie Concert held at Shepherds Bush Empire, London, in memory of their three-time guest vocalist, and in aid of Sound Seekers. The B.E.F. line-up consisted of Martyn Ware on keyboards, a guitarist/keyboardist and a bassist, with Glenn Gregory and Billie Godfrey, Heaven 17's female vocalist.[3], 4006=In 1982, with Heaven 17 already established with Glenn Gregory as the lead vocalist, B.E.F. released an album entitled Music of Quality and Distinction Volume One on Virgin Records, which involved other artists covering classic songs. The production was mainly in the Heaven 17/ B.E.F. style (i.e. synthesisers and LinnDrums). Tina Turner's version of The Temptations's \"Ball of Confusion\" drew the attention of Capitol Records and her next single \"Let's Stay Together\", co-produced by Ware, peaked at number six in the UK chart and made the US Top 20. B.E.F.'s album also featured covers by Billy Mackenzie - \"The Secret Life of Arabia\" and \"It's Over,\" Paul Jones - \"There's A Ghost In My House,\" Paula Yates - \"These Boots Are Made For Walkin',\" Gary Glitter - \"Suspicious Minds,\" Bernie Nolan - \"You Keep Me Hangin' On,\" Glenn Gregory - \"Wichita Lineman\" and \"Perfect Day\" and Sandie Shaw - \"Anyone Who Had a Heart.\", 7546=Dark was released 27 May 2013, with Ware explaining the album would consist of \"very dark versions of tunes that have to be of a certain type. Basically it's dark reinterpretations, primarily looking at things differently from a lyrical point of view. It's almost like soundscape stuff, in much the same way as \"You've Lost That Loving Feeling\" on \"Reproduction\" was kind of like a soundscape.\"[2], 3174=Ware and Marsh's first release as B.E.F. in 1980, a collection of instrumentals entitled Music For Stowaways, was initially available only on cassette and was inspired by the appearance of the first Sony Walkman (at first marketed in the UK as the Sony Stowaway). There was also a vinyl release, Music For Listening To, mainly targeted for export sales, which was slightly truncated (though with the addition of a track not found on the cassette). In the late 1990s, a CD release with this title contained the complete contents from both versions., 10270=Following this concert, the stripped-down cover of \"Party Fears Two\" was recorded in studio and was featured on Heaven 17's 2008 album Naked as Advertised., 6522=It was not until 1991 that a second volume appeared, again featuring Tina Turner (singing \"A Change Is Gonna Come\") and Billy Mackenzie (singing \"Free\"), whilst B.E.F.'s version of \"Family Affair\" gave them and singer Lalah Hathaway a Top 40 hit in the UK Singles Chart.[1] Scritti Politti's Green Gartside was another guest on the album, performing \"I Don't Know Why I Love You\", and Scritti Politti's pop-reggae version of \"She's a Woman\" (featuring Shabba Ranks) was recorded in the same set of sessions.}", "lastModified": "Thu, 30 Jul 2015 18:06:22 GMT", "textBeforeTable": "Discography[edit] Following this concert, the stripped-down cover of \"Party Fears Two\" was recorded in studio and was featured on Heaven 17's 2008 album Naked as Advertised. the Associates' \"Party Fears Two\" in a slower/stripped-down version. David Bowie's \"Drive-In Saturday\" (another MacKenzie favourite) a version of \"Temptation\" similar to the original demo, with guest vocalist Claudia Brücken (who was present with two other acts: Onetwo and Claudia Brücken/Andrew Poppy) Heaven 17's \"Let Me Go\" (Gregory revealing that it was MacKenzie's favourite Heaven 17 track) the aforementioned \"Free\" Setlist In March 2007 B.E.F. made their first live performance, as part of the line-up for the Tribute to Billy MacKenzie Concert held at Shepherds Bush Empire, London, in memory of their three-time guest vocalist, and in aid of Sound Seekers. The B.E.F. line-up consisted of Martyn Ware on keyboards, a guitarist/keyboardist and a bassist, with Glenn Gregory and Billie Godfrey, Heaven 17's female vocalist.[3] First live performance[edit] Dark was released 27 May 2013, with Ware explaining the album would consist of \"very dark versions of tunes that have to be of a certain type. Basically it's dark reinterpretations, primarily", "textAfterTable": "References[edit] ^ Roberts, David (2006). British Hit Singles & Albums (19th ed.). London: Guinness World Records Limited. p. 36. ISBN 1-904994-10-5.  ^ \"Heaven17.com news section: Live debut of BEF, January 17, 2007, Billy MacKenzie Tribute Concert\". February 2007. Retrieved 21 April 2007.  ^ \"Billy MacKenzie Tribute Concert Shepherd's Bush Empire, London\". The Independent. April 2007. Retrieved 1 February 2009.  External links[edit] B.E.F. at AllMusic Official site v t e Heaven 17 Glenn", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}