{"relation": [["Subject", "Connecting GPS to computer/Jornada PC's", "Connecting GPS to computer/Jornada PC's"], ["Author", "Robert Blundon", "Deb Hurraw at Farm Works Software"], ["Posted", "December 07, 2000 12:00AM", "December 07, 2000 12:00AM"]], "pageTitle": "Connecting GPS to computer/Jornada PC's", "title": "", "url": "http://www.farmworks.com/forum/read.php?10,40092,40093", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00148-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 433986957, "recordOffset": 433978755, "tableOrientation": "HORIZONTAL", "textBeforeTable": "RSS Quote Reply Deb Hope these help to get you connected! manual or paperwork that came with it to see where it is located. hole on the back of the unit that a paperclip works perfect for. I would check the without losing the program or data. Again on the Aeros, there is a pin sized 3. Reset - Somewhere on the Jornada, you should have a Reset. This should reset the unit means the same. If this has a checkmark, click on it to remove it. direct connection to desktop\". The wording may be slightly different but This is a box that can be checked or unchecked. Beside it states \"Enable 2. Direct Connection Box - This could be under Communications, or PC Connection. assuming that this would be the same with the Jornada. 1. Cabling - The Aeros and Ipaqs require a special cable to be used for GPS. I'm basically be the same for your Jornada. things that we suggest to check out when users are having problems, which should As we resell the Compaqs, I'm a bit more familiar with those units. These are Robert, December", "textAfterTable": "Sorry, only registered users may post in this forum. Click here to login This forum is powered by Phorum. Privacy Statement | Terms of Use | © Copyright 2009, Trimble Navigation Limited", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}