{"relation": [["Guide Title and Link", "building and installing OpenELEC", "Using Skypekit", "Pre-configuring SD card with a static IP address", "Sending remote commands to our Pi thanks to Pastebin"], ["Guide Description", "How to build and install OpenELEC,a embedded Multimedia Distro. You can learn (cross)compiling, building packages from source, how buildsystems are working and what is needed to install a OS on a SD-card for Raspberry Pi.", "How to get started using Skypekit to make calls & chat. This is currently only useful for advanced users & developers.", "Guide to pre-configuring a SD image so that it boots with a static IP address. Useful for running headless without needing to know what DHCP address will be allocated.", "A guide to send remote commands to our Pi just by editing a pastebin!"], ["Tags", "XBMC, HTPC, Multimedia, Distro, compiling", "Skype, Skypekit", "networking, tcpip", "remote commands, notsureifuseful"], ["Author", "Stephan Raue", "Henry Cooke", "Stewart Watkiss", "Itxaka Serrano Garcia"], ["Status", "Available", "Alpha.", "Available", "Available"]], "pageTitle": "Difference between revisions of \"RPi Guides\" - eLinux.org", "title": "", "url": "http://www.elinux.org/index.php?title=RPi_Guides&diff=prev&oldid=223550", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00335-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 433204285, "recordOffset": 433188680, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{26918=--Geraldcor 03:36, 18 June 2012 (UTC)}", "textBeforeTable": "This section describes tasks that involve software installation, setup or configuration of your Raspberry Pi. System Tasks Guide Status (Not Started/In-Progress/Available). Author(s) or group who have produced it (also if it is an Open/Community Project for anyone to contribute) Tags (key words related to the item, i.e. LCD Screen, Teaching, Python) Guide Description (including any additional links or information Guide Title (as a link to the project webpage or connected wiki page) Fill in each section: Please add links to your guides (and ones you find interesting). The Raspberry Pi Forum has a list of Project Ideas & Links, to help people get started. This page contains a set of guides to show readers how to do common or useful tasks on the system. These guides focus on system-related items such as how to install a linux option or configure an on-board device. Items listed here should achieve a goal as simply as possible, with the aim to build the confidence of the reader. For anything more complex, the item should be listed on the projects page. Introduction Games - all kinds of computer games. Community - links to the community elsewhere on the web. Education - a place to share your group's project and find useful learning sites. Datasheets", "textAfterTable": "Guide Description Tags Author Status Network Attached Storage Network Attached Storage - Basic concept: A place to save copies of all your important files Samba bredman - Open Project Tested on Debian, some help needed with Fedora chapter Connect your RPi to your MS Windows machines The guide above is a full NAS setup - This guide/script just configures and installs a very simple setup to allow you to read/write to your RPi files Samba Simon Walters - Open Project Tested on Raspbian Python 3 on Debian Installing the latest Python 3 and common modules on Debian. Python croston Tested. Needs more modules adding Installing Java 8 Installing Java 8 on Raspberry Pi. Java 8", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}