{"relation": [["ISBN", "PAPERBACK", "0-590-46226-1", "0-590-46228-8", "0-590-25518-5"], ["Title", "", "Back to the Titanic!", "Back to the Day Lincoln Was Shot", "First Ladies: Women Who Called the White House Home"], ["Level", "", "Grades 3-7", "Grades 3-7", "Grades 3-7"], ["Retail Price", "", "$4.50", "$4.5", "$6.99"]], "pageTitle": "Beatrice Gormley Author Visit Kit | Scholastic.com", "title": "", "url": "http://www2.scholastic.com/teachers/visitkit/beatrice-gormley-author-visit-kit", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00329-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 854235423, "recordOffset": 854212925, "tableOrientation": "HORIZONTAL", "lastModified": "Sat, 01 Aug 2015 01:35:26 +0000", "textBeforeTable": "Author's home: Westport, MA (South Coast) Suggested audience: 3–6 grades Maximum number of presentations per day: 4 Honorarium: $900.00 per day plus expenses Beatrice Gormley is the author of many novels and biographies, for middle-grade readers. Her warm, lively presentation to school groups tells the story of how she became a writer. Along the way, she excites the children's interest in writing and reading, expands their knowledge about book writing and publishing, demonstrates effective storytelling, and illustrates reaching a goal through persistence. In the question and answer session, Beatrice guides the discussion to connect with the children's own struggles and joys in writing, to emphasize working hard to write well, and to show research methods. wse/article.jsp?id=3754247\" target=\"_blank\">How to plan an author visit Beatrice Gormley's biography US NY Ossining Current Home US CA Glendale Born", "textAfterTable": "Scholastic School to Home Reading Club (Book Clubs) Book Fairs Teacher Resources Book Lists Book Wizard Instructor Magazine Lesson Plans New Books New Teachers Scholastic News Online Strategies and Ideas Student Activities Daily Teacher Blogs Videos Whiteboard Resources", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}