{"relation": [["Author", "ozwalled", "ozwalled", "ozwalled", "ozwalled", "ozwalled"], ["Title", "Luuuvwaka", "Lucky Seven", "Lucas vs. Hade Hebi", "Lucas and Claus", "Lost Underword Encounter"], ["Description", "Lovewalker.", "Mighty Bear Seven", "I forget the entire story behind this, but basically it's based on ideas and small tidbits of information gleaned from old Mother 3 (Nintendo 64 version) teaser images and articles. There's some image that's forest or jungle-like that showed a snake-like thing, and there was text somewhere I read about some snake boss creature called Hade Hebi, so that's where that part of things comes from. As for Lucas's gaudy outfit, that's something I sort of made based on one of the old screenshots as well. SOURCES: http://starmen.net/eb64/images/scans/npscan2.png (contains \"Lucas\" in that outfit as well as what I figured may be Hade Hebi. http://starmen.net/eb64/images/characters/lucas.jpg (The Lucas Outfit)", "Submission for the Envelope Art part of the 2007 EB Siege.", "The Chosen Four face -to-face with a Chompasaur!"], ["Date", "6/10/10", "1/15/06", "4/12/09", "8/27/07", "9/21/06"], ["Rank", "0.00", "0.00", "0.00", "8.00", "8.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=22108&stuff=TitleDESC&stuffFirstLetter=L", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00003-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 227625158, "recordOffset": 227616956, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> Z Y W V U T S R Q P O N M L K J I H G F E D C B A < Other Submissions by ozwalled Made with Creature Editor 3.0, a piece of software that was made before the Spore Creature Creator was released, as a 2D mock-up of it. This image has been resized for your convenience. Click on it to view the full size version. Mr. Saturn and Starman Mr.", "textAfterTable": "1 2 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day. Activities:", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}