{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", ""], ["Name", "The Hurt Locker", "Goodnight Bastard", "The Long Walk", "Hostile", "B Company", "Man In the Green Bomb Suit", "There Will Be Bombs", "Body Bomb", "Bleeding Deacon", "Oil Tanker Aftermath", "A Guest In My House", "The Way I Am", "BookletDigital Booklet - The Hurt Locker"], ["Artist", "Marco Beltrami & Buck Sanders", "Marco Beltrami & Buck Sanders", "Marco Beltrami & Buck Sanders", "Marco Beltrami & Buck Sanders", "Marco Beltrami & Buck Sanders", "Marco Beltrami & Buck Sanders", "Marco Beltrami & Buck Sanders", "Marco Beltrami & Buck Sanders", "Marco Beltrami & Buck Sanders", "Marco Beltrami & Buck Sanders", "Marco Beltrami & Buck Sanders", "Marco Beltrami & Buck Sanders", "Buck Sanders & Marco Beltrami"], ["Time", "1:52", "4:09", "1:43", "3:25", "2:29", "2:03", "2:27", "2:34", "1:16", "3:32", "3:08", "2:29", "--"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "Album Only"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - The Hurt Locker (Original Motion Picture Soundtrack) by Buck Sanders & Marco Beltrami", "title": "", "url": "https://itunes.apple.com/us/album/the-hurt-locker-original-motion/id346678534?siteID=KcYgFL4xzJU&name=trailers&ign-mpt=uo%3D4", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00067-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 893686215, "recordOffset": 893657390, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{25919=The Hurt Locker was the David vs. Goliath story of the 2010 Academy Awards, a modestly budgeted independent examination of the Iraq war’s impact on a close-knit bomb disposal squad that eventually captured six Oscars. Though nominated for their musical contributions to the film, composers Buck Sanders and Marco Beltrami could argue they deserve a share of the sound awards as well — so closely is their eerie, synthetic/organic fusion score interwoven with the film’s overall sound design. At the core of their ethereal, disquieting soundtrack are instrumental performances by the composers themselves (Beltrami on significantly altered piano, Sanders on ghostly, wafting guitar), augmented by a dozen skilled session soloists operating in a studio environ where experimentalism was freely encouraged. The resulting musical score contains but the barest traces of traditional themes and musical motifs, wed to fleeting wisps of Middle Eastern modalities in a digitally manipulated soundscape that’s responsible not so much for the film’s sense of time and place as it’s impressionistic, oft-unsettling emotional core., 132188=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 05:14:26 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Buck Sanders & Marco Beltrami The Hurt Locker (Original Motion Picture Soundtrack) iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from The Hurt Locker (Original Motion Picture Soundtrack) by Buck Sanders & Marco Beltrami, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't", "textAfterTable": "13 Items Editors’ Notes The Hurt Locker was the David vs. Goliath story of the 2010 Academy Awards, a modestly budgeted independent examination of the Iraq war’s impact on a close-knit bomb disposal squad that eventually captured six Oscars. Though nominated for their musical contributions to the film, composers Buck Sanders and Marco Beltrami could argue they deserve a share of the sound awards as well — so closely is their eerie, synthetic/organic fusion score interwoven with the film’s overall sound design. At the core of their ethereal, disquieting soundtrack are instrumental performances by the composers themselves (Beltrami on significantly altered piano, Sanders on ghostly, wafting guitar), augmented by a dozen skilled session soloists operating in a studio environ where experimentalism was freely encouraged. The resulting musical score contains but the barest traces of traditional themes and musical motifs, wed to fleeting wisps of Middle Eastern modalities in a digitally manipulated soundscape that’s responsible not so much for the film’s sense of time and place as it’s impressionistic, oft-unsettling emotional core. Customer Reviews Too much \"ambience\" and not enough music.           by filmscoremaniac", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}