{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17"], ["Name", "Leonardo Da Vinci (7” Version)", "Kill The Beast", "History Part 1 (Norwood Version)", "Prove It", "Come Back To The Living (Demo)", "Undone (Demo)", "The Twister (Blueprint)", "7 Hours / Remembrances (Demo)", "Better On The Hard Side (Demo)", "The Lady Lies There", "The Price Of Love (Hoxton Square Version)", "See It Goes (Parson’s Green Version)", "Lap Of The Gods", "Waiting For You", "Only Moments Away", "She’s Going Down", "Where It All Comes Down"], ["Artist", "The Lucy Show", "The Lucy Show", "The Lucy Show", "The Lucy Show", "The Lucy Show", "The Lucy Show", "The Lucy Show", "The Lucy Show", "The Lucy Show", "The Lucy Show", "The Lucy Show", "The Lucy Show", "The Lucy Show", "The Lucy Show", "The Lucy Show", "The Lucy Show", "The Lucy Show"], ["Time", "3:38", "3:41", "4:22", "4:45", "3:54", "4:32", "3:55", "4:46", "6:38", "4:07", "4:47", "4:50", "3:25", "3:41", "2:40", "4:10", "3:50"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Remembrances by The Lucy Show", "title": "", "url": "https://itunes.apple.com/us/album/leonardo-da-vinci-7-version/id482499816?i=482499817", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00044-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 868240683, "recordOffset": 868216166, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{126246=Copyright © 2014 Apple Inc. All rights reserved., 32090=The complement to Words on Music's reissue of the band's two full-lengths, Remembrances scoops up a slew of singles, rarities, and demos. It's a classic patchwork compilation that features plenty of missteps, but what works shows off the band's passionately dreamy post-punk nicely enough. The opening \"Leonardo da Vinci\" is definitely in Big Music territory with all the echo and aim at grandeur, almost laughably so. But by the time of their demo version of \"History Part 1,\" a purring keyboard part and heavy drumming helping back vocals nodding less to Bono and much more to Robert Smith, things start to take a clearer and more enjoyable shape. Various solo or duet demos abound, such as Mark Bandola's \"Come Back to the Living\" and \"The Twister,\" as well as snippets of bedroom recordings among a bulk of tracks from the band's own basement rehearsal studio. They generally favor keyboards and the rhythm section in practice, turning the songs into something almost approaching what would later be called minimal wave given the basic demo recording quality. One early song, \"Kill the Beast,\" features guitarist Peter Barraclough's sole released lead vocal, a reasonably restrained breathlessness, while his demo for \"The Lady Lies There\" starts off serenely before becoming a frenetic clip of late-'70s synth hyperactivity backing his singing. The collection concludes with two 1993 cuts from a planned reunion EP of sorts — it's not quite grunge or shoegaze but it's interesting to hear a rougher guitar tone at work on \"She's Going Down\" alternately with a bit of dreaminess.}", "lastModified": "Fri, 31 Jul 2015 09:09:31 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist The Lucy Show Remembrances iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Remembrances by The Lucy Show, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "17 Songs Album Review The complement to Words on Music's reissue of the band's two full-lengths, Remembrances scoops up a slew of singles, rarities, and demos. It's a classic patchwork compilation that features plenty of missteps, but what works shows off the band's passionately dreamy post-punk nicely enough. The opening \"Leonardo da Vinci\" is definitely in Big Music territory with all the echo and aim at grandeur, almost laughably so. But by the time of their demo version of \"History Part 1,\" a purring keyboard part and heavy drumming helping back vocals nodding less to Bono and much more to Robert Smith, things start to take a clearer and more enjoyable shape. Various solo or duet demos abound, such as Mark Bandola's \"Come Back to the Living\" and \"The Twister,\" as well as snippets of bedroom recordings among a bulk of tracks from the band's own basement rehearsal studio. They generally favor keyboards and the rhythm section in practice, turning the songs into something almost approaching what would later be called minimal wave given the basic demo recording quality. One early song, \"Kill the Beast,\" features guitarist Peter Barraclough's sole released lead vocal, a reasonably restrained breathlessness, while his demo for \"The Lady Lies There\" starts off serenely before becoming a frenetic clip of late-'70s synth hyperactivity backing his singing.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}