{"relation": [["Title", "Letters from St Petersburg", "Speak, Memory", "Russian Winter", "Gorky Park", "Natasha's Dance: A Cultural History of Russia", "A People's Tragedy: The Russian Revolution", "The Brothers Karamazov"], ["Author", "Victoria Hammond", "Vladimir Nabokov", "Daphne Kalotay", "Martin Cruz Smith", "Orlando Figes", "Orlando Figes", "Fyodor Dostoevsky"]], "pageTitle": "Russia | Intrepid Travel", "title": "", "url": "http://www.intrepidtravel.com/Russia/culture-geography-history-show-me", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00213-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 514289523, "recordOffset": 514229281, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{86886=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 85567=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 186979=Review submitted 25 Jul 2015}", "TableContextTimeStampAfterTable": "{61071=The open plains stretching across Siberia in the east through to the Arctic in the north determine the Russian climate. Moscow and its milder cousin St Petersburg are prone to temperatures below 0°C (30°F) from November through to March, with few daylight hours and snow. One of the best times to visit Russia is in June, July and August, which are the warmest months (these months are also the wettest so be prepared for a little rain). June is also one of the best times to head north and see the incredible 'White Nights'. Being such a large country, one of Russia’s great joys is its diversity of climatic conditions - poor weather in one location doesn’t necessarily mean poor weather for the entire country.}", "textBeforeTable": "Recommended reading Further reading To learn more or donate, go to: www.theintrepidfoundation.org This Russian NGO helps the homeless people of St Petersburg with a night bus service that provides mobile care to this disadvantaged and marginalised population group. Tea, coffee, food, blankets, health care, warm clothing and links to social services help to alleviate the social disconnection and poverty these people face daily. Image supplied by Nochlezhka. Nochlezhka In Russia, The Intrepid Foundation proudly supports: The Intrepid Foundation provides travellers with an opportunity to give something back to the many wonderful communities we travel to. By donating to The Intrepid Foundation you can make a difference in local communities - in health care, education, human rights, child welfare and the protection of wildlife and the environment. The Intrepid Foundation 8. Please refrain from drinking alcohol in public or on trains. 7. Please ask and receive permission before taking photos of people, including children. 6. Refrain from supporting businesses that exploit or abuse endangered animals. 5. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 4. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 3. Always dispose of litter thoughtfully, including cigarette butts.", "textAfterTable": "Handy links www.lonelyplanet.com/worldguide/russia www.wikitravel.org/en/russia www.worldtravelguide.net/russia www.talkrussian.com/phrases.htm × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}