{"relation": [["Title", "Volume 1: Sidekicks", "Volume 2: Family Matters", "Young Avengers", "Young Avengers Ultimate Collection", "Civil War: Young Avengers & Runaways", "Young Avengers Presents", "Secret Invasion: Runaways/Young Avengers", "Dark Reign: Young Avengers", "Siege: Battlefield", "Avengers: The Children's Crusade", "Young Avengers Vol. 1: Style > Substance", "Young Avengers Vol. 2: Alternative Cultures", "Young Avengers Vol. 3: Mic-Drop at the Edge of Time and Space"], ["Material collected", "Young Avengers #1-6", "Young Avengers #7-12; Young Avengers Special", "Young Avengers #1-12; Young Avengers Special", "Young Avengers #1-12; Young Avengers Special", "Civil War: Young Avengers & Runaways #1-4", "Young Avengers Presents #1-6", "Secret Invasion: Runaways/Young Avengers #1-3", "Dark Reign: Young Avengers #1-5", "Siege: Young Avengers; et al", "Uncanny X-Men #526 (B-Story); Avengers: The Children's Crusade #1-9; Avengers: The Children's Crusade - Young Avengers #1", "Young Avengers Vol. 2 #1-5, Marvel Now! Point One #1 (Young Avengers story)", "Young Avengers Vol. 2 #6-10", "Young Avengers Vol. 2 #11-15"], ["Publication date", "February 2006 May 2006", "November 2006 May 2007", "February 2008", "July 2010", "May 2007", "October 2008", "March 2009", "January 2010", "August 2010 December 2010", "March 2012", "September 2013", "February 2014", "April 2014"], ["ISBN", "HC: 0-7851-1470-X SC: 0-7851-2018-1", "HC: 0-7851-2021-1 SC: 0-7851-1754-7", "HC: 0-7851-3033-0", "978-0785149071", "0-7851-2317-2", "0-7851-2975-8", "0-7851-3266-X", "0-7851-3909-5", "HC: 978-0-7851-4598-1 SC: 978-0-7851-4766-4", "978-0785136385", "978-0785167082", "978-0785167099", "978-0785185307"]], "pageTitle": "Young Avengers - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/Young_Avengers", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00340-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 860285551, "recordOffset": 860253894, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{30490=The Young Avengers appear in the 2010–2012 miniseries, Avengers: The Children's Crusade, written by Allan Heinberg and illustrated by Jim Cheung.[14] In the series, Magneto learned that the Young Avengers were going to search for the still missing Scarlet Witch, and that Wiccan and Speed may be the reincarnations of Wanda's children. Magneto meets them, stating that he wants Wiccan and Speed to finally know him as their grandfather, and helps them find Wanda.[15][16], 53376=In 2008, a story titled \"What If the Runaways Became the Young Avengers?\" ran as a back-up story through five What If? issues.[27] The feature illustrates what would have happened if Iron Lad never found out about the Avengers Fail-Safe Program. Instead, he recruits the Runaways, forcing them to be an actual superhero team with costumes. Although it is later revealed that the Iron Lad that brought them together was actually Victor Mancha—Iron Lad ran into Victor's future self when attempting to flee to the Avengers' era, with Victorious travelling back with him and using Victor to hi-jack his equipment—Kang's attempt to rescue his younger self results in Iron Lad being killed and Kang being erased from history while Victor destroys his future self and departs via Kang's time-belt to find his own way, leaving the Runaways to continue as Young Avengers with Chase now using parts of the Iron Lad armor. It was written by C.B. Cebulski, and drawn by Patrick \"Spaz\" Spaziante.[28], 24199=In the 2008 miniseries Secret Invasion: Runaways/Young Avengers, the Young Avengers again teamed with the Runaways in a Secret Invasion tie-in.[5] The Young Avengers are the first to respond to the Skrull invasion in Manhattan, New York. They are quickly defeated, though Xavin manages to rescue Hulkling. The leaders of the Skrull invasion intend to assassinate Hulking, for fear that his identity as Dorrek VIII would diminish their authority. During the confrontation between the Young Avengers, Runaways, and the invading Skrulls, Xavin is forced to confront her former mentor, Commander Chrell, reluctantly killing him to save the Young Avengers and Runaways.[6], 21000=In the 2008 miniseries Young Avengers Presents, Patriot discovers that Bucky had visited his grandfather Isaiah Bradley. After tracking him down, Patriot shares his concerns losing faith in the country. Bucky explains to Eli that America is an idea used for good or ill, but one with value to it and something worth defending against all threat, inspiring the younger hero once more.[2] Hulkling meets Mar-Vell, telling him that he is his son, much to Mar-Vell's shock. While Captain Mar-Vell is proud of his son, he confesses that he will not be able to stay forever, as the survival of the time stream depends on him eventually returning to the past and dying from cancer. This Captain Marvel eventually turned out to be a Skrull sleeper agent in place for the \"Secret Invasion\".[3] Wiccan and Speed begin searching for the Scarlet Witch, whom they believe to be their mother. Upon searching the former home of the Scarlet Witch and Vision in Leonia, NJ; they encounter Master Pandemonium, who advises them to end their search and embrace their present lives. Vision tells Cassie that after \"Civil War\", he traveled around the world posing as different people, living many different lives, ultimately culminating in a better understanding of who he is. He asserts that he is his own person, not the memories of Iron Lad, confessing his love to Cassie, and states that he wishes to now be called Jonas. Cassie demonstrates that she is unsure but is willing to reciprocate his feelings.[4] During the story, Cassie is also stricken with guilt after accidentally injuring her stepfather while stopping a villain, forcing her to come to terms with the responsibilities that come with her powers and with being part of the Young Avengers and the Initiative, much as her stepfather also understands the risks of life as a policeman. Hawkeye feels uncomfortable about her growing relationship with Patriot, and encounters Clint Barton, the original Hawkeye, who helps her reaffirm her position as Hawkeye and Young Avengers co-leader., 11068=Young Avengers follows the events of the 2004–2005 \"Avengers Disassembled\" storyline. The four founding members of the team were gathered together as a result of the Vision's plan for the reformation of the Avengers in the event the team disbanded. In the series, newspapers refer to the young heroes as \"super-powered fanboys\" and label them the \"Young Avengers,\" a name the team members initially disliked but which stuck nonetheless., 6594=The original series won the 2006 GLAAD Media Award for Outstanding Comic Book and the 2006 Harvey Award for Best New Series. The second volume by Kieron Gillen also received the award for Outstanding Comic Book at the 25th GLAAD Media Awards in 2014., 5184=The Young Avengers is a fictional Marvel Comics superhero team, appearing in comic books published by Marvel Comics. The team, created by Allan Heinberg and Jim Cheung, features numerous adolescent characters who typically have connections to established members of Marvel's primary superhero team, the Avengers. The Young Avengers originally featured in a twelve issue run, later appearing in several notable Marvel crossover series, including the Civil War and The Children's Crusade events, before the series was relaunched in January 2013 as part of the Marvel NOW! rebranding by writer Kieron Gillen and artist Jamie McKelvie., 25836=The 2009 Dark Reign: Young Avengers limited series written by Paul Cornell,[7][8] and Mark Brooks,[9] introduces a new group of powered teens calling themselves the Young Avengers.[10] They join forces with the genuine Young Avengers to battle Norman Osborn's Dark Avengers. The New Young Avengers consist of Enchantress, Executioner, Coat of Arms, Egghead, Big Zero and team leader Melter., 39010=A new Young Avengers series, written by Kieron Gillen and drawn by Jamie McKelvie, was launched in January 2013 as part of the Marvel NOW! rebranding campaign.[26] The new monthly series reintroduces existing Young Avengers, Wiccan, Hulkling and Hawkeye, as well as introducing Kid Loki, Marvel Boy and Miss America to the book's cast. The series' sixth issue included the reintroduction of former Young Avenger, Speed, and the addition of depowered mutant Prodigy to the group. Over the course of the series, Wiccan and Hulkling reaffirm their commitment to one another after Hulkling faces an existential crisis; Wiccan discovers that he will one day become the all-powerful Demiurge; Prodigy comes out as bisexual, and develops a crush on Hulkling; Kate and Noh-Varr become a couple, and then later break up after Noh-Varr realises he doesn't feel as strongly for Kate as he does for his ex, Oubliette; and Miss America is revealed to be from a paradise dimension created by the Demiurge (Wiccan). In the latter half of the series, Kid Loki believes he is engaged in a battle of wits with against his ex, Leah. However, he later uncovers that this 'Leah' is in fact a projection of his own guilty conscience, which wants to restore Loki to his true self. After tricking Wiccan into transforming him to a more mature form—that of a late teenager or young adult—he departs the group, choosing to do so before they can forgive him for manipulating and betraying them. Throughout the story, the group are also haunted by a powerful character dressed as Patriot, who captures Tommy. In the concluding issue of the series, Prodigy rightly surmises that this Patriot is a member of the team who has been transformed into a non-human in some future magical event, and is now echoing backwards along the timeline in order to ensure this future comes to pass. Guessing this person may well be himself, he kisses the Patriot, causing the Patriot to vanish and Tommy to reappear. Volume 2 came to an end with issue #15, as Gillen and McKelvie wrapped up their story and wanted to pursue other collaborations., 7205=Marvel's 1940s forerunner, Timely Comics, had an unrelated character, Young Avenger, who debuted in USA Comics #1 (Aug. 1941).[1]}", "lastModified": "Tue, 21 Jul 2015 16:28:32 GMT", "textBeforeTable": "The stories have been collected into a number of volumes: Collected editions[edit] The series also won the 2006 Harvey Award for Best New Series.[30] In 2006 and 2014, Young Avengers won GLAAD Media Awards for Outstanding Comic Book.[29] Awards[edit] In 2008, a story titled \"What If the Runaways Became the Young Avengers?\" ran as a back-up story through five What If? issues.[27] The feature illustrates what would have happened if Iron Lad never found out about the Avengers Fail-Safe Program. Instead, he recruits the Runaways, forcing them to be an actual superhero team with costumes. Although it is later revealed that the Iron Lad that brought them together was actually Victor Mancha—Iron Lad ran into Victor's future self when attempting to flee to the Avengers' era, with Victorious travelling back with him and using Victor to hi-jack his equipment—Kang's attempt to rescue his younger self results in Iron Lad being killed and Kang being erased from history while Victor destroys his future self and departs via Kang's time-belt to find his own way, leaving the Runaways to continue as Young Avengers with Chase now using parts of the Iron Lad armor.", "textAfterTable": "References[edit] ^ \"USA Comics #1\". Grand Comics Database. Retrieved 2010-12-28.  ^ a b Young Avengers Presents #1 ^ Young Avengers Presents #2 ^ \"Vision Quest: Cornell talks Young Avengers Presents\". Comic Book Resources. April 23, 2008.  ^ George, Richard (March 13, 2008). \"Exclusive Secret Invasion: Runaways/Young Avengers Interview\". IGN. Retrieved 2008-03-16.  ^ Bendis, Brian Michael (w), Yu, Leinil (a). Secret Invasion 1-3 (April–May 2008), Marvel Comics ^ \"NYCC: Cornell talks Dark Reign: Young Avengers\". Comic Book Resources. February 7, 2009.  ^ \"NYCC '09 - Paul Cornell on Dark Reign: Young Avengers\". Newsarama. February 7, 2009.  ^ \"Mark Brooks: Designing the Young Masters\". Newsarama. February 20, 2009.  ^ Stevens, Tim (February 6, 2009).", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}