{"relation": [["Artist", "Jethro Tull", "Styx"], ["Song Title", "Locomotive Breath", "Man in the Wilderness"], ["Played When", "Season 8 recap", "Dean rides to Clayton, LA"]], "pageTitle": "Supernatural Season 8 Episode 1 - We Need to Talk About Kevin (8x1) - Watch Online - s8 e1 Spoilers", "title": "", "url": "http://www.tvrage.com/Supernatural/episodes/1065195189?vote=2", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00169-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 796351956, "recordOffset": 796336005, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Music Read the full recap One Year Later.. Recap Dean Winchester As Jensen Ackles Sam Winchester As Jared Padalecki Main Cast Will As Tom Stevens (1) TBD As Locky Nolan Will's Wife As Raphael Kepinski Roberta As Melissa Dionisio TBD As Erin Lacourciere Channing's Roommate As", "textAfterTable": "Episode Quotes Sam: Maybe we should split up, ask around, see if anyone's seen him. Dean: Yeah. Asian kid, yay high, at a university. That should be easy. Crowley: Dean. Looking... well, let's just say Purgatory didn't do you any favors. Where's your angel? Dean: Ask your mother. Crowley: There's that grade-school zip. Missed it. I really did. Crowley: Chin up, gentleman. I'm a professional. Dean: This ain't over by a long shot, Crowley. Crowley: Really, Dean, who writes your stuff? A marshmallow? Sam: Kevin? How you holding up? Kevin Tran: Awesome. The King of Hell just snapped my girlfriend's neck. How 'bout you? Cultural References Dean: So you dropped your peanut butter in her chocolate. Reese's Peanut Butter cups featured a series of ads where two people, one holding peanut butter and one holding chocolate, would bump into each other and mix their food. The result was Reese's Peanut Butter Cups, \"two great tastes that taste great together.\" Dean: Thirty-one flavors", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}