{"relation": [["Title", "Another Quiet American: Stories of Life in Laos", "Coroner's Lunch", "The Karaoke World of Cortous Haire", "Ant Egg Soup", "A Short History of Laos: The Land in Between"], ["Author", "Brett Dakin", "Colin Cotterill", "Bjorn Turmann", "Natacha Du Pont De Bie", "Grant Evans"]], "pageTitle": "Laos Tours & Travel | Intrepid Travel CA", "title": "", "url": "http://www.intrepidtravel.com/ca/laos", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00055-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 513753387, "recordOffset": 513694807, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{86046=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 87365=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 187824=Review submitted 25 Jul 2015}", "TableContextTimeStampAfterTable": "{55798=Laos is a great place to visit at any time of the year as the weather doesn't vary much – it’s always hot and humid! The coolest time to visit is from November to January. This is also the driest time, and the main festival period, so it’s an interesting time to travel through Laos. The wet season runs from June to October. It rains frequently during this time, temperatures average over 30 degrees Celsius and although some roads may be closed due to flooding, it is a great time for river travel. February to May is drier but hot, with temperatures climbing to 40 degrees Celsius., 66215=Laos was controlled by Japanese forces during World War II, was declared an independent state in 1950 and gained full independence as a constitutional monarchy in 1954. The 1960s proved to be a devastating time for the people of Laos, with their nation gaining the dubious honour of being the most bombed country in the world. The United States bombed Laos extensively in an attempt to eradicate North Vietnamese sanctuaries, and sadly contemporary Laos is still dealing with huge amounts of unexploded ordnance (UXO) that is littered throughout the countryside. A coalition government was set up in 1962, but in 1975 Laos became a Communist state when the king gave up his throne in favour of a president and prime minister being instated. During the late 1970s, many people of Laos fled to neighbouring countries as refugees, as trade embargoes from foreign nations led to widespread poverty and disadvantage. By the 1990s, Laos had become a full member of ASEAN and foreign nations had lifted their trade embargoes, which allowed free enterprise to grow.}", "textBeforeTable": "Recommended reading Further reading To learn more or donate, go to: www.theintrepidfoundation.org This organisation was created to reduce the number of casualties caused by unexploded ordinance (UXO) that still lies on much of Laos’ land. By raising community awareness, training locals, surveying and clearing land, this group is working towards savings lives and building a safer future for the people of Laos. Image supplied by UXO Lao. UXO Lao This vital project assists underprivileged children and young people to return to school, find employment and cultivate a better future with counselling, workshop sessions, education and emergency accommodation. Image supplied by Peuan Mit. Peuan Mit Street Children Project This worthy organisation provides essential services to people with disabilities. Laos has many victims of landmines living with life-changing disabilities acquired from stepping on unexploded ordinance (UXO). Providing rehabilitation, orthotics and prosthetics, the visitor centre also educates and enlightens visitors on the impact of UXO on the people of Laos. Image supplied by Jo Pererira. COPE (Cooperative Orthotic Prosthetic Enterprise)", "textAfterTable": "Handy links www.lonelyplanet.com/laos www.worldtravelguide.net/laos www.ecotourismlaos.com × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea,", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}