{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "CleanHey Ma", "ExplicitIntro (Cam'ron / Come Home With Me)", "ExplicitLosing Weight Part 2", "ExplicitOh Boy", "ExplicitCome Home With Me", "ExplicitOn Fire Tonight", "ExplicitStop Calling", "ExplicitDead or Alive", "ExplicitThe Roc (Just Fire)", "ExplicitBoy Boy"], ["Album", "Come Home With Me", "Come Home With Me", "Come Home With Me", "Come Home With Me", "Come Home With Me", "Come Home With Me", "Come Home With Me", "Come Home With Me", "Come Home With Me", "Come Home With Me"], ["Time", "3:40", "2:44", "6:06", "3:24", "5:01", "5:40", "6:06", "4:07", "4:24", "4:43"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "1,29 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Come Home With Me by Cam'ron", "title": "", "url": "https://itunes.apple.com/lv/album/the-roc-just-fire/id13477541?i=13602602", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00268-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 878955119, "recordOffset": 878926549, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{127612=Autortiesības © 2014 Apple Inc. Visas tiesības aizsargātas., 28962=Just when seemed as if everyone had forgotten about Cam'ron, he returned in 2002 as part of Jay-Z's industry-dominating Roc-a-Fella collective. If that wasn't reason enough to inspire curiosity, Cam'ron's lead single, \"Oh Boy,\" blew up urban radio all summer. His rugged rapping and Just Blaze's soulful production made \"Oh Boy\" the huge success that it was, yet the joy of hearing Cam'ron on the radio again also had a bit to do with the revival. The Harlem rapper had fallen off the map after S.D.E., his poorly received album from two years earlier. Just two years before that, Cam'ron was one of the industry's most promising pop-rappers. His first album, Confessions of Fire, produced several singles, including his collaboration with Mase, \"Horse & Carriage.\" However, 1998 felt like the distant past in 2002, and Cam'ron needed a big comeback after falling into obscurity during the interim. Come Home With Me is indeed that big comeback. Even though members of the Roc-a-Fella roster appear on only two songs — \"Welcome to New York City,\" featuring Jay-Z, and \"The Roc (Just Fire),\" featuring Memphis Bleek and Beanie Sigel — Cam'ron doesn't really need the assistance here. He comes hard on most tracks, yet his muscle is complemented well by producer Just Blaze and his trademark sampling style. Just Blaze doesn't produce every track on this album, but he does provide the key moments: \"Oh Boy\" and \"The Roc (Just Fire).\" Overall, Cam'ron couldn't return with a stronger comeback album than this: he's affiliated with one of the industry's most successful labels, graced with a hot producer, and armed with a dynamite lead single., 30798=Born: 04 February 1976 in Harlem, New York, NY}", "lastModified": "Sat, 01 Aug 2015 05:20:33 GMT", "textBeforeTable": "View In iTunes Confessions of Fire 5. View In iTunes Killa Season 4. View In iTunes Killa Season 3. View In iTunes Purple Haze 2.", "textAfterTable": "Listeners Also Bought Biz's Baddest Beats: The Best of Biz Markie Biz Markie View In iTunes Money In the Bank - EP (feat. Young Buck) Lil' Scrappy featuring Young Buck View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}