{"relation": [["Artist", "Decibel", "Decibel", "Decibel", "Decibel", "Decibel", "Decibel", "José Fors y Carlos Esege", "Aristeo", "Vía Láctea", "Vía Láctea", "Arturo Meza", "Vía Láctea", "Vía Láctea", "Vía Láctea"], ["Title", "El Fin de los Dodos", "Manatí", "El Poeta del Ruido", "Espejismo", "El Titosco", "Terapia de Faquirato", "Duda Mata", "Monumento a la Razón", "La Estructura del Universo", "El Jardín de la Presencia Divina", "Retorno de las Almas Atrapadas en la Región de los Kliphos", "Via Lumiere", "Meditación Post Atómica", "La Alondra y la Virgen"], ["Album", "El Poeta del Ruido", "El Poeta del Ruido", "El Poeta del Ruido", "El Poeta del Ruido", "El Poeta del Ruido", "El Poeta del Ruido", "Duda Mata", "Monumento a la Razón", "Vía Láctea", "Vía Láctea", "Suite Koradí", "Vía Láctea", "Vía Láctea", "Vía Láctea"], ["Label", "Orfeón", "Orfeón", "Orfeón", "Orfeón", "Orfeón", "Orfeón", "", "Private", "Momia", "Momia", "Gente de México", "Momia", "Momia", "Momia"]], "pageTitle": "A Different Nature | KBOO", "title": "", "url": "http://kboo.org/ADifferentNature?page=0%2C16%2C0%2C0%2C20", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00138-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 134712687, "recordOffset": 134675279, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{70882=On Dec. 20th, A Different Nature presents three radio plays by Andreas Ammer and F.M. Einheit (from Einstürzende Neubauten, Gry and his own solo work)., 102366=A Different Nature was founded in the late Seventies by Richard Francis, who fearlessly championed new music and the unheard Avant Garde. His programs went into exhaustive detail on individual artists, labels and musical disciplines. He also spearheaded many important events on the air, such as the 2001 and 2008 Dada and Surrealism festivals that dominated the airwaves for days on end and involved many in the local avant garde community as well as many KBOO programmers. Richard passed away in 2009 but it's our hope to carry on with his mission of introducing listeners to unheard new music as a collective of his collaborators and listeners. Long live Papa Dada!, 2983=Please contact Mindy Johnston to secure a spot in the class by June 25th. Space is limited., 30766=This time on A Different Nature, we delve into the program's past, and play gems from founder Richard Francis' own record collection.  It's KBOO's spring membership drive, so A Different Nature listeners will have the opportunity to pledge their support for the station during the program. We have special thank-you gifts to offer new or renewing members: copies of the CD \"Hendrix Uncovered: New Music Inspired by Jimi Hendrix\", donated by March Music Moderne & Bob Priest., 7385=playlist for A Different Nature, Monday, May 24, 2010 subject: New Music for Gamelan host: Andy Hosch Gamelan Son of Lion, \"Pemangku\" [8:12] (composer : Nick Brooke) Gamelan Son of Lion, \"Pitu Ping Pitu\" [5:24] (composer : Mark Steven Brooks) Gamelan Son of Lion, \"PINs\" [6:20] (composer : David Demnitz) from CD: Gamelan Son of Lion, Bending the Gending, GSOL 3, 2002 Gamelan Son of Lion is based in New York City www.gamelansonoflion.org/ Gamelan Pacifca, \"Small of My Back\" [10:40] (composers : Signy Jakobsdottir, Jon Keliehor, Tom Fallat & Jarrad Powell) Gamelan Pacifca, \"Rain\" [10:49] (composer : Jeff Morris) from CD: Gamelan Pacifica, Trance Gong, What Next? 16, 1994 Gamelan Pacifica is based in Seattle www.gamelanpacifica.org/ Gamelan Sekar Jaya, \"Kekembangan\" [15:31] (composer : Evan Ziporyn) Gamelan Sekar Jaya, \"Khayalan Tiga\" [16:37] (composer : Wayne Vitale) from CD: American Works for Balinese Gamelan, New World Records 80430, 1993 Gamelan Sekar Jaya is based in Oakland, CA www.gsj.org/ Ron George Tambellan ensemble, \"The Floating Bubble\" [20:23] (composer : Ron George) from CD: Ron George, The Floating Bubble, Innova 215, 2008 Ron George is based in Los Angeles, CA www.innova.mu/notes/215.htm Gamelan Madu Sari, \"Lessons of the Garden\" [11:21] (composer : Michael O'Neill) from CD: Gamelan Madu Sari, New Nectar, Songlines 2404, 2004 Gamelan Madu Sari is based in Vancouver, BC www.songlines.com/newnectarcontent.html Andrew Hosch, \"Shifting Winds, Shimmering Sand\" [22:52 -excerpt] music for virtual gamelan, unpublished - Portland, Oregon, 1992 www.timbuktunes.com/, 20522=ADN 9/17/2012 CAGE CENTENARY PROGRAM 3 / host: dj what the!@#%*! , 70693=From 1993, comes Ammer and Einheit's Radio Inferno, a realization of Dante's Inferno - a dizzying audio collage utilizing found music to set the scene of Virgil's descent through hell. Voices by Blixa Bargeld (also of Einstürzende Neubauten), Phil Minton and the late John Peel as 'The Radio'. Also with guitarwork by Caspar Brötzmann.}", "TableContextTimeStampAfterTable": "{86251=3.  Referent  by Scott Goodwin  24:00, 86070=2.  Planetary Sine Wave Organ by Derek Ecklund  30:30, 22686=Persian Electronic Music Yesterday & Today, 1966-2006, 18403=It \"Viaje\" are from Spain and Argentina; 1973. The rest are from Mexico from the early 1980's., 107540=Latest newsletter: May 2015, 67109=Recording of this show can be found at: http://laruletaradio.files.wordpress.com/2010/12/01-a-diffrent-nature-3_..., 115952=Copyright © 2012 KBOO Community Radio | Copyright Policy | Community Guidelines | Website Illustration & Design by: KMF ILLUSTRATION, 85901=1.  Air Objects by John Berendzen   24:30}", "lastModified": "Sat, 01 Aug 2015 03:31:10 +0000", "textBeforeTable": "05/10/2010 Air date:  A Different Nature Program name:  Eclectic Categories: A Different Nature playlist for 05/10/2010 Login or register to post comments mindykayj@yahoo.com   (503) 995-6502   Please contact Mindy Johnston to secure a spot in the class by June 25th. Space is limited.   Classes in the music building at Lewis and Clark college. $60 for four sessions Adult class: 1-2:30pm Children’s class (age 9-16): 10-11:30am Four Saturdays: July 3, 10, 17, 24 No music background necessary! Four week introduction class for children and adults who are interested in learning the traditional percussion music of Java, Indonesia.   Indonesian Gamelan Music Class www.gamelan.info/ And VSB music director Mindy Johnston is teaching some classes in gamelan this summer----------- fyi: here in Portland there as a Javanese style Gamelan based at Lewis & Clark College, Venerable", "textAfterTable": "Junko side B Sleeping Beauty Elevage de Poussiere Lexie Mountain Boys Sweet Potato tots Sacred Vacation Carpark Vocal solo material.. with almost no other instruments Login or register to post comments A Different Nature playlist for 05/03/2010 Program name:  A Different Nature Air date:  05/03/2010 Artist Title Album Label Richard Francis 131 - Across the Border ID Station IDs KBOO Ilhan Miramoglu Agony Electronic Music Turnabout Bulent Arel Stereo Electronic Music 1 Columbia Electronic Music Center Columbia Halim El Dahb Leiyla and the Poet Columbia Electronic Music Center Columbia Luciano Berio and Cathy Berberian Thema (Homaggio a Joyce) Electronic Music Turnabout Tod Dockstader Two Fragments from Apocalypse Apocalypse Owl John Cage Fontana Mix Electronic Music Turnabout Pierre Schaffer Objet Lies Musique Concrete Candide Edgard Varese Poeme Electronique Anthology of Noise and Electronic", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}