{"relation": [["", "1", "2", "3", "4", "5"], ["Name", "The Wind Speaks… (Press 1)", "1derful Beings", "Time Will Heal…", "Lisa Bonet", "Spacewayz!"], ["Artist", "Ras G & The Afrikan Space Program", "Ras G & The Afrikan Space Program", "Ras G & The Afrikan Space Program", "Ras G & The Afrikan Space Program", "Ras G & The Afrikan Space Program"], ["Time", "4:43", "2:11", "2:03", "3:00", "1:56"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Destination There EP by Ras G & The Afrikan Space Program", "title": "", "url": "https://itunes.apple.com/us/album/destination-there-ep/id445655243", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00213-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 875791491, "recordOffset": 875769443, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{64052=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 08:58:46 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Ras G & The Afrikan Space Program Destination There EP iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Destination There EP by Ras G & The Afrikan Space Program, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon", "textAfterTable": "5 Songs Biography Born: Los Angeles, CA Genre: Electronic Years Active: '00s, '10s A staple in the Los Angeles left-field scene as one of the founders of Poo-Bah Records and a member of the Brainfeeder Records clique, Ras G's innovative beatmaking falls into the same stony, psychedelic style of instrumental hip-hop as fellow L.A. DJ/producers Madlib and Flying Lotus. After releasing six EPs and four full albums (Beats of Mind, Ghetto Sci-Fi, I of the Cosmos, and Brotha from Anotha Planet) in the latter half of the 2000s, Ras G had a notable appearance in the 2010 Stones Throw documentary... Full Bio Top Albums and Songs by Ras G 1. Brotha from Anotha Planet View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}