{"relation": [["Title", "A Fine Balance", "Razor's Edge", "Life of Pi", "The God of Small Things", "Holy Cow", "Shantaram", "Gandhi, An Autobiography: The Story of My Experiments with Truth", "A Suitable Boy", "No Full Stops in India", "The Discovery of India"], ["Author", "Rohinton Mistry", "Somerset Maugham", "Yann Martel", "Arundhati Roy", "Sarah Macdonald", "Gregory David Roberts", "Mahatma Gandhi", "Vikram Seth", "Mark Tully", "Jawaharlal Nehru"]], "pageTitle": "India Tours & Travel | Intrepid Travel UK", "title": "", "url": "http://www.intrepidtravel.com/uk/india", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00050-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 520894127, "recordOffset": 520822110, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{188735=Review submitted 26 Jul 2015, 87600=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 86281=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o...}", "TableContextTimeStampAfterTable": "{103479=The landmark results are in for March. Whose scene reigns supreme? You'll have to read to find out., 156730=India has been inhabited by humans for as long as 75,000 years, with early civilisations flourishing as early as 3300 BC. Subsequent civilisations showed advanced technology and infrastructure with drainages systems and houses made of brick appearing sometime between 2600 and 1900 BC. Over the centuries, India both influenced and was influenced by other nations and kingdoms, with far reaching trade, conquest and migration spreading the subcontinent's culture far and wide. Trading with the Romans, Persians and Greeks ensured that Indian culture had an impact on civilisations that seemed worlds away. Empires rose and fell over the centuries, with the wealthy Mughal Dynasty ruling most of India by 1600. At the same time, different European nations started showing an interest in India after being brought to the area for trade. The Portuguese, Dutch, British and French all had vested interests in India, with the British East India Company being given the rights to trade in India in 1617. The 1857 rebellion and War of Independence culminated in the decline of Mughal rule and were considered the first movements against the British Raj's heavy handed rule of the country. India's independence movement continued to grow and soon changed the face of India's future., 158058=By the 1920s, India's independence movement had grown considerable momentum with Mohandas Gandhi leading mass movements based on passive resistance and non-cooperation against the British Raj. Although it took decades, India finally gained independence in 1947. More recently, India has seen dramatic changes in society mainly due to modernisation and globalisation. A new wave of prosperity has seen the rise of the middle class, with men and women entering into new work roles in telecommunications, manufacturing and business. India's large cities are dealing with mass migration of rural citizens, who are moving to the city to seek better employment, education and opportunities for their children. Delhi successfully hosted the Commonwealth Games in 2010, further putting India on the map as an increasingly cosmopolitan, modern country., 145187=Due to India's size and topography, there's a huge amount of variation in its climate. One of the most beneficial times to visit is from September to March when temperatures are at their coolest. During winter (December-January), temperatures can get quite cold in Delhi and in the north, especially at night. Monsoon is from late-May to around October and offers hot and humid conditions, although this is considered one of the best times to visit Ladakh and the hills.}", "textBeforeTable": "Recommended reading Further reading To learn more or donate, go to: www.theintrepidfoundation.org This innovative group turns unwanted clothing into useful items for India's needy people. It also distributes donated books, school uniforms, toys, blankets and utensils across the country to disadvantaged students in need. Image supplied by GOONJ. GOONJ This organisation builds a better future for Delhi's street children by providing food, housing, health care, education and emotional support. Image supplied by Deepalaya. Deepalaya Providing essential services to disabled children and adults, this Rajasthan-based organisation assists disempowered people to feel part of their community. Vocational training, education, guidance and counselling all help to foster self reliance and confidence. Image supplied by Asha Ka Jharna. Asha Ka Jharna In India, The Intrepid Foundation proudly supports: The Intrepid Foundation provides travellers with an opportunity to give something back to the many wonderful communities we travel to. By donating to The Intrepid Foundation you can make a difference in local", "textAfterTable": "Handy links www.lonelyplanet.com/india www.worldtravelguide.net/india www.incredibleindia.org www.tajmahal.com × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}