{"relation": [["Type", "Story", "Story", "Story", "Story", "Story", "Story", "Story", "Story", "Story", "Story"], ["Title", "Why Do We Trust Google", "7 (More) Best Free/Open-source Backup Software for Linux", "Karmic To Lucid", "The best-kept secrets of UNIX power users", "Using Aliases in Linux to Make Life Easier", "Top 5 Free Linux Distributions for Servers in 2010", "NVIDIA's 256.25 Beta Linux Driver Slows Things Down", "Gxine Media Player: Just Press Play", "Mozilla hires open-standards guru Celik", "Fedora 13 released"], ["Author", "srlinuxx", "srlinuxx", "srlinuxx", "solrac", "srlinuxx", "srlinuxx", "srlinuxx", "srlinuxx", "srlinuxx", "srlinuxx"], ["Replies", "", "", "", "", "", "", "", "", "", ""], ["Last Post", "26/05/2010 - 4:41pm", "26/05/2010 - 4:39pm", "26/05/2010 - 4:37pm", "26/05/2010 - 4:30pm", "26/05/2010 - 4:23pm", "26/05/2010 - 4:21pm", "26/05/2010 - 4:19pm", "26/05/2010 - 2:15pm", "26/05/2010 - 2:13pm", "26/05/2010 - 2:12pm"]], "pageTitle": "Tux Machines | Do you waddle the waddle?", "title": "", "url": "http://www.tuxmachines.org/node?page=3109&%24Version=0&%24Path=%2F&%24Domain=.tuxmachines.org", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00158-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 790915775, "recordOffset": 790892101, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{17668=Friday, 31 Jul 15 - Tux Machines is a community-driven public service/news site which has been around for over a decade and primarily focuses on GNU/Linux ☞ Subscribe now}", "TableContextTimeStampAfterTable": "{41790=Remember what posted ten weeks ago? Review: Two RHEL4 and FC5 Books, Face To Face. It was about Christopher Negus' and Mark G. Sobell's books. Well, unless you're running RHEL4 or CentOS4, you might as well forget about them. Fedora Core users should consider Chris Tyler's book as their first choice. Obviously for a book issued in October 2006, it is dedicated to FC6 only., 12357=The 2.6.18.3 stable kernel update has been released. This update is a bit smaller than its predecessors, but there's still a fair number of fixes here, including at least one which is security-related., 44277=Parsix GNU/Linux 0.85 Test 3 is now out. New in this third test release is the inclusion of GNOME 2.16.1, OpenOffice.org 2.0.4, Firefox 2.0, and fixed a number of bugs. The final release of Parsix 0.85 should be out in early December. Phoronix has some Screenshots of Test 3., 20202=The Jokosher team are proud to announce the second pre-release of their simple yet powerful audio studio for the GNOME desktop. The new 0.2 version of the software has been in active development since July, and has packed Jokosher with the core features to perform full audio recording and production on the Linux desktop.}", "lastModified": "Fri, 31 Jul 2015 08:10:45 GMT", "textBeforeTable": "Categories Latest Members Hot Topics All-Time Popular Stories Recent comments Archive Highlights Latest Headlines Quick Roundup Forum funny? WiFi Lost \"root\" login in Fedora 22-KDE Active forum topics 16 science projects for open innovation The best new OpenStack tips and tricks Teach coding with games: a review of Codewars and CodeCombat What value do you bring to your company? Dummy projects for new", "textAfterTable": "« first ‹ previous … 3106 3107 3108 3109 3110 3111 3112 3113 3114 … next › last » Cheat Sheet: Open source licences Submitted by srlinuxx on Monday 20th of November 2006 02:38:16 PM Filed under OSS Open source licences... much of a muchness? Indeed. Let me start by saying, if you happen to think that all open source software is created equal, you are very, very wrong. » Login or register to post comments", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}