{"relation": [["File Name", "BindPad WoD Beta", "BindPad HotKey Text Patch"], ["Version", "2.7.7 WoD beta", "1.1"], ["Size", "33kB", "13kB"], ["Author", "Tageshi", "corveroth"], ["Date", "10-05-14 08:35 PM", "09-01-12 01:05 AM"], ["Type", "Addon", "Patch"]], "pageTitle": "BindPad - GUI to set keybindings for spell/item/macro : Graphic UI Mods : World of Warcraft AddOns", "title": "", "url": "http://www.wowinterface.com/downloads/fileinfo.php?id=6385&so=oldest&page=22", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00209-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 827660267, "recordOffset": 827624229, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{16633=BindPad -- Created by Tageshi ------------------------------------------------------------------------- 1. WHAT IS \"BindPad\"? ------------------------------------------------------------------------- BindPad is an addon to make KeyBindings for spells, items, and macros. You no longer need actionbar slots just to make Key bindings for your macores etc. BindPad addon provides many icon slots in its frame. You can drag and drop anything into one of these slots, and click the slot to set KeyBindings. ------------------------------------------------------------------------- 2. HOW TO USE \"BindPad\"? ------------------------------------------------------------------------- (1) Type /bindpad or /bp to display BindPad frame. (Also you can find \"Toggle BindPad\" Keybinding command in standard KeyBindings frame of Blizzard-UI.) (2) Open spellbook frame (p), you bag (b), or Macro Panel (/macro). (Also you can use three mini-icons on BindPad frame to open these windows.) (3) Drag an spell icon, item icon, or macro icon using left button drag and drop it onto the BindPad window. (Maybe you need shift key + left button drag if action bars are locked.) (4) Now you see the icon placed on BindPad frame. Click it, and a dialog window \"Press a key to bind\" will appear. (5) Type a key to bind. And click 'Close' button. (6) When you want to remove icons from BindPad frame, simply drag away the icon and press right click to delete it. Note that KeyBinding itself will not be unbinded when you delete the icon. To unbind it, click the icon and click Unbind button on the dialog window. Also you can simply override Keybindings. ------------------------------------------------------------------------- 3. HOW TO USE TABS ------------------------------------------------------------------------- 3.1. SLOTS TABS There are four tabs called Slots Tab on the top of BindPad frame (like Blizzard's Macro frame). [General Slots] is for common icons used for every characters and every specs. [<Character> Specific Slots] is for icons specific to current character and current spec. [2] and [3] (aka. 2nd and 3rd <Character> specific slots) will act in the same way as [<Character> Specific Slots]. Note that you can use [<Character> Specific Slots] tab only after you click 'Character Specific Key Bindings' check box at standard KeyBindings frame of Blizzard-UI. From BindPad version 1.5, you can see this checkbox on BindPad window itself too. (Also BindPad will inform you about 'Character Specific Key Bindings' and automatically activate it for you when you click [<Character> Specific Slots] tab.) 3.2. PROFILE TABS There are another three tabs called Profile Tab on the side of BindPad frame. (like Blizzard's Talent frame) Different Profile can hold different contents in [<Character> Specific Slots]. You can click a Profile tab to switch current Profile, and your choice of Profile is saved for each Talent specs and automatically reverted to former profile when you change talent spec. If you choose same Profile for both talent specs this automatic change will not happen. Note that [General Slots] tab is not effected by Profile change, as all contents of [General Slots] tab is common for all characters AND all specs. If you change Profile while [General Slots] tab is shown, BindPad will automatically shows [<Character> Specific Slots] tab of specified Profile. 3.3. CAN I SWITCH PROFILE IN COMBAT? ON STANCE CHANGE? No, you cannot. If you need different skills binded for different stances/forms, simply use the stance condition to decide on what skill to use. Example: /cast [stance:1/2] Berserker Stance; [stance:3] Intercept Where [Stance:1/2] is conditioning the macro for you to be in battle stance or defensive stance and [stance:3] is conditioning you to be in berserker stance. This works for all classes with stances (Including rogues for stealth [stance:1] and shadow dance [stance:2] or none of the previous [stance:0]). Druid example: /cast [stance:1] Bash; [nostance:1] Healing Touch [nostance] = Caster, [stance:1] = Bear, [stance:2] = Aquatic, [stance:3] = Cat, [stance:4] = Travel, [stance:5] = Tree/Moonkin if available else Flight, [stance:6] = Flight if Tree/Moonkin is not available. ------------------------------------------------------------------------- 4. \"You want to convert this icon into a BINDPAD MACRO?\"... What? ------------------------------------------------------------------------- \"BindPad Macro\" is a new feature from BindPad version 1.8.0 ; which allow you to make almost unlimited number of virtual macro icons. Older versions of BindPad just let you save your limited action bar slots. This new BindPad will let you save your limited macro slots on the standard \"Create Macro\" panel. Usage: - Click the small red \"+\" icon to create an empty BindPad Macro. - Right-click an existing spell/item/macro icon on BindPad to convert it into a BindPad Macro. - Right-click the \"BindPad Macro\" to edit macro-text. - ...and you can use left-click to set keybindings as usual. Note that BindPad Macro will only exist within the BindPad frame; You can drag-and-drop them within BindPad, but you cannot drop them outside. ------------------------------------------------------------------------- 5. DETAILS AND MORE INFORMATIONS ------------------------------------------------------------------------- BindPad addon utilizes new functions added from WoW API 2.0 . You can use these functions (and many others) in any addons or macros. GetBindingKey(\"command\") SetBinding(\"KEY\", \"command\") SetBindingSpell(\"KEY\", \"Spell Name\") SetBindingItem(\"KEY\", \"itemname\") SetBindingMacro(\"KEY\", \"macroname\"|macroid) Just don't forget to save changes by SaveBindings(GetCurrentBindingSet()); There are some other similar addons by other authors. Try them and choose what you like. SpellBinder http://www.wowinterface.com/downloads/info5614-SpellBinder.html qUserKey http://wow.curse.com/downloads/wow-addons/details/q-user-key-bind-a-key-to-any-spe.aspx mBindings http://www.wowinterface.com/downloads/info11614-2.html ncBindings http://www.wowinterface.com/downloads/fileinfo.php?id=15270 ProKeybinds http://www.wowinterface.com/downloads/fileinfo.php?id=18841 Visit these links for more informations about keybindings and macros. WoWWiki http://www.wowwiki.com/Making_a_macro ------------------------------------------------------------------------- 6. WHERE CAN I GET LATEST VERSION? ------------------------------------------------------------------------- You can get latest version of BindPad from www.wowinterface.com: http://www.wowinterface.com/downloads/fileinfo.php?id=6385 Or from Curse: http://www.curse.com/addons/wow/bind-pad}", "textBeforeTable": "Optional Files (2) Initial release. Version 1.0 Fixed some tainting bug. Version 1.1 (not uploaded!): (Old save data will be deleted when you use version 1.2; that don't unbind but you need to drag icons again.) Savefile format was changed and not compatible to 1.0 and 1.1. More bug fixes. Version 1.2 (not uploaded!): Added slash command /bindpad and /bp Version 1.3 (Now really updated version): You can now use mouse wheel up/down as a keybind. You can now drag&drop icons from Action Bars too. Now uses new GetCursorInfo() API. (Slouken have kindly added it for me.) Added three mini-icons to open Spellbook, Macros Panel, and All bags. TOC update. Version 1.4 Added some functions to inform about 'Character Specific Key Bindings'. Added the 'Character Specific Key Bindings' check box at upper right corner of BindPad frame. TOC update. Version 1.5 TOC update. Version 1.5.1 Added two extra tabs for heavy users. Version 1.6", "textAfterTable": "Archived Files (43) File Name Version Size Author Date   BindPad - GUI to set keybindings for spell/item/macro 2.7.12 34kB Tageshi 12-31-14 12:17 PM   BindPad - GUI to set keybindings for spell/item/macro 2.7.11 34kB Tageshi 11-23-14 01:58 PM   BindPad - GUI to set keybindings for spell/item/macro 2.7.10 33kB Tageshi 10-22-14 07:44 AM   BindPad - GUI to set keybindings for spell/item/macro 2.7.9 33kB Tageshi 10-17-14 12:14 PM", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}