{"relation": [["Title", "The Fly", "The Ring"], ["Publisher", "Secker", "Secker"], ["Date", "1965", "1967"]], "pageTitle": "Richard Chopping Bibliography at Bookseller World", "title": "", "url": "http://www.booksellerworld.com/richard-chopping.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00313-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 338428238, "recordOffset": 338420036, "tableOrientation": "HORIZONTAL", "textBeforeTable": "You may also Like Len Deighton Wilbur Smith Ian Fleming Richard Chopping was born in 1917 in Colchester Essex and first exhibited his work in 1939 he went on his provide illustrations for numerous books and periodicals. He is best known for James Bond dust jackets though, each one a masterly piece of work. They remain some of the most evocative and effective wrapper designs ever created for the genre. Much of the work was done in collaboration with the author and there was some tension and disagreement at times, not least in regard of copyright and remuneration. He spent his later years concentrating on teaching and did few other jackets, the last one he did do was Licence Renewed, John Gardner's first 007 novel. If you are looking to buy or sell books then our locate a bookshop section may be of some assistance. More Information // --> } document.forms[0].q.select(); document.forms[0].q.focus(); if( document.forms[0].q ) {", "textAfterTable": "Ian Fleming Dust Jackets Illustrated by Richard Chopping Title Publisher Date From Russia With Love Cape 1957 Goldfinger Cape 1959 For Your Eyes Only Cape 1960 Thunderball Cape 1961 The Spy Who Loved Me Cape 1962 On Her Majesty's Secret Service Cape 1963 You Only Live Twice Cape 1964 The Man With the Golden Gun Cape 1965 Octopussy and The Living Daylights Cape 1966 bibliography section bookseller world join us     contact us     site map    ", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}