{"relation": [["Artist", "Adam Sanders", "Adam Zelkind", "The Hummingbirds", "Jesse Thomas", "Jivin' Gene & The Jokers", "Mia Dyson", "Whitey Morgan and the 78's"], ["Song Title", "Run With Me", "I Wish I Didn't Love Her", "Home", "Say Hello", "Breakin' Up Is Hard To Do", "Fill Yourself", "Another Round"], ["Played When", "Zoe yells at Wade and tells him she hates him.", "Shula and Delma yell at Wade.", "Zoe and Lemon drink together at the bar.", "End of episode, Zoe returns Wade's things.", "Start of episode, Zoe wakes up.", "Zoe and Rose at the Rammer Jammer.", "Lavon & Wade fight over tables at fundraiser"]], "pageTitle": "Hart Of Dixie Season 2 Episode 17 - We Are Never Ever Getting Back Together (2x17) - Watch Online - s2 e17 Spoilers", "title": "", "url": "http://www.tvrage.com/Hart_Of_Dixie/episodes/1065283183", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00087-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 800751036, "recordOffset": 800734642, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Music Trivia: This is the second episode to use a Taylor Swift song as an episode title. Ratings: 1.50 Million Viewers Episode Notes Read the full recap Recap The episode begins with Zoe in her bed, apparently trying to eat her depression away. She isn’t taking any calls from anyone and isn’t even seeing her patients. She comes to Lavon’s kitchen a while later. The situation gets really awkward when she sees Wade there, so Wade leaves for work in a hurry. Lemon and Magnolia still want Shelby out of Brick’s life, which is why Lemon is happy that Shelby and Brick have returned early from their vacation. Lemon asks Magnolia to be patient and says they don’t have to do a thing because Shelby will ruin their relationship by herself... George Tucker As Scott Porter Dr. Brick Breeland As Tim Matheson Wade Kinsella As Wilson Bethel", "textAfterTable": "Episode Quotes Magnolia: Ohh, Lemon. Thank god you're here. Shelby wants to take me to school, and I'd rather set myself on fire-- Oh, uh, we're all here. Sorry, I didn't see you. Your head is the colour of the wall. Lemon: Magnolia Breeland, where are your manners? I cannot believe you called and asked me to take you to school when Shelby so generously offered to take you herself. Shelby I am so sorry, I apologize for my sister's behaviour. Shelby: Oh well, we all wake up on the wrong side of the bed sometimes. George: Zoe, I know you are going through a rough time right now. If there is anything I can do, like punch Wade, or Tansy can punch Wade again, or...have anyone at all punch Wade. I've realized now that all my ideas involve punching Wade, but I can work on others. Zoe: Thank you George, that is very sweet. Jonah: Hey, heard you got dumped! Want to know what helps you get over those break-up blues? Mind blowing sex with a really hot doctor. Zoe: Man, if only I knew one I would give it a shot. Why are you here? Jonah: Just finished two gruelling weeks of applying", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}