{"relation": [["", "", "", ">>", "", "", ""], ["", "1.", "2.", "3.", "4.", "5.", "6."], ["Date", "Oct 28, 13:28", "Oct 28, 15:03", "Oct 28, 15:33", "Oct 28, 17:43", "Oct 28, 19:05", "Oct 29, 00:20"], ["Subject", "SWG", "Re: SWG", "Re: SWG", "Re: SWG", "Frater", "Re: Frater"], ["Author", "kimbambaman", "zincthallinide", "Alamar", "zincthallinide", "FourPak", "Awesome Spume"]], "pageTitle": "Morning Q&As - Blue's News Comments", "title": "", "url": "http://www.bluesnews.com/cgi-bin/board.pl?action=viewthread&boardid=1&threadid=61523&id=279548&view=threads", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 20, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00323-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 323117936, "recordOffset": 323102011, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{36418=News CGI copyright © 1999-2015 James \"furn\" Furness & Blue's News. All rights reserved., 36621=Chatbear v1.4.0/blue++: Page generated 30 July 2015, 00:25. Chatbear Announcements., 34503=Copyright © 1996-2015 Stephen Heaslip. All rights reserved. All trademarks are properties of their respective owners.}", "textBeforeTable": "Step Creative Adventure's Planet Q&A with the Step Creative Group talks with the folks from Step Creative Group about their various projects on the occasion of their tenth anniversary: \"Currently we are an independent developer of computer games on PC platform. All the developers in our team have different experience in game development industry: someone has two or three projects in the past, someone – half a dozen and someone stands in the beginning of the game development career. Step CG has already finished work on two projects. By the end of September 2005 we will be pleased to present the Russian gaming community with the remake of Star Heritage 1: The Black Cobra. Also, two adventure games are in development now (Evenings on a Farm near Dikanka and The Island: The Earthling) and we have some interesting projects not announced yet.\" Frater RPG Vault's Frater Q&A is a chat with Krzysztof Krawczyk of Rebelmind about their upcoming RPG: \"We like changes, and this is why our games are rarely continuations of previous ones. I think the 19th century is a border between the mystical and technological periods of our civilization, and the turn of 19th and 20th centuries must have been very special. This is the reason why we decided to set the game in that time. Reading some alchemists' biographies also influenced us quite a bit. Their strong desire to fathom a", "textAfterTable": "Re: SWG Oct 28, 2005, 15:33 Alamar   I think it became obvious long long ago that George Lucas only invented the entire Star Wars franchise to make oodles and oodles of sweet, sweet cash. I agree that it's pretty obvious... That he made the initial SW stories/movie because he was passionate about his creation... He LATER made it into a money-gobbling franchise because of the same reason you would if you could : ) The whole thing is just the same old 'pure good vs pure evil' with lasers and spaceships. same old... It's wasn't so old when it was first released : ) Sure... It wasn't entirely original even then, and we have a billion examples of it now, but it's a mistake of human nature to judge the past with current knowledge, morals, etc... -Alamar    ", "hasKeyColumn": true, "keyColumnIndex": 3, "headerRowIndex": 0}