{"relation": [["", "1", "2"], ["Name", "ExplicitBuff Nuff", "Buff Nuff (Instrumental Version)"], ["Artist", "Roots Manuva", "Roots Manuva"], ["Time", "2:14", "2:12"], ["Price", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Buff Nuff - Single by Roots Manuva", "title": "", "url": "https://itunes.apple.com/lv/album/buff-nuff/id416203879?i=416203883", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00219-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 877498563, "recordOffset": 877473825, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{101984=Autortiesības © 2014 Apple Inc. Visas tiesības aizsargātas., 4874=Born: 1972 in Stockwell, London, England}", "lastModified": "Fri, 31 Jul 2015 08:43:08 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Roots Manuva Buff Nuff - Single iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Buff Nuff - Single by Roots Manuva, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes", "textAfterTable": "2 Songs Biography Born: 1972 in Stockwell, London, England Genre: Hip-Hop/Rap Years Active: '90s, '00s, '10s British rapper/producer Rodney Smith established himself as Roots Manuva in the late '90s and began releasing a series of highly regarded albums through Big Dada. Smith's work was firmly rooted in dub and ragga but also incorporated much of the trip-hop style often associated with Ninja Tune, the U.K. imprint that often distributed Big Dada releases. The MC debuted in 1999 with Brand New Second Hand, a promising album that garnered a sizable amount of attention from the international hip-hop crowd... Full bio Top Albums and Songs by Roots Manuva 1. Buff Nuff - Single View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}