{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Worldwide", "Bounce", "You Talk About Me", "Popcorn", "I Shot the Sherriff", "Ducema", "Pussia", "Funky Zydeco", "Good for the Goose, Good for the Gander (Remix)", "Jam Y'all"], ["Album", "Worldwide", "Worldwide", "Worldwide", "Worldwide", "Worldwide", "Worldwide", "Worldwide", "Worldwide", "Worldwide", "Worldwide"], ["Time", "5:48", "6:33", "4:24", "4:35", "6:20", "3:21", "4:05", "3:54", "4:45", "4:36"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Worldwide by Lil' Brian", "title": "", "url": "https://itunes.apple.com/mt/album/pussia/id262538112?i=262539339", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00240-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 870979767, "recordOffset": 870958962, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{22747=Even the staunchest of hip-hop supporters has to admit that for the most part, musically, the genre has been repeating itself for years by the early 21st century — the same beats, the same sounds, the same tempos, etc. But then there are a select few who break free from these restraints — especially Lil' Brian & the Travelers, as evidenced throughout the group's 2007 release, Worldwide. Zydeco is a style that has been rarely — if at all — integrated into hip-hop, which is what Lil' Brian & the Travelers do throughout their fourth album, as they continue on in their self-described \"z-funk\" style. While not a straight hip-hop release — Lil' Brian often sings rather than raps — the presence of record scratching and even an appearance from the Dogg Pound's Kurupt shows there are definite links between hip-hop and z-funk. Tracks such as the album-opening title track, \"Bounce,\" and \"Funky Zydeco\" make Worldwide one of the year's top surprise party albums — even a pointless remake of Bob Marley's \"I Shot the Sheriff\" can't halt all the fun (c'mon — that's like trying to cover \"Stairway to Heaven\" or \"Purple Haze\"). Paul Simon would be proud., 85192=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 09:05:11 GMT", "textBeforeTable": "View In iTunes Worldwide 1. Top Albums and Songs by Lil' Brian Full bio Young lightning-fingered accordion player Brian Terry and his Zydeco Travelers first found popularity in their native Houston during the early '90s when he and his bandmates were in their early '20s. It was master zydeco accordion player John Delafose who inspired Terry to begin learning the instrument at age 13. As his family is distantly related to the Delafose family,... Years Active: '90s, '00s Genre: Blues Biography Even the staunchest of hip-hop supporters has to admit that for the most part, musically, the genre has been repeating itself for years by the early 21st century — the same beats, the same sounds, the same tempos, etc. But then there are a select few who break free from these restraints — especially", "textAfterTable": "Listeners Also Bought Getting Ready... Freddie King View In iTunes   Name Album Artist Time Price   1 Ain't No Sunshine When She's Gone", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}