{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "I Just Wanna Make Love To You", "Ball and Chain", "Hold Me (Just a Little Longer Tonight)", "If I Can't Have You", "It's All Right", "Two Sides (To Every Story)", "Pushover", "I Found a Love", "Something's Got a Hold On Me", "A Sunday Kind of Love"], ["Album", "Hot Hits of the 60's, Vol. 2", "All Blues'd Up: Songs of Janis Joplin", "Love's Been Rough On Me", "At Last! (Extra Tracks)", "Etta James: My Greatest Songs", "Etta James: My Greatest Songs", "Etta James: My Greatest Songs", "Etta James: My Greatest Songs", "Etta James: My Greatest Songs", "Etta James: My Greatest Songs"], ["Time", "3:07", "6:37", "3:46", "2:50", "2:41", "2:57", "2:57", "3:28", "2:51", "3:17"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Burnin' Down the House (Live At the House of Blues) by Etta James & The Roots Band", "title": "", "url": "https://itunes.apple.com/lt/album/your-good-thing-is-about-to/id255435698?i=255436924", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00241-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 877220507, "recordOffset": 877192288, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{24695=Playing Burnin' Down the House right after you have listened to some of Etta James' early recordings is quite revealing. The veteran soul/blues singer was only 16 when, in 1954, she made her first recordings for Modern records; she was 63 when this excellent live album was recorded at the House of Blues in West Hollywood, CA, in December 2001 — and it is obvious that vocally, she didn't lose anything along the way. Backed by a tight and rock-solid band, James demonstrates that her big, full voice lost none of its richness between 1954 and 2001. The Los Angeles native sounds as vital as ever, and she has no problem going that extra mile on gutsy performances of \"Something's Got a Hold on Me,\" \"I'd Rather Go Blind,\" \"At Last,\" and other hits. For the most part, this is a soul concert; however, James makes a triumphant detour into electric urban blues on \"I Just Want to Make Love to You\" (one of the many Willie Dixon gems that Muddy Waters recorded for Chess in the '50s) and B.B. King's \"Rock Me, Baby.\" The veteran singer pleasantly surprises us with some unlikely medleys; \"I Just Want to Make Love to You\" is successfully combined with Steppenwolf's \"Born to Be Wild,\" and even more intriguing is her ability to unite the standard \"My Funny Valentine\" with two of Al Green's '70s hits (\"Love and Happiness\" and \"Take Me to the River\"). Some longtime fans may be disappointed to learn that she doesn't perform either \"Tell Mama\" or \"Roll with Me, Henry,\" aka \"The Wallflower\"; regardless, Burnin' Down the House is an exciting and powerful document of James at 63., 126916=© „Apple Inc.“, 2014. Visos teisės saugomos., 26524=Born: 25 January 1938 in Los Angeles, CA}", "lastModified": "Fri, 31 Jul 2015 08:07:10 GMT", "textBeforeTable": "View In iTunes Etta James: Her Best 5. View In iTunes Stickin' to My Guns 4. View In iTunes Etta James: My Greatest Songs 3.", "textAfterTable": "Listeners Also Bought Sassy Mama Big Mama Thornton View In iTunes One Eye Open: Live At Rosa's Lounge Lurrie Bell & Mississippi Heat View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}