{"relation": [["Artist", "bluetech", "ananda", "Dzihan & Kamien", "flowers of wraith", "Anteus", "Slackbaba", "jiwaba a shikwa", "subswara", "shen", "Sam Popet", "Ooh Ahh", "dj drez", "Spearhead", "Merzebian", "random rab", "Govinda", "adam sheik", "AR Rahman", "david starfire", "Cheb i Sabbah", "random rab", "hibernation"], ["Title", "living time", "as we let go", "ford transit", "aftermathmatics", "palm of the prophet", "long sunny days", "you are the light", "yeah / Heyoka remix", "causation", "golden ring", "hacksaw", "shes callin", "skin on the drum/ bassnectar remix", "chi che", "the riddle", "i let go", "beyond i", "gangsta blues", "waffler", "qualandri", "clarification", "embers"], ["Album", "divine invasion", "Clipping Paths", "grand reserva", "Devil in the Detail", "Buddah Bar v", "the beat goes om", "buddah chillout lounge", "single", "Outlines", "the sounds of Goa", "single", "Jahta Beats", "sounds of bassnectar", "single", "Elucidation of Sorrow", "amethyst noise", "tribal matrix", "Slumdog Millionaire Soundtrack", "unreleased", "single", "a rose", "Arcana"]], "pageTitle": "The Melting Pot | KBOO", "title": "", "url": "http://www.kboo.org/TheMeltingPot?page=0%2C8%2C0%2C0%2C3", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00067-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 556301767, "recordOffset": 556260149, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{29676=His debut album \"Kytheria\" was released on Dakini Records in 2010, and his tracks and remixes have appeared on labels such as Six Degrees, Wonderwheel, Desert Trax, and Caravan, in addition to numerous bellydance DVDs. As percussionist and remixer he has collaborated with some of the most notable figures in global dance fusion, including the Nickodemus, the Spy from Cairo, Makyo, and Jef Stott., 30482=Upcoming live appearances include \"Awakenings\" with the Desert Dwellers in Portland 7/19. Tracks slated for release in 2012 include 3 remixes of the Desert Dwellers on White Swan and Desert Trax, and 2 new bellydance-oriented tracks on the Caravan label.  , 31105=Interview with DRUMSPYDER from The Melting Pot - Tuesday 7/10/2012}", "TableContextTimeStampAfterTable": "{61438=Grey Filastine is a producer/musician based in Barcelona but rarely found there. Among his 60+ gigs last year you might have caught him at a club in London, on a junk raft floating down the Mississippi, at Shambhala festival in British Columbia, at a tiny breakcore party in Osaka, or in front of forty thousand at the Boulevards festival in Casablanca. In any context it gets riotous- Filastine bangs out his music, jumping between a tangle of electronics, acoustic percussion, and an amplified shopping cart, firing off riddims and synchronized live video. In 2006 Filastine dropped his debut release, Burn It, to much critical acclaim. Vibrant and original, Burn It made inroads among music fans from the hiphop, world, electronic, and experimental scenes; it was snatched up and re-released by French label Jarring Effects, Japanese label Romz, and US anarcho-collective Crimethinc. Tracks from the album received airplay on the radio shows of Mary Anne Hobbes & John Peel, and in France peaked at #15 in national independent radio charts. Less visible are the spins on pirate stations across Latin America, or the more than fifty thousand downloads of his dj mix commissioned by Blentwell.com. Other releases include pirate mixtapes and a selection of sold-out vinyl. Look for his latest 12\" on Tigerbeat6's Shockout with partner Maga Bo in their duo project Sonar Calibrado. With his sophmore album, Dirty Bomb, Filastine returns with a gritty transnational soundclash of urban rhythm. Freely splicing dubstep with balkan brass or hiphop with bollywood, Dirty Bomb parties in the mud puddle of our increasingly polluted world. Kick drums beat out rapid patterns for dances yet to be invented. Rich acoustic strings merge with programmed synths. Bits of field recordings and radio static degrade the signal. Each featured voice is sourced from an on-site collaboration. Over the contorted crunk of \"Hungry Ghosts\" rap aboriginal Australian Wire mc and Japan's ECD, underground icons of their respective countries. Closing the album is teen gypsy La Perla, recorded in a squatted cave in Andalusia. If it's otherworldly melodies with female vocals you want, try tracks 5 and 17. for low-end bangers enhanced by MCs, try tracks 7, 8, and 11. For beautiful instrumentals, tracks 14 and 16. Before focusing on solo work Filastine founded the Infernal Noise Brigade, a 20-piece marching band that was the soundtrack of the globalization protests that opened this century, starting with the blockade of the Seattle WTO summit. The Infernal Noise Brigade was purpose-built to bring music to political movements in the street. Filastine is a project to do the reverse, pumping the immediacy of the street through sound systems. Filastine will spend 2009 touring the world along his DIY trade routes. Expect to find him everywhere. To see how this album was made go to: www.Filastine.com/log/dirtybomb (less), 155046=Latest newsletter: May 2015, 163458=Copyright © 2012 KBOO Community Radio | Copyright Policy | Community Guidelines | Website Illustration & Design by: KMF ILLUSTRATION, 120083=It's Craig. I used to host a Sunday evening show and we met one time at the studio.I am interested in how you layer the sounds. I found some of the CDs on your 2/10 playlist on Amazon but now have to assume you were layering tracks. Curious about your playlist. On 2/10, I tuned in at about 9:30 and was very impressed despite my hither-to strong reservations about much electronica. You created a really a nice mix that was not dragged down by a too-obvious 4/4 beat. (I can't handle too much 4/4 on floor.) Will send my email address to you via your name since KBOO may not be OK with my posting it here., 21072=Balkan beatbox - Featured artistIsraeli saxophonist Ori Kaplan has been a fixture on New York City's downtown music scene since the early 1990s, playing with gypsy punk band Gogol Bordello and the ethno-garage outfit Firewater. He and Firewater drummer/producer Tamir Muskat split off in 2005 to form Artist. As the name suggests, their music is highly danceable, and takes the melting pot approach of the members' previous bands to the next level, giving the traditional sounds of various Middle Eastern and Eastern European styles an au courant electronica polish. A bit hipper than most world fusion acts, the duo (who perform live with a large ensemble of guest musicians) don't just graft traditional sounds to modern--they have alchemized a style all their own.  , 92517= Any chance we could get the playlist for September 22nd? I've been trying to track down this one song, I'm a Warrior or something, and I'd love to know who its by!, 5688=The Melting Pot 6-9-09 Featured Artist ***SHPONGLE***, 13565=Shpongle's first track, Vapour Rumours, was released on TIP Records' Infinite Excursionscompilation in 1996.[1] Their debut album, Are You Shpongled?, was released 1998 onTwisted Records. Are You Shpongled? and Twisted Records' first downtempo compilation,...and the Day Turned to Night, were influential in the then-small psychedelic downtempo genre., 5866=Dongle and Mongle are the only two other words rhyming with Shpongle...a strange hybrid of electronic manipulation and shamanic midgets with frozen digits squeezing the envelope and crawling through the doors of perception, find a new pair of dice...extra numbers and colours an infinite expanding bubble, filled with a bizzare, strange world of dripping halucinatory wallpaper, a garden of earthly delights...........Shpongleland.....a place of well being, and reflective surfaces, morphing like an Anacondas skin and shimmering like a million colour changing squid, at fifty fathoms.. truly unfathomable like seperating water from it's wetness, the Ineffable Mysteries unweave .....  After this years performance at the OZORA festival in August, comes a brand new show at the Roundhouse in London on October 30th 2009 for the worldwide launch of the spectacular new album from Shpongle 'Ineffable Mysteries from Shpongleland'. Copies will be available on the night...the first editions ever on the planet and 2 weeks before any shops or download sites, make sure you're there to get your copy ! Tickets are now on sale. , 107224=Peace and Love, ~ Amar, 15714=In January 2007, Twisted Records announced that a fourth Shpongle album was being recorded, to be released in early 2009. The current projected release date is mid November 2009.[2] The album will be named \"Ineffable Mysteries from Shpongleland\" and will have the catalogue number TWSCD36.[3], 113846=Its called EMRG-N-SEE July 17, 18, 19, 20. Just outside of Salem}", "lastModified": "Sat, 01 Aug 2015 04:07:06 +0000", "textBeforeTable": "06/09/2009 Air date:  The Melting Pot Program name:  The Melting Pot playlist for 06/09/2009 Playlists last » next › 2 1 Download audio file Login or register to post comments Format: MP3 Stereo 44kHz 128Kbps (CBR) Length: 14:13 minutes (13.03 MB) Album: The Melting Pot Title: vibe1 1 Artist: Vibesquad Tue, 03/30/2010 program date: ", "textAfterTable": "Shpongle Levitation Nation Nothing Lasts The Melting Pot 6-9-09 Featured Artist ***SHPONGLE*** Dongle and Mongle are the only two other words rhyming with Shpongle...a strange hybrid of electronic manipulation and shamanic midgets with frozen digits squeezing the envelope and crawling through the doors of perception, find a new pair of dice...extra numbers and colours an infinite expanding bubble, filled with a bizzare, strange world of dripping halucinatory wallpaper, a garden of earthly delights...........Shpongleland.....a place of well being, and reflective surfaces, morphing like an Anacondas skin and shimmering like a million colour changing squid, at fifty fathoms.. truly unfathomable like seperating water from it's wetness, the Ineffable Mysteries unweave .....  After this years performance at the OZORA festival in August, comes a brand new show at the Roundhouse in London on October 30th 2009 for the worldwide launch of the spectacular new album from Shpongle 'Ineffable Mysteries from Shpongleland'. Copies will be available on the night...the first editions ever on the planet and 2 weeks before any shops or download sites, make sure you're there to get your copy ! Tickets are now on sale.   ", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}