{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Saving Gracie", "Snake Drive (live)", "Chuck Berry In Space", "Tall Boy", "Last Page of the Book", "Saving Gracie", "Joy", "The Bridge", "Get Away Clean", "Chronic Liar"], ["Album", "Good2b3", "in the Meantime...", "Good2b3", "in the Meantime...", "in the Meantime...", "in the Meantime...", "Good2b3", "Good2b3", "Good2b3", "Good2b3"], ["Time", "4:11", "3:49", "3:18", "3:53", "4:21", "4:14", "3:36", "2:29", "3:32", "3:57"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Good2b3 by TimLee3", "title": "", "url": "https://itunes.apple.com/us/album/chuck-berry-in-space/id279100449?i=279100576", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00200-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 896494191, "recordOffset": 896476709, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{71167=Copyright © 2014 Apple Inc. All rights reserved., 24144=Good2b3 Good2b3 is Tim Lee's newest release with his band Tim Lee 3. The album from this Southern trio is a combination of narcotic ballads and faster, potent tunes. The songs are filled with dual vocals from Tim himself and Susan Bauer, who also plays bass. Rodney C. Cash (no relation, although you'd swear he was kin to W.S. Holland) rounds out the trio on drums and percussion. The cd was recorded and mixed at WaveLab Studio in Tucson, Arizona, in February and November, 2007, by Chris Schultz and Craig Schumacher (Calexico, the Sadies, Los Lonely Boys, Neko Case). Striking the perfect balance between stomp and shimmer, longtime rocker, Tim Lee's new band TimLee3, steps out with a rousing rocker that recalls the roar of vintage Smithereens, the twang of Uncle Tupelo, and the straight out rock n' roll of the Sonics. This is indie southern rock that will appeal to fans of The Drive-By Truckers, Son Volt, and Whiskeytown If you like this album, check out releases under (just) Tim Lee, like No Discretion, Concrete Dog, and Under the House, as well his work with Bobby Sutliff in the 80s and 90s as the Windbreakers.}", "lastModified": "Sat, 01 Aug 2015 03:55:37 GMT", "textBeforeTable": "View In iTunes in the Meantime... 2. View In iTunes Good2b3 1. Top Albums and Songs by TimLee3 If You Like Alternative Rock From A Southern Perspective Check Out This!,Tim Pen's Song's As Good As Anything Bob Dylan Or Tom Petty Have. This Has Some Heavy Root's Like Real Rock Not The Corporate Stuff! If You Wanna Listen To A National Treasure,Start Listening You Got Some Catchin' Up To Do. The South Is Alive And Kickin' And Tim Lee's The Proof.! by Jimmy Drew", "textAfterTable": "View In iTunes $9.99 Genres: Rock, Music Released: Apr 14, 2008 ℗ 2008 Paisley Pop Customer Ratings We have not received enough ratings to display an average for this album. Discover and share new apps. Follow us on @AppStore. Discover and share new music, movies, TV, books, and more. Follow us @iTunes and discover new iTunes Radio Stations and the music we love. Home iTunes iTunes Download iTunes Features iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}