{"relation": [["TITLE", "Truth in advertising", "No raid until dawn, at least", "No assurances"], ["AUTHOR", "Leslie", "Leslie", "Leslie"], ["DATE", "Monday, Nov. 28, 2011 at 11:12 AM", "Monday, Nov. 28, 2011 at 6:23 PM", "Monday, Nov. 28, 2011 at 9:22 PM"]], "pageTitle": "Urgent Call To Save the Occupation: Stay Up All Night : LA IMC", "title": "", "url": "http://la.indymedia.org/news/2011/11/249980.php", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00035-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 138904423, "recordOffset": 138892300, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{41425=Assad Vows to Defend Syria's Homeland J27 11:16AM, 36655=Russia Challenges America's Orwellian National Endowment for Democracy J30 11:59AM, 24048=Since the encampment arose on October 2, hundreds and sometimes thousands of Los Angeles residents have walked through, picnicked, and camped on the lawn of City Hall daily in a visible demonstration of dissatisfaction with the social and economic status quo. Angelenos by the thousands have joined the groundswell of Occupations across the country and the world, reclaiming spaces and visibility in what had been a monologue about the “needs” of the wealthiest and most influential at the expense of the remaining 99%. With unemployment, foreclosures, and personal debt skyrocketing, as small businesses vanish overnight and homelessness swells, as entire at-risk communities fall into the economic abyss, the people of the United States and worldwide are rising up against financial bailouts doled out to the wealthiest 1%, tax preferences for multinational corporations, corporate take-over of the government, and preferential treatment for those who need it least., 22347=LOS ANGELES, 27 Nov 2011--The Occupiers at City Hall are asking all Angelenos to come to City Hall starting at 10:30 p.m. tonight and secure the space from a scheduled police raid until the Occupation can obtain a temporary restraining order when the courts open in the morning. To cede City Hall to the Mayor is to allow government, yet again, to control public spaces and public voices. It is to allow, yet again, the wealthy and powerful to frame the discussion, to shut down the face of the movement. For 58 days, Occupiers by the hundreds and sometimes thousands have taken up residence on the lawn as proxies for the swelling dissatisfaction of nearly all Angelenos with social and economic inequality. At this juncture, the Occupiers are calling on all Angelenos to stand with them to protect the Occupation., 38317=Israel Bombs Syria During Large-Scale War Games J29 6:51AM, 34250=fbi as the ultimate menace to society J31 6:19PM, 39626=Greece demonstrate J28 10:28AM, 40644=NUCLEAR SHUTDOWN NEWS JULY 2015 J27 4:54PM, 34789=Controversy Over Shell's Arctic Drilling Continues J31 2:49PM, 39356=United Nations Votes for Global Bankruptcy Principles J28 11:37AM, 37768=US Wants Enhanced UN Peacekeepers Serving Its Interests J29 11:51AM, 35634=Israeli Settlers Burn Palestinian Infant to Death J31 9:04AM, 36393=The Shortwave Report 07/31/15 Listen Globally! J30 5:05PM, 36942=Anti-Iranian Nuclear Deal Blitzkrieg in Full Swing J30 11:37AM, 37209=Israel Declares War on Palestinian Hunger Strikers J30 5:41AM, 37475=Irresponsibly Bashing Russia Veto Against Establishing Kangaroo MH17 Tribunal J30 3:13AM, 35899=US Neocon Urges War on Iran J31 7:23AM, 35351=Hollow Israeli Sorrow Over Palestinian Baby Immolation by Settlers J31 11:11AM, 33557=Why The Actual Artists Keep Fleeing What Once Was The Los Angeles Arts District J16 4:15PM, 34503=Nords Heroes of the North hack add unlimited [Gems] cheats Android iOS J31 4:37PM, 36142=More Illegal US Sanctions on Russia J31 3:32AM, 39861=Hezbollah's Nasrallah Urges Resistance Against Israeli Lawlessness J28 7:00AM, 38040=Russia to Veto UN Resolution for US-Controlled MH17 Tribunal J29 10:57AM, 38831=Illegitimate Show Trial Sentences Gaddafi's Son to Death J28 12:15PM, 40143=Tormenting Greece is about sending a message J28 5:16AM, 39104=Another Jail Cell Murder in America J28 11:52AM, 33305=Latest Black Flag Newsletter Available J20 8:05PM, 40891=Troika Bandits Want More from Greece J27 11:37AM, 41144=Anti-fascist and anarchist from Russia needs help and solidarity J27 11:17AM, 35055=How to Hack LINE Dragonica Mobile [LINE Dragonica Mobile Hack Cheats Generators] J31 2:27PM, 33850=12 Peoples Of Rain To the People of California J16 3:36PM, 38580=Another US Jail Cell Death Sentence J29 3:46AM, 40403=Balkanizing Syria Planned J28 4:01AM}", "lastModified": "Mon, 17 Mar 2014 00:26:05 GMT", "textBeforeTable": "LATEST COMMENTS ABOUT THIS ARTICLE Listed below are the 10 latest comments of 3 posted about this article. These comments are anonymously submitted by the website visitors. add your comments Google+FacebookTwitterShare on , , : qcOfftopic(249980); qcDouble(249980); qcSpam(249980); qcAd(249980); qcHate(249980); qcFraud(249980); qcBestOf(249980);", "textAfterTable": "Local News Latest Black Flag Newsletter Available J20 8:05PM Why The Actual Artists Keep Fleeing What Once Was The Los Angeles Arts District J16 4:15PM 12 Peoples Of Rain To the People of California J16 3:36PM More Local News... Other/Breaking News fbi as the ultimate menace to society J31 6:19PM Nords Heroes of the North hack add unlimited [Gems] cheats Android iOS J31 4:37PM Controversy Over Shell's Arctic Drilling Continues J31 2:49PM How to Hack LINE Dragonica Mobile [LINE Dragonica Mobile Hack Cheats Generators] J31 2:27PM Hollow Israeli Sorrow Over Palestinian Baby Immolation by Settlers J31 11:11AM Israeli Settlers Burn Palestinian Infant to Death J31 9:04AM US Neocon Urges War on Iran J31 7:23AM More Illegal US Sanctions on Russia J31 3:32AM", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}