{"relation": [["Artist", "bob baldwin", "Gerald Albright", "Wes Montgomery", "Stanley turentine", "John Coltrane", "Zachary Breaux", "Wayne Shorter", "4pm to 4:58pm", "Marc Cary", "Jason Moran", "Erik Truffaz", "herbie hancock", "kendricks scott", "eitienne charles", "andrew hill", "headhunters", "weather report", "branford marsalis", "lonnie plaxico", "ravi coltrane", "steve coleman", "charles mingus", "terrence blanchard", "conrad herwig", "marcus shelby", "archie shepp"], ["Title", "star spangled...", "Impressions", "\" \"", "\" \"", "\" \"", "", "Children of the night", "", "Abstrakt/Blak", "break down", "less", "rob swift", "ana maria", "dance with la diablesse", "legacy", "here and now", "elegant people", "requiem", "miles II", "epistrophy", "mutiplicity", "fables of faubus", "nocturna", "latin side of h. hancock", "we shall overcome", "come sunday"], ["Album", "American Spirit", "Live", "verve jazz sides", "sugar", "live village vanguard", "Groovin", "high life", "", "Abstrakt Blak", "artist in residence", "revisite'", "future 2 future", "reverence", "folklore", "compulsion", "survival of ...", "black market", "requeim", "melange", "blending times", "def trance beat", "mingus ah um", "bounce", "latin side of h. hancock", "soul of the movement", "The Cry of My People"]], "pageTitle": "KBOO | Community Radio for Portland and beyond", "title": "", "url": "http://kboo.org/playlists/6038?page=476", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 9, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00224-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 131640335, "recordOffset": 131616172, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{103332=As there's only so many earlyish January GD shows (and who could blame them), I tend to feature solo Jerry this month...and that's what you get today.  And only early stuff, plus an infrequent vocalist., 108695=Latest newsletter: May 2015, 117118=Copyright © 2012 KBOO Community Radio | Copyright Policy | Community Guidelines | Website Illustration & Design by: KMF ILLUSTRATION, 98082=Playlist (artist-track-album - *) Bill Holt – No. 10 – Dreamies Steinski – The Motorcade Sped On – What Does It All Mean? NBC Radio/Frank McGee – America the Violent – 1969 Robert F. Kennedy – Senseless Violence Speech – 1968 Laibach – Contrapunctus II – Laibachkunstderfuge Sarah Palin – Blood Libel speech – Sarah Palin’s website Negativland – Guns! – New American Radio Steinski – Soul Searching – www.steinski.com - Davy Tango – Human Fly Opera – YouTube Link DJ ManRich – I Dream ReWired – Gary Numan vs Robert Palmer (link) Księżyc – Klepana – Księżyc Al Lover – Sure Nuff Yes I Do – Safe As Milk Replica – Link Jack Shea/Fred Kaz – The Monitors – Movie 1969 I Cut People – – This Is Hollywood (www.icutpeople.com) I Cut People – Free Willy – This Is Hollywood I Cut People – Jason Goes to Hell (preview) – This Is Hollywood I Cut People – Get Shorty – This Is Hollywood I Cut People – Scanners – This Is Hollywood I Cut People – Mortal Kombat – This Is Hollywood I Cut People – Jerry McGuire – This Is Hollywood I Cut People – Short Circuit – This Is Hollywood I Cut People – Basic Instinct – This Is Hollywood I Cut People – Tremors – This Is Hollywood I Cut People – American Ninja 4 – This Is Hollywood Bas Sheva/Les Baxter – Despair – The Passions Jim Backus – Little Boy Blew – Mr. Magoo in Hi Fi - Ron Geesin – Enterbrain Exit – Miniatures: A sequence of fifty-one tiny masterpieces edited by Morgan Fisher Alejandro Viñao – An Imaginary Orchestrina – Miniatures Quentin Crisp – Stop The Music For A Minute – Miniatures Simon Desorgher – Tetrad – Miniatures Ralph Steadman – Sweetest Love – Miniatures R.D. Laing & Son – Tipperary – Miniatures Trevor Wishart – Beach Double – Miniatures John White – Scene De Ballet – Miniatures Ivor Cutler – Brooch Boat – Miniatures Hector Zazou – Do Tell Us – Miniatures - Shooby Taylor – Over the Rainbow – Shooby Taylor the Human Horn, 63141=This months' program featured the music of, \"Nashville Songwriters Hall of Fame\" member, Rodney Crowell, due to his upcoming performance at the Aladdin Theatre on Wednesday, February 9. It will be a solo performance in which will read excerpts from his new book \"Chinaberry Sidewalks\" and sing songs. }", "lastModified": "Sat, 01 Aug 2015 04:21:33 +0000", "textBeforeTable": "01/19/2011 Air date:  Shocks of Sheba Program name:  Reggae - Caribbean Categories: Shocks of Sheba playlist for 01/19/2011 view full schedule To be determined 10:00pm-12:00am One Two, One Two Mobile Support Archives Listen Schedule Programs   Audio Options", "textAfterTable": "7\" Willi Williams Run Them A Run ...light in the attic CD Yabby You w/ Sly & Robbie Chanting Dub ...runnetherlands CD Ini Kamoze Red Outa Road ...hottis CD Daweh Congo Respect ...tmi 7\" Sizzla Music In My Soul ...john john mp3 Hugh Mike Dem A War ...corner stone LP Ramon Judah Sound Boy Come Away ...reggae roast CD Joey Fever Back With A Blast ...fast forward sound CD Dennis Brown Promised Land ...blood & fire CD Royals Facts Of Life ...pressure sounds 10\" Clinton Fearon Better Days ...boogie brown CD Clifton Campbell New Civilization ...virgo stomach LP Johnny Osbourne Warrior ...light in the attic CD Attaras Brimstone & Fire ...pressure sounds 7\" Bob Marley Stay With Me ...atlantic CD Fe Me Time All Stars The Best Big Youth Version ...pressure sounds CD # denotes version excursion bubblin' under the mic chat:  fe me time all stars - the best of big youth version (pressure sounds) Login or register to post comments", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}