{"relation": [["Artist", "David Bowie", "Pop Levi", "T. Rex"], ["Song Title", "The Jean Genie", "Police $ign", "20th Century Boy"], ["Played When", "Song Begins When the Needle Drops on the Record", "Nina Being Pulled Over by the Cop", "Dr. Rosen Swimming in His Pool"]], "pageTitle": "Alphas Season 1 Episode 1 - Pilot (1x1) - Watch Online - s1 e1 Spoilers", "title": "", "url": "http://www.tvrage.com/Alphas/episodes/1065037511", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 7, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00115-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 810080879, "recordOffset": 810067814, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Music Read the full recap Recap Cameron Hicks is working at a grocery store when he gets a text message with an address. A high-pitched tone plays in the background. A woman asks him for directions and then casually says that it’s time to kill. Cameron goes into the back and his boss makes casual conversation, and then says that it’s time to kill and Cameron should pull the trigger... Bill Harken As Malik Yoba Nina Theroux As Laura Mennell Rachel Pirzad As Azita Ghanizada Cameron Hicks As Warren Christie Gary Bell As Ryan Cartwright Dr. Lee Rosen As David Strathairn", "textAfterTable": "Episode Quotes Rosen: Well, hello, Don. Just come right in, please. Don Wilson: You eating grass again? Rosen: Well, it's Asian Pennywort. It increases the blood flow and oxygen to the brain. It's quite an eye-opener. Want a bite? Don Wilson: I don't eat shrubs. Rosen: I understand, but my group... Don Wilson: Has deniability, Rosen. It doesn't technically exist. So you do this for me and don't bust my balls. Rosen: So refreshingly candid. Jeannie Harken: I love you. Bill: (to his wife) I feel sorry for you, woman. Gary: I'm putting my lunch in the refrigerator. Nina: Hi, Gary. Bill: Hi, Gary. Gary: Good morning. My mother doesn't want me to eat fast food so I have to eat what she makes me. Bill: Got it. Gary: And that's why my name is on it. Don't eat what's inside my bag. Bill: So, what you're saying is I can eat your sandwich. Gary: No, don't. That's my name. Bill: No, I changed my name to Gary. Nina: Bill... Bill: I'm joking. It's a joke.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}