{"relation": [["Rank", "1", "2", "3", "4", "5"], ["Name", "AARP The Magazine", "AARP Bulletin", "Costco Connection", "Game Informer", "Better Homes And Gardens"], ["Circulation", "22,274,096", "22,244,820", "8,654,464", "7,629,995", "7,615,581"], ["Founded", "1958", "1960", "?", "1991", "1922"], ["Publisher", "AARP", "AARP", "Costco Wholesale", "GameStop", "Meredith"]], "pageTitle": "Todd's blog | an occasionally interesting blog", "title": "", "url": "http://toddmgreen.com/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00050-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 240660143, "recordOffset": 240629431, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{14384=This is post #27 for the year, so I averaged one post every two weeks. In 2014 this blog had 6,789 views, which is +10% up on 2013. Thank you for reading! Do sign up for posts by email, or follow me on Twitter for new & old posts, plus a bunch of other nonsense., 27232=The first two reasons are easy to see in the overall numbers. 2014 was a big year: 1.5x more miles than 2013, and over 5x more than 2012. In 2014 I did my first marathon (Manchester, 6 April), and then the Monster Month – which comprised six half marathons on six consecutive weekends (1 training run, 4 half marathon races and 1 Tough Mudder, September-October)., 27773=February 2014 is certainly an outlier. Doing 123km in a month meant an average run of 15km every 3 days. Just thinking about it makes my knees hurt., 36057=My next QS project is about health. Every day since 1 January, I’ve been tracking my body fat %, plus recording what exercise I’ve done, and noting down any ‘bad’ things I’ve eaten/drunk., 530=The Watchtower: Public Edition, which has been produced and distributed by Jehovah’s Witnesses since 1879, now has an average monthly print run of 53m copies. That’s about 1 for every 142 people on Earth., 16050=No doubt I have made all of these errors (and invented some new ones) since starting this blog in 2011. But at this time of year I like to offer you, dear reader, a short list of the most popular posts published in the past 12 months., 29550=In 2014 I did 56 runs, averaged 1:00 hours per run, and covered nearly 400 miles – enough to get me from central London to Aberdeen, Galway, Limouges, Frankfurt, Bremen, or deep deep deep under the North Sea., 14561=So, posts written on the basis of hard-won experience and research triumphed… I suppose I should ditch my clickbait-listicle content strategy for 2015., 29316=I’ve been digging into the data – first for 2014, then all the way back to April 2012 when I first started using the Nike+ app – to see what the patterns are., 26286=But while the running data is interesting, it’s not the full story. The charity element – reason number 3 for all that running back in February 2014 – is important too., 26510=Overall, since starting to track my running in 2012, I’ve done a total of 123 runs, covered 1,153km = 716 miles, and logged almost 100 hours on the road. That would get me to Barcelona, Bologna, or Oslo., 48991=Water fountain dating back to 1853, adorned by Biblical quote. Historically interesting! And possibly significant!}", "TableContextTimeStampAfterTable": "{9952=The poppies on display at the Tower of London (in November 2014) only commemorate British army casualties – about 8% of the total WWI dead. What about the other 8-9m soldiers who died? I wear my poppy for all of them, British and beyond., 4008=Second, it’s free. Until 1990, The Watchtower carried a fee of $0.25 in the US. After a question was raised over the whether religious literature should be subject to taxation, the decision was made to make the magazine free, and now it is funded by voluntary donations from Jehovah’s Witnesses and members of the public.}", "textBeforeTable": "The only verification I could find for the 53m number is from the publishers themselves. But I suspect that it really is the biggest because when I checked the monthly circulation figures for other big magazines, they’re much much smaller. Here’s the top five in the US: The Watchtower: Public Edition, which has been produced and distributed by Jehovah’s Witnesses since 1879, now has an average monthly print run of 53m copies. That’s about 1 for every 142 people on Earth. Yep, that’s right! toddmgreen | Leave a Comment | 30 November 2014 11:49 What is the highest circulation magazine in the world? Tagged: apps, homescreen, iphone, mobile, websites | Posted in: Media, Mobile, Personal, Product development, Social, Technology, Ways of living", "textAfterTable": "The Watchtower: Public Edition also appears to be much larger than anything outside the US. The biggest magazine in India (Mathrubhoomi) records a circulation of 800k. I couldn’t find any data for China – perhaps there is a huge magazine there of which I’m not aware (please let me know if so). But top magazine circulation does not correspond to population size. For example: the Netherlands’ top magazine is AutoPrimeurs with 6m among a population of 16.8, whereas Cosmopolitan in Russia circulates 980k copies among a population of 144m. Curiously, different magazine topics top the list in different countries: Cooking – Canada TV – France Cars – Germany, Netherlands, New Zealand Celebrities – Russia, Spain In other countries, there are either more general, or organisation-specific magazines topping the list: Australian Women’s Weekly – well, Australia The National Trust Magazine – UK AARP The Magazine – US So, how did The Watchtower’s circulation get so big? For sure there is a sense of mission – the subtitle of the magazine is ‘Announcing God’s Kingdom’. Second, it’s free. Until 1990, The Watchtower carried a fee of $0.25 in the US. After a question was raised over the whether religious literature should be subject to taxation, the decision was made to make the magazine free, and now it is funded by voluntary donations from Jehovah’s Witnesses and members of the public. Third, it’s efficient. Production of so many copies must be very expensive. But distribution is relatively cheap, since at local level", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}