{"relation": [["Artist", "Buddy", "Imani Coppola", "Kate Nash", "The Magic Numbers", "Miss Li", "New Buffalo"], ["Song Title", "Say a Lot", "Raindrops from the Sun (Hey Hey Hey)", "Merry Happy", "Let Somebody In", "Don't Try to Fool Me", "Cheer Me Up Thank You"], ["Played When", "Trying to Convince a Patient to Do Unusual Surgery", "Opening Scenes, Space Needle, Callie Sleeping", "Meredith Exits Patient's Room, Plays Almost to End", "Webber Praises George, About to do Awake Surgery", "George Still Holding onto the Wedding Dress", "Izzie Looks Around, Hospital, Girl Explains Dress"]], "pageTitle": "Grey's Anatomy Season 4 Episode 6 - Kung Fu Fighting (4x6) - Watch Online - s4 e6 Spoilers", "title": "", "url": "http://www.tvrage.com/Greys_Anatomy/episodes/607459", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00087-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 800734125, "recordOffset": 800717731, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Music Trivia: The runtime for this episode, not including commercials, is about 47 minutes, which is 4 minutes longer than usual. Ratings: 19.31 Million Viewers Episode Notes Click here to add a recap for Kung Fu Fighting Next Episode --> <-- Previous Episode Recap Dr. Isobel \"Izzie\" Stevens As Katherine Heigl Dr. Cristina Yang As Sandra Oh Dr. George O'Malley As T.R. Knight Dr. Mark Sloan As Eric Dane Dr. Lexie Grey As Chyler Leigh Dr. Erica Hahn As Brooke", "textAfterTable": "Episode Quotes Meredith: (opening voiceover) There’s this thing about being a surgeon. Maybe it’s pride, or maybe it’s just about being tough. But a true surgeon never admits they need help, unless absolutely necessary. Surgeons don’t need to ask for help because they are tougher than that. Surgeons are cowboys, rough around the edges, hardcore. At least that’s what they want you to think. Derek: She doesn't let me take care of her. That's not my job anymore. She won't let me. Cristina: I'm taking care of her. Meredith: I can't stop, Cristina. I can't stop seeing Derek. It's not about the sex. It's not about the sex, it's about that moment afterward. The world stops, just feels so safe, so safe. I'm not ready to give that up. Does that make me sad, weak, and pathetic? Cristina: A little bit. Meredith: What do I do? Cristina: I don't know. Mark: What exactly is a gentlemen's evening? Derek: I don't know. It's an evening, with gentlemen. Mark: And strippers? Derek: Nah, I don't think the Chief meant strippers. Mark: Sure sounds like strippers. Dr. Bailey? What is the first thing that comes to", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}