{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"], ["Name", "Five", "She's Different", "The Lady Is a Tramp", "Tenderly", "Blues for Three Horns", "I Remember You", "Lullaby of the Leaves", "A Shoulder to Cry On", "At Home With the Blues", "There Will Never Be Another You", "Portrait of Ravi", "Body and Soul", "I Can't Get Started", "Gone With the Wind", "The Explorer", "If I'm Lucky", "The Chant", "Villa Jazz", "Zonk", "Blues for Five", "Third Moon", "For Pete's Sake", "Just One of Those Things", "Franzy Pants"], ["Artist", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans", "Tony Scott & Bill Evans"], ["Time", "7:46", "3:33", "4:00", "4:38", "6:12", "3:31", "8:56", "3:01", "3:11", "4:35", "4:22", "4:50", "6:57", "6:01", "6:30", "3:04", "3:37", "4:50", "5:33", "4:51", "7:39", "6:44", "7:33", "7:23"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - A Day in New York by Tony Scott & Bill Evans", "title": "", "url": "https://itunes.apple.com/fi/album/the-explorer/id462041744?i=462041778", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00093-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 879147055, "recordOffset": 879121025, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{148977=Copyright © 2014 Apple Inc. Kaikki oikeudet pidätetään., 46969=Tony Scott led several small groups of various sizes during the month of November 1957, resulting in three separate LPs being issued by Seeco, Carlton, and Perfect without duplicating any of the 24 tracks. This Fresh Sound two-CD set collects everything recorded during these sessions. Scott's core group features pianist Bill Evans (not long after he was discharged from military service), either Milt Hinton or Henry Grimes on bass, and drummer Paul Motian. In addition to his powerful clarinet, Scott plays a potent baritone sax on six selections. The music includes a few standards, a handful of originals by Scott, and some obscure compositions. Trombonist Jimmy Knepper is a guest on several songs, providing a perfect foil for the leader in a snappy take of \"The Lady Is a Tramp,\" with the soloing on clarinet and baritone saxophonist Sahib Shihab following Knepper. Trumpeter Clark Terry (still with Duke Ellington at the time) blows a very soft solo in a subdued arrangement of \"Tenderly.\" Even though Evans was yet to make his mark as a leader or composer, his \"Five\" is heard in extended form rather than as a brief signoff as he played on early recording dates of his own. He also solos brilliantly in \"There Will Never Be Another You.\" The title to this collection is a bit misleading, as trustworthy discographies list these sessions as being recorded over several days. Because obtaining each of the originally issued LPs is likely to be very expensive for collectors, this comprehensive CD set is the better alternative., 48666=Born: 17 June 1921 in Morristown, NJ}", "lastModified": "Fri, 31 Jul 2015 07:52:23 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Tony Scott & Bill Evans A Day in New York iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from A Day in New York by Tony Scott & Bill Evans, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes", "textAfterTable": "24 Songs Album Review Tony Scott led several small groups of various sizes during the month of November 1957, resulting in three separate LPs being issued by Seeco, Carlton, and Perfect without duplicating any of the 24 tracks. This Fresh Sound two-CD set collects everything recorded during these sessions. Scott's core group features pianist Bill Evans (not long after he was discharged from military service), either Milt Hinton or Henry Grimes on bass, and drummer Paul Motian. In addition to his powerful clarinet, Scott plays a potent baritone sax on six selections. The music includes a few standards, a handful of originals by Scott, and some obscure compositions. Trombonist Jimmy Knepper is a guest on several songs, providing a perfect foil for the leader in a snappy take of \"The Lady Is a Tramp,\" with the soloing on clarinet and baritone saxophonist Sahib Shihab following Knepper. Trumpeter Clark Terry (still with Duke Ellington at the time) blows a very soft solo in a subdued arrangement of \"Tenderly.\" Even though Evans was yet to make his mark as a leader or composer, his \"Five\" is heard in extended form rather than as a brief signoff as he played on early recording dates of his own. He also solos brilliantly in \"There Will Never Be Another You.\" The title to this collection", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}