{"relation": [["Position", "1", "4", "5", "6", "7", "11", "22", "32", "35", "44", "45", "46", "47"], ["Title", "Tales of Destiny", "Final Fantasy VI Advance", "The Legend of Zelda: Twilight Princess", "Summon Night 4", "Pokémon Diamond", "Pokémon Pearl", "Disgaea Portable", "Jeanne d'Arc", "Digimon Sabers Another Mission", "Super Robot Wars XO", "Boktai DS", "Final Fantasy V Advance", "Final Fantasy III"], ["Publisher", "Namco Bandai", "Square Enix", "Nintendo", "Banpresto", "Nintendo", "Nintendo", "Nippon Ichi", "SCE", "Namco Bandai", "Namco Bandai", "Konami", "Square Enix", "Square Enix"], ["Platform", "", "", "", "", "", "", "", "", "", "", "", "", ""]], "pageTitle": "RPGamer > Japandemonium > December 14, 2006", "title": "", "url": "http://rpgamer.com/news/japan/jj121406.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00303-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 204410391, "recordOffset": 204390171, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{14773=In a related story, Square Enix also has a plush Chocobo complete with magic picture book for 1800 yen on its online store.}", "textBeforeTable": "Those wondering how the Wii fared, Wii Sports took the silver with Hajimete no Wii earning third place honors. Aside from that, I'll let the numbers speak for themselves. This week was actually a really surprising week. It looked like the chart would be all but empty this time around, but amazingly enough, it's overflowing with RPGs. Another cool fact is that every current system is on there with an RPG except for the GameCube. Dengeki Rankings That said, let's get this party started! As for this week's title, it means 'clean' or 'pretty' in Japanese. Considering I'm using a brand new template that was whipped up for me by Theo Litowski, possibly better known by some of you as Vigivalgus or as the new author of Currents. At RPGamer, we're always evolving and improving, and I think the new template is quite nice. So thanks again for the best template I've used yet, Vigi. With that new date in mind, I do not think I'll be able to get a column out the door next week. I will be traveling to Indiana for Christmas, and then we'll be going to Houston for New Year's Day. I will see if I can't whip up something for Christmas day. It'll be a Culture Corner update, and if possible, I'll throw in a picture update. I'll need", "textAfterTable": "Source: Dengeki Dragon Quest Battles For 100 Yen Coins With the recent announcement of Dragon Quest IX, another addition to the Dragon Quest family has gone largely unnoticed. Dragon Quest Battle Road will soon be hitting arcades, known as game centers in Japan. The game features 3-on-3 monster teams as they do battle in a coliseum, similar to the one seen in Dragon Quest VIII. To assemble your crack team, players will purchase collectable cards with bar codes that will be scanned in, not unlike Mushi King, a game that has swept the country and is popular with just about every elementary school boy and sizable number of the girls as well. Though the game's mechanics have yet to be announced, there are two buttons on each side that will likely correspond to something akin to the three attack system seen in other card battlers that is based on janken. The size of the actual box has also not been shown, but it is likely to be bigger than the other similar games to accommodate an older audience. Given Japan's love for arcade battle games that use collectable cards and their love for all things Dragon Quest, I predict this to be smash success. Though I never quite understood Mushi King, I actually would have played a very", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}