{"relation": [["", "1", "2", "3"], ["Name", "Space Bird (Dubfire Deep Space Remix)", "Space Bird (Liquid Soul Remix)", "Space Bird"], ["Artist", "System 7", "System 7", "System 7"], ["Time", "9:11", "7:32", "7:18"], ["Price", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Space Bird - EP by System 7", "title": "", "url": "https://itunes.apple.com/lt/album/space-bird-ep/id268754921", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00305-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 876025383, "recordOffset": 876005109, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{6555=Formed: 1990 in London, England, 102433=© „Apple Inc.“, 2014. Visos teisės saugomos.}", "lastModified": "Sat, 01 Aug 2015 04:43:58 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist System 7 Space Bird - EP iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Space Bird - EP by System 7, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes", "textAfterTable": "3 Songs Biography Formed: 1990 in London, England Genre: Electronic Years Active: '90s, '00s The only direct link from the '90s ambient house community to its space rocking forebear of the '70s, Steve Hillage played in the prog rock band Gong, released several solo albums during the late '70s and early '80s on Virgin, and later returned to music in the '90s to form System 7, more of a recording collective than an actual band. Hillage was recruited back to the music scene by Dr. Alex Paterson of the Orb, who spun Hillage's Rainbow Dome Musick at London's Heaven one night while Hillage was... Full bio Top Albums and Songs by System 7 1. Point 3 Fire Album", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}