{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Title", "Arlene and Jeff Erotica", "Princes of Mannsborough", "What Happens in Carcosa... Action/Adventure", "The Blood Pact Fantasy", "Mistress Watching", "Video Tape", "Cold Steele Action/Adventure", "Chrissie", "Marline Becomes A Slut", "The Crusader Chapter 9 My Brother's Keeper Action/Adventure"], ["Author", "RoustWriter", "Vulgar Argot", "Stultus", "Kim Logan", "Tallorder64", "The Wanderer", "woodmanone", "StangStar06", "Linda Jean", "woodmanone"], ["Description", "While Jeff is away finalizing the sale of his invention, a local bully coerces Jeff's wife and daughter into having sex. Jeff has to put his family back together and clean up the situation with the bully, while at the same time, moving to a retreat that they are converting to an enormous home, high in the Rocky Mountains. He has to juggle keeping his family going, while protecting the secret of the healer, and where it came from. Smoking fetish. Tags: Ma/Fa, Ma/ft, Fa/Fa, Fa/ft, Consensual, Romantic, Coercion, Blackmail, Heterosexual, Science Fiction, Extra Sensory Perception, Incest, Mother, Father, Daughter, Spanking, Group Sex, Harem, First, Oral Sex, Lactation, Size, Slow Sex Contents: Much Sex Posted: 2006-11-13 in progress Updated: 2015-07-31 / (Review)", "A Mannsborough Chronicle (1) A tale of blackmail, betrayal, romance, espionage, and revenge at Mannsborough High. Tags: Ma/Fa, Fa/Fa, Mult, Teenagers, Consensual, Romantic, Reluctant, Rape, Blackmail, Drunk/Drugged, BiSexual, DomSub, FemaleDom, Light Bond, Humiliation, Gang Bang, First, Oral Sex, Anal Sex, Masturbation, Petting, Voyeurism, Violent Sex Contents: Much Sex Posted: 2004-05-19 Concluded: 2004-06-14 / (Review)", "A Love in Lovett County Story (11) Yellow Neon Lights - Part One. A resourceful Vegas Casino IT Manager discovers what his crime boss employer and family have been up to and loses his taste for voyeurism - and nearly his life! Mobsters, Morbid Mysteries and Mormon Death Squads, oh my! Grizzly revenge and the costs of loyalty lead to his hope for redemption, however unlikely in Lovett, Texas. This is a long slow developing story that is the start for several extremely critical Lovett County tales. Some sex later in the story. Tags: Ma/Fa, Romantic, Coercion, Blackmail, Horror, Mystery, Zombies, Slut Wife, Cuckold, BDSM, Rough, Oral Sex, Anal Sex, Food, Water Sports, Voyeurism, Slow, Violent Sex Contents: Some Sex Posted: 2009-08-25 Concluded: 2009-09-05", "When a desperate servant in the king's castle finds himself deeply in debt, he makes a hasty deal with the court wizard to hide him. However, he neglects to comprehend the details of what he's asking and finds himself transformed into a woman. Soon his new appearance draws him into all manner of court intrigue and erotic encounters. Tags: Ma/Fa, Fa/Fa, Ma/Ma, Consensual, Romantic, Reluctant, Rape, Coercion, Blackmail, Drunk/Drugged, Magic, Lesbian, BiSexual, TransGender, CrossDressing, Fiction, Rough, Gang Bang, Group Sex, White Couple, Black Female, White Male, White Female, First, Oral Sex, Anal Sex, Masturbation, Public Sex, Violent, Transformation Sex Contents: Some Sex Posted: 2011-06-25 Concluded: 2012-08-15", "Ed Hanson screws up a private detective job and helps a minister's daughter out of a jam. He stumbles onto a corrupt city administration. Tags: Ma/Fa, Consensual, Romantic, Rape, Blackmail, Heterosexual, BDSM, Humiliation, Gang Bang, Interracial, Slow Sex Contents: Some Sex Posted: 2002-06-25 / (Review)", "Unexpectedly, but not for the first time, a videotape turns up in a guys office in-tray one morning. What kind of ramifications is it going to have on his life, this time? Tags: Ma/Fa, NonConsensual, Blackmail, Cheating, Interracial, Black Male, White Female, Oral Sex, Anal Sex Sex Contents: No Sex Posted: 2006-11-06 Concluded: 2007-01-09 / (Review)", "Private Investigator Matt Steele Matt is hired by a rich man to find a blackmailer Tags: Romantic, Blackmail Sex Contents: No Sex Posted: 2012-03-07 / (Review)", "My version of the Strange car in the driveway Story Tags: Ma/Fa, Consensual, Romantic, Coercion, Blackmail, Paranormal, Cheating, Gang Bang, Violent Sex Contents: Some Sex Posted: 2011-02-17", "Marline is the wife of a minister; she gets kidnapped, then blackmailed, and hooked on a sex drug. She fucks anyone, anything at anyplace she can. Toys, men, boys, and dogs. Tags: Ma/Fa, Fa/Fa, Mult, Reluctant, Blackmail, Mind Control, Drunk/Drugged, BiSexual, Slut Wife, Sister, Humiliation, Gang Bang, Group Sex, Oral Sex, Anal Sex, Masturbation, Sex Toys, Bestiality, Cream Pie, Exhibitionism, Voyeurism Sex Contents: Much Sex Posted: 2001-09-20 Concluded: 2001-12-22", "The Crusader---Detective Rollie Chambers Rollie proves he is his brother's keeper Tags: Blackmail, Mystery Sex Contents: No Sex Posted: 2012-08-04"], ["Size", "13430 KB", "1318 KB", "278 KB", "701 KB", "160 KB", "171 KB", "95 KB", "95 KB", "275 KB", "87 KB"], ["Dnlds", "2968551", "45867", "15134", "19221", "9979", "21417", "7150", "8292", "54182", "2865"], ["Votes", "4197", "350", "431", "239", "244", "359", "826", "605", "126", "355"], ["Score", "9.18", "8.92", "8.29", "8.21", "8.09", "8.04", "8.01", "7.99", "7.98", "7.96"]], "pageTitle": "Blackmail Stories - Page 1 of 45 - at Storiesonline", "title": "", "url": "http://storiesonline.net/stories/bytag/blackmail", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00033-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 236119018, "recordOffset": 236110816, "tableOrientation": "HORIZONTAL", "textBeforeTable": "1 2 3 4 5 More? Need Login + Premier Displaying stories 1 through 10 of 444 Blackmail Stories Show All Tags Settings 2015-08-03 / 01:08:11 pm EDT [GMT -0400] Twitter Forum Feeds Universes Blogs Reviews Contests Advanced Search Category Search Alphabetical Authors My Library Updates New Stories Authors/Editors Home Help Webmaster Log In 📱 jump to contents The site's javascripts are blocked. This disables some functionality on the site.", "textAfterTable": "1 2 3 4 5 More? Need Login + Premier", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}