{"relation": [["", "1", "2", "3"], ["Name", "Yellow River", "San Bernadino", "Iron Horse"], ["Artist", "Christie", "Christie", "Christie"], ["Time", "2:47", "3:00", "2:49"], ["Price", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Christie - Their Very Best - EP by Christie", "title": "", "url": "https://itunes.apple.com/bg/album/christie-their-very-best-ep/id277706880", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00108-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 882616007, "recordOffset": 882590322, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{6616=Formed: 1970 in London, England, 110465=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 04:03:11 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Christie Christie - Their Very Best - EP iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Christie - Their Very Best - EP by Christie, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on", "textAfterTable": "3 Songs Biography Formed: 1970 in London, England Genre: Pop Years Active: '60s, '70s Leeds-born Jeff Christie (b. 1946) entered music by way of a skiffle band that eventually moved into rock & roll, taking the name the Outer Limits. They eventually cut a pair of singles, before breaking up, and Jeff Christie decided to try a career as a songwriter. His demo tape made its way to Tremeloes' guitarist Alan Blakely, and happened to be heard by his brother, drummer Mike Blakely, formerly of the Epics and the Acid Gallery. Both were impressed enough with Christie's songs to arrange... Full bio Top Albums and Songs by Christie 1. Christie - Their Very Best - EP", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}