{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"], ["Name", "Round Here", "Omaha", "Mr. Jones", "Perfect Blue Buildings", "Anna Begins", "Time and Time Again", "Rain King", "Sullivan Street", "Ghost Train", "Raining in Baltimore", "A Murder of One"], ["Artist", "Counting Crows", "Counting Crows", "Counting Crows", "Counting Crows", "Counting Crows", "Counting Crows", "Counting Crows", "Counting Crows", "Counting Crows", "Counting Crows", "Counting Crows"], ["Time", "5:31", "3:39", "4:32", "5:00", "4:31", "5:14", "4:15", "4:29", "4:03", "4:41", "5:45"], ["Price", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - August and Everything After by Counting Crows", "title": "", "url": "https://itunes.apple.com/ca/album/mr.-jones/id364936?i=364916&v0=TMsongsCA&ign-mpt=uo%3D4", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00073-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 881953103, "recordOffset": 881925183, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{2019=We are unable to find iTunes on your computer. To preview and buy music from August and Everything After by Counting Crows, download iTunes now.}", "TableContextTimeStampAfterTable": "{23881=Formed: August, 1991 in San Francisco, CA, 122515=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 09:07:13 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Counting Crows August and Everything After iTunes for Mac + PC Already have iTunes? Click I have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from August and Everything After by Counting Crows, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store…", "textAfterTable": "11 Songs Editors’ Notes San Francisco’s Counting Crows’ debut album was a classic rock radio programmer’s dream. The album contains an overabundance of magical ideas, from the opening, unwinding drama of “Round Here” that suggests Springsteen at his most lyrical and theatrical, through the Band-Van Morrison jaunt of “Omaha,” the rollicking yet yearning “Mr. Jones” and the moody life-or-death introspection of “Perfect Blue Buildings,” “Anna Begins” and “Sullivan Street.” Customer Reviews Over and Over and Over and Over           by CrickettPower I was living in Thailand when this album was released and it was one of the only cassettes I owned at the time....yes, I said cassettes. Anyway, I would listen to it constantly and on long trips to Malaysia for a new tourist visa, I would listen to it for hours at a time, over and over and over again. I NEVER got tired of it and to this day it is one of my favourite albums of all time - every song is worthy! For sure one of the 10th best 90's album !!!", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}