{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14"], ["Name", "The Riverbank", "London Is the Reason", "Leeches", "ExplicitBlack Eyes", "ExplicitI Dread the Night", "ExplicitDeath Voices", "The Vulture (Acts I & II)", "The Riverbed", "ExplicitThe Great Forgiver", "Graves", "ExplicitQueensberry Rules", "ExplicitMisery", "ExplicitCrucifucks", "Sick of Feeling Sick (Live At the Macbeth)"], ["Artist", "Gallows", "Gallows", "Gallows", "Gallows", "Gallows", "Gallows", "Gallows", "Gallows", "Gallows", "Gallows", "Gallows", "Gallows", "Gallows", "Gallows"], ["Time", "2:29", "3:11", "3:46", "2:51", "3:38", "3:54", "6:02", "3:57", "2:14", "2:42", "4:15", "5:09", "7:59", "4:05"], ["Price", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Grey Britain by Gallows", "title": "", "url": "https://itunes.apple.com/au/album/grey-britain/id314518667", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00039-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 882980743, "recordOffset": 882953218, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{26153=It's no easy task to follow up a record that harvested as much hype as the Gallows' biting 2006 debut, Orchestra of Wolves. Many music mags (Kerrang! and NME, especially) touted the band as the second coming of hardcore punk and the praises were well-founded. Drenched in irony, Frank Carter's frighteningly hedonistic lyrics matched the icky literary prowess of Bret Easton Ellis' American Psycho, and the group's savage intensity recalled early U.K. punk and American hardcore at its finest. After touring some arena-sized festivals, Warped Tours, and whatnot, they rethought their plans of attack for their sophomore attempt, Grey Britain, and ultimately came to a decision to revamp their sound with a metal edge. There's the same screaming angst and relentless speed that was celebrated in their first outing, but now Carter's shrieks are backed by double kick drums and explosive speed metal guitar riffs that have more in common with Slayer and early Metallica than Black Flag or the Exploited. Shifting into metalcore territory is a tricky decision, since a lot of their initial appeal was due to the fact that they were making their own personal stamp on revitalizing punk — a genre that's becoming increasingly saturated with commercialism. Here, they seem less unique. Part of this can be attributed to producer GGGarth, the man responsible for making Mudvayne, Slipknot, and Atreyu come alive on disc. Brittle guitar tones and off-kilter rhythms are substituted for thick, beefy tones and massive group shouts on the choruses, resulting in songs like \"We Are the Night\" and \"Graves.\" In the disc's most unlikely moment, \"The Vulture (Acts I & II)\" begins with two minutes of a sweetly sung, soothing acoustic ballad — complete with strings — before flipping into a tight, furious, headbanging anthem. Those not banging their heads will likely be scratching them, wondering what the Gallows are really all about and where they're headed next., 29060=Formed: 2005 in Watford, England, 127826=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 04:02:14 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Gallows Grey Britain iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Grey Britain by Gallows, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "14 Songs Album Review It's no easy task to follow up a record that harvested as much hype as the Gallows' biting 2006 debut, Orchestra of Wolves. Many music mags (Kerrang! and NME, especially) touted the band as the second coming of hardcore punk and the praises were well-founded. Drenched in irony, Frank Carter's frighteningly hedonistic lyrics matched the icky literary prowess of Bret Easton Ellis' American Psycho, and the group's savage intensity recalled early U.K. punk and American hardcore at its finest. After touring some arena-sized festivals, Warped Tours, and whatnot, they rethought their plans of attack for their sophomore attempt, Grey Britain, and ultimately came to a decision to revamp their sound with a metal edge. There's the same screaming angst and relentless speed that was celebrated in their first outing, but now Carter's shrieks are backed by double kick drums and explosive speed metal guitar riffs that have more in common with Slayer and early Metallica than Black Flag or the Exploited. Shifting into metalcore territory is a tricky decision, since a lot of their initial appeal was due to the fact that they were making their own personal stamp on revitalizing punk — a genre that's becoming increasingly saturated with commercialism. Here, they seem less unique. Part of this can be attributed to producer GGGarth, the", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}