{"relation": [["", "1", "2", "3", "4"], ["Name", "Mourning Of The Earth", "Young And Innocent", "Not My Kind", "Black Magic"], ["Artist", "ASG", "ASG", "ASG", "ASG"], ["Time", "4:05", "4:14", "2:40", "4:16"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Low Country - EP by ASG", "title": "", "url": "https://itunes.apple.com/us/album/mourning-of-the-earth/id475659469?i=475659473", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00202-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 866116559, "recordOffset": 866095893, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{61980=Copyright © 2014 Apple Inc. All rights reserved., 8972=Formed: 2001 in Wilmington, NC}", "lastModified": "Sat, 01 Aug 2015 03:57:37 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist ASG Low Country - EP iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Low Country - EP by ASG, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "4 Songs Customer Reviews ASG           by tmski12 Love ASG and this is sick, wish they would come out with a new album or ep soon! I love going to there shows and these songs have that crisp classic ASG sound and guitar riffs Biography Formed: 2001 in Wilmington, NC Genre: Rock Years Active: '00s, '10s Based out of Wilmington, North Carolina, hard-hitting Southern rockers ASG formed in 2001 around the talents of Jason Shi (vocals, guitar), Andy Ellis (bass), Scott Key (drums), and Jonah Citty (guitar). The quartet, who employ a muscular blend of punk, southern rock, and alt/stoner metal that has drawn comparisons to artist like Queens of the Stone Age, Torche, and Tool, self-released their eponymous debut/demo in 2002 before inking a deal with Volcom Entertainment and issuing their official debut,... Full Bio Top Albums and Songs by ASG", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}