{"relation": [["Language", "BAKOKO", "BAKOKO"], ["Title", "Bakoko Orthography Guide", "The lexical phonology of Bakoko"], ["Author", "NJECK, Mathaus Mbah; and Stephen C. ANDERSON", "KENMOGNE, Michel"], ["Year", "2010", "2000"], ["Pages", "16", "348"], ["Size", "250", "8847"]], "pageTitle": "SIL Cameroon branch - Languages & Publications - Languages", "title": "", "url": "http://www.silcam.org/languages/languagepage.php?languageid=44", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00327-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 718081638, "recordOffset": 718073436, "tableOrientation": "HORIZONTAL", "textBeforeTable": "These electronic publications are published by SIL Cameroon. They represent the concrete results of research carried out by SIL field members and others. Some are preliminary work papers and not polished research. They are based on field notes and are in some cases the work of young researchers with minimal training. Language policy proposals included in technical documents do not necessarily represent the position of SIL Cameroon.The following publications are available as PDF files. The titles are links to the actual files, which you may view using Acrobat Reader or save to your own disk. Disclaimer Publications in PDF format There is no lexicon/dictionary in HTML format available. Lexicon/Dictionary in HTML format For key information refer to the SIL Ethnologue Key Information BAKOKO (Cameroon) News archive News Events agenda News & Events Publications posted recently Published books SIL Publications Publications Language cluster map Language map Languages Languages & Publications Proverbs", "textAfterTable": "Speech There is no Speech available. Links to Published booksThere are no Links to Published books available. Links to SurveysThere are no Links to Surveys available. top top contact sitemaster updated: 2009-09-24", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}