{"relation": [["Position", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Title", "Grand Theft Auto: San Andreas", "Medal of Honor: European Assault", "Batman Begins", "Juiced", "Batman Begins", "Star Wars Episode III: Revenge of the Sith", "Medal of Honor: European Assault", "Destroy All Humans!", "Juiced", "Midnight Club 3: DUB Edition"], ["Publisher", "Rockstar Games", "Electronic Arts", "EA Games", "THQ", "EA Games", "LucasArts", "Electronic Arts", "THQ", "THQ", "Rockstar Games"], ["Platform", "", "", "", "", "", "", "", "", "", ""]], "pageTitle": "RPGamer > Currents", "title": "", "url": "http://www.rpgamer.com/news/currents/2005/column/eg062505.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 11, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00122-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 684740575, "recordOffset": 684722828, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{41937=The gaming software market in the U.S., EMEA (Europe, Middle East, Africa), Asia, Latin America, and Canada will grow from $25.4 billion in 2004 to $54.6 billion in revenues for 2009, according to PWC analysts. Asia/Pacific, the largest of the markets at $10.1 billion revenue during 2004 alone, is \"projected to maintain its leadership, growing by 18.0 percent on a compound annual rate through 2009, reaching $23.1 billion.\" The United States, which raked in $8.2 in revenues during 2004, is expected to experience a growth by more than 12 percent., 41519=As for causes of the growth, the report cited: \"The next generation of game consoles should have a major impact on the market in 2006 and 2007. The introduction of handheld game consoles and their associated games will buttress the console game market in 2005. The next generation of consoles, with their embedded online capabilities, will also have a positive effect on the demand for online games.\", 40795=The analysts over at PricewaterhouseCoopers have predicted, in the company's Global Entertainment and Media Outlook: 2005-2009 report, that the global entertainment and media industry will grow at compound growth rate of 7.3 percent. The analysts noted 2004 revenues of $1.3 trillion for the industry and project that the spending will rise as high as $1.8 trillion in the sectors in 2009., 44678=Parentheses denote negative numbers. Prices as of market closing 06.24.2005, 36816=The Nikkei BP report also went on to predict that the PlayStation 3 could be out by the end of 2005. But it goes on to say that full-scale production isn't likely to begin until 2006., 36462=Since this report was released, it was vehemently denied by Sony. An SCEA representative said, \"I'm not sure where the 18 million claim came from... We announced in the Sony earnings call that the fiscal year 2005 PSP shipment targets were 12 million units worldwide. We are still on target and there has been no reduction in forecast.\", 26907=Also, Sony has made it clear to British retailers that it plans to apply for an interim injunction to stop the sale of imported PSPs during the months leading up the system's European debut, currently slated for September 1. Sony said that if the retailers stop selling the import PSPs, it will cancel the injunction., 35915=A recent report released by Nikkei BP stated that Sony had reduced its PSP production by 33 percent. Initially, companies that provide Sony with PSP components were told by Sony that it needed enough parts to manufacture the 18 million systems that it planned to ship out during the current fiscal year. The story takes an interesting turn when, in April, Sony released an annual financial report stating that the company had plans to ship out only 12 million PSP units, which is the same number of slimline PS2 units it plans to ship out.}", "textBeforeTable": "Ready for the Top Ten? Let's dance. The Xbox version of Grand Theft Auto: San Andreas retains the number one spot from last week, so congrats to Rockstar. Likewise, EA's new Medal of Honor game retains the number two spot. New to the list, and debuting at number three, is Batman Begins. As a small side note, that movie was freaking awesome. Seriously, in my opinion, it is the best superhero movie to date. Anyway, back to the show. Another new title, THQ's racer, Juiced, is coming in at number five. And Destroy All Humans! enters the fray at number eight. There are many new titles making their debut this week, which is always exciting. What is less-than-exciting, though, is that there are many instances of the same game for different consoles on the list, not to mention the lack of RPGs. I guess you can't win them all. I wish the same could be said about losing them all, though.  Currents Top Ten", "textAfterTable": "Source: GameSpot  PSP Importers Sued Even after having been issued several Cease and Desist orders by Sony Computer Entertainment Europe, independent retailers in Britain continue to sell imported PSP systems to consumers on the European island. As a result, Sony has decided that it's time to back up all its tough talk by taking legal action. A copy of the legal document that Sony's lawyers created states that \"The defendant has infringed each of the claimant's said trade marks by using, without the consent of the claimants, in the course of trade in the United Kingdom, signs identical to the said trade marks.\" The \"said trademarks\" being the 'PS', \"PLAYSTATION', and the symbols for the PlayStation controllers. The document adds, \"By reason of the aforesaid, the claimants have suffered loss and", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}