{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19"], ["Name", "Death's Black Train Is Coming", "Instrumental #1", "Hard Times", "Instrumental #2", "Hills of Mexico", "Instrumental #3", "Silicosis Blues", "Instrumental #4", "Wayside Tavern", "Instrumental #5", "Nicotine Blues", "Instrumental #6", "Death Is Only a Dream", "Instrumental #7", "East Virginia Blues", "Instrumental #8", "Little Girl and Dreadful Snake", "Instrumental #9", "Buzz & Grind"], ["Artist", "Gob Iron", "Gob Iron", "Gob Iron", "Gob Iron", "Gob Iron", "Gob Iron", "Gob Iron", "Gob Iron", "Gob Iron", "Gob Iron", "Gob Iron", "Gob Iron", "Gob Iron", "Gob Iron", "Gob Iron", "Gob Iron", "Gob Iron", "Gob Iron", "Gob Iron"], ["Time", "3:46", "0:56", "3:38", "0:59", "4:42", "0:26", "4:20", "1:13", "4:21", "0:44", "2:58", "0:58", "2:46", "0:43", "3:51", "1:08", "3:17", "1:05", "3:06"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Death Songs for the Living by Gob Iron", "title": "", "url": "https://itunes.apple.com/lv/album/buzz-grind/id202655046?i=202655890", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00182-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 871582887, "recordOffset": 871555708, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{34874=After searching for a new creative focus during the first half of the new millennium with a handful of disappointing solo albums, Jay Farrar finally hit a groove again by taking a step backward and reviving his band Son Volt on the 2005 album Okemah and the Melody of Riot. Okemah was Farrar's strongest music since Son Volt's 1995 debut, and in 2006 he once again played to his strengths by gesturing toward his musical past with a new project, Gob Iron. Gob Iron finds Farrar collaborating with singer and multi-instrumentalist Anders Parker of Varnaline, but in many ways their first album feels like a variation on the themes of Uncle Tupelo's masterful acoustic album, March 16-20, 1992. Like March 16-20, Death Songs for the Living is dominated by traditional folk songs, which in this case have been lyrically and musically fashioned into new shapes by Farrar and Parker, and while the occasional electric instrument drifts in and out of the picture, the arrangements are purposefully spare and celebrate the simplicity of these songs rather than trying to twist them into more elaborate forms. While Parker doesn't take as active a role on this album as Jeff Tweedy did on Uncle Tupelo's acoustic opus, he does contribute powerful lead vocals on \"Hills of Mexico\" and \"Wayside Tavern,\" and there's a undertow of post-rock stoicism (attributable to both Parker and Farrar) that sets this music apart from the modern-folkie simplicity of March 16-20. Gob Iron's album isn't as striking or as immediately powerful as Uncle Tupelo's acoustic effort, if only because Farrar has walked a similar path before, but the music here is strong, deeply felt, and speaks of a genuine commitment to keeping the folk tradition alive through a willingness to challenge its structures; it also reveals Parker is one of the best and most effective collaborators Farrar has brought into the studio since leaving Uncle Tupelo, and this deserves to be more than a one-off project., 125882=Autortiesības © 2014 Apple Inc. Visas tiesības aizsargātas., 36981=Formed: 2004}", "lastModified": "Sat, 01 Aug 2015 04:22:40 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Gob Iron Death Songs for the Living iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Death Songs for the Living by Gob Iron, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop.", "textAfterTable": "19 Songs Album Review After searching for a new creative focus during the first half of the new millennium with a handful of disappointing solo albums, Jay Farrar finally hit a groove again by taking a step backward and reviving his band Son Volt on the 2005 album Okemah and the Melody of Riot. Okemah was Farrar's strongest music since Son Volt's 1995 debut, and in 2006 he once again played to his strengths by gesturing toward his musical past with a new project, Gob Iron. Gob Iron finds Farrar collaborating with singer and multi-instrumentalist Anders Parker of Varnaline, but in many ways their first album feels like a variation on the themes of Uncle Tupelo's masterful acoustic album, March 16-20, 1992. Like March 16-20, Death Songs for the Living is dominated by traditional folk songs, which in this case have been lyrically and musically fashioned into new shapes by Farrar and Parker, and while the occasional electric instrument drifts in and out of the picture, the arrangements are purposefully spare and celebrate the simplicity of these songs rather than trying to twist them into more elaborate forms. While Parker doesn't take as active a role on this album as Jeff Tweedy did on Uncle Tupelo's acoustic opus, he does contribute powerful lead vocals on \"Hills of Mexico\" and \"Wayside", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}