{"relation": [["Side A Titles", "1. Keep Your Eyes Peeled", "2. I Sat By The Ocean", "3. The Vampyre Of Time And Memory"], ["Artist", "Queens of the Stone Age", "Queens of the Stone Age", "Queens of the Stone Age"], ["Length", "05:04", "03:55", "03:34"]], "pageTitle": "Queens of the Stone Age - Like Clockwork [Deluxe Edition] (Vinyl LP) - Amoeba Music", "title": "", "url": "http://www.amoeba.com/like-clockwork-deluxe-edition-lp-queens-of-the-stone-age/albums/2929907/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00259-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 281587627, "recordOffset": 281572067, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{2124=Aaron A., San Francisco 09/01/2013, 1786=06/03/2013}", "TableContextTimeStampAfterTable": "{12084=Copyright © 2015 Amoeba, All Rights Reserved. Amoeba and the Amoeba Music mark and logo are trademarks of Amoeba Music Inc.}", "lastModified": "Sat, 01 Aug 2015 03:43:05 GMT", "textBeforeTable": "Track Listing The latest album from Queens of the Stone Age has longtime fans excited for a number of reasons: it’s their first album in six years; it features high-profile guest appearances (Elton John, Trent Reznor); and it’s the first time since their classic Songs for the Deaf that Dave Grohl’s back on drums for the majority of the album, with former bassist Nick Oliveri singing backup on a couple of tracks. Of course none of that would matter if the songs weren’t as good as they are. Like Clockwork finds Homme and co. in gothic mode, wrapping dark riffs around moody arrangements. “Keep Your Eyes Peeled” struts slowly like an old engine starting, firing off in quick bursts of robot riffery. “The Vampyre of Time and Memory” sees the band engaging in Queen-style rock cabaret, with Homme likely reflecting on months of medical struggles with typically dark humor (“I survive, I speak I breathe, I’m alive, hurray”). Grohl’s metallic disco beat sends “If I Had a Tail” sailing smoothly through its troubled waters. The band brings back the desert-rock magic for “My God is the Sun” and “I Appear Missing,” which will have fans kneeling before them once again after years of quietude from the band. And “Fairweather Friends” is a must-hear, with Homme unleashing some of his finest singing and guitarwork to date as Elton John billows the whole thing with his ever-commanding voice.", "textAfterTable": "Side B Titles Artist Length 1. If I Had A Tail Queens of the Stone Age 04:55 2. My God Is The Sun Queens of the Stone Age 03:55 3. Kalopsia Queens of the Stone Age 04:38 Side C Titles Artist Length 1. Fairweather Friends Queens of the Stone Age 03:43 2. Smooth Sailing Queens of the Stone Age 04:51 Side D Titles", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}