{"relation": [["Author", "ozwalled", "ozwalled", "ozwalled", "ozwalled", "ozwalled"], ["Title", "Kraken the Ice", "Ghost of Starman", "Tessie Sighting!", "Mother 3: Death of the Pig King box art", "Wild N Wooly Shambler"], ["Description", "Third Place-winning entry of Zip Cod Ness's Aug. 2005 Apple of Enlightenment revival. The theme/ prompt was \"What if there was a blizzard in Summers?\". Here, I figured, if there was a blizzard in Summers, why not go all the way and have a major freeze, even extending out to the surrounding waters? This would mean no boat ride to Scaraba, so the Chosen Four would have to bundle up and walk there. But with such a glorious triple pun of a title, you can forget about what lurks under the waves...", "There's something undeniably creepy about the Ghost of Starman, what with that glowing aura around the dark palette of its body. Having recently read the Alex Ross masterpiece \"Marvels\", I'd REALLY loved how he painted Cyclops's visor and tried to borrow a bit of that from memory, here. This is one of my favorite pieces of mine to date, just because it's fairly simple, yet I feel, so very effective.", "There it is! The Loch Tess Monster!", "The winning entry in the Mother 3 boxart contest that was run by Nesskid. Here, I think I did a nifty job of preservingthe Japanese cover theme AND conveying the \"Pig\" theme, with the corkscrew tail.", "The Wild N Wooly Shambler. Wooliness, as it happens, is not really all that easy to draw."], ["Date", "8/29/05", "4/26/05", "8/3/06", "8/18/05", "4/27/05"], ["Rank", "0.00", "0.00", "8.00", "9.00", "8.58"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=976&stuff=DescDESC&stuffPageNumber=11", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00306-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 228644920, "recordOffset": 228636718, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> Z Y W U T S R P O N M L K J I H G F E D C B A 8 7 < Other Submissions by ozwalled Starwoman This image has been resized for your convenience. Click on it to view the full size version. Starwoman Starwoman - by ozwalled  Mother2 Go Back! --> } }", "textAfterTable": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}