{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"], ["Name", "Roman Holiday", "The Marvelous Slut", "Who Invited the Russian Soldier?", "Wanderlust", "For the Record", "White Smoke", "Turtles All the Way Down", "Organ Grinder", "Host Disorder", "After One Quarter of a Revolution", "The Sweet Life"], ["Artist", "Every Time I Die", "Every Time I Die", "Every Time I Die", "Every Time I Die", "Every Time I Die", "Every Time I Die", "Every Time I Die", "Every Time I Die", "Every Time I Die", "Every Time I Die", "Every Time I Die"], ["Time", "2:59", "1:43", "2:45", "4:10", "2:59", "3:00", "2:41", "4:07", "2:29", "2:06", "2:52"], ["Price", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - New Junk Aesthetic by Every Time I Die", "title": "", "url": "https://itunes.apple.com/bg/album/new-junk-aesthetic/id329923407", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00096-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 874764419, "recordOffset": 874735543, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{22433=Formed: 1998 in Buffalo, NY, 122951=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 04:03:25 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Every Time I Die New Junk Aesthetic iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from New Junk Aesthetic by Every Time I Die, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop.", "textAfterTable": "11 Songs Album Review Every Time I Die became one of America's more popular metalcore bands by injecting its unrelentingly brutal, snap-tight brand of heavy music with heavy doses of humor and Southern/stoner rock-style chugging guitar. New Junk Aesthetic, the group's debut on Epitaph Records (after a long tenure on indie Ferret Music), found the group further refining its signature approach with a new sonic clarity and an occasional focus on melodic hooks. That said, the Buffalo, NY-based combo remains bone-crushingly intense, with songs such as \"The Marvelous Slut,\" \"Organ Grinder,\" and \"Who Invented the Russian Soldier\" characterized by math rock-like stop-on-a-dime rhythmic shifts and vocalist Keith Buckley's surprisingly comprehensible throat-shedding. Other tracks, however, such as \"Turtles All the Way Down\" and first single \"Wanderlust\" draw a bit more from a traditional rock bag, with radio-ready, old-school, grunge-esque choruses, and catchy, relatively straightforward six-string riffs. Throughout, Every Time I Die sounds energized and passionate, delivering its blend of old and new sounds with a directness that gives the ferocious music an unusually broad appeal. Biography Formed: 1998 in Buffalo, NY Genre: Rock Years Active: '90s, '00s, '10s Buffalo-based metalcore quintet Every Time I Die formed in the winter of 1998. Spearheaded by brothers Keith", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}