{"relation": [["Title", "Tracks", "The Secret River", "Cloudstreet", "In a Sunburned Country", "The Floating Brothel", "Rabbit Proof Fence", "Songlines"], ["Author", "Robyn Davidson", "Kate Grenville", "Tim Winton", "Bill Bryson", "Sian Rees", "Doris Pilkington", "Bruce Chatwin"]], "pageTitle": "Australia Tours & Travel | Intrepid Travel", "title": "", "url": "http://www.intrepidtravel.com/australia", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00142-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 526816891, "recordOffset": 526747620, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{189698=Review submitted 29 Jul 2015, 89612=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 88293=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o...}", "TableContextTimeStampAfterTable": "{119948=Being such a large place, Australia has a wide range of climates so all year round there is somewhere great to visit. Summer (December to February) can get very hot, but is perfect for beach-going and other outdoors activities. In the far north it is also the wet season, which can get quite humid and some beaches may be closed due to jellyfish or 'stingers'. Winter (June to August) is pleasant and dry in the north but can get quite cold in the south, especially in Tasmania and Victoria where snowfall is common. Spring and autumn are great times to visit Australia as the weather is milder, but still warm enough for swimming in northern areas. Regardless of daytime temperatures, nights can get very cold in the desert areas of Central and Western Australia, so prepare accordingly. The main school holiday period is from Christmas to late January, and is considered the peak travel time within Australia; expect popular tourist spots to be crowded during this time., 134779=Naval explorer Captain James Cook set foot on Australian soil in 1770, claiming the eastern coastline as British Territory. Australia was soon seen as a solution to overcrowding in British prisons and a way to expand the reach of the British Empire. In 1788, 11 ships arrived from Great Britain carrying convicts, marines and settlers. The arrival of white settlers changed the face of Australia almost instantly. Much of the indigenous population fell victim to starvation and disease, with foreign diseases like small pox and loss of land devastating the aboriginal population. Colonisation soon expanded throughout Australia, with separate colonies being set up in Queensland, Tasmania, South Australia and Victoria. Thousands of convicts and settlers arrived to populate the new colonies, essentially giving birth to modern Australia. Convict life was hard, with long days spent toiling in a harsh environment with the unforgiving climate making life difficult. Brutal physical punishment, public hangings and death from disease and malnutrition were commonplace. The free settlers also suffered, as limited access to healthcare and fresh produce created medical problems and malnutrition. In the 1850s, Australia experienced a new wave of immigration due to the Gold Rush. Hundreds of thousands of immigrants from China, Britain, Hungary, Poland, Italy, Germany and France flocked to the Victorian goldfields to find their fortunes in the gold frenzy. This new wave of multiculturalism would be the first of many for Australia. In 1901, the separate colonies united to form the Federation of Australia, meaning the nation was then governed under one constitution. Sir Edmund Barton became Australia’s first Prime Minister, governing the Commonwealth of Australia until 1903 when he stepped down to become a judge of Australia’s first High Court. A little more than a decade later, World War I was declared. Australia’s participation in World War I gave birth to the Anzac legend – the spirit of mateship, courage and honour that embodies the Australian way of life. Later on, Australia also participated in World War II, as well as the Korean War, Vietnam War and other conflicts and peacekeeping missions. More recently, Australia has prospered with a strong economy based on tourism, agriculture and the export of resources and minerals like coal, iron and gold.}", "textBeforeTable": "Recommended reading Further reading 9. Refrain from touching or interfering with ancient monuments, relics or historic sites. 8. Please ask and receive permission before taking photos of people, including children. 7. Refrain from supporting businesses that exploit or abuse endangered animals. 6. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 5. Try to use public transport wherever possible. 4. For environmental reasons, try to avoid buying bottled water. Fill a reusable water bottle or canteen with filtered water instead. 3. When camping or visiting national parks, refrain from feeding native animals or leaving food out. 2. Always dispose of litter thoughtfully, including cigarette butts. 1. Be considerate of Australia’s customs, traditions, religion and culture. Top responsible travel tips for Australia Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this in mind while travelling. Australia Travel Tips Responsible Travel also provides useful health information: Go to:", "textAfterTable": "Handy links www.lonelyplanet.com/worldguide/australia www.australia.com www.worldtravelguide.net/australia × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}