{"relation": [["Composer", "Offenbach, Jacques", "Offenbach, Jacques", "Offenbach, Jacques"], ["Title", "La Vie Parisienne", "Musette", "Orpheus in the Underworld"], ["Instrument", "Violin", "Violoncello", "Violin"], ["Editor", "Kaler, Ilya", "Dešpalj, Valter", "Kaler, Ilya"], ["Instrumentation", "Orchestral", "Chamber", "Orchestral"], ["Price", "$ 11.99", "$ 5.99", "$ 2.29"]], "pageTitle": "Jacques Offenbach | Ovation Press", "title": "", "url": "http://ovationpress.com/c-94-offenbach-jacques.aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00275-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 187022623, "recordOffset": 187013466, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1549=Born in Cologne, the son of a synagogue cantor, Offenbach showed early musical talent. At the age of 14, he was accepted as a student at the Paris Conservatoire but found academic study unfulfilling and left after a year. From 1835 to 1855 he earned his living as a cellist, achieving international fame, and as a conductor. His ambition, however, was to compose comic pieces for the musical theatre. Finding the management of Paris's Opéra-Comique company uninterested in staging his works, in 1855 he leased a small theatre in the Champs-Élysées. There he presented a series of his own small-scale pieces, many of which became popular., 875=Starting in the 1850s and moving through the next decade, Offenbach produced at least 18 full-length operettas, as well as more one-act pieces. His works from this period included La belle Hélène (1864), La vie parisienne (1866), La Grande-Duchesse de Gérolstein (1867) and La Périchole (1868. However, his first full-length operetta, titled Orphée aux enfers (\"Orpheus in the Underworld\") and produced in 1858, remains one of his most widely played works. Ovation Press offers an exclusive orchestral arrangement of the work for violin, edited by Ilya Kaler.}", "textBeforeTable": "Exclusive Offenbach Scores for Strings from Ovation Press Starting in the 1850s and moving through the next decade, Offenbach produced at least 18 full-length operettas, as well as more one-act pieces. His works from this period included La belle Hélène (1864), La vie parisienne (1866), La Grande-Duchesse de Gérolstein (1867) and La Périchole (1868. However, his first full-length operetta, titled Orphée aux enfers (\"Orpheus in the Underworld\") and produced in 1858, remains one of his most widely played works. Ovation Press offers an exclusive orchestral arrangement of the work for violin, edited by Ilya Kaler. Born in Cologne, the son of a synagogue cantor, Offenbach showed early musical talent. At the age of 14, he was accepted as a student at the Paris Conservatoire but found academic study unfulfilling and left after a year. From 1835 to 1855 he earned his living as a cellist, achieving international fame, and as a conductor. His ambition, however, was to compose comic pieces for the musical theatre. Finding the management of Paris's Opéra-Comique company uninterested in staging his works, in 1855 he leased a small theatre in the Champs-Élysées. There he presented a series of his own small-scale pieces, many of which became popular. Offenbach was an influential force shaping the future direction of the operetta genre, with a particulary powerful impact on Johann Strauss, Jr. and Arthur Sullivan. Many of Offenbach's most famous works were continually revived during the 20th", "textAfterTable": "    Home    Sitemap    Terms    Privacy Policy    Contact Us © Copyright 2002-2011 Ovation Press, Ltd. All Rights Reserved.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}