{"relation": [["", "1", "2", "3"], ["Name", "Suppecial Generation", "Koishiterutokihaitsumo...", "Suppecial Generation (Instrumental)"], ["Artist", "berryzkobo", "berryzkobo", "berryzkobo"], ["Time", "4:06", "4:48", "4:06"], ["Price", "$1.29", "$1.29", "$1.29"], ["", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Suppecial Generation - EP by berryzkobo", "title": "", "url": "https://itunes.apple.com/us/album/suppecial-generation-ep/id216804822", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00179-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 869900471, "recordOffset": 869875710, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{108261=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 08:03:38 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist berryzkobo Suppecial Generation - EP iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from スッペシャル ジェネレ〜ション - EP by berryzkobo, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "3 Songs Customer Reviews My FAVORITE Berryz Koubou song! ~           by BrookeFinn Special Generation is my most favorite Berryz Koubou songs out of all of their singles! It's from a few years ago, but it's so catchy and a good dance song. The vocals are great in this song, Risako Sugaya, Momoko Tsugunaga, Miyabi Nastuyaki, and Yurina Kumai have the main vocals in this song, but everyone sounds fantastic! I totally think you should buy this song, it has a great beat and kawaii members. Check out the awesome video too! ^_^ Wow!!!           by Giraffesman Finally its back!!! Also isn't it Special Generation and not Suppecial Generation? Either way GREAT Berryz song! Yai!!!           by SaxyCanI I'm doing a groupdub and I'm Chinami and I LUVS her and", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}