{"relation": [["Title", "Singapore Burning", "Battle for Singapore", "The Rose of Singapore", "Diary of a Girl in Changi", "The Singapore Grip"], ["Author", "Colin Smith", "Peter Thompson", "Peter Neville", "Sheila Allan", "J.G. Farrell"]], "pageTitle": "Singapore | Intrepid Travel", "title": "", "url": "http://www.intrepidtravel.com/singapore/culture-geography-history-show-me", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00273-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 507953807, "recordOffset": 507903637, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{106442=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 107761=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan...}", "TableContextTimeStampAfterTable": "{5322=Singaporean Chilli Crab could be considered one of the world's favourite dishes from this region. Invented back in 1950, chilli crab can now be found everywhere in Singapore - from high-end restaurants to simple hawker stalls.}", "textBeforeTable": "Recommended reading Further reading 7. Please ask and receive permission before taking photos of people, including children. 6. Refrain from supporting businesses that exploit or abuse endangered animals. 5. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 4. Always dispose of litter thoughtfully, including cigarette butts. Littering is taken very seriously in Singapore. 3. For environmental reasons, try to avoid buying bottled water. Fill a reusable water bottle or canteen with filtered water. 2. Dress modestly and respectfully. Shoulders to knees should be covered, especially when entering places of worship. 1. Be considerate of Singapore’s customs, traditions, religion and culture. Top responsible travel tips for Singapore Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this in mind while travelling. Singapore Travel Tips Responsible Travel also provides useful health", "textAfterTable": "Handy links www.lonelyplanet.com/singapore www.worldtravelguide.net/singapore www.yoursingapore.com × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}