{"relation": [["Program", "Ego", "FunGo 2000", "Goemate", "Go++", "GOddess", "HandTalk", "Many Faces of Go", "SmartGo for Windows", "SmartGo Mac", "SmartGo Player", "Wulu"], ["Author", "Bruce Wilcox", "Yong-Goo Park", "Chinese", "Michael Reiss", "Ken Chen", "Chen Zhixing", "David Fotland", "Anders Kierulf", "Anders Kierulf", "Anders Kierulf", "A team led by Miss Lei Xiuyu"], ["Description", "Has a range of nine \"personalities\" with distinct playing styles. Free cut-down version EZ-Go", "English version developed from Korean version. Many features. Free cut-down version.", "Program from China.", "Renamed version of Go4++. One of the strongest programs available.", "One of the strongest CD Go program in the World. This program shares the same algorithm as Go Intellect, which consistently earned the top three standings in every world championship competition for the past 8 years. Goddess is implemented with artificial intelligence techniques.", "The world computer Go champion from 1995 to 1997. User interface much improved.", "Possibly the best program for playing Go on a PC. Close behind the leaders in playing strength, and well ahead of all rivals, except perhaps SmartGo, in tutorial value. Free cut-down version Igowin. Version 12 includes Monte Carlo method.", "Complete tool for Go players, with a database of more than 82,000 professional games. Compared to other Go programs, SmartGo is more powerful and easier to use. It's a tool to play, record, replay, analyze, annotate, and print Go games (uses SGF format).", "Same as SmartGo for Windows, but beta version only as of May 2015", "Really good value. Includes an interactive tutorial about Go and more than 100 problems. It automatically adjusts the handicap to keep the game interesting – start with 9x9 then unlock 11x11 and 13x13 as you get stronger.", "Wulu finished 2nd place in the 1998 Ing Cup."], ["Requires", "Dos", "Windows", "32-bit Windows and a CD drive", "32-bit Windows and a CD drive", "32-bit Windows and a CD drive", "Windows", "Windows", "Windows/Vista", "Mac OS", "iPhone/iPod Touch/iPad", "Windows"], ["Price", "£15 or $25", "$36", "$55", "$39.95", "$62.10", "$49.00", "£69.95", "$39, 15 days free trial", "$39, with 15 day free trial", "£2.29", "$59.00"], ["Suggested Source (UK if possible)", "Bruce and Sue Wilcox", "Yutopian", "Yutopian", "goplusplus.com", "Yutopian", "Yutopian", "Smart Games", "Smart Go, Inc.", "Smart Go, Inc.", "Smart Go, Inc.", "Yutopian"]], "pageTitle": "Go-playing Programs | British Go Association", "title": "", "url": "http://britgo.org/gopcres/playit", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00310-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 34901491, "recordOffset": 34893289, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{7815=Since 2007 programs using the Monte Carlo method are becoming available and these are certainly at dan level on small boards at least. Leela and the latest version of Many Faces of Go feature this method.}", "lastModified": "Fri, 31 Jul 2015 07:42:17 GMT", "textBeforeTable": "Here are some commercial programs (check current prices before ordering, postage normally extra): Some freeware and shareware Go-playing programs are available from our Software Catalogue. The best of them are Igowin which is a free version of Many Faces of Go, and EZ-Go which is a free version of EGO. A recent strong program is Leela with its free version LeelaLite. Peter's Go is a good one for improvers as it has different board sizes. Also worth a mention are GnuGo, Minimago and TurboGo. Since 2007 programs using the Monte Carlo method are becoming available and these are certainly at dan level on small boards at least. Leela and the latest version of Many Faces of Go feature this method. The best programs are commercial, although many offer a free version or a free trial period. If you can afford it, buy Many Faces of Go with its considerable tutorial material. One way to improve your Go may be to play against a computer program. If you are a beginner, almost any program will do for this. However, as you improve, you will find that playing a program of around your own strength does not necessarily improve your Go - it may make it worse: instead of learning good style, you just learn to play the particular moves which that program is unable to handle.", "textAfterTable": "This site has reviews of many of the above programs. Printer-friendly version Last updated Tue May 26 2015. If you have any comments, please email the webmaster on web-master AT britgo DOT org.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}