{"relation": [["Author", "IcyAntoid", "IcyAntoid", "IcyAntoid", "IcyAntoid", "IcyAntoid"], ["Title", "Fassad and his Mouse", "Fated Meeting", "Fated Meeting, Failed Attempt", "Favorite Food", "Feather Duster"], ["Description", "\"Do you think he'll be coming home soon? I'm so lonely.\"", "'Ninten prepares to open the lid, unaware that his journey is about to take a sharp turn for the better.' If I may, there's a story behind this one. It is a little lengthy. Please bear with me. This is my second take on this drawing. I actually got the idea for it a couple of years ago. I had my first attempt drawn out and it was getting close to completion, with the outlining and shading mostly done. At one point, before it got finished, I had the idea of showing some of my drawings at the time, this one among them, to someone I knew who was in the midst of moving away. This person was an art teacher at a junior high school I never attended. (It was out of town, whereas the one I attended was not) He liked most of what I showed him, but when he got to this one, he had several things to say about it, ranging from the shading going too far or not far enough, the angles of the building being disproportionate and going in the wrong direction, to the mountains and clouds looking unrealistic. He was critiquing my drawing, and he did mean well (he had even sketched a little reference drawing for me, too), but at the time, for some reason, I had taken it kind of badly. It was a critique and I should have known what I was getting myself into when I showed it to him. I don't know what was going on me then, and why I seemed to take his words so personally. Looking back, it was a very silly reaction on my part. Anyway, feeling depressed, I abandon the drawing. A couple of years later, I dig into my older works, hoping I can still find the failed drawing and reference sketch, because the moment had suddenly hit me. As cheesy as it may sound, I had felt a renewed energy! I was pumped! I was ready to try this idea again, to take the mistakes of my first attempt and improve upon them with a second. I eventually find them and I get to drawing. I try harder. I take my time. I use a ruler. This is the result. I feel much better about this one. Like all of my drawings, I know it isn't perfect; there could still be a few loose ends to tidy up, maybe, but I am satisfied with what I have come up with. The cool thing is, this same person from before actually came down to visit my dad and I, and I was able to show him the second attempt! He agreed it looked much better than before. I am not saying any of this to get a big head or anything. I never do. I just figured it would be nice of me to share my thoughts for once, as this particular drawing has come a very long way since I first started it those couple of years ago. And that person, though he does not come to this website; indeed, I would be very surprised if he knew anything whatsoever about it, if it wasn't for his critique, however blind I was to it at the time, this drawing would not be here right now. His reference sketch had also helped me along immeasurably on the second attempt, and though I could not see it then, it was the best thing he could have done for it, and for me, in that moment. And on the very, very rare chance that his travels actually do take him here, it would bring a smile to his face and perhaps a tear to his eye when I say, \"Thank you, James.\"", "Along with the completed version of my 'Fated Meeting' picture, I figured I'd summon my courage and submit the failed attempt as well. It's only fair. If you compare the two, you can definitely see why I thought it would be wise to start it over. Ninten is not here because, when I first had the idea, I wasn't thinking of including him at all. Again, I'm glad I decided to give this one a second try.", "fanart of someone enjoying his favorite food", "Perfect for cleaning those dusty surfaces!"], ["Date", "1/17/09", "7/30/12", "8/1/12", "8/12/10", "6/3/09"], ["Rank", "0.00", "0.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=31239&stuff=TitleASC&stuffPageNumber=44", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00208-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 207357236, "recordOffset": 207341292, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> Z Y X W V U T S R Q P O N M L K J I H G F E D C B A 8 5 4 2 1 < Other Submissions by IcyAntoid Hmm. Must be of the Manx variety. This image has been resized for your convenience. Click on it to view the full size version.", "textAfterTable": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}