{"relation": [["Book series", "Maigret", "Harry Potter", "Goosebumps", "Perry Mason", "Berenstain Bears", "Choose Your Own Adventure", "Sweet Valley High", "Noddy", "Nancy Drew", "The Railway Series (spawned Thomas the Tank Engine & Friends)", "San-Antonio", "Robert Langdon", "The Baby-sitters Club", "Star Wars", "Peter Rabbit", "Chicken Soup for the Soul", "Frank Merriwell", "Dirk Pitt", "宮本武蔵 (Musashi)", "American Girl", "The Chronicles of Narnia", "Mr. Men", "Twilight", "Clifford the Big Red Dog", "James Bond", "Martine"], ["Author", "Georges Simenon", "J.K. Rowling", "R. L. Stine", "Erle Stanley Gardner", "Stan and Jan Berenstain", "various authors", "Francine Pascal and ghostwriters", "Enid Blyton", "various authors as Carolyn Keene", "Rev. W. Awdry, Christopher Awdry", "Frédéric Dard", "Dan Brown", "Ann Martin", "various authors", "Beatrix Potter", "Jack Canfield, Mark Victor Hansen", "Gilbert Patten", "Clive Cussler", "Eiji Yoshikawa", "various authors", "C. S. Lewis", "Roger Hargreaves, Adam Hargreaves", "Stephenie Meyer", "Norman Bridwell", "Ian Fleming", "Gilbert Delahaye, Marcel Marlier"], ["Original language", "French", "English", "English", "English", "English", "English", "English", "English", "English", "English", "French", "English", "English", "English", "English", "English", "English", "English", "Japanese", "English", "English", "English", "English", "English", "English", "French"], ["No. of installments", "75 novels + 28 short-stories", "7 + 3 supplements", "62 + spin off series", "82", "over 300", "185", "400", "24", "175", "41", "173", "4", "335", "over 300", "6", "105", "209", "19", "7", "", "7", "43", "4 + 1 Novella + 1 Guide", "", "14", "60"], ["First published", "1931-1972", "1997-2007", "1992–1997–present", "1933 — 1970", "1962 — present", "1979 — 1998", "1983–2003", "1949–present", "1930 — present", "1945–2011", "1949–2001", "2000–present", "1986 — present", "1977 — present", "1902–1930", "1997 — present", "1896 –", "1973 — present", "1935–1939", "1986 — present", "1949–1954", "1971 — present", "2005–2011", "1963 — present", "1953–1966", "1954 — present"], ["Approximate sales", "853 million", "450 million", "300 million", "300 million", "260 million", "250 million", "250 million", "200 million", "200 million", "200 million", "200 million", "200 million", "172 million", "160 million", "150 million", "130 million", "125 million", "120 million", "120 million", "120 million", "120 million", "120 million", "120 million", "110 million", "100 million", "100 million"]], "pageTitle": "Robert Sheppard Literary Blog & World Literature Forum | Robert Sheppard's Literary Blog & World Literature Forum", "title": "", "url": "https://robertalexandersheppard.wordpress.com/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 39, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00280-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 884623859, "recordOffset": 884364295, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{677201=1997, 739970=Rod Serling creates a modern   legend. Starting in 1959, The Twilight Zone lasted five seasons, and   was renowned for the care taken with its production. While the best-known of   its type, the Sixties had a number of successful anthology shows of more   interest to the horror fan. Tales of the Unexpected (1960), Thriller   (with Boris Karloff, 1960) and The Outer Limits (1963 — remade in   1996), which followed on from the success of Alfred Hitchcock Presents   [1960] in   1955. ([1949]., 757118=After the popular radio plays   of the Thirties, often incorporating horror motifs, or at least dark and   shadowy heroes [1930s], horror on radio came into its own in this decade.   Examples were programs such as Dimension X, Inner Sanctum, I   Love a Mystery (1939) and Suspense (1942). By 1950 however, the   more visual mediums were taking precedence, and the programs fell by the   wayside. Individual shows can be found in later years, for example CBS   Mystery Theatre, but they are few and far between., 704820=Alan Moore, already an accomplished writer in the British comics scene, takes over the regular Swamp Thing title at issue 20 for DC. Along with his V For Vendetta (with David Lloyd) and Watchmen (with Dave Gibbons), he was able to show a innovative and enormously intricate style, with subjects ranging from Super-Heroes, fascist dictatorships, pure horror and the occasional pirate ship. His popularity led DC to hire more British writers for the mature-age, horror-orientated market and in 1993 Karen Berger grouped this particular style under the Vertigo imprint. Moore had long since left for other things (including From Hell [1913] and his subsequent work in the so-called America’s Best Comics imprint), and Neil Gaiman’s revolutionary Sandman was the star, among notables such as Hellblazer. Gaiman went onto success in other mediums with American Gods., 466326=The art exhibition was held at the Stedelijk Museum from 12 June to 12 August, and displayed 1150 works of art from 18 different countries. Additionally, the literature competition attracted 40 entries from 10 countries, and the music competition had 22 entries from 9 countries.[1], 679373=1984, 50654=C  Copyright Robert Sheppard 2011 All Rights Reserved, 625469=Arising from the Age of Reason and the development of modern science itself, Jonathan Swift’s Gulliver’s Travels was one of the first true science fantasy works, together with Voltaire’s Micromegas (1752) and Johannes Kepler’s Somnium (1620). Isaac Asimov and Carl Sagan have termed the latter work the first science fiction story. It depicts a journey to the Moon and how the Earth’s motion is seen from there. The Blazing World written in 1666 by English noblewoman Margaret Cavendish has also been described as an early forerunner of science fiction. Another example is Ludvig Holberg’s novel Nicolai Klimii iter subterraneum, 1741. Some have argued that Mary Shelley’s Frankenstein (1818) was the first work of science fiction., 672872=Derleth, August, 786091=Alice’s Adventures in Wonderland is published by Lewis Carroll (actually the Reverend Charles Lutwidge Dodgson), followed by Through the Looking Glass in 1872. Not horror in themselves, the novels have had some influence on the genre, particularly in the 1980s., 781266=In this decade, and into the next one, the Grand Guignol flourished on the Paris stage (and was still around a lot later). The term originally referred to a puppet (possibly the work of one Laurent Mourquet a century before), but came to refer to brief plays based around violence, murder, rape, ghostly apparitions and suicide. There was indeed a Théâtre du Grand Guignol, but the art-form was most prominent in Montmartre. London also played host to several seasons over the next fifty years, in a less intense form, notably in 1920-22. [1930s]., 795846=For a brief thirty years horror flourished again on the British stage. Three theatres, Drury Lane, Covent Garden and the Haymarket, played host to such dramatisations as Fitz Ball’s The Devil’s Elixir, Matthew Lewis’ The Castle Spectre, James Planche’s The Vampire (1819) (introducing a new form of stage machinery, ‘the vampire trap’), and Milner’s Frankenstein, or The Man and the Monster (1818). These productions were ‘expensive, spectacular and decidedly bloody’, but none were staged after 1825 when ‘the devil was no longer in fashion.’, 895259=https://robertalexandersheppard.wordpress.com/2013/04/11/poetry-pacific-3-poems-by-robert-sheppard/, 788154=The Baltimore Saturday Visitor publishes MS Found in a Bottle by the unknown author Edgar Allan Poe. Between here and his death in 1849 he publishes many short stories, including ‘The Fall of the House of Usher’ (1839), ‘The Masque of the Red Death’ (1842), ‘The Pit and the Pendulum’ (1843) and ‘The Cask of Amontillado’ (1846). He has some claim to be the father of the detective story, and has described himself as ‘insane, with long intervals of horrible sanity.’ He was the first significant proponent of the fiction that would dominate the next century. [1960]., 345221=While freewheeling piratical capitalism drove down the price of books in the US and nurtured a book-buying middle class mass market, monopoly capitalism and price-fixing cartels in the UK drove the price up and resulted in a middle-class book-borrowing public who subscribed to commercial and public lending libraries to deal with the artificially high cost of books. A principal reason for this was the price-fixing system known as the “Net Book Agreement” whereby the top British publishers formed a cartel and a system of contractual controls over retailers and distributors forbidding “discounting” of books, or lowering the price below the high price fixed by the publisher—-forbidding any “sale” or promotion. Free market-minded violators would be subject to industry boycotts, reprisals and law suits and generally driven out of business by the ruling cartel. Adam Smith, often quoted as the father of the “free enterprise system” was nevertheless a canny enough observer of actual market capitalism to observe and warn: “Put any three members of the same profession in a room for fifteen minutes and you are sure to generate a conspiracy against the public.” In this the British publishing industry proved true to form in enforcing a high cost of books to the general public for their private profit through both the Net Book Agreement (NBA) and its twin pillar of monopoly cartelization, the Traditional Marketing Agreement (TMA). The results of this anti-competitive system were not all bad however, as protected publishers had the extra resources to develop new authors and talent as well as means of compensating authors well with royalties. The system also subsidized the smaller “highbrow” market for quality literary works with profits derived from the low and middle-brow mass markets. The system militated, however, against large “bestseller” sales comparable to the American market and encouraged library borrowing rather than individual consumer purchasing of high-priced books. The absence in Britain of the American practice of publishers accepting returns of unsold book inventories without cost to the retailer also discouraged bulk stocking and buying for resale and hence impeded large-volume bestseller marketing. The cartelized price-fixed structure of the British market under the Net Book Agreement continued until 1995 when it was abolished as incompatible with the free market and anti-monopoly principles of the European Union. Thereafter, under the pressures of free and fierce competition the American and British markets tended to merge into one Transatlantic market whose larger scale increased the scope for “bestsellers,” and indeed encouraged the movement towards Mergers & Acquisitions in which the large publishing houses swallowed up one another to become global conglomerates such as HarperCollins, often attached to larger media and multi-national marketing complexes. Such mega-firms looking to global markets increasingly raised the stakes in search of “blockbusters” or super-star global bestsellers, often squeezing out or buying out smaller rivals in a “winner takes all” literary marketplace., 682690=1942, 478740=Art competitions were held as part of the 1924 Summer Olympics in Paris, France. Medals were awarded in five categories (architecture, literature, music, painting, and sculpture), for works inspired by sport-related themes., 314227=Somerset Maugham established the genre of the MI6 spy thriller with his Ashenden in 1928, building on prior classics such as Conrad’s Secret Agent. John Buchan had already made significant headway in this area during the war years with Richard Hannay in The Thirty-Nine Steps, rendered in film by Alfred Hitchcock and Greenmantle.  The genre came into prominence after WWII with the epic James Bond series of Ian Fleming, complemented by Graham Greene and such masters as John Le Carre with bestsellers such as The Spy Who Came In From the Cold and The Honorable Schoolboy. Tom Clancy rendered the format in the American context of the CIA with his Jack Ryan series including Patriot Games and The Hunt for Red October also rendered on the big screen., 727844=William Peter Blatty publishes his thoughtful and theological novel The Exorcist [1973]. It ‘is as superior to most books of its kind as an Einstein equation is to an accountant’s column of figures.’ A rather good sequel, Legion, was written in 1983., 683170=1911, 894428=“Read Robert Sheppard’s sprawling, supple novel, Spiritus Mundi, an epic story of global intrigue and sexual and spiritual revelation. Compelling characters, wisdom, insight, and beautiful depictions of locations all over the world will power you through the book. You’ll exit wishing the story lines would go on and on.” May 13, 2012, 160729=In 2008 I worked at the Beijing Sports University (Ti Yu Da Xue) making preparations for China’s first successful hosting of the Olympic Games. In recent years a greater part of my activity in addition to teaching has focused on being a professional writer, publishing in 2013 my two-part best-selling novel Spiritus Mundi, in which about a third of the action takes place in China. In short, my experience as a “Foreign Expert” has been swept along in the tide of amazing historical development which is the saga of the rise of modern China in our times., 681508=1970, 682201=1954, 679876=1981, 58334=Spiritus Mundi: Book I: The Novel https://www.smashwords.com/books/view/303856 http://www.barnesandnoble.com/w/spiritus-mundi-robert-sheppard/1115113181?ean=2940044432598&itm=1&usri=2940044432598 http://www.kobobooks.com/ebook/Spiritus-Mundi-Book-The-Novel/book-vYffC7MUUEyN0wJTQSpgFQ/page1.html https://itunes.apple.com/us/book/spiritus-mundi/id634577546?mt=11 http://www.diesel-ebooks.com/item/SW00000303856/Sheppard-Robert-Spiritus-Mundi-Book-I-The-Novel/1.html, 760333=Charles Addams first appearance in The New Yorker. He quickly became a regular, and by 1935 his   cartoons had evolved into his immediately recognizable   style. His darkly comedic visions of death and the macabre lasted until 1989,   and spawned The Addams Family television show [1964] and a more recent   movie double, in 1991 and 1993. ‘…if the cartoon needed a caption, he felt   he had failed in some way, even if the caption was brilliant.’, 865193=We also invite you to listen in to the  BlogTalkRadio Interview with Dr. Robert Rose interviewing Robert Sheppard on the topic of “World Consciousness and the Emergencer of World Literature” pre-recorded May 17, 10:00 AM, PST:, 166286=I had the pleasure of meeting with the Premier at the Great Hall of the People on a similar occasion sponsored by the State Foreign Expert Bureau in 2009 on the 60th Anniversary of the founding of the People’s Republic of China.  This year marks the 20th Anniversary of my work in China, beginning in 1993, most of which was in the status of a “Foreign Expert,” or foreign Professor teaching at most of the most celebrated universities in the nation: Peking University, Tsinghua University, People’s Renmin University, Bei Wai, or the Beijing Foreign Studies University, the China University of Political Science and Law, the Guanghua School of Management MBA Program, and the Chinese Academy of Social Sciences (CASS) Law Institute and Graduate School, among others,  in the three primary areas of International Law, Literature—Western, American, British and World Literature, and Business and MBA Studies., 860803=C  Copyright Robert Sheppard 2014 All Rights Reserved, 676618=2002, 756516=Ray Bradbury publishes ‘The Candle’, his first short story, in Weird Tales. He would go on to   write The Martian Chronicles (originally The Silver Locusts) in   1951 and Something Wicked This Way Comes in 1963 (admirably filmed by   Jack Clayton [1898] in 1963). Carnivals were never the same again. Other   achievements include the fascist future of Fahrenheit 451 (1953) and   his collections of poetically macabre short stories such as The October   Country (1956)., 725907=Richard O’Brien’s Rocky Horror Show opens for 50p a ticket at the Royal Court Theatre, quickly becoming a hit and ultimately achieving true cult status. The camp production is a send-up of [1950s] SF and horror movies. The Rocky Horror Picture Show, a celluloid version with the same director (Jim Sharman) and most of the cast of the original was a commercial failure in 1975, but has since also achieved a cult standing. The sequel, Shock Treatment (Sharman, 1981) has done less well, but is worth checking out., 891505=“Robert Sheppard’s exciting new novel, Spiritus Mundi, is an unforgettable read and epic journey of high adventure and self-discovery across the scarred landscape of the modern world and into the mysteries beyond. Its compelling saga reveals the sexual and spiritual lives of struggling global protesters and idealists overcoming despair, nuclear terrorism, espionage and a threatened World War III to bring the world together from the brink of destruction with a revolutionary United Nations Parliamentary Assembly and spiritual rebirth. This modern epic is a must read and compelling vision of the future for all Citizens of the Modern World and a beacon of hope pointing us all towards a better world struggling against all odds to be born.” May 19, 2012, 743262=The first of the Pan Book of Horror Stories is released, edited by Herbert van Thal, becoming one of   the most well-known and influential of anthologies. The series became annual   in 1962, and concentrated on new fiction from number five on. Van Thal   continued till his death in 1983, and was replaced by Clarance Paget. In 1990   Pan put out Dark Voices, a best of the series, and it is now   continuing under that name., 709144=Friday the 13th, directed by Sean S. Cunningham, is released. The first in an ever-increasing series it is perhaps most notable for not having a hockey-masked killer called Jason. Still, it was a slaughter-spree among teenagers at a holiday camp and ‘propelled the independent, low-budget splatter movie into the big time.’ Jason X in 2001 was the tenth in the series, and since then he’s met Freddy (2003). Frank Mancuso, producer of the series since number 2, is also the force behind the otherwise unrelated Friday the 13th TV series (1987)., 762323=As mentioned with regards to The Shadow and ilk, radio plays were also popular at the time, with a number   dedicated to the supernatural. This debuted the soon-to-be-familiar format of   the anthology play (a consequence of the number of horror short stories). One   of the first was Lights Out in 1934, broadcasting Arch Oboler to a   national audience, but it wasn’t till the [1940s] that the dedicated late-night horror   show took off., 790990=Mary Shelley’s novel Frankenstein — or the Modern Prometheus is published, the first science fiction novel [1816]. It will also have a great influence on horror though the popular image of the monster is taken from the multitude of films [1910], [1930s], [1948]. Like much of the contemporary literature it was quickly adapted for stage [1790-1825] but it wasn’t until 1991 that it became an opera, with Richard Meale and David Malouf’s Mer de Glace., 870531=C   Copyright 2014 Robert Sheppard   All Rights Reserved, 890576=“Robert Sheppard’s “Spiritus Mundi” is a book of major importance and depth. A must read for any thinking, compassionate human being living in these perilous times. I highly recommend this powerful testament of the current course of our so-called life on his planet. April 25, 2012, 721621=Young Frankenstein combines Mel Brooks’ usual silliness with a reverent recreation of the mood (and actual sets) of the [1930s] Frankenstein with a rather strange and popular result. Indeed, from a list compiled in 1983 it was the fourth most popular horror film made since 1950 (behind Jaws [1975], The Exorcist [1973] and Jaws II (1978)). Mel Brooks is possibly more interesting for being the Executive Producer for David Lynch’s The Elephant Man [1990]., 578115=Frank Herbert (1920 –1986) was a critically acclaimed and commercially successful American science fiction author. Though also a short story author, he is best known for his novels,most notably Dune and its five sequels. The Dune saga, set in the distant future and taking place over millennia, deals with themes such as human survival and evolution, ecology, and the intersection of religion, politics and power. Dune itself is the “best-selling science fiction novel of all time” and the series is widely considered to be among the classics in the genre., 677689=1993, 400292=The art exhibition was held at the Victoria and Albert Museum from 15 July to 14 August, and displayed works of art from 27 different countries. The literature competition attracted 44 entries, and the music competition had 36 entries.[1], 157734=Foreign Experts: Isabel and David Crook in 1947 near Yanan before National Liberation, 738342=And just to give Hammer a run   for their money, horror auteur Roger Corman shoots the first of his   adaptations of Poe [1833]. House of Usher stars Vincent Price [1953] and was written for the screen by Richard Matheson [1954], and combinations of the three proceeded through The   Pit and the Pendulum (1961), The Premature Burial (1961) and The   Masque of the Red Death (1964), among others. This cult figure was the   master of the cheap budget and the quick shoot, but was also responsible for   discovering Francis Coppola [1963], Joe   Dante, and Martin Scorsese. Corman had already directed such delights as Attack   of the Crab Monsters in 1957 and the original Little Shop of Horrors   in 1959. He was still happily doing what he does best in 1991, with an   adaptation of Brian Aldiss’s Frankenstein Unbound, ‘pure Corman’., 755120=William Gaines takes over his   father’s publishing business and changes the name from Educational Comics to   Entertaining Comics. As well as SF and action titles they would also produce   America’s first and most famous horror comics, the likes of Tales from the   Crypt, Haunt of Fear and Vault of Horror, all edited by Al   Feldstein. EC became a cult sensation — until 1954, that is, when Dr.   Fredric Wertham’s infamous The Seduction of the Innocents: The Influence   of Comic Books on Today’s Youth saw print. The backlash was incredible,   EC was brought under the scrutiny of a US Senate Subcommittee and business   went downhill fast. Mad Magazine remains the only survivor of the   publishing house, though several of the old titles are seeing reprint. As   Gaines said in the nationally televised court case: ‘It would be just as   difficult to explain the harmless thrill of a horror story to a Dr. Wertham   as it would be to explain the sublimeness of love to a frigid old maid.’   Tributes to the EC tradition include the excellent Tales From the Crypt   television series and Creepshow (George Romero, 1982)., 504426=Until the Amsterdam Games in 1928, the architectural competition was not divided into categories. The 1928 games introduced a town planning category. However, the division was not always clear, and some designs were awarded prizes in both categories. Entries in this category were allowed to have been “published” or built before the Olympics. A notable example of this is the 1928 gold medal for architecture awarded to Jan Wils for his design of the Olympic Stadium used in the same Olympics. The revival of the Architecture Award could be coordinated with the Pritzkers, and include designs for both the Olympic venues and recent World Fairs., 869993=  PUSHCART PRIZE NOMINEE ROBERT SHEPPARD’S SPIRITUS MUNDI NOW AVAILABLE ON AMAZON! —–INVITATION TO LISTEN TO MAY 17 BLOGTALKRADIO INTERVIEW WITH AUTHOR 10:00 AM PST _______________________________________________________________________, 682135=1955, 586824=Beginning in 1942 he published the first of his Foundation stories—later collected in the Foundation Trilogy: Foundation (1951), Foundation and Empire (1952), and Second Foundation (1953)—which recount the collapse and rebirth of a vast interstellar empire in a universe of the future. Taken together, they are his most famous work of science fiction, along with the Robot Series. Many years later, due to pressure by fans on Asimov to write another, he continued the series with Foundation’s Edge (1982) and Foundation and Earth (1986), and then went back to before the original trilogy with Prelude to Foundation (1988) and Forward the Foundation (1992). The series features his fictional science of Psychohistory in which the future course of the history of large populations can be predicted., 678848=1987, 681570=1968, 519444=In May 1906, Baron de Coubertin organized a meeting in Paris for both IOC members and representatives of artists’ organizations. The meeting ended with a proposal to the IOC to organize artistic competitions at the Olympic Games in five areas: architecture, literature, music, painting, and sculpture. From then on World Literature and the Arts became a regular part of the Olympics until 1954, when the program was discontinued on the grounds that most of the Olympic artists were in fact professionals rather than amateurs, as the Olympic rules of the time mandated. However today, the rules of the  International Olympic Committee (IOC) have long abolished the requirement of amatuerism.  Beginning in 1988 professional athletes were allowed to compete in the Olympic games, until today, with the exception of professional boxing and wrestling, professionals are found in all Olympic sports. The ideals of the Classical world revered by Baron de Coubertin celebrated and required “mens sana in corpore sano” or a sound mind in a sound body, encompassing both physical culture and imaginative culture, and the celebration of the whole human personality, both  sport and in World Literature and the Arts., 514094=Furthermore, the re-inclusion of World Literature and the Arts in the Olympic Games would encourage the Arts to become more global and international. Most arts awards today are narrowly nationally based and fixate on national tastes. The Oscars purport to be the ultimate world film award, but in reality are only American, with a small category for international films. Emmys, Grammys, Bookers, Pulitzers, etc are similarly too parochial and nation-state based. Even our “World Series” of baseball is nothing but an American Series and does not include teams from the rest of the “World” at all.  Olympic awards will legitimatize and globalize the arts beyond the limitations of the present systems. In our globalized world and culture artists and writers should be encouraged to create for the seven billion citizens of the planet not just for the home audience. This will strengthen the industries themselves, as for instance most films now earn more money abroad than in their home markets, and Olympic recognition will encourage an international outlook in the performing arts as well as in World Literature, with the art of translation being greatly encouraged. How then did the Cultural Olympics, or Delphic Olympics work when de Coubertin and the International Olympic Committee originally included them in the early Modern Olympics? From 1912 to 1948 rules of the art competition evolved and varied, but the core of the rules remained the same. All of the entered works  had to be original (that is, not be published before the competition). Like in the athletic events at the Olympics, gold, silver, and bronze medals were awarded to the highest ranked artists, although not all medals were awarded in each competition. On a few occasions, in fact, no medals were presented at all, as sometimes occurs with the Nobel or Pulitzer Prizes.  A revival of the Arts half of the Olympics could be modernized, including allowance of both sports-related and non-sports related art, national team and individual entry, professionals and amateurs, and entry of works recently published or released in the past year, (or past four years)., 571110=Alternate (or alternative) history stories are based on the premise that historical events might have turned out differently. These stories may use time travel to change the past, or may simply set a story in a universe with a different history from our own. Classics in the genre include Bring the Jubilee by Ward Moore in which the South wins the American Civil War, and The Man in the High Castle by Phillip K. Dick, in which Germany and Japan win World War II. The Sidewise Award acknowledges the best works in this subgenre with the name is taken from Murray Leinster’s 1934 story Sidewise in Time. Harry Turtledove is one of the most prominent authors in the subgenre and is sometimes called the “master of alternate history.”, 747134=Invasion of the Body Snatchers (Don Siegel),   is a nicely written and complex tale (based on Jack Finney’s 1954 novel),   interrogating rather than reflecting the fears of its decade [1950s]. It was remade in   1978 by Philip Kaufman, and again by Abel Ferrara in 1993. ‘Invasion of   the Bodysnatchers is one of the worst titles imaginable created by the   pods that ran Allied Artists… McCarthy came up with a very good one which   he stole from Shakespeare. That title fit our picture perfectly: Sleep No  More‘ — Don Siegel (in Fangoria #4). The studio also had their   hand in downplaying the original powerful last scene., 797265=Donatien-Alphonse-François de Sade, better known as the Marquis de Sade, writes Les 120 Journées de Sodome, ou l’Ecole du libertinage (The 120 Days of Sodom), ‘the most impure tale that has ever been told since our world began’ whilst incarcerated in the Bastille — though the uncompleted novel wasn’t properly published until 1931. The combination of his (hardly unusual) licentious ways and love of literature produced an extraordinary fusion that saw him persecuted throughout life, and beyond. If nothing else, he certainly had a philosophy (and no, he never met Sacher Masoch). Other novels include his most readable, Justine, ou les Malheurs de la Vertu (Justine, or the Misfortunes of Virtue, first version in 1791) and its sister volume, l’Hisoire de Juliette, sa soeur (ou les Prospérités du vice) (Juliette, or the Triumph of Vice) in 1797. He has featured as a character in various, usually bad, novels and films such as ‘The Skull of the Marquis de Sade’ by Robert Bloch (filmed by Freddy Francis in 1965); and there are an almost surprising number of adaptations of his work. Most are somewhat obscure, and only Pier Paolo Pasolini’s masterly adaptation of Sodom, released under the title Salòo le centoventi giornate di Sodom in 1976, has risen to any public attention., 571940=Time travel stories have antecedents in the 18th and 19th centuries. The first major time travel novel was Mark Twain’s A Connecticut Yankee in King Arthur’s Court and  the most famous, of course,  is H.G. Wells’1895 novel The Time Machine, which uses a vehicle that allows an operator to travel purposefully and selectively, whereas Twain’s time traveler is struck in the head. The term “time machine,” coined by Wells, is now universally used to refer to such a vehicle. Stories of this type are complicated by logical problems such as the “grandfather paradox.” Time travel continues to be a popular subject in modern science fiction, in print, movies, and television episodes of Stargate, Stargate SG1and the hit BBC television series Doctor Who., 149168=David Crook in our swimming expeditions from Bei Wai to the Friendship Hotel used to laugh that one of his duties as a KGB spy in Spain during the Spanish Civil War was to maintain surveillance of George Orwell, author of 1984 and Animal Farm, a suspected “Trotskyist” and an author I much admired. One of the most poignant and heart-wrenching episodes of the Animal Farm allegory, you may recall, comes when the “inner party of pigs” discover that the work horses who have shouldered the main burden of the farm’s work have been thoroughly exhausted and worn out by old age and can no longer work. They are callously sold off and shipped to the meat factory to be butchered into dog food when they can no longer work. China has made immense progress in avoiding the condition or the Orwellian dystopian prophecy and should hasten and complete its reforms of the Foreign Expert System to prevent the foreign experts who have given the better part of their lives to China from suffering such an Orwellian end., 867588=Spiritus Mundi: Book I: The Novel https://www.smashwords.com/books/view/303856 http://www.barnesandnoble.com/w/spiritus-mundi-robert-sheppard/1115113181?ean=2940044432598&itm=1&usri=2940044432598 http://www.kobobooks.com/ebook/Spiritus-Mundi-Book-The-Novel/book-vYffC7MUUEyN0wJTQSpgFQ/page1.html https://itunes.apple.com/us/book/spiritus-mundi/id634577546?mt=11 http://www.diesel-ebooks.com/item/SW00000303856/Sheppard-Robert-Spiritus-Mundi-Book-I-The-Novel/1.html, 320937=“Hard-boiled” detective and private-eye fiction developed millions of readers before being transformed into the “noir” film genre epitomized by such classics as Dashiell Hammet’s Sam Spade thriller The Maltese Falcon later filmed by John Huston with Humphrey Bogart, Lon Chaney and Sidney Greenstreet. Raymond Chandler’s Phillip Marlow was introduced in 1938 with The Big Sleep, accompanied by such classics as James Caine’s The Postman Always Rings Twice, Rex Stout’s Nero Wolfe and others of the noir genre., 141997=To be fair, this system that keeps Foreign Experts poor had important justifications in its origins. At the beginning of the PRC China was in fact extremely poor and could only afford to pay little to foreigners. After “Kai Fang” or the “Opening Up” policy after 1979 it remained important to both conserve scarce funds and foreign exchange and to give poorer areas some chance to compete with the major centers in attracting foreign talent by not becoming perpetual losers in a bidding war. Foreigners were “assumed to be rich” and their pay in any case was more than their comparable Chinese colleagues, who suffered at least triple the underpay and exploitation as their relatively privileged foreign counterparts. Most foreign experts, moreover, were not motivated by money but rather by cultural curiosity, a spirit of adventure, altruism or other motives and were planning only a short sojourn before moving on to bigger and better things elsewhere., 774725=A number of German films were   made in this decade using the premise of artificial creatures. They include Der   Golem (Heinrich Galeen, 1914), Der Golem (Paul Wegener and Carl   Boese, 1920, ‘its splendid sets, performances and certain scenes all being   clearly influential on later Hollywood films, especially Frankenstein.‘ Homunculus (Otto Rippert, 1916) (actually a serial   totalling 401 minutes — ‘the most popular serial in Germany during WW I,   even influencing the dress of the fashionable set in Berlin’ and Alarune   (filmed at least three times, firstly in 1918 by Eugen Illes). Metropolis   [1931], of   the next decade, also fits the pattern and gives us Rotwang the Inventor,   perhaps the earliest, and certainly a still effective, cinematic mad   scientist. A variation (and an incredibly influential one at that) was provided by Robert Wiene in 1919 with The Cabinet of Dr Caligari. In this case the entire landscape was artificial, created in the mind of a   madman., 502214=The sculpture class had only a single category until 1928, when two separate competitions were designated; one for statues and one for reliefs and medals. In 1936, this was split up further, separating reliefs and medals into their own categories., 680509=1978, 893915=“Robert Sheppard’s novel, “Spiritus Mundi,” has everything. “Spiritus Mundi” is Latin, meaning “spirit” or “soul of the world.” According to the Norton Anthology of English Literature, the phrase refers to “the spirit or soul of the universe” with which all individual souls are connected through the “Great Memory.” This amazing novel is all inclusive and unceasingly riveting. If you are interested in politics, philosophy, human relationships, sex, intrigue, betrayal, poetry and even philosophy — buy and read “Spiritus Mundi”!”November 18, 2012, 892537=“Longing for a thrilling experience of the sexual and spiritual world? Expecting a thorough summoning of your inner heart? Aspiring to find an extraordinary voice to enlighten your understanding heart? Then you can’t miss this extraordinary novel, Spiritus Mundi by Robert Sheppard. The author will spirit you into a exciting world filled with fantasy, myth, conflicts and wisdom from a fresh perspective. Don’t hesitate, just turn to the 1st page and start out enjoying this marvellous journey.”November 17, 2012, 668559=The Facts in the Case of M. Valdemar, 681049=1975, 683751=1886, 708541=Thomas Harris releases Red Dragon, creating Dr. Hannibal Lector, one of the most successful (if non-realistic) portraits of a serial killer, and a precursor of the craze to come. Harris’ success is the combination of a sparse but effective narrative with a chilling eye for detail, a trend continued in the sequels The Silence of the Lambs (1988) [1991] and Hannibal (1999). Michael Mann adapted Red Dragon as Manhunter (1986) masterfully, and Brett Ratner provided a more commercial but still effective version in 2002., 500052=Alfréd Hajós is one of only two Olympians to have won medals in both Sport and Art competitions Only two persons have won Olympic medals in both Olympic Sport and Olympic Art competitions. Walter Williams, an American who lived in England, won a gold medal as a marksman at the 1908 Summer Olympicss in the running deer (double shot) competition. In 1912, he won another shooting medal — Silver this time — in the running deer team competition. By then, he had already won a Gold medal for his sculpture An American trotter. The other Olympian with successes in both fields was Alfred Hajos As a swimmer. He won two Gold medals at the 1896 Athens Olympics.Twenty-eight years later, he was awarded a Silver medal in architecture for his stadium design, co-designed with Deszo Lauber. Two Presidents of the International Olympic Committee have also been among the entrants in the Olympic Art competitions. In 1912 Pierre de Coubertin himself under the pseudonym “Georges Hohrod and Martin Eschbach”, entered Ode to Sport, which won the Gold medal.  Avery Brundage, who competed as an athlete at the 1912 Games, entered literary works at the 1932 and 1936 Olympics, earning an honorary mention in 1932. He would serve as the IOC’s president from 1952 to 1971., 792339=Between the 15th and 17th of June Lord Byron, Percy Shelley, Mary Wollstonecraft Shelley and Dr. John Polidori stay at a villa by Lake Geneva. Quite possibly under the influence of laudanum, they declare they will each write a ghost story. From this meeting both the Vampire sub-genre and science fiction itself are created in English [1818], [1819]. The story of that night has been told a number of times on film, most notably in Ken Russell’s Gothic (1986)., 677337=1995, 689532=Chris Carter’s The X-Files had the ability, at its best, to walk into a cliche and then twist it into something wonderful. Appearing at the tail end of the direct Twin Peaks [1990] influences, it has now started a whole lot more of its own — conspiracies and pseudo-science are all the rage, whilst Carter added his own serial-killer of the week Millennium to the mix [1997]. Meanwhile, the other shows that dared carve out their own niche on our screens didn’t last as well, but did some good things — American Gothic and Forever Knight were the best, and even Kindred had… potential. Then came Buffy. The X-Files movie (Rob Bowman) appeared in 1998., 767002=The first ‘performance’ of Dracula   was a reading in 1897 (to protect stage rights), but it is actor Hamilton   Deane who writes and stars in the first proper stage version [1897], [1927]., 794031=The Monk, ‘charged with all the adolescent sexual intensity of the 19-year-old who wrote it.’ is published anonymously. It is the most readable of the Gothic novels to the modern reader and, as the Marquis de Sade puts it, ‘is superior in all respects to the strange flights of Mrs. Radcliffe’s imagination’ [– Reflections on the Novel (1800)]. There were calls for the book to be banned, particularly once the author’s identity was made known, one Matthew Lewis, playwright and member of parliament. Ann Radcliffe [1794], whose work in part inspired it, was so horrified she wrote The Italian (1797) in reply. A film was made in the early seventies by Ado Kryou, and Paco Lara’s version came out in 1990. It wasn’t very good.], 783516=This decade saw a movement in France known successively as L’Esprit Décadent and Symbolisme. The writers that typified it, the earlier Charles Baudelaire, Joris Karl Huysmans (A rebours (Against the Grain), 1884), La Bas (Down Here), 1891) and Guy de Maupassant (La Horla, 1886), produced some of the finest works of the European macabre. The movement was violently opposed to the restraint of resemblance in art, and of morals or religion in anything that would prevent the experience of l’horreur et l’extase de la vie, as Baudelaire wrote in Les Fleurs du Mal (The Flowers of Evil), which upon printing in 1857 was seized, and six of the poems banned. Extremes were sought, of terror, pleasure and pain. Huysman’s A rebours appears by implication in Oscar Wilde’s The Picture of Dorian Grey, as the symbol and instrument of ultimate foreign corruption. To explain, the poet Paul Verlaine said “It is made of a mixture of the carnal spirit and the sad flesh, and of all the violent splendours of the declining (La Bas) Empire.”, 780668=A popular and transitional author in the move from historical to contemporary settings for horror stories was Ambrose Bierce. This year saw the publication of Can Such Things Be?, a collection of ghostly tales following on from his grimly realistic war stories. He was also known for his black humour, as demonstrated by The Devil’s Dictionary (1906, under the original title The Cynic’s Word Book)., 816627=The crowning master of contemporary horror writers is Stephen King, known for writing Carrie, The Shining, It, Misery and many more, raising the horror genre to Bestseller status.  Beginning in the 1970s, King’s stories have managed to attract a huge audience, for which he was prized by the U.S. National Book Foundation in 2003., 678692=1988, 891613=Jaime Martinez-Tolentino, Writer” November 19, 2012, 709841=After the re-emergence of horror on stage in the [1970s], producers became more confidant, and we started seeing bigger budgeted shows, starting with Stephen Sondheim’s Sweeney Todd in 1980 [1840s], and [1986]; but not everything was a success. We have already commented on Carrie‘s demise [1974], and musical versions of A Clockwork Orange (1988, penned by Anthony Burgess, who later condemned it [1971]) and Metropolis (Michael White, 1989) also failed to draw crowds. The Woman in Black (Stephen Mallatratt, 1989), however, is a big-budgeted and long running-show, a ‘stunning adaptation’ of a novel by Susan Hill (1983)., 87421=https://robertalexandersheppard.wordpress.com/2013/04/11/poetry-pacific-3-poems-by-robert-sheppard/, 18570=Robert Sheppard is the author of the acclaimed novel Spiritus Mundi, featuring lthriller-action criss-crossing the globe, MI6, CIA & Chinese MSS Intelligence as well as a \"People Power\" campaign to establish a United Nations Parliamentary Assembly--nominated for the prestigious 2014 Pushcart Prize for Literature., 785435=Robert Browning writes The Ring and the Book, a macabre study of a Duke killing his wife, all based on a yellowing legal paper he had come upon in 1860. It is still the longest narrative poem in English literature. Browning is most noted for his dramatic monologues dealing with madness and obsession, including Childe Rolande to the Dark Tower Came [1974] and Porphyria’s Lover (1842)., 321386=The first novel ever to be optioned and rendered as a movie was Thomas Dixon’s Ku Klux Clan epic The Clansman, a bestseller in 1905. D.W. Griffiths paid $2000 for the subsidiary rights to the book and rendered it in his “Birth of a Nation,” which despite its controversial subject matter for many years remained both the top-grossing film in cinema history and a touchstone for the development of the art of cinematic narrative., 760502=The classic Dr Jekyll and Mr Hyde movie is released (Rouben Mamoulian). It won its lead, Fredric   March, an Academy Award [1885]., 777840=Joseph Conrad’s Heart of   Darkness is published. As an exploration of the darker side of the soul   it deserves mention, and is also considered the first twentieth century   novel. Francis Ford Coppola moved the premise into Vietnam to see what would   happen in 1979, whereas Nicholas Roeg’s telemovie (1994) was set in the   original’s time period., 739379=Alfred Hitchcock ‘apparently   had the time of his life’ directing his most successful film, Psycho,   based on [1959]   and forevermore typecasting Anthony Perkins. It was followed by various   sequels (number 2 is rather good) and a telemovie, Bate’s Motel   (Richard Rothstein, 1987). An incredibly prolific director, Hitchcock is   regarded as possibly the master, and definitely unique, in the field of   psychological horror. His distinctive style can be found as early as 1926 (The   Lodger) and as late as 1972 (Frenzy, ‘a closed and coldly negative   vision of human possibility’).   Other works include Vertigo   (1958, adapted from D’entre les Morts by Pierre Boileau and Thomas   Narcejac, though the book was written specifically for Hitchcock) and ‘The   Birds’ (1963, based on Daphne du Maurier’s story. People still haven’t   stopped using Hitchcock’s imagery in their own films [1960s]., 893210=“Robert Sheppard’s new novel “Spiritus Mundi” is a new twist on a well-loved genre. Robert leaves no stone unturned in this compelling page turner you’ll experience mystery, suspense, thrills, and excitement. Robert touches on sexuality and spirituality in such a way that the reader is compelled to ask themselves “what would you do if faced with these trials?” Robert is a master at taking the reader out of their own lives and into the world he created. If you’re looking for a “can’t put down” read pick up Spiritus Mundi!” May 20, 2012, 682622=1943, 889463=“This novel rocks the reader with its supple strength. You want to say “No, No,” and you end up saying, “Maybe.” Political science fiction at its highest, most memorable level.”November 17, 2012, 683569=1895, 718960=Interview with the Vampire is released by Anne Rice. Adding far more to the mythos than ‘Salem’s Lot, it heralded the new direction of Vampire fiction, portraying a vibrant and truly alive community of the undead. Anne Rice became a prominent horror author, her work including a number of direct sequels to Interview, including The Vampire Lestat (1985). She has also had success with historical fiction, and soft and hard-core pornography. Meanwhile the historical vampire novel was also being successfully treated with series from Les Daniels (starting with The Black Castle) and Chelsea Quinn Yarbro (starting with Hotel Transylvania) both from 1978. Neil Jordan directed a successful version of Interview in 1994, and Michael Rymer took on The Queen of the Damned in 2002., 555880=In the second half of the 20th century, a new generation of writers developed a more complex approach. Social Science Fiction, concerned with philosophy, ethics, utopian and dystopian ideas, became the prevalent subgenre. The breakthrough was started by Ivan Yefromov’s utopian novel Andromeda Nebula (1957). He was soon followed by brothers Arkady and Boris Strugatsky, who explored darker themes and social satire in their Noon Universe novels, such as Hard to be a God (1964) and Prisoners of Power (1969), as well as in their science fantasy trilogy Monday Begins on Saturday (1964). A good share of Soviet science fiction was aimed at children. Probably the best known was Kir Bulychov, who created Alisa Selezneva (1965-2003), a children’s space adventure series about a teenage girl from the future., 681633=1967, 438923=The artwork which is getting admiring focus of attention is “At the Seaside of Arild” by the artist David Wallin (1876-1957) from Sweden., 676766=2001, 726384=The Exorcist is made into a movie, written by Blatty and directed by William Friedkin. It becomes the top grossing movie up to that date (so to speak), and won Blatty an Oscar, along with Best Sound (and eight other nominations) and was a wonderful movie. It was followed by an expensive but somewhat silly sequel in 1977, then Blatty returned in top form for Exorcist III in 1990. A re-edit of the original appeared in 2000., 91178=The Pushcart Prize is an American literary prize by Pushcart Press that honors the best “poetry, short fiction, essays or literary whatnot”published in the small presses over the previous year. Magazine and small book press editors are invited to nominate up to six works they have featured. Anthologies of the selected works have been published annually since 1976., 680153=1980, 677828=1992, 680702=1977, 682051=1956, 511362=Luxembourg Olympic Artist Jean Jacoby is the only Artist to win two Olympic Gold Art Medals. He won his second with the above drawing, titled Rugby at the 1928 Olympic Games, 793048=‘His genius had angelic wings, and fed on manna’, said William Hazlitt of Samuel Taylor Coleridge though opium would have been closer to the mark. Other works by this British poet include Kubla Khan (1798, the famous (if not necessarily actual) interrupted transcript of a drug-induced dream) and Christobel (1801) [1872]. Coleridge is also known for being one of the premiere critics of English literature, and is credited with the ‘rediscovery’ of the original, unbowdlerised Shakespeare., 550067=Although there is still some controversy as to when science fiction began in Latin America, the earliest works date from the late 19th century. All published in 1875, O Doutor Benignus by the Brazilian Augusto Emilio Zaluar, El Maravilloso Viaje del Sr. Nic-Nac by the Argentinian Eduardo Holmberg, and Historia de un Muerto by the Cuban Francisco Calcagno are three of the earliest novels which appeared in the continent., 684437=The Blair Witch Project (Daniel Myrick and Eduardo Sánchez) proved that if slick and self-referential weren’t strict requirements for success, then perhaps media-savvy was. Whilst at heart a gimmick, it did not compromise itself, and scores many points for simply doing its best to scare people. The sequel arrived in 2000., 765905=Followed immediately by The Great Depression. In the economic down-turn of the next decade radio plays   and pulps took people’s mind off their problems and saw the creation of such   as the hugely popular The Shadow (1930) and The Spider (1933), both dark   vigilantes, wreaking havoc on the underworld. The former started as a radio   narrator of the ‘Detective Story Hour’, leading into success in magazine   (edited by Frank Blackwell) and novel (the first written by stage magician   Walter B. Gibson) formats, with over 280 novellas detailing his exploits. In   early 1932 the Shadow appeared in his own radio show, and was portrayed by   Orson Welles in 1937-8, and Lynn Shores directed the first movie in ’37,   followed by two serials. The Spider first appeared in The Spider Strikes,   written by R. T. M. Scott, but was soon the work of ‘Grant Stockbridge’, a   pseudonym for several writers, most frequently Norvell Page, totalling 118   novellas (and yes, the first movie serial appeared in 1938, the sequel in   1941). Both of these characters can still be found today, mostly in reprints   and comics (and the lacklustre 1994 version of The Shadow), but the   best preserved of the group appeared in 1939 and is just as well-known as   ever. The adventures of Batman have been published continuously since his   inception, and have had many interpretations, but the recent portrayals of   Tall, Dark and Moody (notably Frank Miller’s The Dark Knight Returns   (1986) and Tim Burton’s cinematic version of 1989 and 1992) are simply a   return to Bob Kane’s original conception. Then there’s Batman Forever,   which was too messy for words., 498759=Britain’s  John Copely winner of a Silver medal in the 1948 engravings and etchings competition, was 73 years of age, making him the oldest Olympic medalist in history. The oldest Olympic medalist outside the art competitions Swedish shooter Swahn who won his last medal at age 72. Indeed, in a modern world in which lifespans have doubled and the elderly composing up to a third of the population of some countries,it is critical to the Olympic Movement that Senior Citizens be included in the competitions, for which Art and Writing, talents that may mature with years instead of declining, may make a meaningful contribution, a change as important in equality of opportunity as the broadening of the Olympics to include women and the handicapped via the Paralympics. All of this is a good reminder to us all that the Olympic Movement was from its very origin involved with the Arts and World Literature as well as sport. Both halves of the Olympic Movement contribute to the overall goals of overcoming conflict and war between nations, building global understanding and appreciation, and supplanting a Clash of Civilizations with a Clasp of Civilizations. It also from the start encouraged the development of the whole persons of the athletes, including both mind and body. This was a goal of the Ancient Olympics as well as the Modern Olympics., 864621=or you can listen in anytime to the recorded Podcasts of the May 17 Interview, or past Interviews:, 743775=Robert Bloch’s novel Psycho is released, featuring an obese Norman Bates and his mother, all based on the   life of Ed Gein [1957]. The author has had innumerable successes with both   novels and short stories as well as television and movie work, and was the   first person to win the World Fantasy Award for Life Achievement in 1975.   Bloch also wrote Psycho 2 in 1983 (unrelated to Richard Franklin’s   film) and Psycho House in 1990. [1939], 729007=Getting the whole gritty-film-thing off to a fine start was Stanley Kubrick’s A Clockwork Orange, based on Anthony Burgess’ novel of 1962. With its alienating view of rape, ultra-violence and Beethoven, it engendered a rather large amount of controversy, but also carried its own message about the rights of the individual. Not strictly a horror story, excess pushes it into the genre. Stanley Kubrick’s other major horrific foray was The Shining (1980). ‘At 14 [David Duchovny] saw A Clockwork Orange “which didn’t necessarily make me want to be an actor, but did make me want to be a criminal!”‘ [interview in The Sun-Herald, 21/1/96]., 504548=The 1928 Olympic Stadium, designed by Jan Wils, won the gold medal in architecture at the 1928 Olympics., 749971=And Vincent Price appears in the film that truly established his horror reputation, André de Toth’s House of Wax. Price specialised in playing exquisitely evil villains, ranging   from the intermittently possessed Charles Dexter Ward (The Haunted Palace,   Roger Corman, 1963) to the Abominable Doctor Phibes (Robert Fuest,   1971 — the 1972 sequel’s pretty good too). Although very fond of camping it   up, he is the genii of some truly chilling moments in movies such as he   produced with director Corman [1960]., 338546=Winston Churchill once famously quipped that America and Britain were two nations “divided by a common language.” That Churchill had an American mother and partnered with Franklin Roosevelt in saving the world from Fascism in WWII underscores the resilience of the “special relationship” which extends to the present not only in political cooperation but also through a shared literary and cultural community. Before 1776 America was decidedly junior in this relationship. As has been observed above, from 1776 to 1900, abetted by copyright piracy, British authors actually constituted the majority of bestsellers in America. With the loss of Empire and the foundational fact that the US had six times the population of the UK and commercial dominance after 1900 the American side of the partnership gradually became ascendant until the marketplace after the 1990’s merged into a common Transatlantic English-language publishing market. Even with the ascendency of the US the tradition of strong British literary influence and leadership continued, even as America found itself largely parochial and resistant to reading works from non-English outside authors. The bond of a common language and shared culture of ideas has proven resilient. The following table illustrates the continuing strong Transatlantic British literary influence over the past century:, 677258=1996, 550913=In Canadian Francophone province Quebec, Elisabeth Vonarburg and other authors developed a tradition of French-Canadian SF, related to the European French literature. The Prix Boreal was established in 1979 to honor Canadian science fiction works in French. The Prix Aurora Awards (briefly preceded by the Casper Award) were founded in 1980 to recognize and promote the best works of Canadian science fiction in both French and English. Also, due to Canada’s bilingualism and the US publishing almost exclusively in English, translation of science fiction prose into French thrives and runs nearly parallel upon a book’s publishing in the original English. A sizeable market also exists within Québec for European-written Francophone science fiction literature., 727542=Wes Craven’s Last House on the Left was loosely based on Ingmar Bergman’s Jungfraukallan (1959, aka The Virgin Spring, winner of a Best Foreign Film Oscar), but became a notorious film in its own right, detailing an intricate revenge on three rapists. It created a tradition followed by Mario Bava’s LHonL II (1972, really Twitch of the Death Nerve (or Carnage, or Bay of Blood…)), House by the Lake (William Fruet, 1977), the ‘wildly misanthropic’ Last House on Dead End Street (Victor Juno, 1977), The New House on the Left (Evans Isle, 1978) and Don’t Go in the House (Joseph Ellison, 1980). Yes, House (Steve Miner, 1986) is theoretically another example (it even shared Sean S. Cunningham as Producer with the original), but is just embarrassing. Wes Craven has directed a number of films in the genre including The Hills Have Eyes I (’77) and II (’85), and with other successes such as [1984] and [1996] has a popular reputation. ‘Director Craven now considers [The Last House on the Left] so grim that it even shocks him.’, 679686=1982, 682556=1945, 683094=1920, 772009=The Lodger, by Belloc Lowndes (filmed in 1926 (by   Alfred Hitchcock), 1932 and 1944, and done twice as an opera), is an early   notable example of many, many works based on Jack the Ripper though Robert   Bloch’s ‘Yours Truly, Jack the Ripper’ (1962) [1959] may be better known. However Alan   Moore and Eddie Campbell’s still incomplete From   Hell (issue 1, 1991) will become the definitive work of fiction on the   subject, we suspect [1984]., 683645=1891, 666298=Copyright Robert Sheppard 2014 All Rights Reserved, 713101=Also released was Mad Max, an independent Australian movie that created a genre. It was the first feature of George Miller, a former doctor who had became interested in the mentality of using cars as a weapon whilst working in casualty (as opposed, he says, to the machinations of a gun culture). While at heart an action movie, this post-apocalyptic melee contains elements of horror not present in the two sequels (1981 and 1985). As well as these, Miller went on to more mainstream successes (including Witches of Eastwick (1987)), but isn’t the George Miller who directed Man From Snowy River., 790223=Dr. Polidori’s The Vampyre is published in the New Monthly Magazine, ‘the first vampire tale of any substance in the English language.’ Originally attributed to Byron, the lead character is in fact a caricature of the poet. A theatrical adaptation by Charles Nodier appeared in 1820, and this was further turned into an opera by Heinrich Marschner, with libretto by Wilhelm Wolbrucke, in 1828. In 1992 Charles Hart provided substantially different lyrics for The Vampyre: A Soap Opera., 681180=1974, 801779=Paradise Lost is John Milton’s epic poem of the fall from Heaven, the English poet dictating his work to his daughters after being left blind in 1652. A strict Puritan, Milton still questioned Christian orthodoxy, and it is his depiction of Satan, his realms and his struggle against omnipotence that give the poem its power. Paradise was regained in 1671., 751103=Acclaimed British writer John Wyndham produces The Day of the Triffids, his best known work along   with 1957’s The Midwich Cuckoos. The books had reasonable film   adaptations in 1963 (Steve Sekely), 1977 (Wolf Rilla) and 1995 (John   Carpenter, the latter two known as The Village of the Damned)., 327339=In America perhaps the first acclaimed “bestseller” was not a work of fiction but rather the political tract “Common Sense” by Thomas Paine, a British author turned American citizen at the time of the American Revolution. In 1776 this book reportedly attained sales of over 500,000 copies at a time when the total population of the 13 American colonies totaled only 3 million, ensuring that distribution effectively reached every American family. This revolutionary work truly influenced World History as few have ever done, and is credited with turning the American people decisively towards the Declaration of Independence in 1776, as well as being a key document in catalyzing the French Revolution in its Declaration of the Rights of Man and the abandonment of the institution of monarchy in 1789. Indeed, many bestsellers connected with key social issues are intimately connected with the rise of democracy upon a tide of public consciousness, as for example the immense success of Harriet Beecher Stowe’s Uncle Tom’s Cabin upon the upsurge of the Abolitionist Movement and the rise of Abraham Lincoln’s Republican Party and Steinbeck’s Grapes of Wrath upon the upsurge of the Democratic Party and Roosevelt’s New Deal following the Great Depression., 493829=Art competitions at the Olympic Games were part of the Olympic program from 1912 to 1948, but were discontinued due to concerns about amateurism and professionalism. Since 1952, a non-competitive art and cultural festival has been associated with each Games., 520295=The “4 1/2 Rings” glitch of the Opening Ceremony of the 2014 Olympics is a small reminder that something is missing from the Olympic system as we know it over the last fifty years, both as to the Summer and Winter Olympics. It is a largely forgotten fact that the founding of the Modern Olympics by Pierre de Coubertin included gold, silver and bronze medal competition in the arts as well as in sports. With the founding of the International Olympic Committee  (IOC) in 1894, and the celebration of the first modern Olympic Games, French Baron Pierre de Coubertin saw the fulfillment of his ideals — men being educated in both mind and body, and competing in sport  rather than war. One of his other desires was to combine both art and sport, and he thus originally included artistic competition in the Olympic Games., 639474=Of course, the identification of the first science fiction writer in history is dependent upon our definition of what is science fiction. That in turn will depend on our definitions of what is science and what is fiction. These terms are not constant but vary and shift with historical, intellectual and cultural circumstance. Nonetheless, looking back on all known past literature it is possible to identify writers in the past who approached most nearly the modern themes, subject matter and imaginative intent of the institution we now regard as the modern genre of “Science Fiction.” Various national or individual claimants to the title of the “the first work of science fiction” are proposed from time to time, from the True History of 2nd Century Roman writer Lucian to some of the tales of the 1001 Arabian Nights, to the 10th Century Japanese “Tale of the Bamboo Cutter” to the Robinson Crusoesque desert island tale Theologus Autodidacticus (The Self-Taught Theologist) by 13th Century Arabic writer Ibn al-Nafis. In my judgment, the Roman writer Lucian has the strongest claim to the title of “the father of science fiction.”, 681715=1962, 61458=C   Copyright 2011 Robert Sheppard   All Rights Reserved, 425407=The art exhibition was held in a hall of the Berlin Exhibition from July 15 to August 16, and displayed 667 works of art from 22 different countries. Additionally, the literature competition attracted 40 entries from 12 countries, and the music competition had 33 entries from 9 countries.[1], 558849=The main German science fiction writer in the 19th century was Kurd Lasswitz. In the 20th century, during the years of divided Germany, both East and West spawned a number of successful writers. Top East German writers included Angela and Karlheinz Steinmuller, as well as Gunther Krupkat. West German authors included Carl Amery, Gudrun Pausewang, Wolfgang Jeschke and Frank Schatzing, among others. A well known science fiction book series in the German language is Perry Rhodan which started in 1961. Having sold over one billion copies (in pulp format), it claims to be the most successful science fiction book series ever written, worldwide. Current well-known SF authors from Germany are five-time Kurd-Lasswitz Award winner Andreas Eschbach, whose books The Carpet Makers and Eine Billion Dollar are big successes, and Frank Schatzing, who in his book The Swarm mixes elements of the science thriller with SF elements to an apocalyptic scenario. The most prominent German-speaking author, according to Die Zeit, is the Austrian Herbert W. Franke., 694531=Twin Peaks, created by David Lynch and Mark Frost, proved that horror can still be successful on television, though it was eventually suspended due to a lack of ratings. The show ran for thirty episodes over two seasons and was followed by a rather good (if not quite as expected) movie in 1992. The show built on a great many sources, including the dramas Laura (Otto Preminger, 1944) and Born to Kill (Robert Wise, 1947 — featuring a victim called Laura Palmer), and has even been seen as a study of Marilyn Monroe’s death. While Mark Frost has since became a successful novelist (starting with The List of 7), David Lynch, remains one of America’s most innovative film-makers, with works such as Eraserhead (1977), Blue Velvet (1986) and Mulholland Drive (2001)., 680316=1979, 466597=Art competitions were held as part of the 1928 Summer Olympics in Amsterdam, the Netherlands. Medals were awarded in five categories (architecture, literature, music, painting, and sculpture), for works inspired by sport-related themes., 677473=1994, 715480=The Swiss artist Hans Rudi Giger opens his ‘Necronomicon I’ exhibition in Europe. It is banned in France and Germany for the supposedly pornographic contents of his ‘landscapes’. However, it was their quality of horrific inhumanity and macabre industrialism that attracted international attention and landed him a particularly successful design contract [1979]. In 1984, the American punk group The Dead Kennedys included a Penis Landscape as a poster in their album Frankenchrist; to have it also banned. ‘Necronomicon II’ was exhibited in 1985, and he also did design work for the film Species (Roger Donaldson, 1995)., 692639=American Psycho by Bret Easton Ellis is a lovingly detailed look at the world of 1980’s commercialism through the eyes of a psychotic murderer, a book ‘gutted…, becoming a media scandal, at the hands largely of those who had not read it or — worse still — had read excerpts only.’ The book was filmed in 2000. With The Informers in 1994, Ellis introduced a more explicit horror metaphor for his vision of universal soul death., 508628=Because of the economy and the remote location of Los Angeles, participation in the athletic events of the 1932 Games was lower than that of 1928. The Arts competition did not suffer from this problem, and the number of art works entered remained stable. Their exhibition drew 384,000 visitors to the Los Angeles Museum of History, Science and Art. Art contests were also held in Berlin (1936) and London (1948), with reasonable success, although the number of entered works had significantly dropped by 1948., 676936=1998, 561588=In Franco-Belgian comics the bande dessinee (“BD”) science-fiction is a well established genre. Among the notable French science fiction comics, there is Valerian et Laureline by Pierre Christin and Jean-Claude Mezieres, a space opera franchise lasting since 1967. Metal Hurlant magazine (known in US as Heavy Metal) was one of the largest contributors to Francophone science-fiction comics. Its major authors include Jean “Moebius” Giraud, creator of Arzach, Chilean Alejandro Jodorowsky, who created a series of comics, including L’Incal and Les Metabarons, set in Jodoverse, and Enki Bilal with the Nikopol Trilogy. Giraud also contributed to French SF animation, collaborating with Rene Laloux on several animated features. A number of artists from neighboring countries, such as Spain and Italy, create science fiction and fantasy comics in French aimed at a Franco-Belgian market., 518182=See Wikipedia on Olympic Gold Medals in the Arts and Olympic Art Competitions 1912-1952:   http://en.wikipedia.org/wiki/Art_competitions_at_the_Olympic_Game1,wP/a>, 676390=2007, 327505=Tom Paine’s Common Sense Sold One Book for every Five Men, Women and Children in 1776 in America, 494292=OLYMPIC ART & LITERATURE MEDALS AWARDED AT THE 1912 SUMMER OLYMPICS IN STOCKHOLM, 682485=1948, 635869=After returning to Earth, the adventurers become trapped in a giant 200 mile-long whale where live many groups of people whom they rout in war. They also reach a sea of milk, an island of cheese and “The Isle of the Blessed,” a species of afterworld. There Lucian meets the heroes of the Trojan War from the Iliad, other mythical men and animals, and even Homer himself. They find the historian Herodotus being eternally punished for the “lies” he published in his “Histories.”, 425028=The art competitions at the 1936 Games were similar to the 1928 and 1932 Games, with medals being awarded in multiple subcategories for each of the five artistic categories.[2] The judges declined to award any medals for three subcategories, and no gold medals for another three subcategories., 803142=An incredible series of gruesome plays jostle each other on the stages of England. The first is traditionally Thomas Kyd’s The Spanish Tragedy (1585) followed by Christopher Marlowe’s Tamburlaine (1587), Dr Faustus (1587) and William Shakespeare’s Titus Andronicus (1594). Shakespeare’s Hamlet (1600) and Macbeth (1605) are also morbid little pieces of some note. Cyril Tourneur’s The Revenger’s Tragedy (1607) and John Webster’s The Duchess of Malfi (1613) are the latter examples, and indeed the last examples of death portrayed in front of an audience in European theatre until Victor Hugo’s Hernani in 1730., 340014=In fact, the culture of the British publishing industry for the hundred years from the 1890’s to the 1990’s was hostile to the idea of the bestseller, with the more genteel and upper-class disdain for the “consumer stampede” by the masses in their millions for a mass-commodity. Even the practice of compiling “Best Seller Lists” as exemplified in the US by the New York Times Bestseller List, the “Bookman” List from 1895, the “Publisher’s Weekly” List from 1912 and others, was frowned upon in the UK as an American barbarism of Babbitian proportions, and it was only in the 1970’s  and the increasing Americanization and Thatcherization of the British publishing industry including the rise of the chain stores that “Bookseller” began to assemble such statistics for the UK trade and the Sunday Times began to make them available for the reading public., 55237=http://www.blogtalkradio.com/icdrrose http://www.blogtalkradio.com/icdrrose/2012/08/01/robert-sheppard–spiritus-mundi-a-novel, 554520=After the fall of the Soviet Union, science fiction in the former Soviet republics is still written mostly in the Russian language, which allows an appeal to a broader audience. Aside from Russians themselves, especially notable are Ukrainian writers, who greatly contributed to science fiction and fantasy in Russian language. Among the most notable post-Soviet authors are H.L. Oldie, Sergey Lukyanenko, Alexander Zorich and Vadim Panov. Russia’s film industry, however, was less successful recently and produced only a few science fiction films, most of them are adaptations of books by Strugatskies (The Inhabited Island, The Ugly Swans) or Bulychov (Alice’s Birthday). Science fiction media in Russia is represented with such magazines as Mir Fantastiki and Esli., 521685=BEYOND SOCHI—A MODEST OLYMPIC PROPOSAL: REVIVAL OF DE COUBERTIN’S CULTURAL OLYMPICS EVENTS FOR WORLD LITERATURE  & THE ARTS IN THE SUMMER AND WINTER OLYMPIC GAMES + TABLES OF OLYMPIC GOLD, SILVER AND BRONZE MEDALS AWARDED FOR THE ARTS & LITERATURE 1912-52, 688787=The Scream series at the cinema and Buffy the Vampire Slayer (1997) on TV provided the new look of horror — media-savvy, slick, self-referential, hugely popular — and occasionally scary (Buffy season 2-3 in particular contained more than a few chilling moments). They are also significant in providing stardom to their creators and principal writers, Kevin Williamson and Joss Whedon — a rare (and wonderful) thing. A link to the past is provided by Wes Craven [1972] who directed the Scream series, and also the similarly referential New Nightmare in 1994. Despite all this success, most follow-ups, even by Williamson and Whedon (such as I Know What You Did Last Summer and Angel) have been less interesting., 679110=1985, 698010=Peter Jackson succeeds the atmospheric The Quiet Earth (Geoff Murphy, 1985) as the voice of horror from New Zealand with Bad Taste, the first of (currently) three splatter movies (with Meet the Feebles in 1989 and Braindead in 1992) from this popular and cult figure. His claims as his two principle influences George Romero [1968] and Buster Keaton. However, these movies didn’t prepare the world for his excellent treatment of a 1950’s murder case in Heavenly Creatures (1994) — or a movie or three about hobbits., 770091=The first issue of Weird Tales is published, the first all-fantasy magazine in the world, it   survived thirty-two years without ever showing a profit. The inaugural editor   was one Edwin Baird, soon succeeded by Farnesworth Wright and, much later, by   Seabury Quinn. The magazine attracted a still-famous plethora of authors ([1923], [1939] and [1942]) and a   small but dedicated audience. Indeed the attempts by public officials of   various cities to ban the November ’24 issue over C. M. Eddy’s story ‘The   Loved Dead’ only increased sales. It was later joined by Famous Fantastic   Mysteries in ’36 and Amazing Stories, and was revived in 1974 and   again in 1984., 400564=Art competitions were held as part of the 1948 Summer Olympics in London, Great Britain. Medals were awarded in five categories (architecture, literature, music, painting, and sculpture), for works inspired by sport-related themes., 682982=1929, 510571=Coordination with UNESCO and United Nations cultural organs could also encourage development of the arts in each country and early professional development amoung the youth of each country; teams from each nation in the arts could be selected by competitions similar to those in the sports half of the Olympics or otherwise as deemed desirable.  Appreciation for the arts across the broader populations of the competing nations and for works of lesser known nations across the world would be fostered. Participation of women, the elderly and intellectuals not so generally attracted to pure sport would thus democratize and universalize the Olympics. A “Gold” in the Olympic Arts could do much to make an artist’s career and promote the recognition of new and innovative artists, making it possible for artists to support themselves and develop their talents from their creative activity. When the first post-war Olympic Games were held in WWI-ravaged Belgium, Art contests were again on the program, although they were little more than a sideshow. This was different for the 1924 Summer Olympics in Paris. There the contests were taken seriously for the first time, and 193 artists submitted works. Remarkably, this figure also includes three Soviet artists, even though the Soviet Union officially did not take part in the Olympic Games, which they considered to be a “bourgeois” festival., 733908=George Andrew Romero invents the   Zombie movie (or at least gives it life), with Night of the Living Dead,   a claustrophobic, effective and really cheap movie. Direct sequels are the   classy Dawn of the Dead (1979) and Day of the Dead (1985),   whereas the film was remade in 1990, written by Romero and directed by the   original FX creator, Tom Savini. Dan O’Bannon continued the tradition in Return   of the Living Dead (1985) (with one dire sequel, and then the   encouragingly straight ROTLD3). Still not content, the prolific Skipp,   and Spector have edited short story anthologies roughly set in Romero’s   universe (The Book of the Dead 1 and 2, 1989 and 1990). Other less   official follow-ups abound. Romero’s ability to realistically portray   less-than-realistic subjects is also shown in one of the great vampire films,   Martin (1977)., 802416=A semi-fictional biography of a Johannes Faustus, scholar and reputed magician, is published in Germany. Christopher Marlowe reads the English translation and creates his play The Historie of the Damnable Life, and Deserved Death of Doctor Iohn Faustus. This is the prototype of the Mad Scientist, later echoed in such characters as Dr. Frankenstein, who sells his soul for knowledge (1818).The tale was more or less directly retold by Goethe in 1808 and Charles Maturin in 1820. Goethe’s version was adapted as an opera by Charles Gounod, libretto by Jules Barbier and Michel Carre, in 1859., 564003=Until recently, there has been little domestic science fiction literature in Korea. Within the small field, the author and critic writing under the nom de plume Djuna has been credited with being the major force. The upswing that began in 2009 has been attributed by Shin Junebong to a combination of factors. Shin goes on to quote the Korean science-fiction writer and editor as saying that, “‘It looks like the various literary awards established by one newspaper after another, with hefty sums of prize money, had a big impact.'”  Another factor cited was the active use of Web bulletin boards among the then-young writers brought up on translations of Western SF. In spite of the increase, at the time, there were still no more than sixty or so authors writing in the field at that time., 563191=Chalomot Be’aspamia is an Israeli magazine of short science fiction and fantasy stories. The Prophecies Of Karma, published in 2011, is advertised as the first work of science fiction by an Arabic author, the Lebanese writer Nael Gharzeddine., 55558=http://www.blogtalkradio.com/icdrrose/2013/05/17/robert-sheppard-global-consciousness, 683394=1898, 758656=The Arkham House publishing   company is founded by August Derleth and Donald Wanderi. Admirers of Lovecraft’s work, they were determined to ensure it survived both the author   and Weird Tales [1923]. Derleth and other authors such as Robert Bloch [1959] and Robert E. Howard began to utilise the mythos in   their own stories, with mixed success., 683964=1765, 501907=While several of the Olympic Art medalists have achieved at least national fame, few of them can be considered well-known artists globally. In fact, the 1924 Games featured better known jury members than artists, with artists like Igor Stravinsky judging the entered works. By eliminating the limitation that the works be sports-related as well as opening the Olympic Arts competition to all stars and professional artists as has already been done for athletes, the greatest world artists, writers, film directors and stars will surely make the Olympic Arts events as prestigious as the sports events., 159550=Book Cover of Spiritus Mundi, Novel by Robert Sheppard 2013, 888337=“Robert was one of my best guests. His novel is as wide ranging as are his interests and expertise. He can explain his various ideas with great clarity and he does this with compassion. Novel is worthwhile reading.”November 18, 2012, 899071=World Literature Forum  is honored to announce that Spiritus Mundi, the acclaimed Cyberthriller Action Novel by Robert Sheppard, the defining work of our Snowden-Orwellian Era,  has been included in the nominations for the presitigious 2014 Pushcart Prize. The thriller action of the novel follows a NSA/CIA/MI6 Counterterrorism team’s cat and mouse cyber-pursuit of nuclear terrorists bent on infiltrating a group of global idealists campaigning for a United Nations Parliamentary Assembly for global democcracy, then  unearthing a much bigger Apocalyptic conspiracy to start WWIII between a secretly allied China, Russia and Iran to make a Pearl Harbor-like sneak attack on the Middle-East’s oil reserves, severing the energy jugular of the vulnerable declining West. Cutting edge MI6/NSA Cyber-techno-penetration  of  the top-secret communications network of the  Chinese Politburo through the tech-avvy and sexual wiles  of neo-Bondian 21st Century MI6 Superspy Etienne Dearlove gives the West its last chance to head off Armageddon.  Find out the final fate of the world by reading Spiritus Mundi now!, 502998=As with the other art forms, a single painting category was on the program until 1928, when it was split out into three sub-categories: drawings, graphic arts and paintings. The categories then changed at each of the following Olympic Games. In 1932, the three categories were: paintings, prints , and watercolors/drawings. Four years later, the prints category had disappeared, and had been replaced by graphic arts and commercial graphic art. At the final Olympic art competition, the three categories were applied arts and crafts, engravings/etchings and oils/water colors. A re-included Arts Olympics could include new technologies such as Computer Art, Performance Art, Conceptual Art, Laser and Holographic Art, Murals and Graffiti-Art. Olympic World Sculpture, 683497=1897, 800891=The first major work of what became known as the Graveyard Poets is published with Thomas Parnell’s A Night-Piece on Death. The group focused on the melancholy and mortality of man, an introspective style that finally led into the wilder fantasies of the Romantics. Other examples include Robert Blair’s The Grave (1743), Thomas Warton’s The Pleasures of Melancholy (1747) and Elegy Written in a Country Churchyard, by Thomas Gray in 1752., 678103=1990, 566464=Mohammed Dib, an Algerian writer, wrote a science fiction allegory about his nation’s politics, Qui se souvient de la mer (Who Remembers the Sea?) in 1962. Masimba Musodza, a Zimbabwean author, published MunaHacha Maive Nei? the first science-fiction novel in the Shona language, which also holds the distinction of being the first novel in the Shona language to appear as an e-book first before it came out in print. In South Africa, a movie titled District 9 came out in 2009, an apartheid allegory featuring extraterrestrial life forms, produced by globally renowned Peter Jackson., 573510=The cyberpunk genre emerged in the early 1980s; combining cybernetics and punk the term was coined by author Bruce Bethke for his 1980 short story Cyberpunk.  In Cyberpunk works the time frame is usually near-future and the settings are often dystopian in nature and characterized by misery. Common themes in cyberpunk include advances in information technology, especially the Internet, visually abstracted as cyberspace, artificial intelligence and prosthetics, and post-democratic societal control where corporations have more influence than governments. Nihilism, Post-Modernism and film noir techniques are common elements, and the protagonists may be disaffected or reluctant anti-heroes.. Noteworthy authors in this genre are William Gibson, Bruce Sterling, Neal Stephenson and Pat  Cadigan. James O’Ehley has called the 1982 film Blade Runner the definitive example of the Cyberpunk visual style., 676452=2006, 682414=1951, 93522=World Literature Forum  is honored to announce that Spiritus Mundi, the acclaimed Cyberthriller Action Novel by Robert Sheppard, the defining work of our Snowden-Orwellian Era,  has been included in the nominations for the presitigious 2014 Pushcart Prize. The thriller action of the novel follows a NSA/CIA/MI6 Counterterrorism team’s cat and mouse cyber-pursuit of nuclear terrorists bent on infiltrating a group of global idealists campaigning for a United Nations Parliamentary Assembly for global democcracy, then  unearthing a much bigger Apocalyptic conspiracy to start WWIII between a secretly allied China, Russia and Iran to make a Pearl Harbor-like sneak attack on the Middle-East’s oil reserves, severing the energy jugular of the vulnerable declining West. Cutting edge MI6/NSA Cyber-techno-penetration  of  the top-secret communications network of the  Chinese Politburo through the tech-avvy and sexual wiles  of neo-Bondian 21st Century MI6 Superspy Etienne Dearlove gives the West its last chance to head off Armageddon.  Find out the final fate of the world by reading Spiritus Mundi now!, 864507=http://www.blogtalkradio.com/icdrrose http://www.blogtalkradio.com/icdrrose/2012/08/01/robert-sheppard–spiritus-mundi-a-novel Spiritus Mundi, Novel by Robert Sheppard: Table of Contents, 676873=1999, 337154=ORIGIN OF BESTSELLERS ON US BESTSELLER LISTS 1900-2000 (%), 686757=Although better known internationally for its giant monster movies [1954], Japanese cinema has a strong tradition of more subtle horrors. This year, Hideo Nakata’s Ringu appeared, achieving great success at home and abroad. Other recent examples are Sogo Ishii’s Enjeru dasuto (aka Angel Dust, 1994), Takashi Miike’s Oodishon (Audition, 1999) and Kiyoshi Kurosawa’s Kairo (Pulse, 2001). They are challenging and evocative films, often involving shifting perception, alienation and growing dread. Ringu was based on a novel by Kôji Suzuki, and there is a complex web of alternates, including remakes, sequels and a prequel (Gore Verbinski did the US version). Hideo Nakata has kept busy, including the excellent Honogurai mizu no soko kara (Dark Water) in 2002., 724749=A Maine author gives up trying to write science fiction and suspense novels and tries again by padding one of his horror novellas to double size. Carrie becomes an instant best-seller, and launched a career that would see Stephen King become one of the most widely read modern authors (‘whatever he writes is mainstream fiction.’) Other novels include ‘Salem’s Lot (1975), The Stand (1978/1990) and It (1986), and he has also had considerable success with short fiction (for example Skeleton Crew in 1985), novellas (Different Seasons in 1982) and non-fiction (Danse Macabre in 1981), as well as more experimental forms — the serial novel The Green Mile (1996) and the e-book Riding the Bullet (2000). His sharp eye for detail and character have proved somewhat resilient to being adapted for the screen, though there are notable exceptions [1990]. A more spectacular flop, however, was the 1988 stage musical of Carrie which lost its producers some eight million dollars. Because of its popularity King’s fiction has become centre stage in the American debate over censorship, particularly within schools, though Omni Magazine says on the matter his works are ‘almost simplistically humane and moral.’ Some of the pre-Carrie novels were later published under the name of Richard Bachman., 509157=The growth continued at the 1928 Amsterdam Olympics, where over 1,100 works of art were exhibited in the Municipal Museum, not including the submissions in World Literature, music and architecture. Artists were allowed to sell their works at the close of the exhibition, which was rather controversial given the IOC’s amateurism policy, which required all competitors to be amateurs. In Amsterdam, the number of events was also increased, as four of the five fields of art were subdivided, creating more events., 487172=Art competitions were held as part of the 1920 Summer Olympics in Antwerp, Belgium. Medals were awarded in five categories (architecture, literature, music, painting, and sculpture), for works inspired by sport-related themes., 682911=1933, 706071=With a little publicity from Stephen King, an obscure film made in 1980 becomes another ‘instant classic’ of horror. In Evil Dead, director Sam Raimi creates a tangible air of menace with some superb camera work, even if the cast are hard to tell apart. The hilarious sequel appeared in 1987, and we wish they had kept the original title of the increasingly separate third entry — Medieval Dead. Sam Raimi was also instrumental in the production of Shaun Cassidy’s American Gothic, and directed The Gift (2000)., 808056=600 BC to 200 AD—- The bestselling book of all time, the Bible, Old and New Testaments, along with its sequels including the Koran, could easily be labeled horror, for where else can you find fallen angels, demonic possessions, and an apocalypse absolutely terrifying in its majesty, inclusive of the lives of all of us, all in one volume?, 895559=Included in the Pushcart 2014 Nominations were several of well-known author Robert Sheppard’s “Poems from Spiritus Mundi” including “Moby Dick” and “Zeno’s Paradox” which were published in and nominated for the Pushcart Prize by Poetry Pacific and available here and on their website:, 771101=The German director Friedrich   Murnau shoots Nosferatu, eine Symphonie des Gravens and is immediately   sued by the Stoker estate [1897] (who probably hadn’t heard of the 1921 Hungarian Drakula   — and that’s all we know as well). This is despite substantial changes to   the source (a habit taken up by later screen-writers), enough to count as a   different story. It was remade with lots of rats in 1979 by Werner Hertzog., 508059=The literature competitions were divided into a varied number of categories. Until 1924 and again in 1932, there was only a single literature category. In 1928, separate categories were introduced for drama, epic and lyric literature. Awards in these categories were also presented in 1948, while the drama category was dropped in 1936., 699477=Hellraiser marked Clive Barker’s entry into the movies in a spectacular fashion (well, he was involved in Underworld (George Pavlou, 1985) and Rawhead Rex (Pavlou, 1986), which is why he took up directing. And then there were his much earlier but only recently released efforts, Salome (1973) and ‘The Forbidden’ (1975-8). Oh well). Under all that gore is a very well-made, powerful (and oddly poetic) movie, unfortunately the start of an increasingly irrelevant series. Clive Barker adapted the story from his own Hellbound Heart, and then went on to direct the far more accessible Nightbreed (based on Cabal), and the disappointing Lord of Illusions (1995). Candyman (Bernard Rose, 1992, based on Barker’s The Forbidden) and sequel show the dangers of trying to mesh Barker’s work with more mainstream horror ideas. Resurrected lover indeed., 696995=The first of the Hot Blood series is released, edited by Jeff Gelb and Lonn Friend. The meshing of explicit sex and sexuality with the horror field came of age, and has become the most obvious trend of written Nineties genre fiction. Still mostly collections of short stories (though, more accurately, it’s the anthologies that are getting the label attached) further examples include Dan Simmons’ Lovedeath (1993), Dark Love, 1995, edited by Nancy A Collins and others, and, perhaps the most successful so far, Ellen Datlow’s 1994 anthology Little Deaths., 679572=1983, 735772=John Astin and Carolyn Jones are the stars of a new TV show, The Addams Family, based on the   cartoons of Charles Addams [1932]. Unlike The Munsters, ‘essentially a straight-forward   Stupid Dad comedy,’   which also premiered in the   same year, as well as numerous cartoons featuring the trappings of horror   that would follow, The Addams Family was a truly macabre program,   maintaining the essential dignity of its characters in their naïve   interactions with the outside world. It contained sixty-four episodes,   running in American prime-time till September 1966. A guest appearance on Scooby-Doo   lead to an animated series between ’73 and ’75 (with a young Jodie Foster as   Pugsley) and movies were made in 1991 and 1993, directed by Barry   Sonnenfield. They were purportedly based on the original cartoons and not the   TV show, but there is some disagreement., 741966=Where Universal [1930s] had left off,   across the Atlantic, Hammer’s House of Horror took over. The small British   studio had existed since WWII, but gained its name with treatments of all the   old favourites, updated for modern audiences and more lenient censorship   laws. Peter Cushing and Christopher Lee hit the screens in The Curse of   Frankenstein in ’57, as the doctor and monster respectively; the double   act was repeated in Dracula in ’58 and The Mummy in ’59; all   directed by Terence Fisher, who added Curse of the Werewolf in ’61.   Sequels followed until both producers and audience ran out of steam, though   the studio produced a great variety of product, including effective   psychological horror and the dark SF of the Quatermass films. Considered the   last gasp, The Legend of the Seven Golden Vampires (’74), was a   co-production with a Hong Kong studio and involved martial arts. In 1990 the   British band Warfare released Hammer Horror, an authorised Hammer concept   album. ‘With Universal one had always known that nothing ghastly would   assault the eye. With Hammer, one was constantly in danger from the sight of   dripping blood, rotting corpses and bits of brains, all in vivid color; to   say nothing of well endowed young women falling victim to the monster in various   stages of undress.’, 798007=The Japanese student of literature and critic Uneda Akinari, publishes Ugetsu Monogatari, or Tales of Moonlight and Rain. Drawing inspiration from popular myth, this collection of romantic and chilling stories includes ‘The House Amidst the Thickets’, ‘The Chrysanthemum Trust’ and ‘The Carp that Swam in my Dreams’. ‘The House’, in which a soldier comes home from the war to find everything exactly as he left it… exactly, formed the basis for the 1953 film Ugetsu, by Mizoguchi Kenji., 806873=La Comedia, or The Divine Comedy as it came to be known, of Dante Alighieri is written in Italy. This semi-autobiographical poem sets forth one of the most influential descriptions of Hell in the literature, though Dante’s vast and intricate plan has, in the public eye, been superseded by Milton’s vision 1667. Even less well-known are the two sections after Inferno that complete the poem, Purgatorio and Paradiso., 789279=Hector Berlioz’s Symphonie Fantastique. Titanic and shocking in the extreme to the listeners of his day, Berlioz’s masterwork retains the ability to conjure up just the grotesque and frightening images of nightmare and death he had in mind when he named movements of the symphony March to the Scaffold and Dream of a Witch’s Sabbath. Robert Schumann described ‘malformed creatures of all sorts… lamentations, howls, laughter, cries of pain… demoniac orgies… death bells’ in the final movement (with not a little discomfort)’., 506347=A single event for music was held until 1936, when three categories were introduced: one for orchestral music, one for instrumental music, and one for both solo and choral music. In 1948, these categories were slightly modified into choral/orchestral, instrumental/chamber, and vocal music. The juries often had trouble judging the pieces, which were entered on paper. Possibly related to the problematic judging, juries frequently decided to award only a few prizes. On two occasions, no award was given out at all (in the 1924 music category and in the 1936 instrumental music category). 1936 marked the only occasion when the winning musical works were actually played before an audience. Josef Suk was the only well-known musician to have competed, winning a silver medal in 1932. In a revival of the Olympic Music event the scope could be much widened to emulate the Grammy’s and other awards for Rock, Pop, Jazz, Blues, Music Videos, Techno, Rap, Hip-Hop, etc. and open the event to all of the professional stars and non-professionals as well. Olympic World Architecture, 501288=Judging by the medals won, Luxembourg painter  Jean Jacoby was the most successful Olympic Artist, winning the Gold medal for his 1924 painting Étude de Sport, and for his drawing Rugby in 1928 Swiss Artist  Alex Diggleman won three medals, a Gold one in 1936 (for his poster Arosa I Placard), and a Silver and a Bronze in the 1948 applied arts & crafts class, both with commercial posters. Danish writer  Josef Petersen won a Silver medal on three occasions: in 1924, 1932, and 1948., 681293=1973, 865408=CELEBRATING SPIRITUS MUNDI’S AMAZON RELEASE DAY WITH MAY 17 BLOGTALKRADIO AUTHOR INTERVIEW WITH DR. ROBERT ROSE 10:00 AM PST __________________________________________________________________________, 801378=Not the largest or most gruesome of the witch trials (Bamberg, Germany, 1623-1633 comes to mind), the events in Salem, Massachusetts are definitely the most famous. A group of young girls began to claim local women were bewitching them. The first arrest was a slave Tituba who provided all the details that could be wished to capture the imagination. Prominent theologians such as Cotton Mather provided legitimization, and things ran on from there., 579876=Emerging themes in the 1990s included environmental issues, the implications of the global Internet and the expanding information universe, questions about biotechnology and nanotechnology, as well as a post-Cold War interest in post-scarcity societies; Neal Stephenson’s The Diamond Age comprehensively explores these themes. Lois McMaster Bujold’s Vorkosigan novels brought the character-driven story back into prominence. The television series Star Trek: The Next Generation (1987) began a torrent of new sci-fi shows, including three further Star Trek spin-off shows (Deep Space 9, Voyager and Enterprise) and Babylon 5. Stargate, a movie about an ancient portal to other gates across the galaxy, was released in 1994. Stargate SG-1, a TV series, premiered in 1997 and lasted 10 seasons with 214 episodes. Concern about the rapid pace of technological change crystallized around the concept of the “technological singularity” or the rise of intelligent computers and androids to power over humans, popularized by Vernor Vinge’s novel Marooned in Realtime and then taken up by other authors., 627459=The other contenders for the title of the first work of science fiction are clearly much weaker. The 1001 Nights Arabian Entertainment, though incorporating some sci-fi motifs is clearly of the fantasy rather than sci-fi genre, with the laws of science not restraining the free play of fantasy and negating the comparability of the fantastic realm with the world of our lived-in reality. The Japanese 10th Century “Tale of the Bamboo Cutter” (Taketori Monogatari) presents a fantasy of a “Tom Thumb” sized princess, Princess Kayuga, discovered and born from a bamboo stalk by a cutter who proves to be a princess of the Moon People. The tale tells of how she grows up on earth in the family of the bamboo cutter and is courted by all the earthly princes and proposed to by the Emperor of Japan. She rejects all these suitors, however, until an embassy from the Moon comes to return her to her lunar home, evocative also of the Chinese tale of Chang’E. Though incorporating the motif of interplanetary travel and civilizations, there is little of science or continuity of the laws of nature as a restraint on pure fantasy and impossibility. Thus, on the whole, the title of “The Father of Science Fiction” and “The First Work of Science Fiction” in history and World Literature is best conferred on Lucian and his “True History.”, 676522=2003, 750742=The Thing is released, directed by Christian Nyby   (really under the control of Howard Hawks). It was an adaptation of J. W. Campbell’s ‘Who Goes There?’ (1938) and ‘contains the first space monster on   film, and is quite nimbly made.’ The story was re-adapted by John   Carpenter in 1982 (it looked real good, but did anyone understand it?)., 722767=The Texas Chainsaw Massacre (Tobe Hooper) is perhaps the most notorious of the slasher genre. This is the second important work to be based on the case of Ed Gein [1957] (other examples are Three on a Meathook (William Girdler, 1973) and ‘probably the most clinical and closest to the truth’ Deranged (Jeff Gillen and Alan Ormsby, 1974 — not to be confused with 1987’s twisted study of trauma shock directed by Chuck Vincent)). Halliwell says of Massacre, it is ‘nothing but shocks and gore, but the beginning of the wave of such deplorable movies…’ whereas McCarty reckons that ‘rather than gobs of graphic gore, it’s the pervading atmosphere of violence and depravity… that makes it seem so relentless.’, 467389=Jan Wils won the gold medal for the design of the Olympic Stadium in Amsterdam, 896757=The Pushcart Prize is an American literary prize by Pushcart Press that honors the best “poetry, short fiction, essays or literary whatnot”published in the small presses over the previous year. Magazine and small book press editors are invited to nominate up to six works they have featured. Anthologies of the selected works have been published annually since 1976., 682841=1935, 778476=The American writer Henry James publishes the novella The Turn of the Screw, ‘the favourite ghost story of people who don’t like ghost stories’ an early presentation of the evil child tale. It was adapted memorably as both opera (by Benjamin Britten in 1954, libretto by Myfanwy Piper), and film (Jack Clayton’s dead creepy The Innocents in 1961)., 778954=Abraham ‘Bram’ Stoker publishes Dracula, or The Un-Dead. [1456], [1922], [1925], [1927], [1930s], [1960s], [1970s], [1990s]. ‘Dracula’s Guest’ is a related short story, and not necessarily a missing chapter as is widely thought. Other works by this Irish stage manager are not as memorable, and include The Lady of the Shroud in 1908, and The Lair of the White Worm in 1911, which desperately needed Ken Russell [1986]., 494166=Art competitions were held as part of the 1912 Summer Olympics in Stockholm, Sweden. It was the first time that art competitions were part of the Olympic program. Medals were awarded in five categories (architecture, literature, music, painting, and sculpture), for works inspired by sport-related themes., 817670=Many modern novels claim an early description of the living dead in a precursor to the modern zombie tale, including H.P. Lovecraft’s stories such as “Cool Air,” (1925) “In The Vault,” (1926) and “The Outsider,” (1926). Richard Matheson’s 1954 novel I Am Legend would also influence an entire genre of apocalyptic zombie fiction epitomized by the classic films of George A. Romero., 776460=The Listener is published, a book of short stories   by Algernon Blackwood containing his best-regarded work, ‘The Willows’.   Blackwood was only one of a number of successful authors belonging to the   Order of the Golden Dawn, an occult society created in 1888 by Samuel Liddell   MacGregor Mathers, and whose most infamous member was Aleister Crowley. Other   notable members were William Butler Yeats, Arthur Machen (debuting with ‘The Great God Pan’ in 1894), Lord Dunsany and the incredibly popular (in his   time) Sax Rohmer who gave the world Dr Fu Manchu. This group represented not   only most of the weird fiction originating in the UK at the time (one report   lists Bram Stoker as a member), but is the last flourishing of English horror literature till James Herbert and Clive Barker [1984]., 681857=1959, 890167=“This new novel ‘Spiritus Mundi’ brings together history, politics, future society, and blends with a plausible World War Three scenario. I have read it and find it over the top fascinating. I am very glad to see Robert share his creativity with the world through this work of fiction, and know it will be a huge hit.” April 28, 2012, 767799=The unfinished novel The   Trial is released against the wishes of the (deceased) Franz Kafka (and   indeed the actual trial was never written). Kafka has captured the essence of   waking nightmare in an ever-shifting dream-scape of bureaucracy gone mad, and   ‘at least indirectly influenced much of modern horror fiction.’   Orson Welles made a good-looking movie of the novel in 1962, starring Anthony   Perkins as Josef K., 683323=1907, 889153=“Robert Sheppard’s Novel Spiritus Mundi confronts politics and philosophies of the world. He’s examined multiple layers of personality in his characters; male, female, Chinese, Arab, English, and American melding them into a story of possible outcomes. How else can I convey the intelligent presentation of fiction woven with sensitivity to our world’s governments, religious influences and sectarian principles? We must not forget the influence of a largely secular world. Robert tirelessly checked, rechecked and triple checked his resources in order to bring a fiction of occurrence, and psychological impact as set forth in his novel Spiritus Mundi.”November 18, 2012, 565219=Indian science fiction, defined loosely as science fiction by writers of Indian descent, began with the English-language publication of Kylas Chundar Dutt’s A Journal of Forty-Eight Hours of the Year 1945 in the Calcutta Literary Gazette (1835). Since this story was intended as a political polemic, credit for the first science fiction story is often given to later Bengali authors such as Jagadananda Roy, Hemlal Dutta and the polymath Jagadish Chandra Bose. Similar traditions exist in Hindi, Marathi, Tamil and English. In English, the modern era of Indian speculative fiction began with the works of authors such as Samsit Basu, Payal Dhar, Vandana Singh and Anil Menon. Works such as Amitav Ghosh’s The Calcutta Chromosome and Salman Rushdie’s Grimus and Boman Desai’s The Memory of Elephants are generally classified as magic realist works but make essential use of science fiction tropes and techniques., 678431=1989, 517201=Between 1912 and 1952, art competitions were held as part of the Olympic Games, with gold medals being awarded in categories such as architecture, literature,, 319401=Agatha Christie (1890-1976) was never “Number One” on any bestseller list. She only came close in 1975 placing as No. 2 with Curtain and No. 2 in 1976 with Sleeping Murder. Yet her cumulative sales have been credited by the Guinness Book of Records as the very bestselling novelist ever, with a cumulative total, including translations into all major languages, of over two billion volumes—ranking with the Bible and Koran in mass distribution. This highlights an internal contradiction and conundrum in the very concept of “the bestseller” as the best selling genre novelist over half a century never attained the “fastseller” status of attaining the top spot on the lists, as had Margaret Mitchell with Gone With the Wind at over 1,000,000 first year sales or Harper Lee with To Kill A Mockingbird. Tellingly of the “bestseller” category, both Mitchell and Lee only wrote a single novel, a relative “flash in the pan” compared to the decades-long productivity of Christie. Similar conditions recur with genre-prolific writers such as Barbara Cartland and her 600+ romances, Georges Simenon, Louis D’Amour and others., 348240=The achievements of American capitalism have always been ambiguous. The “Robber Barons” have shown the vicious side of capitalism alongside the “creative entrepreneurs” and innovative enterprisers. For the first one-hundred years of the history of the American publishing industry the “flag of free enterprise” was that of the Jolly Roger. Bestsellers were priced low enough to become accessible to the ordinary middle-class reader in significant part because most of the editions were pirated by virtue of the refusal of the US government until 1891 to join in the relevant international copyright conventions that were beginning to secure authors’ rights across Europe. The dominance of American publishing was built on blatant theft and piracy of famous works by European authors, a condition famously denounced by Dickens on his visits to America and hypocritically forgotten by those wishing to paint America as the eternal champion of intellectual property rights.  The scholar F.L. Mott in his seminal work “Overall Best Sellers in the United States” surveyed the history of book sales in the US for books which sold copies numbering over 1% of the total population in the decade of their publication, his working definition of “bestsellerdom.” He found that from 1776 to 1900 of the 124 “bestsellers” thus defined in America, 74 were of British origin and largely published in pirated American editions which paid no copyright to their authors, while another 15 were by other European authors, leaving native American authors who were protected by American copyright far behind. Thus the “Mother Country” continued to subsidize her rebellious American offspring and underwrite its literature far after political independence. The American book, piratically immune from the cost of copyright evolved as a radically less expensive book sold closer to production cost that ultimately was affordable to the common man. US book prices often being five to ten times less expensive than premium editions of the same book in Britain, a foundational fact which made the rise of the American bestseller possible. This piratical condition persisted until 1891 when the passage of the Chase Act in the US finally brought American law into accord with European copyright by recognition of the enforceability of foreign copyright rights within America., 683814=1818, 353037=Of course authors for centuries have sought the key to the puzzle of what makes a bestseller. While there are some recurrk�) patterns the answer remains elusive. Take the year 1923, the date of the emergence of James Joyce’s Ulysses, voted the greatest novel of the last hundred years by critics in 2000, alongside T.S. Eliot’s The Waste Land and D.H. Lawrence’s Aaron’s Rod. The Number One bestselling novel of that year, however, was far from any of those classics, but rather Black Oxen by Gertrude Atherton, a semi-sci-fi tech fantasy account of a women’s rejuvenation through a Viennese scientist’s then cutting-edge X-ray technology. This mythos of the eternally youthful beautiful woman was part of the “Roaring 20’s” cult of “the Flapper” or independent woman cut free from tradition, biology and time, itself a subset of the “Golden Youth” generation epitomized by Fitzgerald’s “be forever young or die now” novel The Beautiful and the Damned of the same year and The Great Gatsby published two years later. It was a forerunner of the later work After Many a Summer Dies the Swan, Aldous Huxley’s saga of an ageing California billionaire’s high-tech search for the biological secret of immortality. Black Oxen thus epitomized and gave expression to the “consciousness of the moment” and became “the book of the day” for its camera-flash moment, to be deservedly forgotten as that moment in history faded and passed away., 749371=Gojira was the highly impressive start of a   long line, and if you don’t recognise Inoshiro Honda’s film, perhaps its   occidental title will give you a hint: Godzilla: King of the Monsters.   Well over twenty films have been devoted to the exploits of Godzilla, mostly   the product of Honda and Eiji Tsuburaya, and other examples followed:   Baragon, Ghidorah, Gaos, Gamera, Rodan, Manda, Mothra… All followed a   strict ritual of killer breath and city-destroying tendencies (Tokyo suffered   many ignominious deaths). And the reason for all this isn’t too hard to find   [1939-1945].   The US version added Raymond Burr as a reporter to the original, released in   1956. [1998], 889705=“Robert Sheppard is an exceptional thinker! His work should be read and made the subject of critical study.”May 26, 2012, 761319=Fritz Lang’s M is released, the first serious movie based on a serial killer (played brilliantly by Peter Lorre), its impact for the modern audience is still   considerable. The German director had already made the classic Metropolis   five years earlier. Lang’s The Testament of Dr Mabuse (1933), a Gothic  thriller, pitted the police protagonist of M against an insane scientist. Joseph Losey remade M in 1951., 730935=While there are certainly individual novels of great merit in the genre up to this point, horror fiction had been dominated by the short story since the demise of the Gothic Novel in the previous century. That all changed in this decade, and the novel would soon be the dominant form. Preceded by such successes as Levin [1967], Fred Mustard Stewart’s The Mephisto Waltz (1969) and Blatty [1971], the deluge began in 1973, soon finding Stephen King [1974] as a champion., 679011=1986, 805721=Vladislav Basarab of Transylvania gains the crown of Wallacia for the first time (until 1462, and again briefly in 1468). From his father he earned the nickname ‘Dracula’, son of the Dragon, but he earned for himself the name Vlad the Impaler, for his favorite method of execution, the precise details of which you don’t want to know about. Despite a large amount of slander by his political opponents, many of the tales of his cruelty were true (he is said to have killed over 40,000 people in his reign). He was also a staunch defender of Christendom from the Turkish threat. O’ Religion!, 515978=The 1928 Olympic Stadium, designed by Jan Wils, won the Olympic Gold Medal in Architecture at the 1928 Olympic Games., 682322=1952, 745055=Shirley Jackson’s The Haunting of Hill House, ‘perhaps the most critically respected genre   novel of the last fifty years has influenced just about everybody,   really. If they only knew it, for she is perhaps the opposite of the   archetypical horror author — both popular and critically acclaimed during   her life, but too soon forgotten. Other novels such as We Have Always Lived in the Castle (1962) and various short stories such as The   Summer People form a body of work both quiet and profoundly disturbing.   In 1963 Robert Wise created an extremely successful adaptation of Hill   House with The Haunting., 757497=It was a time of atrocity. The   Nazi Movement in Germany, under the leadership of Adolf Hitler, attempted the   genocide of the Jewish people, creating one of the enduring symbols   of the Bad Guy. Meanwhile, on August the 6th and 9th of 1945, America showed   the world a new type of Horror; its canvas: Hiroshima and Nagasaki [1954]., 465969=The art competitions at the 1928 Game was larger in scope than for previous Games. Instead of a single competition in each of the five artistic categories, awards were presented in multiple subcategories.[2] The judges of the music competition declined to award any medals in two of the three subcategories, and only presented a single bronze medal in the third., 590610=Clarke is best known for his works related to 2001: A Space Odyssey, which became an immense success through its embodiment in the epic 1968 Stanley Kubrick film. The works present a spiritual mystery of man’s origins and destiny in the universe, including such iconic scenes as discovery of the black obelisk, the struggle of the protagonist with the homicidal computer “Hal” and the imagery of spiritual rebirth through voyaging through space. It formed the consciousness of a generation decisively convinced that humanity’s spiritual destiny was linked with space exploration. It was followed by numerous sequels., 312381=Ray Bradbury with novels such as Fahrenheit 451, his satire on philistine driven TV culture, broke out of the genre ghetto and began to attract a mass readership and critical acclaim. Epics such as Frank Herbert’s Dune became cult classics, as did Isaac Asimov’s Foundation Trilogy.  Michael Crichton’s technothriller The Andromeda Strain was the first Science Fiction work to break into the Bestseller ranks. Arthur C. Clarke’s novelization of Stanley Kubrick’s epic film 2001 A Space Odyssey (originally based on one of Clarke’s short stories) leveraged the cinema exposure to attain bestseller status. Similarly, such tie-ins as William Kotzwinkle’s novelization of ET: The Extraterrestrial and The Return of the Jedi Storybook achieved No. 1 Bestseller status., 355816=Yet many books that proved to be part of the canon of masterpieces also attained remarkable sales: Dickens’ A Tale of Two Cities sold 200 million copies, Tolstoy’s War and Peace 40 million, and Fitzgerald’s The Great Gatsby and Orwell’s 1984 achieved 25 million each. That is not to mention the mega-distribution of the great religious scriptures with the Bible printed in over 5 billion copies and the Koran close behind at 4 billion. Such classics, however, rarely made the “Bestseller Lists” as they had rather the long-term staying power of the “slowseller,” the classical tortoise which eventually surpasses the exhausted hare of the bestseller sprint., 425679=Art competitions were held as part of the 1936 Summer Olympics in Berlin, Germany. Medals were awarded in five categories (architecture, literature, music, painting, and sculpture), for works inspired by sport-related themes., 755948=‘Kiss me and I’ll claw you to death’ ran the publicity tag for Val Lewton’s Cat People (directed by   Jacques Tourneur), produced, as all his work, to a list of titles provided   for him by his superiors at RKO. What RKO wasn’t expecting (and wasn’t sure   it wanted) was a series of movies of subtle horrors and meticulously   maintained atmosphere. Examples include Isle of the Dead (Mark Robson,   1945) and I Walked with a Zombie (Jacques Tourneur, 1943) and the   mostly unrelated sequel Curse of the Cat People (Robert Wise and   Gunther Fritsch, 1944). Cat People was also remade with lots of sex,   Nastassja Kinski and a rather nice panther in 1982 (and Robert Bloch also   wrote a comic version for TV in 1973)., 763005=It was also the last decade of   the pulps, by this stage there were titles for just about every taste, and   the ‘Spicy’ — read mildly erotic — range was introduced. Inspired by a   visit to the Grand Guignol Theatre in Paris [1890s], Henry Steeger, president of Popular   Publications, revamped the Dime Mystery Magazine, adding Terror   Tales and Horror Stories in the next two years. The horror pulps   would last till 1941 — typical content being described as ‘sex-sadism with   luscious females on the covers suffering the usual ignominies: whippings,   roastings and mad-virus inoculations.’, 753252=This is the magic year for horror on television, when everybody decided to convert their radio series   into a more visual medium. Lights Out had started as a series of   specials in 1946, and became a regular series, and Appointment with Fear and Suspense also made the transition. A less successful show of ’49   was Starring Boris Karloff, which turned into Mystery Theatre Starring   Boris Karloff, and then hit pay-dirt as Thriller. [1960s]., 717208=They Came From Within, aka Shivers (among others), is an early work of Canadian director David Cronenberg, one of the best modern directors of understated psychological horror (well, and overstated…). This and his Rabid (1977) take Romero’s premise [1968] and add a healthy dose of sexual release. His unique visions continued in The Brood (1979), Dead Ringers (1988, an adaptation of Bari Wood and Jack Geasland’s 1977 Twins, at least for legal purposes), The Naked Lunch (1991, sort of an adaptation of the controversial William S. Burroughs’ 1959 novel), and Crash (1996 — even more controversial, from Ballard’s novel), though he is possibly best known for his remake of The Fly (1986 — winning an Oscar for make-up). Cronenberg also made a convincing psychiatrist/psychopath in Clive Barker’s Nightbreed (1990), [1987]., 752711=The main action this decade, in the cinema at least, was science fiction, but most of it fits snugly within   this assembly. It hadn’t taken long after World War II for another conflict   to appear and these films were a telling indication of Cold War tension (and,   by the way, of the rush of UFO sightings that began in earnest in 1947), in a   decade ‘in which anxiety, paranoia and complacency marched hand in hand.’   The themes were internal invasion, corruption and paranoid fantasies. The classic Invaders From Mars (William Cameron Menzies, 1953) and It   Came From Outer Space (Jack Arnold, 1953) are early examples (though,   really, the first sign was Spencer Gordon Bennet and Fred Brannon’s The   Purple Monster Strikes (1945)), and The Thing [1951] and Invasion of   the Body Snatchers [1956] are probably   the best of the breed. Only in War of the Worlds (Byron Haskin, 1953 [1896]) and Earth versus the Flying Saucers (Fred F.   Sears, 1956) were large scale invasions portrayed. Naturally enough,   post-holocaust movies started to appear, and it was also the decade of the   monster movie, giant ants, silly robots, hairy beasts (and mixtures of the   two), Neanderthal men, lizard-skin girl-lusting critters and on and on (Jack   Arnold’s The Creature from the Black Lagoon (1954) is the best   example), mostly the product of science gone wrong. Mind you, the Japanese   had their own thoughts on that subject [1954]., 677980=1991, 680852=1976, 598825=In the early 20th century, pulp magazines helped develop a new generation of mainly American science fiction writers, influenced by Hugo Gernsback, the founder of Amazing Stories magazine, after whom the “Hugo” science fiction award for excellence is named. In 1912 Edgar Rice Burroughs published A Princess of Mars, the first of his three-decade-long series of Barsoom novels, situated on Mars and featuring John Carter as the hero. The 1928 publication of Philip Nolan’s original Buck Rogers story, Armageddon 2419, in Amazing Stories was a landmark event. This story led to comic strips featuring Buck Rogers (1929), Brick Bradford (1933), and Flash Gordon (1934). The comic strips and derivative movie serials greatly popularized science fiction., 781888=After an initial set-back Robert Louis Stevenson publishes The Strange Case of Doctor Jekyll and Mister Hyde. It was often filmed, usually badly — though [1908] and [1931] are worth noting. The earliest stage adaptation was T. R. Sullivan’s in 1887., 681449=1971, 764091=This was the decade of the   Universal monster movies, where ‘the impossible took place in a tight, false   world of studio-built landscape, where every tree was carefully gnarled in   expressionistic fright, every house cunningly gabled in gothic mystery, every   shadow beautifully lit into lurking terror’]. Tod Browning’s Dracula   started it all and became the money-spinner of 1931 for the studio [1927]. 1932 saw James   Whale’s Frankenstein [1910],   introducing the man who ousted Lugosi as the studio’s resident ghoul, Boris   Karloff (whose much-repeated make-up was created by Jack Pierce) [1974]. Frankenstein was also the year’s top grosser,   whereas Karl Freund’s The Mummy in ’33, also starring Karloff, did not   do so well financially. However, the plethora of sequels kept them busy for   quite some time. The Wolf Man (George Waggner) blitzed the box-office   in ’41, introducing Lon Chaney Jr. in his most famous role [1933]. [1948], [1939-1945]., 787240=With the Industrial Revolution and a suddenly-educated (and over-crowded) public, horror adapted into a more visceral and immediate field. The result was the Penny Blood (known as Penny Dreadfuls to their critics) and the stage equivalent, the Penny Gaff. The earliest and most influential of the publishers was one Edward Lloyd, who started with Thomas Prest’s The Calendar of Horrors in the ’30s, and then evolved the more recognisable form. Prest was also responsible for Sweeney Todd, The Demon Barber (first published as The String of Pearls in 1847, and performed on stage in the same year. [1980s])—-(Don’t eat that pie!), the only character created in the period still being used. Varney the Vampire, or, the Feast of Blood, by James Malcolm Rymer, 1845, has had some influence on the vampire sub-genre and a possible companion piece, Wagner the Werewolf was written in 1846 by George Reynolds. ‘It was thought at the time that “Penny Dreadfuls” were the origin of all youthful crime, and parents not only banned them, but, when discovered, burned them without mercy.’, 701223=Gothic, directed by Ken Russell. It was based on the events of [1816] using, among other things, images from [1781]. This British director has long been known for his vivid film-making, notable examples being The Devils (1971, based on Aldous Huxley’s 1952 The Devils of Loudun), Altered States (1980, from a novel by Paddy Chayevsky (who disowned the movie)), and the hilarious Lair of the White Worm (1989), [1897]., 693095=Jonathan Demme’s adaptation of The Silence of the Lambs is released to popular and critical acclaim and much debate. Whether or not a ‘meretricious piece of sleaze,’ it is superbly written and directed (but the book’s better). It won Best Actor, Actress, Director, Film and Adapted Screenplay in the 1991 Academy Awards. It was followed by Hannibal (2001), a brave attempt to film the unfilmable. [1981]., 798833=Gottfried August Bürger writes the poem Leonore, a popular treatment of the folk tale motif of the lover who comes back from the grave; ‘And now are you afraid?’ and, incidentally, ‘Denn die Todten reiten schnell.‘ It was translated into English by William Rosetti in 1844 under the title The Hunt., 682768=1939, 864837=http://www.blogtalkradio.com/icdrrose/2013/05/17/robert-sheppard-global-consciousness, 804350=The first edition of the Malleus Maleficarum is produced in Germany by the Dominican inquisitors Hienrich Institoris (aka Henry Kramer) and Jakob Sprenger. Literally ‘the Hammer of Witches’, it codified the form of belief in witchcraft that spread, through fourteen editions by 1520, throughout Europe. It contributed enormously to the witch craze of the Sixteenth and Seventeenth centuries in which thousands of people were tortured and killed., 816808=Richard Matheson’s 1954 novel I Am Legend becomes a Will Smith Cinema Classic, 328591=By the 1990’s first print runs of 1 million or more were routine for novelists such as Jean Auel, Stephen King, Tom Clancy, John Grisham and Danielle Steele. From 1986, the year that the hardcover went mass market Auel’s The Mammoth Hunters, Michener’s Texas and Garrison Keilor’s Lake Woebegon Days all sold more than one million expensive hardback copies in the first year. A first year sales volume of more than 1,000,000 in today’s enlarged market is far from exceptional for the “A-Listers.”, 681972=1958, 591631=Clarke and Asimov first met in New York City in 1953, and in an amicable rivalry they traded friendly insults and gibes for decades. They established a verbal agreement, the “Clarke–Asimov Treaty,” that when asked who was best, the two would say Clarke was the best science fiction writer and Asimov was the best science writer. In 1972, Clarke put the “treaty” on paper in his dedication to Report on Planet Three and Other Speculations., 746411=Det Sjunde Inseglet, or The Seventh Seal, is Ingmar   Bergman’s classic about a knight (the ubiquitous Max von Sydow) playing chess   with Death during the plague. Inspired by paintings in the churches of   Bergman’s childhood, it is unsubtle but powerful, and not a little   disconcerting (the hacksaw was certainly a surprise). Not to be confused with   The Seventh Sign, a strange little flick with Demi Moore in it., 862713=Naval Diaries and Ship’s Logs of Admiral Sir George Rose Sartorius (1780-1875), 826274=Sometimes a distinction is made in the types of emotional response to horror fiction. In 1826, the gothic novelist Anne Radcliffe published an essay distinguishing two elements of horror fiction, “terror” and “horror.” Whereas terror is a feeling of dread that takes place before an event happens, horror is a feeling of revulsion or disgust after an event has happened. Radcliffe describes terror as that which “expands the soul and awakens the faculties to a high degree of life,” whereas horror is described as that which “freezes and nearly annihilates them.” Both are intrinsic to the genre., 700733=Dan Simmons becomes one of the most powerful new-comers in the field with Song of Kali, ‘quirky, tough-minded, literary horror-fiction’ followed by Carrion Comfort in 1989. As well as success in the horror field his SF is getting him noticed — Hyperion won the 1990 Hugo award., 445650=Art competitions were held as part of the 1932 Summer Olympics in Los Angeles, United States. Medals were awarded in five categories (architecture, literature, music, painting, and sculpture), for works inspired by sport-related themes., 599887=Čapek’s most mature work was War with the Newts (Válka s mloky) sometimes also translated as War with the Salamanders. The 1936 satirical science fiction novel concerns the discovery in the Pacific of a sea-dwelling race, an intelligent breed of newts, who are initially enslaved and exploited by their human masters and owned by profit-seeking corporations. They acquire human knowledge and intelligence, however, and rebel leading to a global war for supremacy between the two intelligent species on earth. Ultimately the Newts triumph due to human mendacity. There are obvious similarities to Čapek’s earlier R.U.R. which also included conflict between humans and their created “android” species of robots, but also some original themes and the fuller development as a full novel., 489726=At the time, medals were awarded to these artists, but art competitions are no longer regarded as official Olympic events by the International Olympic Committee. These events do not appear in the IOC medal database and these totals are not included in the IOC’s medal table for the 1912 Games., 555023=Soviet film industry also contributed to the genre, starting from the 1924 film Aelita. Some of early Soviet films, namely Planet of the Storms (1962) and Battle Beyond the Sun (1959), were pirated, re-edited and released in the West under new titles. Late Soviet science fiction films include Mystery of the Third Planet (1981), Ivan Vasilyevich (1973) and Kin-dza-dza! (1986), as well as the world famous  Andrey Tarkovsky’s Solaris and Stalker, among others., 683890=1794, 674130=The October Game, 682259=1953, 60646=PUSHCART PRIZE NOMINEE ROBERT SHEPPARD’S SPIRITUS MUNDI NOW AVAILABLE ON AMAZON! —–INVITATION TO LISTEN TO MAY 17 BLOGTALKRADIO INTERVIEW WITH AUTHOR 10:00 AM PST _______________________________________________________________________}", "lastModified": "Thu, 30 Jul 2015 04:02:50 GMT", "textBeforeTable": "More than 100 million copies List of best-selling single-volume books     Reading, it is safe to prophesy, will survive and thrive beyond any technological threshold it is called upon to transit in the course of history. The appetite for on-page (digital or print) fiction and imaginative experience looks to be as insatiable as it ever was, even in competition with its transformations into cinema, video and online media. In the Age of Globalization, which is also the Age of the Internet and Digitization, the literary marketplace seems set to go on expanding, and lowered costs of e-Books, along with rising incomes, higher-education and literacy rates and the continuing role of the English language as the international language of the world supplemented by ample resources for translation, augurs well for the rise of the consumption of literature, good and bad, as well as the periodic emergence of bestsellers and blockbusters across all of the new and old media within this vastly expended literary marketplace. The globalization of the literary marketplace also creates new opportunities for people of all nations and cultures to partake of other cultures and literatures as well as participate in the emergence of our emerging World Literature and of global consciousness shared by all citizens of the world generally. In theory, the marketplace and niche for quality literature should also expand as well as that for “e-Pulp and e-Pap.” We only hope that with time the taste and", "textAfterTable": "Harry Potter and the Deathly   Hallows[32] J. K.   Rowling English 2007 44 million Jonathan Livingston Seagull Richard   Bach English 1970 40 million A Message to Garcia Elbert   Hubbard English 1899 40 million Sofies verden (Sophie’s   World) Jostein   Gaarder Norwegian 1991 40 million Flowers in the Attic V. C.   Andrews English 1979 40 million Angels   & Demons Dan Brown English 2000 39 million Как закалялась сталь (Kak   zakalyalas’ stal'; How the Steel Was Tempered) Nikolai Ostrovsky Russian 1932 36.4 million copies in USSR Война и мир (Voyna i mir; War   and Peace) Leo   Tolstoy Russian 1869 36.0 million copies in USSR Le avventure di Pinocchio. Storia   di un burattino (The Adventures of Pinocchio) Carlo   Collodi Italian 1881 35 million You Can Heal Your Life Louise Hay English 1984 35 million Your", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}