{"relation": [["Artist", "Deelay Ceelay", "Guidance Counselor", "Jeffrey Jeruselam", "Nice Nice"], ["Title", "PDX Pop Now! Live set.", "PDX Pop Now! Live set.", "PDX Pop Now! Live set.", "PDX Pop Now! Live set."]], "pageTitle": "Plugged In | KBOO", "title": "", "url": "http://www.kboo.org/PluggedIn?page=0%2C6%2C0%2C0%2C0", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 8, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00092-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 539119963, "recordOffset": 539095503, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{55225=A selection of Deelay Ceelay's performance at the 2009 PDX Pop Now! music festival, as aired on the July 31st edition of Plugged In., 46614=A selection of Guidance Counselor's performance at the 2009 PDX Pop Now! music festival, as aired on the July 31st edition of Plugged In., 50921=A selection of Jeffery Jerusalem's performance at the 2009 PDX Pop Now! music festival, as aired on the July 31st edition of Plugged In.}", "TableContextTimeStampAfterTable": "{54970=We also had a ticekt giveaway for the Micropalooza chiptune party that is happening on August 28th @ Ground Kontrol - GroundKontrol.com, 16323=Plugged In on Friday, November 6th featured two hours of DJ mixed music from Tronic.  I mixed up dubstep, breakbeats, house and techno.  Had lots of fresh promos that were played in the mix., 69385=Latest newsletter: May 2015, 77797=Copyright © 2012 KBOO Community Radio | Copyright Policy | Community Guidelines | Website Illustration & Design by: KMF ILLUSTRATION, 29747=This was the first of two Fall pledge drive shows for Plugged In.  Tronic was in the studio with Marc. Our next show is on Friday, October 16th from 10pm - 12am.}", "lastModified": "Sat, 01 Aug 2015 04:22:34 +0000", "textBeforeTable": "12/04/2009 Air date:  Plugged In Program name:  Electronic Categories: Plugged In playlist for 12/04/2009 Login or register to post comments *these tracks are available for free download from DancefloorMayhem.com   Hamza & David Hykes - Dusk Oskar Zenkert - Oriental (Original Mix) Audio Affinity feat. Juelz - Candy (Pablo Decoder remix)* Z-Kat - Pitchfork Roulette (blnd! Midnite Cruise Mix) Dirty South & MYNC - Everybody Freakin'* MYNC & Henry \"Choo Choo\" Romero and Jose Nunez - Boogerlight* Botz & Flydrums & Dani Villa - Ta Bueno (Dub Mix) Zemi vs Angel Alanis - Live On (Inert Vocal mix) Groove Armada - I Won't Kneel (No Brainer & Mouj Remix) Scope - Glow Felipe Lutofo - Pearl Earring (Marcelo Medeiros & Maestro Tosin Remix) Imugen Orihasam - Blue (Original Mix) Sphongle - I Am You Sphongle - Ineffable Mysteries Sphongle - Nothing Is Something Worth Doing Playlist We had a special bonus session of Plugged", "textAfterTable": "Bentley & Ben Gomori Out Comes Fabianski (Fabregas Dub) Audio Affinity feat. Juelz Candy (Pablo Decoder remix) Chris Lake & Lys La Tromba (Lys remix) Hamza and David Hykes Dusk Alledj Blow Your Mind Tim Sheridan Bionic Language (Adultnapper remix) Ninja Kodou Lost in Hebron Draax & Seavers Rude Boys (Krafty Kuts remix) Fort Knox Five Sax Pusher Beat Assassins Put 'Em Up (Napt remix) Radiohead Reckoner (James Zabiela remix) Frank Chiarello Stabby McGee Jake Childs Spells (Ospina & Oscar P deep mix) Jordan Rivera feat. Spoon Face Keep On Holding (Jordan Rivera feat. Jodee Kitch dub) Filterwolf Neo Aux Lazersonic & Zak Frost Thermionic   Login or register to post comments Plugged In playlist for 11/20/2009 Categories: Electronic Program name:  Plugged In", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}