{"relation": [["Artist", "Chucho Merchan", "Chucho Merchan", "Chucho Merchan"], ["Song Title", "Fumba Rumba", "Emotion Lotion", "Kool As A Rool"], ["Played When", "", "", ""]], "pageTitle": "Alias Season 3 Episode 4 - A Missing Link (3x4) - Watch Online - s3 e4 Spoilers", "title": "", "url": "http://www.tvrage.com/Alias/episodes/4924?vote=2", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00237-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 802826301, "recordOffset": 802810637, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Music Click here to add a recap for A Missing Link Next Episode --> <-- Previous Episode Recap Lauren Reed As Melissa George Julian Sark As David Anders Eric Weiss As Greg Grunberg Michael C. Vaughn As Michael Vartan Jonathan 'Jack' Donahue Bristow As Victor Garber Marshall J. Flinkman As Kevin Weisman Marcus R. Dixon As Carl Lumbly Arvin Sloane As Ron Rifkin", "textAfterTable": "Episode Quotes Sloane: (to Lauren) I must admit, I was concerned for you when Sydney resurfaced. I remembered seeing her with Vaughn: their relationship reminded me of my own with my late wife. It was the kind of bond even death cannot sever. Hmmm, well apparently I misjudged. Sydney: I can't afford to make a distinction between professional and personal - not in my life. I mean, this job took two years from me. Everything is personal. Episode Goofs Marshall enters Vaughn's height as 1.60 meters which is 5'3\", when he is really 6'0\" (1.83 meters). When Sydney steals the diamond necklace, she puts it around her ankle, but when she is jumping off the balcony there is no necklace. Then in the second shot of the pool scene, the necklace reappears on her left ankle, but in the van it moves to her right. Other Episode Crew Click here to add other crew for A Missing Link", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}