{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"], ["Name", "Fantasy", "Don't Worry", "Hallelujah", "Everything Eventually", "M.W.A.", "Ring-a-Ding-Ding", "Supernaturally", "All Grown Up", "Waiting 4 Your Love", "5Am", "Long Long Road", "Anyone"], ["Artist", "Appleton", "Appleton", "Appleton", "Appleton", "Appleton", "Appleton", "Appleton", "Appleton", "Appleton", "Appleton", "Appleton", "Appleton"], ["Time", "3:47", "4:42", "4:27", "4:44", "3:38", "6:29", "3:40", "4:22", "3:32", "4:11", "4:15", "3:33"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Everything's Eventual by Appleton", "title": "", "url": "https://itunes.apple.com/cz/album/fantasy/id7801313?i=7801347", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00335-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 866904183, "recordOffset": 866882878, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{25162=Formed: 2001 in London, England, 115723=Copyright © 2014 Apple Inc. Všechna práva vyhrazena.}", "lastModified": "Fri, 31 Jul 2015 08:54:51 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Appleton Everything's Eventual iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Everything's Eventual by Appleton, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "12 Songs Album Review The fortunes of artists who go solo once their pop group has disbanded has always been hard to predict. Robbie Williams is an obvious example, but the likes of Simon Webbe and Geri Halliwell, to name two more, have achieved far greater success than anticipated, often at the expense of their much more fancied bandmates. So it shouldn't come as too much of a shock that the Appleton sisters, formerly of chart-toppers All Saints, have easily surpassed some rather lowly expectations with their debut album. Nicole and Natalie may be famous for their rock star boyfriends and Heat magazine appearances, but Everything's Eventual positions them as gifted songwriters, with a knack for a strong pop melody that could see them overshadowing their more prominent former group members Shaznay Lewis and Melanie Blatt. Taking Madonna's seminal Ray of Light as its inspiration, the duo combines shimmering electronica, acoustic pop, and heartfelt understated ballads to produce an eclectic and confident first offering not a million miles away from another solo attempt by a former member of a girl band: Melanie C's Northern Star. Hits like the pop/rock fusion of \"Fantasy\" and the acoustic ballad \"Don't Worry\" (the missing link between Nicole's husband's Oasis and their old girl group) are certainly no fluke. \"M.W.A.,\" with its multi-layered harmonies, recalls", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}