{"relation": [["Author", "Author", "srpit Private Message Oct 30 2013 at 2:23pm #", "cowchip Private Message Oct 30 2013 at 8:47pm #", "andyc Private Message Nov 1 2013 at 1:47pm #", "Swalfoort Private Message Nov 1 2013 at 3:43pm #", "Steven Private Message Nov 1 2013 at 5:17pm #", "Swalfoort Private Message Nov 1 2013 at 6:07pm #", "cowchip Private Message Nov 2 2013 at 9:53am #", "StuInMcCandless Private Message Nov 2 2013 at 12:06pm #", "gg Private Message Nov 2 2013 at 5:06pm #", "cowchip Private Message Nov 11 2013 at 11:24pm #", "Swalfoort Private Message Nov 12 2013 at 11:32am #", "srpit Private Message Nov 17 2013 at 3:09pm #", "srpit Private Message Sep 12 2014 at 3:39pm #", "cowchip Private Message Sep 12 2014 at 7:22pm #", "srpit Private Message Nov 29 2014 at 5:27pm #", "J Z Private Message Dec 14 2014 at 10:45pm #", "Jacob McCrea Private Message Apr 23 2015 at 5:58pm #", "srpit Private Message May 10 2015 at 6:10pm #", "The Iguana Private Message May 12 2015 at 8:23pm #"], ["Posts", "Posts", "I thought we had a lost and found thread, but I didn’t find it when I searched so I started this one. Figured it might be good to have a place to post things lost/found along the trails and roads. Found a water bottle today. Looked like it hadn’t been laying there long, so if you lost one this morning shoot me a pm.", "lost a set of keys some where in the south side along carson or 2nd ave trail access a couple months ago . How do i find them ? I posted an ad on craigslist ?", "I kind of hope you are joking about the keys. Unless it’s some novelty key that was made 3 yards long (maybe for a novelty lock for the giant duck?), I wouldn’t hold out much hope.", "Actually, someone posted something on here not all that long ago about finding a key, or set of keys. Can’t remember the location or the details, unfortunately.", "Maybe this one from February? Seems too early to be Cowchip’s, sadly. I didn’t find any better candidates though.", "I think that is the one I was remembering. February, huh? Wow, time sure flies!", "i LOST a whole ring of keys with a grey remote fob.I had them clipped to my pack and lost somewhere on my ride, i returned to the 2nd ave trail head after dark so i did not back track. I was able to have my family rescue me after my ride with a spare set .", "I found a big ring of keys along McKnight Road back when there was still snow on the ground. Still have them. I checked CL for a while around that time, but it’s been so long now, I doubt anyone is still holding out hope they turn up.", "Lost a Campy pedal cap. Stupid things are probably expensive, but figured I would ask. The little chrome looking thing that is actually plastic that goes on the end of the pedal. Might be around the zoo, Aspinwall or Highland Park.", "Found a cell phone tonight on the north shore trail. Called and met one of the contacts on the phone and got it returned to owner !!", "@cowchip……that’s awesome. There are probably a lot of things worse than losing your cell phone, but when you are struggling to recover one that’s gone missing, it is hard to imagine what those things might be. Extra karma points to you, my friend…..", "Found a blinky on Friday evening in the downtown area. It was still flashing so I’m guessing that someone lost it that evening, probably before 9pm. ID it and it’s yours.", "Found something under the Birmingham Bridge today around noon. Looks like it fell off someone’s bike, but wasn’t wet or dirty so it couldn’t have been laying there too long. ID it and it’s yours.", "Found an MP3 player and head phones oakland by dippy last week , ID some of the songs and brand ? I checked craigslist lost and found for a couple days after but no luck finding owner .", "Lost today: my black Novara pannier fell off the bike somewhere between the bottom of the incline coming off the Ft Pitt bridge, and the Southside Slopes. I was on the way to cheer on the DD riders, heading up the hill when I realized it was gone. My U-lock and lots of odds and ends were in it.", "Anyone lose a key to an Onguard lock in Frick Park? Was on a ring with 2 other keys, someone hooked it onto the port-a-john near the lawn bowling courts, if anyone is looking for it.", "I found a large white Sunline U-lock today in the middle of the street near the Hofbrauhaus in the South Side Works complex. The key was missing. If this is yours, email me at jcm250b at juno dot com.", "Anyone lose something off their bike this morning, send me a description to ID it. Found it just after noon.", "Someone found a keychain with keys to two Kryptonite Locks on the trail along the Waterfront–I have them. Kryptonite did not have a record of anyone registering them. So if someone is missing some keys…"]], "pageTitle": "Bike Pittsburgh | Topic: Lost and Found", "title": "", "url": "http://bikepgh.org/mb/topic/lost-and-found-3/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00286-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 27039591, "recordOffset": 27026652, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{7812=I think that is the one I was remembering. February, huh? Wow, time sure flies!}", "textBeforeTable": "  ← Forums Home Viewing 19 posts - 1 through 19 (of 19 total) This topic contains 18 replies, has 10 voices, and was last updated by  The Iguana 2 mos, 2 weeks. Lost and Found Monthly emails, no SPAM. Newsletter Signup Instagram Pinterest Flickr Facebook Twitter Google Plus Login Search Bike Racks Gear", "textAfterTable": "Viewing 19 posts - 1 through 19 (of 19 total) ← Forums Home   You must be logged in to reply to this topic. Become a Member Volunteer Newsletter Subscribe to our mailing list Monthly emails, no SPAM. Search the Forums Search Sponsors Web Design by ClickNathan Handmade Websites All original material is licensed under a Creative", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}