{"relation": [["Title", "SingStar: Pop Volume 2", "Toki Tori", "Backyard Baseball '09", "Campus", "Dragon Quest IV: Chapters of the Chosen", "Grid", "Helicopter Strike Force", "John Deere: Drive Green", "New International Track & Field", "Ocean Commander", "P-38 Lightning", "FINAL FANTASY TACTICS A2: Grimoire of the Rift", "City Life 2008 Edition", "Commando: Steel Disaster", "Bus Driver", "Super Jigsaw Desert Explorer", "Sid Meier's Civilization Revolution", "Crazy Mouse", "Golf: Tee It Up!"], ["Publisher", "SCEA", "Two Tribes B.V.", "Atari, Inc.", "Topware Interactive Inc.", "Square Enix, Inc", "Codemasters", "Masque Publishing", "Destineer", "Konami", "UFO Interactive Games", "Just Flight", "Square Enix, Inc", "Paradox Interactive", "XS Games LLC", "Meridian 4", "RealNetworks", "2K Games", "Ultizen Games", "Activision"], ["Rating", "T", "E", "E", "E", "E10+", "E", "T", "E", "E10+", "E", "E", "E10+", "T", "E10+", "E", "E", "E10+", "E", "E"], ["Platforms", "PS2", "Wii", "PC, PS2, 360, Wii", "PC", "DS", "PC, 360, PS3", "PC", "PC", "DS", "DS", "PC", "DS", "PC", "DS", "PC", "Macintosh, PC", "360, PS3", "360", "360"]], "pageTitle": "Think of the Children for April 23rd Article - Gaming Nexus", "title": "", "url": "http://www.gamingnexus.com/Article/Think-of-the-Children-for-April-23rd/Page2/Item1820.aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00210-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 464604401, "recordOffset": 464596199, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{16393=While my byline is on many reviews, articles and countless news stories, I have a passion for and spent the last several years at GamingNexus focusing on audio & video and accessories as they relate to gaming. Having over 15 years of Home Theater consulting and sales under my belt, it is quite enjoyable to spend some of my time viewing gaming through the A/V perspective. While I haven't yet made it to one of the major gaming conventions (PAX or E3), I have represented GamingNexus at the Consumer Electronics Show (CES) in Las Vegas for the last six years. I have been a staff member at GamingNexus since 2006 and feel lucky to have the opportunity to put to use my B.A. in Journalism from The Ohio State University.  }", "textBeforeTable": "With only 19 titles to work with, I really don’t have a title of shame so to speak. So I chose a game that just seemed like it wasn’t needed at all, and that was Campus by Toppware Interactive. I think we all knew it would be coming eventually, but this sim about campus life seems like it may not have any legs unless it delves into the worlds of fraternities, party life and Big Time College sports. Based on the fact that the game was rated E for Everyone for content that includes mild language and use of tobacco, I’m guessing this will be the most unrealistic sim ever made. Most of us over the age of 25 probably want to forget our campus years, and those that are still in college don’t need a Sim to tell them what it is all about. Not to mention the fact that this game was originally released in October of 2007, so I have no idea why the ESRB is just now providing a rating. The Xbox 360 and PS3 had several titles rated this week. Each had Sid Meier's Civilization Revolution and Codemaster’s Grid come across. In addition, the 360 had three titles that have been flying below the radar. The retail title Backyard Baseball ’09 and XBLA titles CrazyMouse and Golf: Tee it Up! CrazyMouse is being developed/published by Ultizen Games, which appears to be the first Chinese developed", "textAfterTable": "Here is the final tally on who, what and where everything was rated for the last week. There were 19 rated titles on seven platforms. PC (9), DS (5) and 360 (5) had the most games rated. There were 16 of the 19 titles rated at E10+ or lower, three rated at T for Teen and zero rated at M for Mature. Got a comment on the article or a rated games, put it in the section below or send me an e-mail. Until next week, make sure you know what your kids are playing…… *The weekly Title of Shame (and any game that is tossed in that paragraph) is done so based on several factors, including which games were rated that week, how does the game concept stack up, is it a re-hashed sequel, lame movie tie-in, rip off of another game, etc… * The product in this article was sent to us by the developer/company for review. About Author I spent the greater part of my informative years glued to the front of a Commodore 64 after we wore out our Intellivision. If you were in the Toledo area surfing C-64 bulletin boards in the mid 80's, we probably have already met. When not running the BBS, I spent countless hours wandering around the", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}