{"relation": [["Title", "The Kappillan of Malta", "Earthly Powers", "Death in Malta", "The Jukebox Queen of Malta", "Ricasoli Soldier: A Novel Inspired by True Events"], ["Author", "Nicholas Monsarrat", "Anthony Burgess", "Rosanne Dingli", "Nicholas Rinaldi", "Joe Scicluna"]], "pageTitle": "Malta | Intrepid Travel", "title": "", "url": "http://www.intrepidtravel.com/malta/latest-deals", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00041-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 519292575, "recordOffset": 519237978, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{102989=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 101670=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o...}", "TableContextTimeStampAfterTable": "{4248=Starring Brad Pitt and Australia’s own Eric Bana, Wolfgang Peterson’s loose adaptation of Homer’s Iliad was shot almost exclusively in Malta’s Mellieha, Fort Ricasoli and on Malta’s sister island Comino. An epic tale of wanton murder and betrayal, fuelled by an illicit royal affair, the film was purportedly produced on a budget of approximately $175 million – making it one of the most expensive ever made. In a damning demonstration that people learn nothing from history, the Turkish town of Canakkale accepted Pitt's gifting of the giant Trojan Horse maquette used in the film., 6351=Popularly lauded as one of the worst movies ever made, Guy Ritchie’s Swept Away – starring his then-wife Madonna – marked the director’s filmmaking nadir. A right box-office disaster, the film scooped the 2002 Raspberry Awards and was the only movie ever to have won both Worst Picture and Worst remake or Sequel. What the film does have going for it is the setting, with Blue Lagoon, Vittoriosa and Mdina all featuring prominently as the stunning backdrop to the mismatched couple’s shipwrecked shenanigans., 955=Malta’s summer season - stretching from April right through to October - is the best time to visit, with daytime temperatures generally sitting in the high 20s that are tempered by sea breezes along the coast. Over July and August, the temperatures can climb above 30 degrees C - perfect for some, unpleasant for others. From November to March, temperatures range around 16 degrees C and it can be quite rainy in December and January.}", "textBeforeTable": "Recommended reading Further reading 6. Refrain from supporting businesses that exploit or abuse endangered animals. 5. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive and supports the local community. 4. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 3. Always dispose of litter thoughtfully, including cigarette butts. 2. The tap water is considered safe to drink, so for environmental reasons try to avoid buying bottled water. Fill and refill a reusable water bottle or canteen instead. 1. Be considerate of Malta’s customs, traditions, religion and culture. Top responsible travel tips for Malta Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this in mind while travelling. Malta Travel Tips Responsible Travel also provides useful health information: Go to: http://www.who.int/en/ The World Health Organisation Go to: http://www.fco.gov.uk/en/ From UK? Go to: http://travel.state.gov/ From US?", "textAfterTable": "Handy links www.lonelyplanet.com/malta www.worldtravelguide.net/malta www.visitmalta.com × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}