{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"], ["Name", "Les playboys", "L'espace d'une fille", "Sur une nappe de restaurant", "J'ai mis un tigre dans ma guitare", "Les cactus", "Et moi, et moi, et moi", "L'opération", "On nous çache tout, on nous dit rien", "La fille du Père Noël", "Les gens sont fous, les temps sont flous", "La compapade", "Mini, mini, mini"], ["Artist", "Jacques Dutronc", "Jacques Dutronc", "Jacques Dutronc", "Jacques Dutronc", "Jacques Dutronc", "Jacques Dutronc", "Jacques Dutronc", "Jacques Dutronc", "Jacques Dutronc", "Jacques Dutronc", "Jacques Dutronc", "Jacques Dutronc"], ["Time", "3:08", "2:45", "2:15", "2:21", "2:42", "2:55", "3:09", "2:36", "2:36", "3:03", "3:19", "1:54"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Et moi et moi et moi by Jacques Dutronc", "title": "", "url": "https://itunes.apple.com/gr/album/et-moi-et-moi-et-moi/id270985013", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00341-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 881392591, "recordOffset": 881367792, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{23000=If ever Rhino considers a foreign language Nuggets compilation, the inclusion of Jacques Dutronc would be inevitable. Although succeeding albums would see him evolve stylistically into the French counterpart to Ray Davies at his creative peak, Dutronc's debut spawns vintage garage rock akin to the Yardbirds and the the Troggs. \"La Fille du Père Noël\" even shares a sped up Bo Diddley riff with Diddley's \"I'm a Man.\" Other fine examples include the bluesy \"Sur une Nappe De Restaurant\"and the irresistibly hip shaking and buzzsaw guitar laden \"Les Gens Sont Fous, les Temps Sont Flous.\" Though some would argue that someone like Antoine to be a more true heir to the French garage crown, Dutronc wins out by humorous lyrics (courtesy of Jacques Lanzmann) and his inseparable ironic delivery. One of the debut's signature songs, \"Et Moi, et Moi, et Moi,\" was intended as a stab at Antoine's \"Les Élucubrations d'Antoine.\" It succeeded in ridiculing his contemporary in two ways. Lyrically, it dissected Antoine's \"Subterranean Homesick Blues\" of sorts for all its narcissism. To top things off, some people mistook it for a new Antoine hit instead of identifying it as Dutronc's debut single. (Regretfully, during the mid-'70s Mungo Jerry refashioned it into the far less provocative \"Alright Alright Alright.\") A few more songs deserve special mention. First off, there's the second single \"Les Playboys\" where Dutronc mocks stereotypical womanizers with a swaggering flair, pointing out his own seduction tactics for women in the process. (Upon recognizing the impenetrably thick layers of irony, his belle Françoise Hardy probably more than agreed to the lyrics.) The African chant of \"La Compadade\" visits the same territory as Gainsbourg Percussions did two years earlier. Finally, third single \"Les Cactus\" made its way into the renowned French dictionary Petit Robert as a synonym for people's everyday troubles. [The following is important with regard to detailing Dutronc's discography. All seven of his albums made between 1966 and 1975 lack a proper title. To keep them apart, the first album is equally referred to by its original year of release (1966), the first song on the album (\"Les Playboys\") or either one of the title tunes to the preceding EPs (\"Les Playboys,\" \"Et Moi, et Moi, et Moi\" or \"Les Cactus\"), the content of which matches exactly with the 12 songs present here.], 25693=Born: 28 April 1943 in Paris, France, 123267=Copyright © 2014 Apple Inc. Με επιφύλαξη παντός δικαιώματος.}", "lastModified": "Sat, 01 Aug 2015 04:51:20 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Jacques Dutronc Et moi et moi et moi iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Et moi et moi et moi by Jacques Dutronc, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on", "textAfterTable": "12 Songs Album Review If ever Rhino considers a foreign language Nuggets compilation, the inclusion of Jacques Dutronc would be inevitable. Although succeeding albums would see him evolve stylistically into the French counterpart to Ray Davies at his creative peak, Dutronc's debut spawns vintage garage rock akin to the Yardbirds and the the Troggs. \"La Fille du Père Noël\" even shares a sped up Bo Diddley riff with Diddley's \"I'm a Man.\" Other fine examples include the bluesy \"Sur une Nappe De Restaurant\"and the irresistibly hip shaking and buzzsaw guitar laden \"Les Gens Sont Fous, les Temps Sont Flous.\" Though some would argue that someone like Antoine to be a more true heir to the French garage crown, Dutronc wins out by humorous lyrics (courtesy of Jacques Lanzmann) and his inseparable ironic delivery. One of the debut's signature songs, \"Et Moi, et Moi, et Moi,\" was intended as a stab at Antoine's \"Les Élucubrations d'Antoine.\" It succeeded in ridiculing his contemporary in two ways. Lyrically, it dissected Antoine's \"Subterranean Homesick Blues\" of sorts for all its narcissism. To top things off, some people mistook it for a new Antoine hit instead of identifying it as Dutronc's debut single. (Regretfully, during the mid-'70s Mungo Jerry refashioned it into the far less provocative \"Alright Alright Alright.\") A few more songs deserve special", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}