{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14"], ["Name", "Intro", "Russian Girl", "Killing Ground", "Eden", "Going On", "Everybody", "Spanish Rain", "Flesh And Bone", "Sunshine", "Victoria", "Afraid", "So Painfully", "Edgar", "All Around"], ["Artist", "Saigon Kick", "Saigon Kick", "Saigon Kick", "Saigon Kick", "Saigon Kick", "Saigon Kick", "Saigon Kick", "Saigon Kick", "Saigon Kick", "Saigon Kick", "Saigon Kick", "Saigon Kick", "Saigon Kick", "Saigon Kick"], ["Time", "1:14", "4:14", "3:45", "5:02", "4:45", "2:53", "5:02", "3:53", "3:52", "4:23", "4:10", "3:10", "3:14", "2:14"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Devil In The Details by Saigon Kick", "title": "", "url": "https://itunes.apple.com/us/album/so-painfully/id403402413?i=403402480", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00027-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 880284303, "recordOffset": 880254863, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{124531=Copyright © 2014 Apple Inc. All rights reserved., 27148=Formed: 1988}", "lastModified": "Fri, 31 Jul 2015 08:55:11 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Saigon Kick Devil In The Details iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Devil In The Details by Saigon Kick, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "14 Songs Album Review Perhaps due to the fact that their breakthrough hit was an acoustic ballad and they weren't afraid to embark on a musical detour from time to time, Saigon Kick seemed to go over the heads of many metalheads — despite the fact that the majority of their repertoire was metallic. By 1995's Devil in the Details, guitarist Jason Bieler was firmly in the driver's seat, as this was the second album on which he did double duty as the group's lead singer. And once more, Devil in the Details turned out to be a varied album that brings to mind Extreme, King's X, and Queen. Another sweet and sappy acoustic ditty is included (\"Spanish Rain\"), as well as an old-tyme pop tune (\"Victoria\") and the expected headbanging rockers (\"Killing Ground\"). Fans of the band's first few albums will dig it, but it appeared as though rock radio circa the mid-'90s was as far removed as you could possibly get from Saigon Kick's brand of all-encompassing rock. Biography Formed: 1988 Genre: Rock Years Active: '80s, '90s, '00s Hard rockers Saigon Kick formed in Miami in 1988 with a lineup including Matt Kramer, Jason Bieler, Tom DeFile and Phil Varone. The band", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}