{"relation": [["Title", "The Ice Palace", "The Snowman", "Pan", "Mysteries", "The Castle in the Pyrenees", "The Real Heroes of Telemark"], ["Author", "Tarjei Vesaas", "Jo Nesbo", "Knut Hamsun", "Knut Hamsun", "Jostein Gaarder", "Ray Mears"]], "pageTitle": "Norway Tours & Travel | Intrepid Travel", "title": "", "url": "http://www.intrepidtravel.com/norway", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00319-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 503875275, "recordOffset": 503818840, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{143974=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 245696=Review submitted 01 Aug 2015, 145293=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan...}", "TableContextTimeStampAfterTable": "{997=Because of the Gulf Stream, the climate in Norway is noticeably warmer than what would otherwise be expected at such high latitude. Summers can be moderately warm (up to 30 degrees Celsius), even in northern areas, but only for limited periods. The length of the winter and amount of snow varies around the country. In the north there is more snow and winters are dark; on the southern and western coasts, winters are moderate and rainy, while further inland the temperature can get below -25 degrees Celsius. March, April, October and November tend to be the rainiest months. Snow usually starts to fall in October/November in the northern areas (and in higher altitudes) and generally melts by the end of April. The Northern Lights are visible from parts of Norway, with September to April usually presenting the optimal conditions for viewing.}", "textBeforeTable": "Recommended reading Further reading 7. Please ask and receive permission before taking photos of people, including children. 6. Refrain from supporting businesses that exploit or abuse endangered animals. 5. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 4. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 3. Always dispose of litter thoughtfully, including cigarette butts. 2. For environmental reasons, try to avoid buying bottled water. Instead, fill a reusable water bottle or canteen with tap or filtered water. 1. Be considerate of Norway’s customs, traditions, religion and culture. Top responsible travel tips for Norway Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this in mind while travelling. Norway Travel Tips Responsible Travel also provides useful health information: Go to:", "textAfterTable": "Handy links www.lonelyplanet.com/norway www.worldtravelguide.net/norway www.visitnorway.com × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}