{"relation": [["Title", "Sesame salad dressing", "Authentic paella?", "IMPORTANT: If you have a blog on JustBento...", "Shiso - uses for this herb", "Fuki (Japanese Butterbur) Tsukemono Recipes"], ["Author", "Supertaster", "maki", "maki", "Loretta", "kumo"], ["Answers", "9", "10", "2", "0", "5"], ["Last Post", "1 year 47 weeks ago", "1 year 48 weeks ago", "1 year 51 weeks ago", "2 years 6 days ago", "2 years 1 week ago"]], "pageTitle": "Dietary advice for pregnant women in Japan? | Just Bento Community Forum", "title": "", "url": "http://www.justbento.com/forum/dietary-advice-pregnant-women-japan?sort=asc&order=Author", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00163-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 532605903, "recordOffset": 532583185, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{26072=I found this page (English) on the Ministry of Health, Labor and Welfare site: Advice for Pregnant Women on Fish Consumption concerning Mercury Contamination. This has a list of fish consumed in Japan that is deemed to have high mercury levels, which should be eaten sparingly if at all by pregnant women. That list is from 2001 though - this Japanese page is a bit more up to date. Basically if you aren't eating dolphin(!) and whale(!) the fish to eat sparingly would be various kinds of tuna, yellow porgy, maybe some types of cod., 31290=Eating more than before is rather difficult at the moment. Just keeping what I eat down is a challenge so I'm trying to make every mouthful count, nutritionally speaking. But I'm hoping that I'll be feeling better by April., 35246=My bento blog: http://justbento.com/blog/1305 My art blog: http://jizaacaso.deviantart.com}", "lastModified": "Fri, 31 Jul 2015 07:19:32 GMT", "textBeforeTable": "New forum activity since your last visit More information about formatting options Web page addresses and e-mail addresses turn into links automatically. Each email address will be obfuscated in a human readble fashion or (if JavaScript is enabled) replaced with a spamproof clickable link. You may quote other posts using [quote] tags. Allowed HTML tags: <h3> <h4> <h5> <h6> <object> <a> <em> <strong> <p> <br> <i> <b> <cite> <code> <ul> <ol> <li> <dl> <dt> <dd> <img> You can use Markdown syntax to format and style the text. Markdown Lines and paragraphs break automatically. You may quote other posts using [quote] tags. Each email address will be obfuscated in a human readble fashion or (if JavaScript is enabled) replaced with a spamproof clickable link. Web page addresses and e-mail addresses turn into links automatically. Allowed HTML tags: <h3> <h4> <h5> <h6> <object> <a> <em> <strong> <p> <br> <b> <i> <blockquote> <cite> <code> <ul> <ol> <li> <dl> <dt> <dd> <img> Filtered HTML Input format", "textAfterTable": "    » See more activity Join the Just Bento flickr pool Join the Bento Gear flickr pool Recently commented articles Tuna tofu miso mini burgers (42 comments) Stewed hijiki seaweed with carrots and fried tofu", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}