{"relation": [["Artist", "Boards of Canada", "Garaj Mahal", "Old 97's", "Justin Townes Earle", "Frank Zappa", "James Cotton", "Corin Tucker Band", "Cochemea Gastellum", "The Acorn Project", "Orgone", "Reggie Houston", "Robert Cray Band", "Sierra Leone's Refugee All Stars", "Greg Merritt's Heavy Road", "String Cheese Incident", "Trey Anastasio Band", "Gov't Mule", "Soulive", "Scott Amendola Trio", "Caleb Klauder", "Infamous Stringdusters", "Joe McMurrian", "Tim Reynolds", "Birdsong At Morning", "Red Horse"], ["Title", "Alpha & Omega", "Uptown Tippitina's", "Please Hold On While The Train Is Moving", "Harlem River Blues", "Inca Roads", "Buried Alive In The Blues", "1,000 Years", "Fathom 5", "Melting", "The Big Escape", "Sick And Tired", "Sitting On Top Of The World", "No Woman, No Cry", "Drift", "Eyes Of The World", "Drifting", "Larger Than Life", "Come Together", "Lima Bean", "Worn Out Shoes", "Magic #9", "Get Inside This House", "Che", "Velvet Indigo", "Wild Horse"], ["Album", "Geogaddi", "Woot", "The Grand Theater", "Harlem River Bluesq", "One Size Fits All", "Giant", "1,000 Years", "The Electric Sound Of Johnny Arrow", "Generation Debt", "The Killion Vaults", "Homage I", "Cookin' In Mobile", "Tribute To A Reggae Legend", "Everything Changed", "Jerry Jams For Rex", "TAB At The TAB", "Mulennium", "Rubber Soulive", "Lift", "Western Country", "Things That Fly", "Get Inside This House", "The Limbic System", "Lumens", "Red Horse"], ["Label", "Warp", "Owl Studios", "New West", "Bloodshot", "Ryko", "Alligator", "Kill Rock Stars", "Mowo", "", "Ubiquity", "", "Vanguard", "Putumayo", "", "Sci-Fidelity", "", "Evil Teen", "Royal Family", "Sazi", "", "Sugar Hill", "", "", "", "Red House"]], "pageTitle": "KBOO | Community Radio for Portland and beyond", "title": "", "url": "http://www.kboo.org/playlists/6057?page=504", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00053-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 540404335, "recordOffset": 540377244, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{6500=The Great Mundane- grew up in a southeastern Michigan home where TV was made of cardboard boxes, the tree in the backyard was his best friend and the words “I am bored” were household blasphemy. Aside from occasional piano lessons, he passed time deep in his own imagination and on spontaneous road trips, a.k.a his mother’s famous mystery van rides, that seem to have provoked his current state of restlessness. Itching to hit the road, The Great Mundane left his hip-hop roots in Michigan to delve into Chicago’s house/techno scene before arriving in the Pacific Northwest. Now based in Portland, Oregon he takes listeners on a journey exploring the complexities and intricacies of his minimalist and innovative approach to beatmaking. He invents fractured, heady instrumentals laced with lush synthesizer work that navigate the terrain of forward thinking hip-hop and electro/house, all while exhibiting genuine emotion and talented production skills. Each arrangement is collaged with friends, found sounds, synthesizers, and samples meticulously programmed to convey what it might feel like to fall in love with a tree, travel through a wormhole, or to never be bored again. His debut LP “When Falls Arrive” (psymbolic) was released in 2007 exposing him as one of the top underground electronic musicians to keep an ear out for. Since, he has released “The Wires Remixes” EP (self-released, 2008), a remix of Deru’s “Peanut Butter and Patience” (Mush, 2009) and his second full length entitled “Humdrum” (RunRiotRecords, 2010). The Great Mundane’s music is featured on a long list of compilation albums including Portland’s annual “PDX Pop Now” series. Expect remixes for SPL, Lorn, KiloWatts & Bluetech as well as his next full length in May 2011 on 1320 Records., 110651=Latest newsletter: May 2015, 13152=Angelides’ performance moniker was inspired by San Francisco experimental music icons The Residents’ 1979 album “Eskimo”. Drawn to the album’s character-based stories and shamanistic themes, he dropped the title’s middle “I” and launched his Eskmo project in 1999 in his home state Connecticut. Prior to that, in the mid-90s, he was introduced to renegade funk combo Primus and UK breakbeat techno wizards The Prodigy. The music virus soon took hold. He learned to play bass and formed bands while absorbing ‘90s electronic music from Aphex Twin, Frankie Bones, 187, Dieselboy, The Chemical Brothers and Moby among others., 13865=Angelides initially made music to share with friends using a primitive Miracle instructional keyboard, a four-track recorder and a bass guitar. He used a Roland keyboard to record his first formal work, a CD titled “Machines on Task“, for a school graduation project. After high school, between 1999 and 2005, he wrote two full-length albums that he gave away at small shows. During this time he spent two years working on music in a secluded lakeside house in Connecticut. It was there that he also wrote gentler, melodic material released later under his other production alias, Welder., 15451=In early 2006 he was invited to play in San Francisco. He fell in love with the area’s culture, art, music and landscape and relocated to the city soon after. He was immediately embraced by SF’s frenetic electronic producer and label community., 44308=Audi for this broadcast can be found at: http://laruletaradio.wordpress.com/2011/03/07/tito-tablada-flught-ariste..., 12462=In the past five years he’s released over a dozen singles and EPs while touring throughout North America and Europe. He’s also remixed works by diverse artists such as Bibio, Spor, STS9, Bear In Heaven and Bar9, to name a few. Angelides also runs the Ancestor label, which issued his “Hypercolor” and “Angus Dei” singles in 2009 to positive reviews from numerous magazines, blogs and tastemakers. Ninja Tune recording artist and film composer Amon Tobin hailed his work as “some of the best production I’ve heard in recent times.”, 14510=Delving into conspiracy theories and moved by the 9/11 attacks, his music took a darker turn. However, by 2005 he grew tired of his remote outpost and emerged to explore new environments and sounds. “The [conspiracies] were separating me from people,” he says of that period. “I wanted [people] to be motivated to come together and make change, but it had the opposite effect. I realized that music could be a tool to bring people together.”, 15718=One track that caught on big in 2009 was the self-released “Hypercolor”. “I wanted to write a tune at 140 bpm,” he says of the beaming, colorful song. “I made [the beat] a triplet pattern and added some Tom Waits-y sounds to it. I wanted it to be a really big sounding track without it being an aggro tune.” The track was featured on the Mary Anne Hobbs‘ BBC Radio1 show and was presented by Bleep as one of the top 100 tracks of 2009 in their catalog., 16244=Soon after his remix of Warp’s Bibio was featured in Pitchfork, he was asked by Flying Lotus to perform at the Brainfeeder Sessions in LA alongside Nosaj Thing. Angelides has since joined forces with Amon Tobin in a collaborative music project called “Eskamon” that highlights their love of field recoding and unique take on sound manipulation. His first single on Warp entitled “Lands and Bones” featuring Swan is set for an early 2010 release on a split single with good friend EPROM., 119074=Copyright © 2012 KBOO Community Radio | Copyright Policy | Community Guidelines | Website Illustration & Design by: KMF ILLUSTRATION, 11662=ESKMO-Brendan Angelides is a San Francisco based electronic music producer who records and performs live as Eskmo. His multi-genre compositions have been featured on influential labels like Warp Records and Planet Mu (most recently having been signed to the mighty Ninja Tune). While Angelides’ tracks encompass a wide range of electronic styles, he avoids classifications. Bleep.com described his tracks as “Masterfully produced… sophisticated, post-Dilla hip-hop funk“. His last single of 2009 entitled “Let Them Sing” on Mu was met with equal praise and described by sites like Boomkat as “[Putting] Eskmo on his own electronic plateau.”}", "lastModified": "Sat, 01 Aug 2015 05:17:34 +0000", "textBeforeTable": "10/20/2010 Air date:  A Jazz World Program name:  Jazz Categories: A Jazz World playlist for 10/20/2010 Login or register to post comments Much thanks to Todd Bayles for co-hosting, and to listener Chris for being the first person to become a KBOO member during my show!   The Beatles – Nowhere Man – Rubber Soul (Parlophone, 1965) **REQUEST Elvis Costello – Leave My Kitten Alone – Kojak Variety (Warner Bros, 1995) The Hollies – Pay You Back With Interest – Stop! Stop! Stop! (Parlophone, 1966) A Girl Called Eddy – Julia – The White Album Recovered (Mojo Magazine, 2008) Cornershop – Norwegian Wood (This Bird Has Flown) – When I Was Born For The 7th Time (Warner Bros, 1997) **REQUEST Fiona Apple – Across The Universe – Pleasantville Soundtrack (Sony, 1998) Queen – Play The Game – The Game (Elektra, 1980) Jellyfish – Brighter Day – Spilt Milk (Virgin, 1993) Paul McCartney", "textAfterTable": "  this is a music video that was made by the good people at intothewoods.tv http://intothewoods.tv/#/music-videos/greatmundane-slidingdownrainbows   http://twitter.com/thegreatmundane http://www.myspace.com/thegreatmundane http://thegreatmundane.bandcamp.com/ www.thegreatmundane.com   SUB SWARA - Sub Swara is a live electronic crew that represents the best in lo-frequency hi-vibration culture. From dubstep, dancehall, and jungle, to breakbeat, midtempo, and glitch hop, all mixed with a global sensibility in a live soundystem, the Sub Swara sound engages and unites across cultural and musical boundaries. The crew runs one of the most celebrated monthly club night on the first Fridays of every month at New York's Club Love, home of one of the finest club soundsystems in the country. the crew has played such prestigious events and venues as All Points West, The Clandestino Festival, Shambhala Music Festival, Deep Space NY, Dub War, Wembley Stadium, VH1 New Years in Goa, and Club Cargo (UK), and has appeared as a featured act on Maryanne Hobbs acclaimed BBC Radio 1 show and has played with fellow artists like The Glitch Mob, Bassnectar, FreQ Nasty, Ghislain Poirier, The Bug, Stereotyp, Skream, and more. About Coup d'Yah, the debut album from Sub Swara Two years in the making, Coup d'Yah unleashes the devastating bass-weighted sound which has become the recognized trademark of the crew's acclaimed NYC club night and performances around the world. The album spans a broad spectrum, from the dub-wise depths", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}