{"relation": [["", "1", "2"], ["Name", "CleanWritten On Her (Radio Edit)", "CleanWritten On Her (Clav Remix Radio Edit)"], ["Artist", "Birdman", "Birdman"], ["Time", "3:31", "3:30"], ["Price", "£0.99", "£0.99"], ["", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Written On Her (feat. Jay Sean) - Single by Birdman", "title": "", "url": "https://itunes.apple.com/gb/album/written-on-her-feat.-jay-sean/id342520123", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00091-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 881409663, "recordOffset": 881381706, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{6736=Born: 15 February 1969 in New Orleans, LA, 112568=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 04:49:42 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Birdman Written On Her (feat. Jay Sean) - Single iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Written On Her (feat. Jay Sean) - Single by Birdman, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your", "textAfterTable": "2 Songs Customer Reviews err nah           by sma stevie birdman signed Jay Sean so actually Jay would be nothing without Baby! theyre both amazing! Jay Sean!!           by Roxana123 i only bought this because i love jay sean<33 i couldn't care less about the G Birdman! Biography Born: 15 February 1969 in New Orleans, LA Genre: Hip-Hop/Rap Years Active: '90s, '00s, '10s When he's doing business, Cash Money Records CEO Bryan Williams uses his real name, but when he grabs the mike to spit Dirty South raps, Williams goes by the names Birdman or Baby. Williams formed Cash Money in 1991 with his brother Ronald \"Slim\" Williams. Releases by B.G., the Hot Boys, Juvenile, and many others built the Cash Money empire into a Dirty South powerhouse. Williams himself displayed his vocal skills on the Hot Boys albums, but it was with Cash Money's", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}