{"relation": [["Artist", "Elton John", "Extreme", "John Mayer", "The Platters"], ["Song Title", "Your Song", "More Than Words", "Say", "One In A Million"], ["Played When", "", "", "", ""]], "pageTitle": "Glee Season 4 Episode 18 - Shooting Star (4x18) - Watch Online - s4 e18 Spoilers", "title": "", "url": "http://www.tvrage.com/Glee/episodes/1065291203", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00203-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 804837065, "recordOffset": 804821422, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Music This was the first time that there was no closing music at the end of the episode, due to its serious nature. Episode Notes Read the full recap Recap The episode begins with Will announcing the Regionals. He tells the group that they will be competing against “Hoosier’s Daddy” from Indiana and the “Nun Touchables” from Michigan. At that moment, Brittany arrives and announces that a meteor, asteroid or comet (she is not sure what it is) will strike Lima. She tells everyone to spend their last moments with their loved ones. She too will do the same. She says that she is going to spend time with her cat, Lord Tubbington. Sam seems slightly irritated. .. Brittany Pierce As Heather Morris Sam Evans As Chord Overstreet Blaine Anderson As Darren Criss Artie Abrams", "textAfterTable": "Cultural References Brittany says \"Hide your kids, hide your wife\" which is a reference to a man in a news interview that went viral by the name of Antoine Dodson. Other Episode Crew Click here to add other crew for Shooting Star Missing Information Click here to add Episode Quotes Click here to add Episode Goofs Click here to add Episode References Click here to add Analysis   Flash Show Menu General Info Forum Episode List Episode Guide Printable Guide", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}