{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"], ["Name", "Rockin' the Joint", "This Thing Called Love", "Please Come On Home", "Oh Baby", "Sarah Lee", "I Got a Lot to Learn", "What Was Wrong", "Sweet Skinny Jenny", "The Rock-A-Round", "Dew Drop Inn", "Little Richard Interview"], ["Artist", "Esquerita", "Esquerita", "Esquerita", "Esquerita", "Esquerita", "Esquerita", "Esquerita", "Esquerita", "Esquerita", "Esquerita", "Esquerita"], ["Time", "2:49", "2:08", "3:15", "2:49", "2:21", "2:55", "2:31", "2:18", "2:49", "2:22", "1:24"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Vintage Voola by Esquerita", "title": "", "url": "https://itunes.apple.com/mt/album/what-was-wrong/id205718210?i=205718294", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00136-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 879713231, "recordOffset": 879692522, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{20578=Originally issued as a vinyl album, this compact disc reissue adds some new tracks and wild, eye-boggling color photos to the original package. The seven original demo acetates Esquerita cut in Dallas at Sellers' Recording in 1958 are still aboard, sounding raw and wonderful as ever, fleshed out with his contribution to Paul Peek's lone NRC single, \"Sweet Skinny Jenny\" and \"The Rock-A-Round,\" which he helped co-author. Added to this is Esquerita's late-'60s original version of \"Dew Drop Inn\" (later recorded by Little Richard) and a Little Richard interview where he waxes effusive about the artist who influenced him so greatly. Although a bit short in the running time department, this nonetheless is the perfect companion piece to any solid collection of his Capitol sides from 1958., 112976=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 08:06:35 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Esquerita Vintage Voola iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Vintage Voola by Esquerita, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "11 Songs Album Review Originally issued as a vinyl album, this compact disc reissue adds some new tracks and wild, eye-boggling color photos to the original package. The seven original demo acetates Esquerita cut in Dallas at Sellers' Recording in 1958 are still aboard, sounding raw and wonderful as ever, fleshed out with his contribution to Paul Peek's lone NRC single, \"Sweet Skinny Jenny\" and \"The Rock-A-Round,\" which he helped co-author. Added to this is Esquerita's late-'60s original version of \"Dew Drop Inn\" (later recorded by Little Richard) and a Little Richard interview where he waxes effusive about the artist who influenced him so greatly. Although a bit short in the running time department, this nonetheless is the perfect companion piece to any solid collection of his Capitol sides from 1958. Biography Born: New Orleans, LA Genre: Rock Years Active: '50s With a six-inch pompadour, brocaded shirts, rhinestone shades, and a rhythmic, belligerent style of piano playing, Esquerita was the original Little Richard, years before Mr. Penniman tutti-frutti'd his way to stardom. Working around the Dallas-New Orleans circuit in the early '50s, Esquerita's shot at the big time came when Capitol Records decided they needed their own version of Little Richard, after signing their", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}