{"relation": [["Author", "Johana Vankova", "Kevin O'Riordan", "Mick Hanney", "John Shiels", "diarmuid O'Colmain", "Mick Hanney", "Paul Mitchell", "Stephen Cleary", "Johana Vankova", "niamh o ceallaigh", "Stephen Cleary", "Mick Hanney", "Mick Hanney", "NIamh O Ceallaigh", "Dave McE", "Gareth Little", "Dave McE", "Caitlín Bent", "Mick Hanney", "Rene Borg", "Caitlín Bent", "Johana Vankova", "Eoin Brady", "Mick Hanney", "Rene Borg", "Rene Borg", "Brendan Pollard", "Stephane Pradines", "Stephane Pradines", "Catherine Devitt", "Emma Hand", "Dave McE", "Brendan Hogan", "Gareth Little", "Brendan Hogan", "Sean Broderick", "Sean Broderick", "Rene Borg", "Gary Ward", "Jason Kehoe", "Dave McE", "Justin Rea", "Catherine Devitt", "Brian Carolan", "Niamh O'Ceallaigh"], ["Date", "Mar 3, 8:39pm", "Mar 1, 1:27pm", "Feb 26, 11:41am", "Feb 26, 12:03am", "Feb 25, 5:03pm", "Feb 25, 3:57pm", "Feb 24, 5:27pm", "Feb 24, 4:05pm", "Feb 23, 7:36pm", "Feb 22, 4:39pm", "Feb 22, 4:36pm", "Feb 22, 3:05pm", "Feb 22, 11:19am", "Feb 21, 7:11pm", "Feb 21, 6:40pm", "Feb 21, 6:36pm", "Feb 21, 4:11pm", "Feb 21, 11:43am", "Feb 21, 10:14am", "Feb 20, 11:01pm", "Feb 20, 7:30pm", "Feb 20, 4:53pm", "Feb 20, 3:37pm", "Feb 20, 3:18pm", "Feb 20, 10:34am", "Feb 20, 10:33am", "Feb 19, 8:46pm", "Feb 19, 7:24pm", "Feb 19, 7:10pm", "Feb 19, 6:16pm", "Feb 19, 4:52pm", "Feb 19, 3:31pm", "Feb 18, 2:20pm", "Feb 18, 2:13pm", "Feb 18, 2:00pm", "Feb 17, 5:45pm", "Feb 17, 5:44pm", "Feb 17, 2:03pm", "Feb 17, 2:00pm", "Feb 16, 10:01am", "Feb 16, 9:48am", "Feb 14, 4:44pm", "Feb 13, 12:37am", "Feb 11, 1:19pm", "Feb 9, 1:10pm"], ["Message", "Hi Kevin, thanks a lot :-) That's ok, I know for sure that number 128 was behind me, because I saw him finishing when I looked back while walking away. But I'm happy now, and those few seconds (I'm a newbie in racing and half a minute is still just a few seconds) doesn't really change anything! Thanks a mil and I definitely make sure that my number will be notice the next time. Regards, Johana", "Hi Johanna, I've given you an approximate time of 71 mins. I was a little bit conservative in order to ensure fairness to other competitors. The important thing to note for future races is that your number should be clearly visible when you cross the finish line for results recording purposes. Regards, Kevin.", "Thanks guys - the more the merrier.", "Well Mick, you did ask. I've put up a report as well. john", "Mick there is", "There must be a race report out there somewhere?", "No problem Rachel.", "Hi Niamh, thanks a million for holding onto the jacket. See you at maulin. Stephen", "Hi Niamh, thank you. Looking at the pictures of other people I figured out I was somewhere between 69:45 and 70:25. Not to sure where exactly thou. It's partly my own fault, it was my first race and I didn't realise I'm suppose to hand in my number. It'll be great if my correct time is written down somewhere. Johana", "Hi Stephen, Your jacket was picked up and can be collected from Rachel at the Maulin race. It is with the race equipment. Niamh", "Hi, I was wondering did anyone pick up a blue running jacket at the start of the race next to the barrier, it was so warm I forgot to look for it after the race;) Thanks, Stephen.", "Team prizes for Sli Cualann (Mens) and Raheny Shamrocks (Ladies) can be picked up at the next race.", "Any creative spirits want to have a go at a race report? Eoin - how about one from the race winner :-)", "Hi Johanna, Apologies for the mix up with your result. We will amend the results with your correct time. NIamh", "Cheers Gareth", "Hi Dave, check out the below.... http://www.imra.ie/forum/topic/id/1667/ http://www.imra.ie/forum/topic/id/1529/ http://www.imra.ie/forum/topic/id/1853/ I got a pair of Salomon Speedcross 2 trail runners, a great shoe for the mountains! Pop into the great outdoors and they will be able to give you lots of really good advice. You also get a 10% discount too :) (http://www.imra.ie/reading/view/id/16/) Hope this helps, Gareth", "Looking for some help to get the right runners. Did my first IMRA run yesterday, really enjoyable. I am looking for any info in relation to trail running shoes, where I can buy them, what types there are, any recommendations from the seasoned runners out there. Regards, Dave", "Will look in. Thanks Mick.", "Caitlin - dog captured here... http://www.imra.ie/photos/tag/id/36972 Dog wasn't wearing a no. so couldn't tag him/her", "Team results are up.", "A very enjoyable race today. My thanks to Niamh and all concerned. The marking was spot on. Just a little gripe - A race competitor passed me along the way with a dog on a lead which I believe is out of order for obvious reasons. Did anyone else spot him?", "Hi, it was my first race ever. I really enjoyed the run and the atmosphere. It was well organised and I had fun. Thought I did really well, it was 12:16 when I checked my phone after finishing. So I was really looking forward to see my result (at about 75 mins or bit less I guess)in compare with the others...and now I'm listed as a second last one, with 127 mins....How did that happened? It spoiled the joy little bit..", "I agree with Mick. Thanks organisers! Really well run, lovely atmosphere and great fun.", "Thanks Niamh and volunteers for a great race today in a wonderful wintery setting.", "That should be \"First mountain run\". Last is a tad ominous...", "Great stuff Stephane, enjoy your last mountain run, it should be about 45 hours shorter than your last race!", "Kevin O'Riordan: Apologies for late reply but Kevin if you see this can you contact me on 0868178657. I live up at Lanesborough beside Charlestown. A lift tomorrow would save me a lot of hassle. I could meet you at Tolka Rovers or wherever suited you. thanks, Brendan Pollard 0868178657", "It's OK, i think I found a lift. I didn't see \"carpool\". Thanks.", "Hi, I am the young French ultra-runner. I'm sorry to write so late but i look for a lift for the race tomorrow. Rene Borg helped me but for the moment anyone (just one person but he live in Dun Laoghaire so it's not very good for him). So I'm interested by a lift. I live in Tallaght (near the hospital) but I can move (City center or somewhere else). Thank you very much for your help. Stephane Pradines", "Hi Gary, Great. I am just opposite the Tesco's in Sandymount - so how about I meet you there at 9.45 tomorrow morning. It is in Tesco village. Great if you can email me your number just in case i need to cntact you, Regards, Catherine", "Hi Catherine, I'd love a lift if you've still got space and can help out with petrol etc. Where are you leaving from in Sandymount? Is there somewhere I can park? Alternatively, I can meet you somewhere along the N11 if you can think of anywhere suitable. I've left my car in the Foxrock car park before. My ph is 0876849235 if you need to contact me. Thanks, Emma.", "cheers for the feedback Jason.", "Great, Thanks for the help and advice. See you on Saturday morning. Brendan", "Hi Brendan, Going by your previous experience and times you will be fine for the Tibradden race. As this is your first race just go at your own pace and you will soon get into a comfortable routine. As stated previously, just bring along €17 (€10 annual membership / €7 race fee) and you will be all set to go! Looks like it could be a bit cold / frosty on the day so bring some extra clothes and perhaps and hat and gloves. Have a look at what other people are wearing too and you should be right. Good luck, Gareth", "Hi, I have been thinking of entering a race for a while now. I had planned on starting with maulin but have just seen this race on this weekend. One thing I am concered of is my level of fitness. Would this be a good race to start out in? Any help, advice appreciated. As a bench mark, I ran a 10k road race in phoenix park in 50mins approx the last 2 years, And completed GF6 for the past 2 years in 6 hrs 22 mins (exact time 2 years in a row..!). My fitness is relatively similar to what it was then. Thanks, Brendan", "Hey guys, Anyone planning a doing a recce of the route Thursday evening? I cannot make the race on Saturday morning but I would love to do the route tomorrow evening. I dont know the route so if anyone knows the route and wants to do a training run let me know. sbroderick at eircom.ie Sean", "Hey guys, Anyone planning a doing a recce of the route Thursday evening? I cannot make the race on Saturday morning but I would love to do the route tomorrow evening. I dont know the route so if anyone knows the route and wants to do a training run let me know. sbroderick@eircom.ie Sean", "Hi all, I've got a young French ultra-runner, Crusaders and exchange student (some intro) who's looking to go to his first mountain race on Saturday. He lives in Tallaght but trains out of Irishtown, so could probably arrange to meet anyone crossing within the vicinity of that area.", "Hi Catherine, I would love a lift out on Saturday. I live just across the East Link so only a few minutes walk away. Where in Sandymount would be a good place to meet? Happy of course to help with petrol etc. Cheers, Gary", "My own recommendations: Bring a range of clothes for last minute decision - take a look at what others are wearing during their warmup. Nice calm day: Shorts Technical running t-shirt Windy cold day: Shorts Longsleeve technical running top Hat Rainy day: Shorts Longsleeve or tech t-shirt Lightweight rain resistant running jacket Hat", "Planning to do my first IMRA run on the 20th of this month. Usually only do road races so looking for any recommendations on clothing. Is it the norm or do you need light running jacket, heavy weather top etc. Cheers, Dave", "I ran recce of route during the week. It is pretty easy to follow. The race will start along the forest road rather than up the way marked Dublin Way, you join the way further up the hill, and follow new trail till you meet Wicklow Way, turn left here, then route is easy to find up to Fairy Castle. Watch out for left turn coming down towards comms masts, this path joins Wicklow Way again at left turn, then you join up with the trail back to Tibradden. Route is mostly on paths with one rocky patch on descent and traverse of Two Rock mountain. Fair climb in the first 2km, then pretty flat until Two Rock. Great route for a Winter League race.", "Hi! I will be leaving from Sandymount village and travelling south along N11 if anyone requires a lift. Leave Sandymount around 9.45 - 3 spaces available. Catherine", "I'm thinking of heading down to do a recce at some stage over the next week or so. As someone with no sense of direction who would have trouble directing a seagull to the coast how easy is the route to find/follow? Thanks", "IMPORTANT NOTICE RE FIXTURES: Contrary to what is printed in the paper calendar, the next race is Tibradden on Saturday 20th February, 11am. Please refer to the event page for further details."]], "pageTitle": "Irish Mountain Running Association", "title": "", "url": "https://www.imra.ie/forum/reply/id/2049/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00284-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 914834097, "recordOffset": 914825895, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Back to Forum }); ); } document.getElementById(\"captcha-response\").value = document.getElementById(\"recaptcha_response_field\").value; document.getElementById(\"captcha-challenge\").value = document.getElementById(\"recaptcha_challenge_field\").value; function(e) { 'submit', document.getElementById(\"captcha-challenge\").form, zendBindEvent( windowOnLoad(function(){ } } el.attachEvent('on'+eventName, eventHandler); } else if (el.attachEvent){ el.addEventListener(eventName, eventHandler, false); if (el.addEventListener){ function zendBindEvent(el, eventName, eventHandler) { } }; fn(); } old(); if (old) { window.onload = function() { var old = window.onload; function windowOnLoad(fn) {", "textAfterTable": "Safety Beginners Internationals Wicklow Round Contact Constitution Links Reading Archive Forms Privacy Policy Email Address: Password:   Forgot Password? | What is myIMRA? myIMRA", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}