{"relation": [["ARTIST", "Billy Taylor, piano; Victor Gaskin, bass; Bobby Thomas, drums", "Dianne Reeves, voice; Donald Brown, piano; Lonnie Plaxico, bass; Ralph Peterson, drums", "Wayne Shorter, sop. sax; Kirk Lightsey, piano; Rufus Reid, bass; Steve Bagby, drums", "Fred Hersch, piano; Drew Gress, bass; Matt Wilson, drums", "Mel Lewis, drums/bandleader; Joe Lovano, t. sax; Rolando Briseno, a. sax; Dick Oatts, a. sax; Ralph Lalama, t. sax; Gary Smulyan, b. sax; Earl McIntyre, b. tbn; Doug Purviance, tbn; John Mosca, tbn; Ed Neumeister, tbn; Peter Wright, French hn; Larry Moses, tpt; Earl Gardner, tpt; Laurie Frink, tpt; Jim Powell, tpt; Dennis Irwin, bass; Kenny Werner, piano", "Sir Roland Hanna, piano", "Ruth Brown, voice; Bill Easley, t. sax; Charles C.R. Williams, a. sax; Bobby Forester, Hammond Organ; Bill Williams, guitar; Clarence \"Tootsie\" Bean, drums"], ["SELECTION", "The Man I Love", "Love For Sale", "Fee-Fi-Fo-Fum", "Black Nile", "Mr. Fone Bone", "Walkin'", "5-10-15 Hours"], ["DATE RECORDED", "11/1/1987", "10/18/1987", "10/8/1982", "7/4/1997", "4/21/1985", "4/29/1994", "3/20/1988"], ["VENUE", "WBGO performance studio", "WBGO performance studio", "William Paterson College", "1997 Iowa City Jazz Festival", "The Ritz (WBGO Jazzathon)", "Gilmore International Keyboard Festival", "20/20"]], "pageTitle": "WBGO's Playdate With Matt Wilson: Show #1 | WBGO Jazz 88.3FM", "title": "", "url": "https://www.wbgo.org/playdate/wbgos-playdate-with-matt-wilson-show-1", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00240-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 951807963, "recordOffset": 951788073, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1511=The debut first show features Wayne Shorter Day in 1982 on the campus of William Paterson University, Billy Taylor inside the WBGO performance studio innaguarting the Steinway baby grand piano, Ruth Brown on stage in New York City at 20/20, The Mel Lewis Jazz Orchestra at a WBGO Jazzathon, and much more!}", "TableContextTimeStampAfterTable": "{38888=From a Benny Goodman-themed concert on October 21, 1993, Maestro Jon Faddis and arranger Jim McNeely put the band on its course, 41986=Web Extra: listen to \"Armando's Rhumba\" performed in 1985 by Chick Corea, piano with Gary Burton, vibes., 30235=Bonus Audio: From 1990, the great young drummer, self-declared Jazz Maniac, and WBGO host Kenny Washington reflects on the legacy of Art Blakey., 37814=Max Roach Double Quartet performed \"Bright Moments\" inside the WBGO performance studio in 1987., 16710=WBGO JAM Fest 2015 Hear the top student jazz groups perform live in our annual on-air festival. more, 31769=Bonus Audio: The Proclamation was made at the Brooklyn Brass Festival on March 8, 2014, and we chime in with \"Good Morning, Heartache\" by Bowie's Brass Fantasy from the WBGO Archive., 40339=Bonus Audio Extra: To celebrate bandleader Sun Ra's 100th birthday, stream \"Space is the Place\" from a performance by the Arkestra in Huntington, Long Island on April 21, 1991., 43469=Bonus Audio Extra: read about Wayne Shorter Day 1982 and hear Shorter play \"Footprints\" and \"Fee-Fi-Fo-Fum\" live., 36864=Bonus Audio: Stream saxophonist Dewey Redman with pianist Geri Allen at Town Hall in 1991 and The Dewey Redman Quartet at the Iridium in 1996., 30748=Bonus Audio: full audio of Ray Anderson's Pocket Brass playing \"I Mean You\" from the 1997 Iowa City Jazz Festival., 34394=Web Extra: exclusive photos from the 2014 and 2013 Mardi Gras festivities, courtesy of WWOZ New Orleans 90.7FM., 28683=The November 1, 2001, concert opens with this musical prayer at Carnegie Hall in New York., 29651=Bonus Audio: Larry Coryell plays \"Body and Soul\" and \"On Green Dolphin Street\" with George Braith at the Village Vanguard in 1984.}", "lastModified": "Sat, 01 Aug 2015 04:02:09 GMT", "textBeforeTable": "The Line-up: Read words on Ruth Brown by Felix Hernendez and a retrospective on Billy Taylor by Tim Wilkins. \"Just Friends\" from The Mel Lewis Jazz Orchestra at a 1985 WBGO Jazzathon. Wayne Shorter Day 1982 with the full story and full audio of \"Footprints\" and \"Fee-Fi-Fo-Fum.\" Web Extras from Show #1: Check out a behind the scenes video of Matt Wilson and Kirk Knuffke tracking the Playdate theme. Now, let's play! The full line-up is below, the entire show is above, tweet us @playdatewbgo and connect via the WBGO Facebook page.  The debut first show features Wayne Shorter Day in 1982 on the campus of William Paterson University, Billy Taylor inside the WBGO performance studio innaguarting the Steinway baby grand piano, Ruth Brown on stage in New York City at 20/20, The Mel Lewis Jazz Orchestra at a WBGO Jazzathon, and much more! Playdate with Matt Wilson arrives!  Stream the show by clicking the link above and explore shows 2, 3, 4, 5, 6, 7, 8  and explore our web extras. Listen Now WBGO's Playdate With Matt Wilson: Show #1", "textAfterTable": "  Listen Now Support comes from the National Endowment for the Arts, New Jersey State Council on the Arts and WBGO. Produced for WBGO by Alexander Ariff, with Becca Pulliam and Duke Markos, Executive Producer Josh Jackson. Share | Please enable JavaScript to view the comments powered", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}