{"relation": [["ARTIST", "EXPLOSIONS IN THE SKY", "KADDISFLY", "BLOODJINN", "69 EYES, THE", "FIELD MUSIC", "FINGER ELEVEN", "HAWKINS, TRAMAINE", "ILLINOIS", "JAIN, ESSIE", "LITTLE AXE", "LMNO", "MANDO DIAO", "MANN, CHICO", "MENDEED", "MUNLY, JAY", "N.I.L.", "SHERWOOD, ADRIAN", "SMOKE OR FIRE", "STRIBORG", "SWEET, KELLY", "TIMES NEW VIKING", "ANTIBALAS", "ARCADE FIRE", "BIG BUSINESS", "BLACKFIELD", "BRIGHT EYES", "GREEN PITCH", "HAMMOND, ALBERT JR.", "HIGHER, THE", "JONNY LIVES!", "MRNORTH", "ODAWAS", "OKKERVIL RIVER", "ONE AM RADIO", "ORANGEBURG MASSACRE", "PARKINS, ZEENA", "PAULSON", "RJD2", "SECRET HANDSHAKE, THE", "SEVENDUST", "SHAW BLADES", "SILMARIL", "TAYLOR, MARIA", "TRAGICALLY HIP", "WHITE FLIGHT", "WOLF & CUB"], ["TITLE", "ALL OF A SUDDEN I MISS EVERYONE", "SET SAIL THE PRAIRIE", "THIS MACHINE RUNS ON EMPTY", "ANGELS", "TONES OF TOWN", "THEM VS. YOU VS. ME", "I NEVER LOST MY PRAISE LIVE", "WHAT THE HELL DO I KNOW?", "WE MADE THIS OURSELVES", "STONE COLD OHIO", "BOOM IT/RACE CARD", "LONG BEFORE ROCK’N'ROLL", "MANIFEST TONE VOL. 1", "THE DEAD LIVE BY LOVE", "GALVANIZED YANKEE", "ST", "BECOMING A CLICHE", "THIS SINKING SHIP", "NEFARIA", "WE ARE ONE", "THE PAISLEY REICH", "SECURITY", "NEON BIBLE", "HERE COME THE WATERWORKS", "BLACKFIELD II", "FOUR WINDS", "ACE OF HEARTS", "YOURS TO KEEP", "ON FIRE", "GET STEADY", "FEAR & DESIRE", "RAVEN AND THE WHITE NIGHT", "BLACK SHEEP BOY (DEFINITIVE ED", "THIS TOO WILL PASS", "MOOREA", "NIGHTMARE ALLEY", "ALL AT ONCE", "THE THIRD HAND", "SUMMER OF 98", "ALPHA", "INFLUENCE", "THE VOYAGE OF ICARUS", "LYNN TEETER FLOWER", "WORLD CONTAINER", "WHITE FLIGHT", "VESSELS"], ["GENRE", "ALTERNATIVE ROC", "ALTERNATIVE ROC", "METAL", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK", "ROCK"]], "pageTitle": "Music For The Masses: 3/1/07 or The “Loose Ends” Edition » FRED Entertainment", "title": "", "url": "http://asitecalledfred.com/2007/03/01/music-for-the-masses-3107-or-the-loose-ends-edition/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 11, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00092-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 17455451, "recordOffset": 17438719, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{32435=When I first heard about this album, it was hyped as Think Differently Music Presents: Wisemen Approaching. That in itself was enough to get me to pick up this album. See, if you don’t know, Think Differently Music is the brainchild of Bronze Nazarath, who coincidently is one of the 4 members of Wisemen. In 2005, Think Differently Music released one of the best hip hop albums in the last few years with Wu-Tang Meets Indie Culture. This album combined Wu-Tang Clan members with stars of the underground scene such as MF Doom, Del Tha Funky Homosapeien and Aesop Rock. This was a GREAT album, which led to my interest in this particular Wisemen CD. But something strange happened when I actually picked up this new album. Nowhere on it does it even mention Think Differently Music. “Odd,” me thought. That little fact really has nothing to do with this review. I just need to waste space. Is this space fully wasted? Good, now we can move on., 31781=Blue October @ The Ogden, 37324=(Of course, he subsequently pushed his luck and made To Wong Foo, Something Something, Julie Newmar, a movie that nobody watched, and for which the soundtrack likely included “Taps” (to mark the end of his acting career). But considering that he hasn’t been seen since then, doesn’t now seem like a good time for Quentin Tarantino to cast him in something?), 53201=M.C. Bell P.O. Box 1222 Arvada, CO 80001}", "textBeforeTable": "UPCOMING RELEASES… 3/6/07 E-MAIL THE AUTHOR Don’t Hassel the Hoff!! Rappers got it all wrong. “Ghost like Swayze?” Pshaw!!! Highlight: Too many to mention. Quite possibly the hands-down winner of the title “Greatest Video of All-Time.” Remember earlier when I said that the actor’s foray into music never turns out well? I stand corrected. This is everything you’d want a David Hasselhoff video to be, and more. Jump In My Car David Hasselhoff Highlight: The fact that you get the sense that this is EXACTLY what Lewis is like in real life. Hot Kiss Juliette Lewis Highlight: Either the remarkably unsexy backup dancers, or Mr. T’s very sexy shorts. (However, the outstanding opening segue also deserves mention: Dissing on each other? No problem. Dissing on someone’s mother? T steps in!). Treat Your Mother Right Mr. T Highlight: Tie–Rick James rocks Whitney Houston’s hairdo from the same time period and Eddie’s chorus sounds like he’s singing “My girl wants to potty all the time, potty all the time, potty all the tiiiiiiime.” Why can’t Flomax use this song in a marketing campaign? Party all the time Eddie Murphy Highlight: Definitely the first line of the song: “She’s like the wind….through my tree.” Pure poetry! She’s Like The Wind Patrick Swayze Let’s kick it off with the master himself: On the bright side, these forays–while musical disasters–often result in superb comedy. Here then are five fantastic", "textAfterTable": "Well, there you have it friends… another notch on the bed post. Until next week, keep wearing it proud and playing it loud. Send pictures of your man-crush, review copies, hate mail and assorted presents to: M.C. Bell P.O. Box 1222 Arvada, CO 80001 E-MAIL THE AUTHOR « The Fred Hembeck Show: Episode 93 - They Shoot Freds, Don’t They? | Home | Quick Stop Thingamabobs: 3/2/2007 » Comments: Leave a Reply Name (required) Mail (will not be published) (required) Website", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}