{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"], ["Name", "Tombstones and Cigarettes", "1975", "Antler (I Got Lost)", "Blood On the Moon", "Dead By Valentines", "My Life", "Love Sick", "Didn't See the Day", "All I Had", "I Laid Eyes", "Dig Yer Own Hole"], ["Artist", "Antler", "Antler", "Antler", "Antler", "Antler", "Antler", "Antler", "Antler", "Antler", "Antler", "Antler"], ["Time", "4:09", "2:39", "4:05", "3:23", "3:38", "4:29", "2:55", "4:01", "4:46", "2:44", "5:20"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Antler by Antler", "title": "", "url": "https://itunes.apple.com/mt/album/antler/id215620118", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00061-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 873275727, "recordOffset": 873255412, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{70911=Copyright © 2014 Apple Inc. All rights reserved., 20631=The debut album by Boston roots-rockers Antler doesn't fit into any particularly neat categories, which is part of its charm. The opening \"Tombstones and Cigarettes\" feels very much like Green on Red's mid-'80s mash-up of post-punk and country, but that rolls directly into the much darker \"1975,\" with its squalling distorted guitar and threateningly slow pulse; it sounds more like a less crazed Queens of the Stone Age. The rest of the album moves back and forth between alt-country and stoner rock, and for the most part, it's a combination that works surprisingly well. The main exception is the overwrought \"Blood on the Moon,\" which singer Craig Riggs oversings in an inappropriately stentorian manner (think Dennis DeYoung of Styx at his most vocally bloated) that's all the more frustrating because it has one of the album's strongest melodies. On songs where Riggs dials it back, like \"Dead by Valentines\" (which features an appealingly-'70s arena rock instrumental section), he's a much stronger frontman; luckily, that's most of the time, making Antler is a promising debut that suggests better still to come., 21913=Formed: 2002 in Boston, MA}", "lastModified": "Fri, 31 Jul 2015 08:01:40 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Antler Antler iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Antler by Antler, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "11 Songs Album Review The debut album by Boston roots-rockers Antler doesn't fit into any particularly neat categories, which is part of its charm. The opening \"Tombstones and Cigarettes\" feels very much like Green on Red's mid-'80s mash-up of post-punk and country, but that rolls directly into the much darker \"1975,\" with its squalling distorted guitar and threateningly slow pulse; it sounds more like a less crazed Queens of the Stone Age. The rest of the album moves back and forth between alt-country and stoner rock, and for the most part, it's a combination that works surprisingly well. The main exception is the overwrought \"Blood on the Moon,\" which singer Craig Riggs oversings in an inappropriately stentorian manner (think Dennis DeYoung of Styx at his most vocally bloated) that's all the more frustrating because it has one of the album's strongest melodies. On songs where Riggs dials it back, like \"Dead by Valentines\" (which features an appealingly-'70s arena rock instrumental section), he's a much stronger frontman; luckily, that's most of the time, making Antler is a promising debut that suggests better still to come. Biography Formed: 2002 in Boston, MA Genre: Rock Years Active: '00s Since forming in 2002, Antler has defied the rules", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}