{"relation": [["Artist", "Adam Hood", "April Geesbreght", "Art Morgan", "Freek Squad", "Jaylyn Ducati", "Kathleen Edwards", "Mississippi John Hurt", "Tori Bigelow", "Young Mennace"], ["Song Title", "Tennessee Will", "Once I've Done It", "The Ballad of Oscar Jones", "Work It", "Move My Hips", "A Soft Place to Land", "Nobody's Dirty Business", "Birds and the Bees", "Outta Control"], ["Played When", "Lavon talks to Zoe about what happened with Lemon", "George tells Zoe that they aren't friends anymore", "", "", "", "George breaks up with Lemon", "", "", ""]], "pageTitle": "Hart Of Dixie Season 1 Episode 18 - Bachelorettes & Bullets (1x18) - Watch Online - s1 e18 Spoilers", "title": "", "url": "http://www.tvrage.com/Hart_Of_Dixie/episodes/1065160470", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00042-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 804926164, "recordOffset": 804910210, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Music Notes: 1.37 Million Viewers Episode Notes Read the full recap Recap The episode begins with George testing his eyesight by trying to recognize people from across the road, after he saw Lavon and Lemon kissing at a distance the night before. He still can’t seem to believe his eyes. Zoe is curious as to what he is exactly is trying to do, he tells her “I am trying to see what a witness may or may not be able to see from this distance”. Meanwhile, Lavon comes by, and the situation becomes apparently awkward, with Lavon’s guilt, George’s doubt and Zoe looking on at the two of them curiously. Later, Zoe meets a cute patient at her clinic called Jesse. He asks Zoe out to lunch. Meanwhile, Lemon discusses the marriage plans with her maid of honor; her sister. .. George Tucker As Scott Porter Wade Kinsella As Wilson Bethel Lavon Hayes As Cress", "textAfterTable": "Episode Quotes Zoe: I hate small towns. Everyone I know lives here, and there are only like nine people in the whole town. You have to keep track of everyone's secrets. In New York I could ride next to someone on the subway, learn all about them, about their kids, their hopes, their dreams. And never have to think about them again. It was great. You know, I don't even live here? And that is why I am done. I am officially out of the being in everyone's business, business. Jesse: Well, I don't live here. I'm Jesse. Zoe: Hi, I'm Zoe. Dr. Hart. Dr. Zoe Hart. Zoe. Yeah, sorry I've just been talking all about me and I didn't even ask you how you sprained your wrist. Jesse: Oh, ninja stuff. It's boring. Zoe: Well how did a ninja wind up in this small little town? Jesse: Well, you are sworn to secrecy right? Being my doctor? Zoe: Mmhm, absolutely. Jesse: Antiquing. Zoe: Really? Jesse: And some murdering and what not. Wade: Hangover? What can I get for you? Lavon: A quick burial. Nothing fancy, maybe say a few words. Wade: Or you could have my extra special,", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}