{"relation": [["Author", "EJ Hurst", "EJ Hurst"], ["Message", "Hi Everyone, Dmitry will be visiting with us until Wednesday August 10th. Please send your final comments by then. For the first 10 people to comment, watch for an e-mail from me. You have won a Reinventing Collapse T-shirt. Monday 08 August 2011 03:17:58 pm", "Thanks to everyone who has participated in this excellent discussion. I have had such a great time reading all the comments and responses. I love that everyone pitched in to help answer questions and offer comments. Let's hope we can continue with some more great chats. If there is one of our authors you would like to hear from, please just let me know by e-mailing EJ at newsociety.com. For regular updates about new society books, authors and events, you can also subscribe to our newsletter at the bottom right of our home page. Take care and happy prepping to all! Wednesday 10 August 2011 02:29:59 pm"]], "pageTitle": "Three More Days | New Society Publishers", "title": "", "url": "http://newsociety.com/forums/Reinventing-Collapse-by-Dmitry-Orlov/Three-More-Days", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00315-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 166535870, "recordOffset": 166527668, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{1375=Wednesday 10 August 2011 02:29:59 pm, 277=Hi Everyone, Dmitry will be visiting with us until Wednesday August 10th. Please send your final comments by then. For the first 10 people to comment, watch for an e-mail from me. You have won a Reinventing Collapse T-shirt., 537=Monday 08 August 2011 03:17:58 pm}", "lastModified": "Fri, 31 Jul 2015 07:15:49 GMT", "textBeforeTable": "To post in our Book Club, please log in or sign up for an account here. Next topic » | Reinventing Collapse by Dmitry Orlov | Previous topic «  Three More Days Book Club Our Blog About New Society Books & Authors Contact Us How to Order Shopping Cart }()); document.getElementById('fb-root').appendChild(e); '//connect.facebook.net/en_US/all.js'; e.src = document.location.protocol + (function() { var e = document.createElement('script'); e.async = true; }; xfbml: true}); window.fbAsyncInit = function() { FB.init({appId: '136539023063369', status: true, cookie: true,", "textAfterTable": "Books & Authors Upcoming By Topic By Author Alphabetical Special Deals Find Books About activism agriculture appropriate technology climate change cohousing community cooking ecological design ecology economics economy ecovillages education energy energy efficiency environment food food security gardening green building green business green jobs health mediation", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}