{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"], ["Name", "The Need", "Inner Vacume", "Perfumed Metal", "Planet Strike", "The Strangers", "Insect Human", "Out Of Reach", "Brain On Scan", "Blood On The Moon", "In A Dream", "Danger Zone"], ["Artist", "Chrome", "Chrome", "Chrome", "Chrome", "Chrome", "Chrome", "Chrome", "Chrome", "Chrome", "Chrome", "Chrome"], ["Time", "3:02", "2:55", "4:39", "2:25", "3:35", "4:55", "3:35", "3:59", "5:08", "5:09", "5:22"], ["Price", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Blood On The Moon by Chrome", "title": "", "url": "https://itunes.apple.com/gr/album/blood-on-the-moon/id368053029", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00040-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 878056091, "recordOffset": 878031558, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{119150=Copyright © 2014 Apple Inc. Με επιφύλαξη παντός δικαιώματος., 22812=Formed: 1977 in San Francisco, CA}", "lastModified": "Sat, 01 Aug 2015 04:10:43 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Chrome Blood On The Moon iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Blood On The Moon by Chrome, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "11 Songs Album Review With the Stench brothers on board as the rhythm section, Chrome veered towards creating more 'regular' rock music, if only conceptually. While still never playing live, it's easy to imagine many of the songs on Blood kicking out the jams live, especially since in the punk/new wave-crazy scenes of the times they would have cut a truly unique path. No matter how near to three-chord catchiness some of the numbers get, something about them always sounds just off enough. Edge maintains his usual mix of electronic weirdness — at this point he had the knack for never making his keyboards sound cheap or or cheesy, a good talent — whileCreed is all over the place as usual, his seemingly effortless but always fantastic soloing ripping through the songs. \"Perfumed Metal\" is one fantastic example of many, with both his strong rhythm crunch and his freeform work turning everything into one powercharged feedback frenzy. Another winner is the massive solo halfway through \"The Strangers\" — only a few seconds long, but better than most songs in their entirety. Meanwhile, Edge feeds his voice through effects processors and keeps on the strange lyrical path — thus, from \"Inner Vacume,\" this couplet: \"Buildings built like beaches/Dripping off the land.\" It's not all aliens from Mars or anything — often", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}