{"relation": [["Title", "The Place of Stunted Ironwood Trees", "Soul of a Lion", "The Elephant's Secret Sense", "Blood Rose", "Histories of Namibia"], ["Author", "David P Crandall", "Barbara Bennett", "Caitlin O'Connell", "Margie Orford", "Colin Leys and Susan Brown"]], "pageTitle": "Namibia Tours & Travel | Intrepid Travel NZ", "title": "", "url": "http://www.intrepidtravel.com/nz/namibia", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00296-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 521938267, "recordOffset": 521875968, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{188823=Review submitted 21 Jul 2015, 87686=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 86367=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o...}", "TableContextTimeStampAfterTable": "{90164=May to October is considered one of the best times to visit Namibia as the days are warm and sunny and the weather is generally dry. Namibian and South African school holidays are mid-December to mid-January, late April to early June and late August to mid-September, so expect Namibia to be busier during these times., 59437=The country only celebrates its 20th anniversary of independence on 21 March this year, but as Intrepid’s Gill Leaning discovered, Namibia is an ancient land of dramatic deserts and stunning […]}", "textBeforeTable": "Recommended reading Further reading 10. When on community visits or homestays, refrain from giving gifts or money to locals. 9. Please ask and receive permission before taking photos of people, including children. 8. Refrain from supporting businesses that exploit or abuse endangered animals. 7. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 6. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 5. When bargaining at markets, stay calm, be reasonable and keep a smile on your face. It's meant to be fun! 4. Always dispose of litter thoughtfully, including cigarette butts. 3. For environmental reasons, try to avoid buying bottled water. Instead, fill a reusable water bottle or canteen with filtered water. 2. Dress modestly and respectfully. Shoulders to knees should be covered, especially when entering places of worship. 1. Be considerate of Namibia’s customs, traditions, religion and culture. Top responsible travel tips for Namibia Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please", "textAfterTable": "Handy links www.lonelyplanet.com/namibia www.worldtravelguide.net/namibia www.namibiatourism.com.na × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}