{"relation": [["Title", "Around the world in 80 plants", "Catching nature in the act: Réaumur and the practice of natural history in the eighteenth century", "Field guide to Wisconsin grasses", "Florida's edible wild plants: A guide to collecting and cooking", "Grass, soil, hope: A journey through carbon country", "Green walls green roofs: Designing sustainable architecture", "How the Earth turned green: A brief 3.8-billion-year history of plants", "Leaf defence", "Pollen: The hidden sexuality of flowers", "Saving container plants: Overwintering techniques for keeping tender plants alive year after year", "Saving vegetable seeds: Harvest, clean, store, and plant seeds from your garden", "Sowing the seeds of victory: American gardening programs of World War I", "Sustainable homebrewing: An all-organic approach to crafting great beer", "Technology and the garden", "The bee: A natural history", "The flower hunter and the people: William Bartram's writings on the Native American Southeast", "The glory of the tree", "The Loudons and the gardening press: A Victorian cultural industry", "The Tao of vegetable gardening", "The wilderness writings of Howard Zahniser", "The wildflowers of Ireland: A field guide", "The working man’s green space: Allotment gardens in England, France, and Germany, 1870-1919", "Views of nature", "Whispering flowers"], ["Author", "Stephen Barstow", "Mary Terrall", "Emmet J. Judziewicz, Robert W. Freckmann, Lynn G. Clark, and Merel R. Black", "Peggy Sias Lantz", "Courtney White", "Gina Tsarounas (editor)", "Joseph E. Armstrong", "Edward E. Farmer", "Rob Kesseler and Madeline Harley", "Alice McGowan and Brian McGowan", "Fern Marshall Bradley", "Rose Hayden-Smith", "Amelia Slayton Loftus", "Michael G. Lee and Kenneth I. Helphand (editors)", "Noah Wilson-Rich", "William Bartram", "Noel Kingsbury", "Sarah Dewis", "Carol Deppe", "Howard Zahniser", "Zoë Devlin", "Micheline Nilsen", "Alexander von Humboldt", "Mit Ingelaere-Brandt"], ["Publication Date", "2014", "2014", "2014", "2014", "2014", "2014", "2014", "2014", "2014", "2014", "2014", "2014", "2014", "2014", "2014", "2014", "2014", "2014", "2015", "2014", "2014", "2014", "2014", "2014"], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]], "pageTitle": "Current Books & Book Reviews | Chicago Botanic Garden", "title": "Volume: 16, Number: 4", "url": "http://www.chicagobotanic.org/book/11.3/austin.php", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00281-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 365109815, "recordOffset": 365094888, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{856=In 1999, the first issue of this review journal appeared. It aim was to fill a gap in reviews of new books in botany, gardening, landscape architecture, and related fields. Many volunteers and staff at the Chicago Botanic Garden contributed reviews of fascinating books, from technical tomes to children's tales about natural history. After 16 volumes and hundreds of reviews, this issue is the last.}", "TableContextTimeStampAfterTable": "{25305=© 2015 Chicago Botanic Garden. All rights reserved. One the treasures of the Forest Preserves of Cook County., 22278=1000 Lake Cook Road Glencoe, IL 60022 Main: (847) 835-5440 Member: (847) 835-8215 Directions Garden Map Admission is free. Parking rates apply., 23927=Today, August 3, 2015 7 a.m. – 9 p.m. (sunset 8:09 p.m.) Garden View Café: 8 a.m. – 9 p.m. Garden Shop: 10 a.m. – 9 p.m.}", "lastModified": "Mon, 03 Aug 2015 17:27:30 GMT", "textBeforeTable": "I thank all of the reviewers who made this journal possible. I appreciated all of the kind comments from authors, publishers, readers, and librarians about this unique, online only, free journal. – Edward J. Valauskas, Editor, Current Books on Gardening and Botany (also Curator of Rare Books at the Lenhardt Library of the Chicago Botanic Garden). In 1999, the first issue of this review journal appeared. It aim was to fill a gap in reviews of new books in botany, gardening, landscape architecture, and related fields. Many volunteers and staff at the Chicago Botanic Garden contributed reviews of fascinating books, from technical tomes to children's tales about natural history. After 16 volumes and hundreds of reviews, this issue is the last. Current Books & Book Reviews", "textAfterTable": "Lenhardt Library About Services Catalog Collections Library Exhibitions Stories from the Rare Book Collection Digging for Answers Grants Received Digitized Special Collections Staff Links For Kids Story Time Summer Reading Program Current Books Current Books Past Reviews Current Books by Volume Public Library Days Book Dedication Learn Visit 1000 Lake Cook Road Glencoe, IL 60022 Main: (847) 835-5440 Member:", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}