{"relation": [["Author", "sanjay Ku Sahoo", "Zafar", "Wallis Dudhnath"], ["Subject", "RRC connection Failure", "Major Differences Between PC2 & PC3", "Echo in GSM network"], ["Date", "31 Jul 2015", "29 Jul 2015", "29 Jul 2015"], ["Message (part)", "RRC FAILURE & RAB FAILURE IN WCDMA...", "What about in 2G.??...", "In the past I used to look at Echo Suppressors and Echo Cancellers (EC). Essentially, for the PSTN you have points wh..."]], "pageTitle": "Telecom Traffic Online", "title": "", "url": "http://www.erlang.com/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 15, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00301-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 428334107, "recordOffset": 428326147, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1=Copyright © 2015. All rights reserved.}", "textBeforeTable": "Here are the latest messages posted by fellow telecommunications and call centre professionals, sharing their thoughts and ideas on telecommunications design, Voice over IP and call center operations. Click here to join in now. Telecom Design Forum SIP Boutique - Premium VoIP for call shops A premium quality VoIP termination and billing service for callshops. Bill My Calls  -  callshop biller system An online call shop biller system that works with all other VoIP carriers. 44Mobile  -  wholesale A-Z termination An aggressively priced A-Z wholesale termination service offering access to TDM routes for large volume customers. 44Direct - UK direct VoIP route with CLI Premium A-Z termination for wholesale customers with their own VoIP switches. We offer a range of internet telephony products, providing VoIP services to business, wholesale and consumer customers: Internet Telephony", "textAfterTable": "Our customers and what they say about us We are proud to have satisfied customers from around the globe.  Our customers vary in size from one man consultancy businesses to some of the largest telecommunications carriers in the World.  Find out who they are, and what they think of our products and service.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}