{"relation": [["", "1", "2", "3", "4"], ["Name", "Debaser (Cliff Norrell Mix)", "Bone Machine", "Gigantic", "Isla de Encanta"], ["Artist", "Pixies", "Pixies", "Pixies", "Pixies"], ["Time", "2:59", "3:04", "3:25", "1:43"], ["Price", "1,29 €", "1,29 €", "1,29 €", "1,29 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Debaser - EP by Pixies", "title": "", "url": "https://itunes.apple.com/be/album/isla-de-encanta/id291376819?i=291376832", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00322-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 874922167, "recordOffset": 874894158, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{8364=Formed: 1986 in Boston, MA, 111863=Copyright © 2014 Apple Inc. Tous droits réservés.}", "lastModified": "Sat, 01 Aug 2015 04:39:15 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Pixies Debaser - EP iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Debaser - EP by Pixies, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "4 Songs Biography Formed: 1986 in Boston, MA Genre: Alternative Years Active: '80s, '90s, '00s, '10s Combining jagged, roaring guitars and stop-start dynamics with melodic pop hooks, intertwining male-female harmonies, and evocative, cryptic lyrics, the Pixies were one of the most influential American alternative rock bands of the late '80s. They weren't accomplished musicians — Black Francis wailed and bashed out chords while Joey Santiago's lead guitar squealed out spirals of noise. But the bandmembers were inventive, rabid rock fans who turned conventions inside out, melding punk and indie... Full bio Top Albums and Songs by Pixies 1. Wave of Mutilation - Best of Pixies View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}