{"relation": [["Title", "Live from Jordan: Letters Home from My Journey through the Middle East", "Married to a Bedouin", "The Making of Jordan"], ["Author", "Benjamin Orbach", "Marguerite van Geldermalsen", "Yoav Alon"]], "pageTitle": "Jordan Tours & Travel | Intrepid Travel UK", "title": "", "url": "http://www.intrepidtravel.com/uk/jordan", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00191-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 511747955, "recordOffset": 511682918, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{89349=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 191497=Review submitted 17 Jun 2015, 90668=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan...}", "TableContextTimeStampAfterTable": "{71496=In 1950, Jordan was renamed the Hashemite Kingdom of Jordan and in 1951, King Abdullah I was assassinated while visiting a mosque. His eldest son became king but was removed from his duties in 1952 due to mental illness. In 1953, his teenage son Hussein Ibn Talal became king, and continued to rule for over 40 years. In the 1960s, Jordan saw many immigrants arrive and settle – mainly Palestinians escaping the conflict in their homeland. In 1999, King Abdullah II succeeded his father King Hussein and continues to rule Jordan now. His reign has been characterised by liberal policies, economic reforms and technological advances. His wife, Queen Rania of Jordan, has a visible public profile, is active in many social causes and is regarded internationally as a highly influential woman., 60059=The weather in Jordan can get quite extreme. Overall, it tends to be hot during the day and cold at night (in desert areas, expect it to be extremely hot during the day and freezing at night). Yet during winter it can get bitterly cold, with snowfall occurring in some parts of the country. Travelling during the summer months (June, July and August) can be challenging for those not accustomed to the heat, so visiting Jordan during spring and autumn is recommended for those who wish to escape the hotter temperatures. As a Muslim country, Jordan observes Ramadan. If you are planning to travel during Ramadan, it's important to consider that many restaurants and shops will either be closed or operating on reduced hours during this time.}", "textBeforeTable": "Recommended reading Further reading 10. Always dispose of litter thoughtfully, including cigarette butts. 9. Dress modestly and respectfully. Shoulders to knees should be covered, especially when entering places of worship. 8. Ask permission and remove your shoes before entering a place of worship. 7. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 6. Learn some local language and don't be afraid to use it. Simple greetings will help break the ice. 5. Refrain from touching or interfering with ancient monuments, relics or historic sites. 4. Ramadan is the fasting month for all Muslims. During this month no food, drink or smoking is permitted during daylight hours. While non-Muslims aren't expected to fast, it's recommended to try to avoid eating, drinking or smoking in public during daylight hours. 3. For environmental reasons, try to avoid buying bottled water. Fill a reusable water bottle or canteen with filtered water instead. 2. Please ask and receive permission before taking photos of people, including children. 1. Be considerate of Jordan’s customs, traditions, religion and culture. Top responsible travel tips for Jordan Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress", "textAfterTable": "Handy links www.lonelyplanet.com/worldguide/jordan www.wikitravel.org/en/Jordan www.worldtravelguide.net/jordan www.visitjordan.com × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}