{"relation": [["", "1", "2", "3", "4", "5", "6", "7"], ["Name", "Brothers O Brothers", "Jerusalem Way", "Ivory Coast", "Jeanne", "Her Spanish Heart", "Great Moscow Nights", "Maria"], ["Artist", "Transatlantic", "Transatlantic", "Transatlantic", "Transatlantic", "Transatlantic", "Transatlantic", "Transatlantic"], ["Time", "6:17", "5:43", "7:50", "5:48", "4:19", "4:53", "5:16"], ["Price", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Live In Titanic by Transatlantic", "title": "", "url": "https://itunes.apple.com/gb/album/maria/id358691055?i=358691302", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00336-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 864928307, "recordOffset": 864907516, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{70242=Copyright © 2014 Apple Inc. All rights reserved., 16205=Formed: 1999, 14118=This is not the Roine, Pete, Mike & Neal Transatlantic. There are many instances where bands share their name with other bands and this is one of them. The clue is in the lengths of the songs listed here, there's not one of them as long as 10 mins or more plus this album was released in 1999 where as the Prog Transatlantic's 1st album was in 2001. plus this album is Jazz. If only ITunes could catalogue the music better so people aren't downloading the wrong band because they have the same name. Sorry it's not a review of this album, it's just a warning so you don't get the wrong band!}", "lastModified": "Fri, 31 Jul 2015 07:34:56 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Transatlantic Live In Titanic iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Live In Titanic by Transatlantic, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "7 Songs Customer Reviews It's not that Transatlantic!!!           by Tumster This is not the Roine, Pete, Mike & Neal Transatlantic. There are many instances where bands share their name with other bands and this is one of them. The clue is in the lengths of the songs listed here, there's not one of them as long as 10 mins or more plus this album was released in 1999 where as the Prog Transatlantic's 1st album was in 2001. plus this album is Jazz. If only ITunes could catalogue the music better so people aren't downloading the wrong band because they have the same name. Sorry it's not a review of this album, it's just a warning so you don't get the wrong band! Not Their Best           by Billty A bit of a departure from the norm by Neil, Mike, Pete and Roine. Some nifty keyboard work but the drum pyrotechnics and soaring guitar", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}