{"relation": [["Title", "Atlas of Ancient Egypt", "Chronicle of the Pharaohs (The Reign-By-Reign Record of the Rulers and Dynasties of Ancient Egypt)", "Dictionary of Ancient Egypt, The", "History of Ancient Egypt, A", "Jill Kamil Guides: Sakkara and Memphis, The Necropolis and the Ancient Capital", "Monarchs of the Nile", "Oxford Encyclopedia of Ancient Egypt, The", "Tomb and Beyond, The: Burial Customs of Egyptian Officials"], ["Author", "Baines, John; Malek, Jaromir", "Clayton, Peter A.", "Shaw, Ian; Nicholson, Paul", "Grimal, Nicolas", "Kamil, Jill", "Dodson, Aidan", "Redford, Donald B. (Editor)", "Kanawati, Naguib"], ["Date", "1980", "1994", "1995", "1988", "1996", "1995", "2001", "2001"], ["Publisher", "Les Livres De France", "Thames and Hudson Ltd", "Harry N. Abrams, Inc., Publishers", "Blackwell", "Egyptian International Publishing Co. - Longman", "Rubicon Press", "American University in Cairo Press, The", "Aris & Phillips Ltd"], ["Reference Number", "None Stated", "ISBN 0-500-05074-0", "ISBN 0-8109-3225-3", "None Stated", "ISBN 0-582-78380-1", "ISBN 0-948695-20-x", "ISBN 977 424 581 4", "ISBN 0 85668 734 0"]], "pageTitle": "Egypt: The 2nd Dynasty Tombs at Saqqara in Egypt", "title": "", "url": "http://www.touregypt.net/featurestories/2nddynastysaqqara.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00111-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 753147855, "recordOffset": 753129945, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{21335=1996, 28036=Copyright © 1996-2013 Tour Egypt. All Rights Reserved. Web Development & Design By AKN Solutions, 17693=The owner of S2498 is unknown and it is the smallest of these tombs. The substructure can be entered by an east-west stairway which, after a portcullis, leads to the main corridor which is rather of a large chamber with store rooms to either side. A southern passage then leads to a funerary chamber. This tomb is very ordinary, consisting of not much else besides a large chamber., 19582=1980, 8773=Of these, the largest and most elaborate (Tomb A) is the one underneath the pyramid temple of Unas, which was discovered by Barsanti in 1901. According to the seal impressions, the tomb belongs either to Hetepsekhemwy, the first ruler of the 2nd Dynasty, or to his successor, Raneb. It was only partially cleared, but this tomb, measuring about 130 by 46 meters, has a long, north-south corridor entered from the north by a staircase passage. The corridor begins about 20 meters northeast of the Unas Pyramid's northeast corner. It was carefully cut into the rock five meters below the surface. This corridor has four portcullis blocking stones. It leads to the burial chamber and some lateral rooms in the south and also gives access to more than eighty storage chambers on both sides. After about 25 meters, a passage opens on the west wall of the stairway leading into the first set of store rooms. This is an east-west corridor on which the north and south sides open into 14 long chambers of the same size. A similar set of store rooms is five meters south of the first, on the opposite (east side of the stairway. About ten meters further along the stairway reaches the horizontal floor about about seven meters below the ground level. The corridor then continues to branch out into scores of secondary galleries. This labyrinth of chambers is thought by some to be perhaps an imitation of the corridors in the royal palace. Mud-brick walls blocked the entrances to these chambers, and some still contained wine jars and animal bones., 22186=2001, 20055=1994, 17086=Tomb S2171 was probably built during the reign of Djer but rebuilt under that of Ninetjer. The superstructure of this tomb is a mudbrick mastaba with two niches on the east facade. It is a fairly small tomb with a substructure that has been partly excavated out of the sand rock It has a straight stairway that descends from the North, and after about ten meters, was blocked by portcullis. Just before the blocking stones there were four small storerooms, two each on either side of the corridor., 15837=Tomb S2302 is one of the greatest private mastabas of the older tombs at Saqqara . Ruaben, its owner, was probably an overseer of Sculptors. The superstructure was made of mudbrick and was originally surrounded by a revetment that left only a narrow corridor between the two internal walls. Both the inner and outer facades were plain except for two niches on the east side, one near the northern corner and another, which is more complex, near the southern., 15428=Most of the known, private tombs of the 2nd Dynasty at Saqqara date to the reign of Ninetjer. One is the huge tomb of Nyruab (or Ruaben), numbered S2302, which had a plain double casing with only two niches in the eastern face. Other contemporary tombs include S2171, S2498, and S3009., 20479=1995, 11983=The third king of the 2nd Dynasty, Ninetjer, appears to have been buried a little further to the east of Tomb A. His tomb (Tomb B) was overbuilt by the causeway of Unas (Unis), and was first excavated by S. Hassan between 1937 and 1938. The stairway entrance started under the 6th Dynasty mastaba of the Vizier Nebkawhor, and after a straight run, blocked by porcullis (blocking stone), it curved towards the west expanding into the first group of magazines and adjoining galleries. The three principal galleries of chambers formed the main axis of the subterranean level and from these long passages spread out the vast labyrinth before finally reaching the burial chamber. It is currently being re-examined by a German mission. Though it is not completely explored, this tomb appears smaller, measuring about 40 by 45 meters, than that of Hetepsekhemwy. The arrangement of chambers also seems to be more irregular, but the original layout is obscured by many intrusive shafts and chambers from later periods., 20899=1988}", "textBeforeTable": "References: More work is needed in Saqqara and other sites related to the 2nd Dynasty. We think that this was a period with considerable upheaval, and only more research on its sites is likely to reveal more on this important beginning to Egyptian civilization. Tomb S3009 has been by some dated to the 3rd Dynasty, but other scholars believe it dates to the 2nd Dynasty. On one stone vessel is the name of Ptahenhpty, but there is also an inscription attributed to Khnwmenii. The tomb more likely belonged to the latter. The owner of S2498 is unknown and it is the smallest of these tombs. The substructure can be entered by an east-west stairway which, after a portcullis, leads to the main corridor which is rather of a large chamber with store rooms to either side. A southern passage then leads to a funerary chamber. This tomb is very ordinary, consisting of not much else besides a large chamber. Tomb S2171 was probably built during the reign of Djer but rebuilt under that of Ninetjer. The superstructure of this tomb is a mudbrick mastaba with two niches on the east facade. It is a fairly small tomb with a substructure that has been partly excavated out of the sand rock It has a straight stairway that descends from the North, and after about ten meters, was blocked by portcullis. Just before the blocking stones there were four", "textAfterTable": "Who are we? Tour Egypt aims to offer the ultimate Egyptian adventure and intimate knowledge about the country. We offer this unique experience in two ways, the first one is by organizing a tour and coming to Egypt for a visit, whether alone or in a group, and living it firsthand. The second way to experience Egypt is from the comfort of your own home: online. Popular Pages Egypt Pyramids Monuments & Ancient Sites Egyptian Kings Ancient Temples Pharaohs General Travel What to Take Destinations Egypt Travel Articles Budget Travel Fees to Monuments Shopping Guide Beach Vacations Interactive Pages Picture of the Day Reader Pictures Recipe of the Week Weekly Crossword Puzzle Send Postcard Hieroglyph Converter Egyptian Money Specific Activities Scuba Diving Therapy Golf Courses Fishing Lake Nasser Birding in Egypt Tour Specific", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}