{"relation": [["Title", "Fallout 3 (GOTY Edition)", "Phantasy Star Portable 2", "Yggdra Unison", "Power Pro-kun Pocket 12", "Cross Treasures", "Poké-Park Wii - Pikachu's Big Adventure", "Cross Edge (CH Collection)", "Holy Invasion of Privacy, Badman! 2", "Tales of Graces", "Monster Racers (Koei the Best)", "Luminous Arc 3 - Eyes", "Uncharted Waters Online : El Oriente", "Final Fantasy XIII", "World War Moe 2", "Queen's Blade - Spiral Chaos", "Dice-Dice Fantasia", "Atelier Lina - Alchemist of Schtrole", "World War Moe 2 - Yamato Nadeshiko"], ["Publisher", "Bethesda", "Sega", "Sting/Atlus", "Konami", "Square Enix", "Nintendo", "Compile Heart", "Acquire / SCE", "Bandai-Namco", "Koei", "Marvelous", "Koei", "Square Enix", "SystemSoft Alpha", "Bandai-Namco", "Broccoli", "Gust", "SystemSoft Alpha"], ["Release Date", "12/03/09", "12/03/09", "12/03/09", "12/03/09", "12/03/09", "12/05/09", "12/10/09", "12/10/09", "12/10/09", "12/10/09", "12/10/09", "12/15/09", "12/17/09", "12/17/09", "12/17/09", "12/17/09", "12/22/09", "12/17/09"], ["Platform", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]], "pageTitle": "RPGamer > Japandemonium (December 5th, 2009)", "title": "", "url": "http://www.rpgamer.com/news/japan/mb120409.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 12, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00328-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 677350583, "recordOffset": 677331981, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{688=The better part of a year after its initial release, Muramasa - The Demon Blade gets a massive soundtrack release. There's three discs, with a total of 57 tracks covering all the music used for the various stages and bosses. The beautiful sleeve art is just a bonus. It's all in stores Dec. 16th, for 3675 yen.}", "TableContextTimeStampAfterTable": "{6053=The last two years have seen a boom for the \"retro\" look in games. After bringing the first Badman game to western shores, with plans for the second come 2010, Nippon Ichi has decided to jump on the bandwagon with the very appropriately titled Classic Dungeon.}", "textBeforeTable": "Double Weekly Famitsu Famitsu Online Source: The better part of a year after its initial release, Muramasa - The Demon Blade gets a massive soundtrack release. There's three discs, with a total of 57 tracks covering all the music used for the various stages and bosses. The beautiful sleeve art is just a bonus. It's all in stores Dec. 16th, for 3675 yen. Music Time OshimaiDecember Release DatesScary StoriesClassic FlavorDouble-Weekly FamitsuMusic Time I don't like doing music updates often on JP. Really, every game that comes out these days seems to have an accompanying soundtrack release, and I don't feel like keeping up with it all. From time to time we get something special, though, and here's one: I I I I I Kawaisou ne... In my mind, this is the epitome of kawaisou. Not cute, not nice, but sad and pitiable. I really wish I could have taken the kitten with me, but aside from the fact that I had", "textAfterTable": "The story itself is about what one would expect of a dungeon-crawling experience, which is sort of the point of this experiment, wouldn't you say? There's the typically mysterious realm of Manoakuzu, filled with monsters, traps, and loot, which provides most if not all known justification for visiting there. The actual blurb in Dengeki says \"The Promised Land, the Forbidden Ground, yada yada yada...\", as if to convey just how self-consciously cliché the setup is. There's a secondary title to mention, The Circle of Assistance. This magic circle plays an important part in how one survives the game. There are nine characters in the game to bring together, plus a cat, which can be placed at points on the circle. The central spot is reserved for the character who actually goes out and whacks stuff, while the characters surrounding him or her serve as support, blocking attacks or slashing at monsters. The actual setting of the circle strongly affects the defensive and offensive bonuses of all characters.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}