{"relation": [["Title", "And the Mountains Echoed", "Entwined with You", "The Fault in Our Stars", "The 9th Girl", "Whiskey Beach", "Backfire", "Youtility", "The Great Degeneration", "Cooked"], ["Author", "Khaled Hosseini", "Sylvia Day", "John Green", "Tami Hoag", "Nora Roberts", "Catherine Coulter", "Jay Baer", "Niall Ferguson", "Michael Pollan"], ["Kindle", "$ 16.99", "$ 10.99", "$ 15.99", "$ 13.99", "$ 15.99", "$ 10.99", "$ 12.99", "$ 13.99", "$ 15.99"], ["Nook", "n/a", "n/a", "n/a", "n/a", "n/a", "n/a", "n/a", "n/a", "n/a"], ["Apple", "$ 16.99", "$ 10.99", "$ 15.99", "$ 13.99", "$ 15.99", "$ 10.99", "$ 12.99", "$ 13.99", "$ 15.99"], ["Kobo", "$ 16.99", "$ 10.99", "$ 15.99", "$ 13.99", "$ 15.99", "$ 10.99", "$ 12.99", "$ 13.99", "$ 15.99"], ["Google", "$ 16.99", "$ 10.99", "$ 15.99", "$ 13.99", "$ 15.99", "$ 10.99", "$ 12.99", "$ 13.99", "$ 15.99"]], "pageTitle": "eBook prices remain high in Canada despite price drops in US - ProPR", "title": "", "url": "http://propr.ca/2013/canadians-not-benefiting-from-the-apple-book-settlement/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00067-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 193661717, "recordOffset": 193645772, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{3965=— Jennifer Fox (@theyellowline) July 11, 2013, 4378=— Jennifer Fox (@theyellowline) July 11, 2013}", "textBeforeTable": "Canadian prices for the same books Laura Hazard Owen’s US price table So, I decided to take a look at the prices that the Ebooks in Laura Hazard Owen’s example are being offered in Canada. . Jennifer makes good points. Canadian prices always are higher than US prices and a comparison of US prices does not transfer into Canada.   — Jennifer Fox (@theyellowline) July 11, 2013 @thornley But not in Canada. COOKED is same price for Kindle edition on Amazon.ca as Kobo. E-book pricing articles are irrelevant here.   — Jennifer Fox (@theyellowline) July 11, 2013 @thornley @kobo Those are American prices. Even Amazon would be charging you more in Canada. I focused on the fact that my favourite eBook seller, Kobo, was the highest priced seller in all examples. I tweeted about this and was promptly called out by Jennifer Fox. Laura Hazard Owen reported yesterday that retailers have begun cutting eBook prices in response to the settlement of the Apple eBook price fixing case. Her post included a table comparing prices at which certain books are offered by the various major eBook retailers in the US. While readers in the US may be benefiting from", "textAfterTable": "Do you see what I see? For Canadians, one high price for each book, regardless of retailer. Canadians are not benefiting from the drop in US eBook prices It’s clear that agency pricing persists in Canada. And that means higher book prices across the board with no competition on price. That’s not good for consumers. That doesn’t promote reading. And that’s something that must change. Now. Not next year. What will it take to end agency pricing of eBooks in Canada? Who will see this as an opportunity and take the lead? I buy from Kobo because of its commitment to ePub standards and its device-agnostic approach. And I’m willing to pay a premium for being part of an open system that lets me consume my books on the device of my choice. So, Kobo, you’ve already got me for the right reasons. Now why don’t you go the next step by seizing the opportunity to break the agency model and lead the way to better book prices for Canadian eBook readers. Kobo, are you listening? Tags: \"eBook prices\" Jennifer Fox Of course, the real fight is the with the publishers and distributors…", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}