{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"], ["Name", "Hold My Bag, Please!", "Bumpy", "(It's Not Easy) Bein' Green", "Nowhere Man", "Death Is Just Around the Corner Cha Cha Cha", "Heartbreak Hotel", "He Was Such a Nice Quiet Boy", "An Hour Blessed", "It Don't Mean a Thing If It Ain't Got That Swing", "I Can See Clearly Now", "Impure Inspiration"], ["Artist", "Jack Walrath, Bill Mays, Boris Kozlov & Jonathan Blake", "Jack Walrath, Bill Mays, Boris Kozlov & Jonathan Blake", "Jack Walrath, Bill Mays, Boris Kozlov & Jonathan Blake", "Jack Walrath, Bill Mays, Boris Kozlov & Jonathan Blake", "Jack Walrath, Bill Mays, Boris Kozlov & Jonathan Blake", "Jack Walrath, Bill Mays, Boris Kozlov & Jonathan Blake", "Jack Walrath, Bill Mays, Boris Kozlov & Jonathan Blake", "Jack Walrath, Bill Mays, Boris Kozlov & Jonathan Blake", "Jack Walrath, Bill Mays, Boris Kozlov & Jonathan Blake", "Jack Walrath, Bill Mays, Boris Kozlov & Jonathan Blake", "Jack Walrath, Bill Mays, Boris Kozlov & Jonathan Blake"], ["Time", "4:54", "5:16", "5:58", "5:19", "5:27", "6:21", "8:58", "5:16", "5:44", "7:22", "6:25"], ["Price", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "Album Only", "1,29 €", "1,29 €", "Album Only", "1,29 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Ballroom by Jack Walrath", "title": "", "url": "https://itunes.apple.com/hu/album/impure-inspiration/id286026805?i=286026932", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00341-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 881409999, "recordOffset": 881391034, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{75370=Copyright © 2014 Apple Inc. Minden jog fenntartva., 25000=Born: 05 May 1946 in Stuart, FL, 23358=Jack Walrath has been around the jazz scene for quite some time, working with Charles Mingus and various Latin bands, in addition to recording quite a few albums on his own. On this occasion he is joined by the versatile pianist Bill Mays (a terrific composer and bandleader in his own right), Mingus Big Band bassist Boris Kozlov, and drummer Jonathan Blake. The trumpeter has frequently displayed a sense of humor in his music and it is definitely on display during a portion of this 2007 session. How can a listener not get a kick out of songs like \"Death Is Just Around the Corner Cha Cha Cha,\" a spirited, happy go lucky bop vehicle with just a tinge of Latin rhythm? \"He Was Such a Nice Quiet Boy!\" darts all over the place in an unpredictable manner, while his heartfelt, bittersweet ballad \"An Hour Blessed\" shows his serious side, with Mays' lush piano providing the perfect backdrop. He has a bit of fun with his sassy arrangement of Elvis Presley's \"Heartbreak Hotel,\" playing down and dirty with a mute as Mays and the rhythm section saunter along with him. Few people will expect the Beatles' \"Nowhere Man\" to follow Walrath's dramatic introduction, which hints that something like \"'Round Midnight\" is on the way. The band also finds a new path into Duke Ellington's \"It Don't Mean a Thing (If It Ain't Got That Swing\"),\" which is played in furious fashion with a brilliant, rapid-fire muted trumpet solo reminiscent of Clark Terry.}", "lastModified": "Sat, 01 Aug 2015 04:25:53 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Jack Walrath Ballroom iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Ballroom by Jack Walrath, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "11 Songs Album Review Jack Walrath has been around the jazz scene for quite some time, working with Charles Mingus and various Latin bands, in addition to recording quite a few albums on his own. On this occasion he is joined by the versatile pianist Bill Mays (a terrific composer and bandleader in his own right), Mingus Big Band bassist Boris Kozlov, and drummer Jonathan Blake. The trumpeter has frequently displayed a sense of humor in his music and it is definitely on display during a portion of this 2007 session. How can a listener not get a kick out of songs like \"Death Is Just Around the Corner Cha Cha Cha,\" a spirited, happy go lucky bop vehicle with just a tinge of Latin rhythm? \"He Was Such a Nice Quiet Boy!\" darts all over the place in an unpredictable manner, while his heartfelt, bittersweet ballad \"An Hour Blessed\" shows his serious side, with Mays' lush piano providing the perfect backdrop. He has a bit of fun with his sassy arrangement of Elvis Presley's \"Heartbreak Hotel,\" playing down and dirty with a mute as Mays and the rhythm section saunter along with him. Few people will expect the Beatles' \"Nowhere Man\" to follow Walrath's dramatic introduction, which hints that something like \"'Round Midnight\" is on the way. The band", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}