{"relation": [["ISBN", "9780312363154", "9780374127527", "9780374178925", "9780375413902", "9780880016070", "9781590514153"], ["Title", "The Paris review", "The complete stories", "Jesus' son", "After the quake", "The essential tales of Chekhov", "The Vices"], ["Publisher", "New York : Picador : 2006-<2007>", "New York : Farrar, Straus and Giroux, c1971.", "New York : Farrar, Straus, and Giroux, 1992.", "New York : Alfred A. Knopf : 2002.", "Hopewell, N.J. : Ecco Press, 1998.", "Other Press"], ["Author(s)", "with an introduction by Philip Gourevitch", "O'Connor, Flannery", "by Denis Johnson", "Haruki Murakami; translated from the Japanese by Jay Rubin", "edited and with an introduction by Richard Ford; translation by Constance Garnett", "Lawrence Douglas,"], ["Comment", "", "", "", "", "", ""], ["Book Store", "Amherst Books", "Amherst Books", "Amherst Books", "Amherst Books", "Amherst Books", "Amherst Books"], ["Price", "$8.49-$16.00", "$44.00-$126.93", "$64.95-$154.95", "$16.95-$57.20", "$49.99", "TBD"]], "pageTitle": "Fiction Writing I | Amherst College", "title": "", "url": "https://www.amherst.edu/academiclife/departments/courses/1415F/ENGL/ENGL-226-1415F", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00307-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 912212363, "recordOffset": 912197998, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{14607=Amherst College Amherst MA 01002-5000 (413) 542-2000, 845=Section 01 W 02:00 PM - 04:40 PM MCLS 428}", "lastModified": "Fri, 31 Jul 2015 07:57:32 GMT", "textBeforeTable": "This is preliminary information about books for this course. Wait for this message to go away, or contact your instructor, before attempting to purchase these books. Below are the textbooks used in this course, along with pricing information and availability at local bookstores. The price range shown is based upon queries to multiple online booksellers; roll your mouse over the price field to see detailed pricing information. Textbooks Section 01 W 02:00 PM - 04:40 PM MCLS 428 ENGL 226 - L/D Course times and locations Artistic practice Keywords If Overenrolled: Keep registration open, and the instructor will choose from among the registrants on the basis of a writing sample. The instructor will choose students with a lively engagement with literary language and a wide variety of life experience. Limited enrollment. Please consult the Creative Writing Center website for information on admission to this course.  Fall semester:  Visiting Writer Gaige.  Spring semester:  Professor Frank. A first course in writing fiction. Emphasis will be on experimentation as well as on developing skill and craft. Workshop (discussion) format. Description Amity W. Gaige (Section 01) Faculty Moodle site: Course (Login required) Formerly listed as: ENGL-26 Listed in: English, as ENGL-226 Fiction Writing I Fall 2014", "textAfterTable": "These books are available locally at Amherst Books. If Overenrolled Keep registration open, and the instructor will choose from among the registrants on the basis of a writing sample. The instructor will choose students with a lively engagement with literary language and a wide variety of life experience. Offerings 2015-16: Offered in Fall 2015 and Spring 2016 Other years: Offered in Fall 2007, Spring 2008, Fall 2008, Spring 2009, Fall 2009, Spring 2010, Fall 2010, Spring 2011, Fall 2011, Spring 2012, Fall 2012, Spring 2013, Fall 2013, Spring 2014, Fall 2014, Spring 2015  ", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}