{"relation": [["Title", "Sesame salad dressing", "Authentic paella?", "IMPORTANT: If you have a blog on JustBento...", "Shiso - uses for this herb", "Fuki (Japanese Butterbur) Tsukemono Recipes"], ["Author", "Supertaster", "maki", "maki", "Loretta", "kumo"], ["Answers", "9", "10", "2", "0", "5"], ["Last Post", "1 year 47 weeks ago", "1 year 48 weeks ago", "1 year 51 weeks ago", "2 years 1 week ago", "2 years 1 week ago"]], "pageTitle": "Moss temple in Kyoto | Just Bento Community Forum", "title": "", "url": "http://justbento.com/forum/moss-temple-kyoto?sort=desc&order=Title", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00160-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 130047895, "recordOffset": 130032406, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{7301=Hi Maki, I've browsing your \"Just Hungry\" site and found the Kyoto trip reportage, it is wonderful, as are the pictures. At the last week of July/beginning of August I'll be in Kyoto for 2 weeks, one for holidays and one for a congress, and I've been browsing around for things to do. One thing that I would really want to do is to visit the \"Moss temple\", the Kokedera, I love gardens and moss, and in the heat of summer it sounds like the perfect place to be, quiet and fresh(er). I found that it is necessary to apply in advance and to have a short \"sutra chanting and copying session\" and I'm a bit perplex about this part, especially because both me and my partner are agnostic and don't speak any Japanese. Have you been there? Do you think it is worth the effort (and the money) or that we can find other places to visit. On a more general note, how easy is to go around for tourists that don't speak Japanese in Kyoto? For example I would love to go to a tofu restaurant like the one youtalk about....and as in the first week we are not staying in a hotel, but in a micro-apartment, we can't even ask somebody from the hotel to phone for us to make reservations and so on. Lots of questions, I know..., 19039=http://www.overahedge.ca/2010/12/meltdown-at-moss-temple.html}", "lastModified": "Mon, 03 Aug 2015 17:15:24 GMT", "textBeforeTable": "New forum activity since your last visit More information about formatting options Web page addresses and e-mail addresses turn into links automatically. Each email address will be obfuscated in a human readble fashion or (if JavaScript is enabled) replaced with a spamproof clickable link. You may quote other posts using [quote] tags. Allowed HTML tags: <h3> <h4> <h5> <h6> <object> <a> <em> <strong> <p> <br> <i> <b> <cite> <code> <ul> <ol> <li> <dl> <dt> <dd> <img> You can use Markdown syntax to format and style the text. Markdown Lines and paragraphs break automatically. You may quote other posts using [quote] tags. Each email address will be obfuscated in a human readble fashion or (if JavaScript is enabled) replaced with a spamproof clickable link. Web page addresses and e-mail addresses turn into links automatically. Allowed HTML tags: <h3> <h4> <h5> <h6> <object> <a> <em> <strong> <p> <br> <b> <i> <blockquote> <cite> <code> <ul> <ol> <li> <dl> <dt> <dd> <img> Filtered HTML Input format", "textAfterTable": "    » See more activity Join the Just Bento flickr pool Join the Bento Gear flickr pool Recently commented articles Tuna tofu miso mini burgers (42 comments) Stewed hijiki seaweed with carrots and fried tofu", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}