{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "With Every Beat of My Heart", "I'll Be Your Shelter", "Love Will Lead You Back", "Heart of Stone", "You Can't Fight Fate", "Up All Night", "I Know the Feeling", "Wait for Me", "You Meant the World to Me", "Ain't No Good"], ["Artist", "Taylor Dayne", "Taylor Dayne", "Taylor Dayne", "Taylor Dayne", "Taylor Dayne", "Taylor Dayne", "Taylor Dayne", "Taylor Dayne", "Taylor Dayne", "Taylor Dayne"], ["Time", "4:22", "4:44", "4:39", "4:18", "4:41", "4:04", "4:47", "3:41", "4:09", "4:06"], ["Price", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Can't Fight Fate by Taylor Dayne", "title": "", "url": "https://itunes.apple.com/gb/album/cant-fight-fate/id298412282", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00342-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 867876891, "recordOffset": 867848712, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{20898=Born: 07 March 1962 in Long Island, NY, 122017=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 08:59:19 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Taylor Dayne Can't Fight Fate iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Can't Fight Fate by Taylor Dayne, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "10 Songs Album Review Arista was poised to take Taylor Dayne beyond the dance tracks and drum beats which established her as a force to be reckoned with on her smash debut Tell It to My Heart. Can't Fight Fate, her sophomore outing, featured much more straight-ahead rock & roll, lush production, and top-notch songwriters (including Diane Warren, who penned her biggest hit \"Love Will Lead You Back\"). The album proved an even bigger success than her debut, scoring two Top Ten hits, one number one hit, and one Top 20 hit. Unfortunately, however, the momentum was lost after this album, and Taylor Dayne never again reached the commercial stratosphere she scaled with this set. The album's dance songs, such as the lead-off Top Five hit \"With Every Beat of My Heart,\" feature more organic instrumentation, although there are a few straight-ahead dance tracks, such as \"Up All Night.\" The ballads are lush and dramatic, and one of them, \"Love Will Lead You Back,\" soared all the way to number one. The real killers, however, are the rock songs, and Taylor delivers like a true, seasoned rock star. The set's third single, the Top Five hit \"I'll Be Your Shelter\" (also written by Warren), brings to mind Tina Turner, while other tracks, such as the unstoppable \"You Can't Fight Fate\"", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}