{"relation": [["Book", "Selected Letters I", "Selected Letters II", "Selected Letters III", "Selected Letters IV", "Selected Letters V", ""], ["1st Edition", "2,504 (1965)", "2,482 (1968)", "2,500 (1971)", "5,000 (1976)", "5,000 (1976)", ""], ["2nd Edition", "3,000 (1974)", "3,000 (1974)", "2,500 (1997)", "––", "––", ""], ["Total", "5,504", "5,482", "5,000", "5,000", "5,000", ""]], "pageTitle": "Written Works", "title": "", "url": "http://www.hplovecraft.com/internet/ahcfaq/written.aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00036-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 495656559, "recordOffset": 495643404, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Q: Where can I find Lovecraftian fiction and articles? A: The most accessible versions of Lovecraft’s tales are paperback editions by Ballantine/Del Rey. They are very inexpensive and are available in most large bookstores. The definitive versions of H.P. Lovecraft’s stories (as well as Mythos fiction by other authors) are available in hardback from Arkham House Publishers, Inc. They include: Q: What are the “posthumous collaborations”? A: After Lovecraft’s death, August Derleth took fragments of Lovecraft’s writings (from his Commonplace Book, for example), and incorporated them into stories entirely of Derleth’s own design. According to S.T. Joshi’s Bibliography, Derleth’s The Lurker at the Threshold is 50,000 words long, and only incorporates 1,200 words by Lovecraft – that’s about 2.4%. None of these “posthumous collaborations” should be considered to have been authored by Lovecraft. In spite of this, these stories have been published as being authored by Lovecraft and Derleth, or, worse yet, solely by Lovecraft. Both the Carroll & Graf paperbacks, The Lurker at the Threshold and The Watchers Out of Time include only Lovecraft’s name on their covers, although they are almost wholly Derleth’s work. Q: What other authors wrote stories set in Lovecraft’s Cthulhu Mythos? A: An amazing number of writers set their stories in Lovecraft’s world. The best known amongst these are Robert Bloch, Ramsey Campbell, Lin Carter, August Derleth, Robert E. Howard, Stephen King, Frank Belknap Long, Brian Lumley, and Clark Ashton Smith. Also,", "textAfterTable": "2nd Edition  Total Selected Letters I   2,504 (1965) 3,000 (1974) 5,504 Selected Letters II  2,482 (1968) 3,000 (1974) 5,482 Selected Letters III 2,500 (1971) 2,500 (1997) 5,000 Selected Letters IV  5,000 (1976)     ––      5,000 Selected Letters V   5,000 (1976)     ––      5,000 As you can see, Arkham House reprinted volumes I and II in 1974 and probably intended to simply delay reprinting volume III until after volumes IV and V came out. At that point, the page proofs for volume III were lost, and that volume was not reprinted until popular demand brought it back in 1997. Arkham House has yet to announce plans to reprint any of the Selected Letters volumes. Q: Where can I find a biography of Lovecraft? A: There are actually a few noteworthy biographies of Lovecraft: H.P. Lovecraft: A Life by S.T. Joshi – Published in 1996 by Necronomicon Press, this is certainly the best biography of Lovecraft available. Joshi examines all aspects of Lovecraft’s life and works without whitewashing them at all. A must-read for all fans of Lovecraft.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}