{"relation": [["TITLE", "A blackletter statement of federal administrative law", "The constitutional systems of the Commonwealth Caribbean : a contextual analysis", "California legal research", "Judging statutes", "Employability skills for law students"], ["AUTHOR", "KF5407 .B53 2013", "Derek O’Brien", "Hether C. Macfarlane, Aimee Dudovitz, Suzanne E. Rowe", "Robert A. Katzmann", "Emily Finch, Stefan Fafinski"], ["CALL #", "", "KGL5548 .O27 2014", "KFC74 .M33 2013", "KF425 .K38 2014", "KD460 .F56 2014"]], "pageTitle": "Secondary Sources Archives - Library & Technology Center", "title": "", "url": "http://fcsl.edu/blogs/library/tag/secondary-sources/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00010-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 94744159, "recordOffset": 94731793, "tableOrientation": "VERTICAL", "TableContextTimeStampAfterTable": "{30890=As you finalize your ALWR, please do not neglect to update your research. Some of these materials the library acquired in March may be of assistance to you:, 20256=We’ve added new books! To view a table listing the new print resources that the library received since the start of September, 2013, click Continue reading below. Most of the items listed there can be found in the General Collection and checked out for up to three weeks by members of the Coastal Community., 16832=We’ve added new books! To view a table listing the new print resources that the library received since the start of October, 2013, click Continue reading below. Most of the items listed there can be found in the General Collection and checked out for up to three weeks by members of the Coastal Community., 23648=We’ve added new books! To view a table listing the new print resources that the library received in June and July 2013, click Continue reading below. Most of the items listed there can be found in the General Collection and checked out for up to three weeks by members of the Coastal Community.}", "textBeforeTable": "This month, we received books on career advice, research, and more! Career Advice and Research Tag Archives: Secondary Sources Coastal Law Home On Twitter Subscribe via e-mail Subscribe via RSS Home Skip to content Menu … part of The Coastal Network Library & Technology Center", "textAfterTable": "This entry was posted in Books, New Library Resources and tagged Administrative Law, Books, Career Advice, Constitutional Law, Employability, Foreign Law, Judiciary, Library, Research, Secondary Sources on November 11, 2014 by Jamie Marie Keller, JD, MLIS. Bar Prep, Career Tactics, and More! We have some new resources for you here in the library for bar preparation, career information, and more! TITLE AUTHOR CALL # Advice for the lawlorn: career do’s and don’ts from one of the most successful legal recruiters in the industry Ann M. Israel KF299.I5 I835 2014 Clearing the last hurdle: mapping success on the bar exam Wanda M. Temm KF303 .T46 2014 Engaging students through social media: evidence based practices for use in student affairs Reynol Junco LB2343 .J79 2014 How", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}