{"relation": [["Author", "Elobo", "Elobo"], ["Title", "Beauty and Putrescence", "Endless Guardian"], ["Description", "Do not feel sorry for the malignant figure of the Putrid Moldyman. It's not like he feels sorry for your unfortunate cleanliness. Please leave the preconceptions at the door. This creature revels in filth but is not necessarily rotten of character. Give a guy a chance, yes?", "Deep in the sand kissed pyramids, the greatest treasures of this ancient civilization are hidden... and defended. A massive guardian - rough, cracked, and without the capacity for pain. A golem to stand watch eternally over the secrets of the dead."], ["Date", "4/20/09", "7/17/09"], ["Rank", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=30002&stuff=DescDESC&stuffFirstLetter=D", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00321-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 222523206, "recordOffset": 222515004, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> Y W V U T S R P O N M L K I H F E D C B A < Other Submissions by Elobo Be still my cheese clogged heart, my chest goes thumpa thumpa at the very sight of this Adonis wrought in pink fur. His lips must taste of the highest grade Parmesan. What depths do his perfect orbits reach hidden behind those dramatically awesome shades? Can such a mouse be truly faithful to one woman? Or is his heart truly unobtainable and untamable? Perhaps this bad boy image is why I have pledged him every fibre of my being. Perhaps... the rebelliousness inherent to his character is even more beautiful than his perfect hair. Sigggghhhhhhh....", "textAfterTable": "1 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day. Activities:", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}