{"relation": [["", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35", "36", "37", "38", "39", "40", "41", "42", "43", "44", "45", "46", "47", "48", "49", "50"], ["Name", "Man Next Door", "Leader of Dub", "Soddom Gomorrah", "My Guiding Star", "Dub Right", "Do Right", "Something on My Mind", "Natural Mystic", "Skylarking", "Ain't No Sunshine", "That’s How I Feel (w/Ricky General & Bunny Rugs)", "Just My Imagination", "Don’t Take Your Guns To Town", "Done With It", "That’s How I Feel (w/Bunny Rugs)", "Better Collie", "I May Never See My Baby (Bonus Track)", "Tag Along (Bonus Track)", "I Will Forgive You", "Roots of All Evil", "Sexy Jean", "Let Your Teardrops Fall", "Get Wise", "Today Youth (Horns Cut)", "Youths of Today"], ["Album", "Ain't No Sunshine: The Best Of", "Ain't No Sunshine: The Best Of", "Ain't No Sunshine: The Best Of", "Ain't No Sunshine: The Best Of", "Ain't No Sunshine: The Best Of", "Ain't No Sunshine: The Best Of", "Ain't No Sunshine: The Best Of", "Ain't No Sunshine: The Best Of", "Ain't No Sunshine: The Best Of", "Ain't No Sunshine: The Best Of", "Rude Boy", "Rude Boy", "Rude Boy", "Rude Boy", "Rude Boy", "Hi Grade Ganja Anthems 4", "Get Wise", "Get Wise", "Get Wise", "Get Wise", "Get Wise", "Get Wise", "Get Wise", "Get Wise", "Get Wise"], ["Time", "2:09", "5:21", "3:57", "4:10", "4:10", "3:22", "2:02", "3:38", "4:19", "2:25", "3:58", "3:54", "3:38", "3:38", "3:50", "2:25", "2:18", "2:11", "2:07", "2:30", "2:38", "2:47", "2:09", "2:59", "3:09"], ["Price", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Horace Andy", "title": "", "url": "https://itunes.apple.com/us/artist/horace-andy/id2532332?trackPage=2", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00148-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 865970795, "recordOffset": 865939904, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{36511=In 2001, the singer guest-starred on the British group Dub Pistols' sophomore album, Six Million Ways to Live, bringing more acclaim from electro mavens and trip-hop fans. His 2003 effort Mek It Bun appeared on the Wrasse label and featured a cover version of America's \"Horse with No Name\" along with Gregory Isaacs' \"Night Nurse.\" In 2006 he guest-starred on the Easy Star All-Stars' Radiohead tribute Radiodread. The live On Tour album landed on Trojan in 2008 and then two years later he hooked up with German producer Andreas \"Brotherman\" Christophersen along with the Groove Attack label for the album Serious Times. The 2013 set Broken Beats featured his classic hits remixed by dubstep and left-field house music producers like Rob Smith and Oliver Frost., 40657=In 1987, Jammy oversaw the Haul and Jack Up album, absolutely sizzling with Steely & Clevie's rhythms. Andy also returned to Bunny Lee's side for 1986's Reggae Superstars Meet, an album that paired him with the equally legendary Dennis Brown. And, appropriately enough, he also linked with John Holt this same year for the From One Extreme to Another set. Both albums were excellent showcases for all three of the vocalists involved. Garnett Silk's success with his own version of \"Skylarking\" this same time was merely icing on the cake. In 1988, two new exciting albums appeared: Everyday People and Shame and Scandal. Andy was now regularly jetting forth between London, New York, and Kingston, with the former album recorded in the States, and the latter in Jamaica. Meanwhile, back in London, the singer had now joined forced with DJ Tonto Irie on the \"Bangarang\" single., 42627=Previous to those last singles, however, the singer went into the studio with fellow expatriate Lloyd Barnes for the classic Dance Hall Style album, which proved that Pure Ranking was no fluke and that Andy was perfectly capable of making crucial albums aimed at the dancehalls. Amongst its excellent recreations of old songs are a clutch of new numbers, including the trancey \"Spying Glass.\" And just to prove the point, in 1984 he appeared on the Prince Jammy & the Striker Lee Posse Presents Music Maker Live at the Halfway Tree Jamaica album, which is filled with dancehall delights. The singer also released two of his own albums this same year, the Ted Dawkins-produced Showcase, which was true to its title, and Confusion, overseen by Sonny Peddie and Jackal. Andy had cut his first singles for this production duo the year before and had continued recording with them across such excellent singles as \"Walking on Ice,\" \"Sweet Music,\" and the album's title track. Come the new year, he paired with DJ Patrick Andy for the wittily titled Clash of the Andys., 46484=Across his career, Andy would revisit old songs time and time again, a practice typical of Jamaican vocalists. Almost uniquely, however, the singer's later versions invariably stand up against the originals, and no matter how many times he recuts a song, Andy always brings something new to it. For collectors, this is a major headache, especially when perusing compilations in search of a specific recording. But as there's no \"definitive\" version, for fans this is a godsend, for no matter which version one ends up with, it's never an inferior one. He's one of the only artists around that will never record a truly definitive version of any song, each, like a prism, will be another exquisite reflection. Of course, Andy was also recording new songs as well with Lee, including such classics as \"Zion Gate,\" \"You Are My Angel,\" \"Don't Try to Use Me,\" and \"Rasta Saw Them Coming,\" as well as equally crucial covers including John Holt's \"I've Got to Get Away\" and \"Serious Thing\" and Tapper Zukie's \"Better Collie.\" The Trojan label bundled up much of the best of these cuts for You Are My Angel, many of which are also featured on The Prime of Horace Andy, released by the Music Club label in 1998. The Cleopatra label's The Wonderful World of Horace Andy features rarities cut with Lee, as well as with Niney Holness, amongst a handful of modern remixes and an oddly chosen cover song from the early '80s. Meanwhile, in 1974, Andy paired up with Winston Jarrett, singer with Alton Ellis' backing group the Flames, for the fabulous Earth Must Be Hell album. Andy also joined forces with a number of DJs during this period, including Doctor Alimantado for the classic \"Poison Flour\" single., 44671=In 1977, Andy emigrated to Connecticut and immediately linked up with Hungry Town labelhead Everton DaSilva. The end result was the classic In the Light album and its equally seminal dub companion remixed by Prince Jammy. The pair also released a stream of excellent singles including \"Youths of Today,\" the fabulous re-recorded \"Fever,\" the guitar-laced \"Do You Love My Music,\" and \"Government Land.\" Andy next set up his own label, Rhythm, and inaugurated it with a new version of \"Don't Let Problems Get You Down.\" The singer continued recording under DaSilva's aegis for other Rhythm singles, including \"Ital Vital,\" \"Control Yourself,\" and \"Ital Vibe.\" Their partnership was abruptly ended in 1979 when the producer was murdered. However, Andy had not been working exclusively with DaSilva. In 1978, he had recorded the Pure Ranking album for Brad Osbourne's Clocktower label. This seminal album not only foreshadowed the rise of raggamuffin with its title track, but also laid the groundwork for modern dancehall. Andy now hooked up with the production duo Morwells and recorded the \"Black Cinderella\" single., 43436=In 1980, he joined with singer Bim Sherman and DJ U Black for the Bim Sherman Meets Horace Andy & U Black album. That same year brought the arrival of Andy's Natty Dread a Weh She Want, brilliantly overseen by Tappa Zukie, which boasts such classic cuts as \"Raggamuffin,\" \"Run Babylon,\" and the sweet-as-sugar title track. The pair also unleashed the singles \"Revolution\" and a re-recorded \"Earth Must Be Hell. Meanwhile, Andy was also working with producer Ossie Hibbert, for whom he cut \"Sitting on a Hillside\" that same year, \"Have You Ever Been in Love\" the next, and carried on with \"Cool and Deadly,\" \"Eternal Love,\" \"You Are My Angel,\" and \"Ain't No Love\" across 1983-1984., 41500=Soon after, Andy emigrated once again, this time to London. There he signed to the Rough Trade label and released the dancehall-flavored \"Elementary.\" The single titled his next album, on which he was joined by Rhythm Queen. The singer obviously had quickly taken the pulse of the local scene and the record reflected the country's fascination with lovers rock, but wed it to a throbbing electro beat. Andy dabbled in production for the first time on the single \"User,\" where he was again joined by Rhythm Queen. However, the singer reunited with Prince Jammy in 1986 and, accompanied by Steely & Clevie and the Firehouse Crew, unleashed a clutch of singles over the next couple of years including \"Come in a This,\" \"Must Have to Get It,\" and \"Do Your Thing.\", 48117=Having reached such heady heights, Andy now departed Studio One, linked back up with Phil Pratt, and proceeded to cut such seminal songs as \"Money Is the Root of All Evil\" and \"Get Wise.\" Now a fervent freelancer, Andy recorded with many of the island's other producers as well. He cut \"Love You to Want Me\" and \"Delilah\" with Gussie Clarke, the deeply dubby \"Girl I Love You\" with Ernest and Jo Jo Hookim, \"Jah Jah Children\" for Count Shelly, \"Lonely Woman\" for Derrick Harriott, \"God Is Displeased\" for Harry J, and covered Tony Orlando's \"Bless You\" for Robbie Shakespeare's Bar-Bell label. Leonard Chin was the producer responsible for Andy's second Jamaican number one, 1973's the infectious \"Children of Israel,\" and the singles just kept coming. He joined forces with Niney Holness in 1975 to cut \"Nice and Easy\" and \"I'm in Love,\" paired up with Freddie McKay for the duet \"Talking Love,\" and also returned to Jo Jo Hookim's side for \"Beware of a Smiling Face.\" Arguably, however, some of his best work was in conjunction with producer Bunny Lee. The two men inaugurated their partnership with a superb re-recording of \"Skylarking\" and \"Just Say Who,\" the latter fueled by a mighty mix courtesy of King Tubby. The pair would create several more seminal versions of Andy's earlier works including \"Love of a Woman,\" \"Something on My Mind,\" and \"Money Is the Root of All Evil\" (aka \"Money Money\")., 49172=Andy was on the ascendant, but it was another recording, \"Skylarking,\" which sealed his stardom. The song was placed on the Jamaica Today compilation and caused such a fevered reaction at the Lord Tippertone sound system that Dodd quickly released it as a single, where it rocketed to the top of the Jamaican chart. From that point on, the hits rained down: \"Love of a Woman,\" \"Every Tongue Shall Tell,\" a cover of Cat Stevens' \"Where Do the Children Play,\" and the deeply devotional \"Oh Lord Why Lord,\" amongst the number. In 1972, Studio One released Skylarking, rounding up a clutch of Andy's singles and other crucial recordings from this period. Two years later, the follow-up, Best of Horace Andy, appeared, heavily weighted with covers but still crucial nonetheless. The Heartbeat label compiled the Mr. Bassie album much later, which again trawls through the Studio One material but unearths a pair of previously released recordings alongside all the crucial singles., 38373=The following year found the singer cutting the \"Seek and You Will Find\" single for British producer Dennis \"Mixman\" Bedeau. That song titled his next full-length record the following year, with Bedeau creating an album's worth of simmering rhythms that made this set one of the most crucial U.K. reggae albums of the decade. Unfortunately, a collaboration with Jah Shaka, Jah Shaka Meets Horace Andy, was nowhere near as strong, and its dub companion Dub Salute 1 Featuring Horace Andy was merely unnecessary. Inevitably, Andy's work with Massive Attack brought him into the sphere of the group's sometime-collaborator Neil \"Mad Professor\" Fraser. He and Andy entered the studio in 1995 as well and emerged with the \"Life Is for Living\" single and an album of the same name., 50159=In January 1970, Hinds showed up at Studio One to audition for labelhead Coxsone Dodd, this time as a duo with friend Frank Melody. Dodd wasn't keen on the pairing, but later that week, Hinds tried again on his own with the self-composed ballad \"Got to Be Sure,\" and this time the producer was sold. That song was cut as the singer's debut single. However, the producer was wary of releasing it under Hinds' own name, concerned that the family relation with Justin and Horace's similar singing style might count against the teen. Dodd insisted on a name change and decided to throw out a red herring by rechristening him Horace Andy, a tribute to the equally legendary former Paragon-turned-solo star Bob Andy. \"Got to Be Sure\" was followed up with several more singles during 1971 — \"See a Man's Face\" and \"Night Owl\" included — with \"Fever\" and the evocative \"Mr. Bassie\" arriving the next year., 50988=Born Horace Hinds in the Allman Town neighborhood of Kingston, Jamaica, on February 19, 1951, the young star-to-be watched in awe as his elder cousin Justin Hinds cut a swathe across the Jamaican music scene. Justin Hinds & the Dominoes notched up hit after hit across the '60s, most memorably with the smash \"Carry Go Bring Come,\" later covered by Two Tone heroes the Selector. It was inevitable then that the younger Hinds would attempt to follow his cousin's meteoric path, although intriguingly he chose not to approach Justin's own producer, Duke Reid. Instead, at the age of 16 he cut his debut single for George \"Phil\" Pratt. Unfortunately, \"This Is a Black Man's Country\" did not light up the charts and the teenager spent the next few years in the shadows., 37528=The pair followed through with a re-recording of \"Zion\" the next year and the Roots and Branches album in 1997. Bunny Gemini would oversee Andy's next set, See and Blind, a stunning mix of new songs and old favorites accompanied by the Firehouse Crew. That same year, a new recording of \"I May Never See My Baby\" arrived. The year 1998 was further enhanced with a new album for Bushwackies, the sublime Horace Andy Sings Bob Marley album. Meanwhile, Massive Attack had launched their own label, Melankolic, and released Skylarking, a compilation of Andy's more difficult to find hits from across his long career. This was followed at the end of the decade with an album of new material, the seminal In the Light. Clive Hunt's exceptional production, a supple bass intertwining through the ever more claustrophobic atmospheres, is the perfect backing for one of Andy's own most powerful performances in ages. It was followed in 1999 by the similar Living in the Flood.}", "TableContextTimeStampAfterTable": "{61814=Copyright © 2014 Apple Inc. All rights reserved., 53796=February 19, 1951 in Kingston, Jamaica}", "lastModified": "Fri, 31 Jul 2015 07:54:30 GMT", "textBeforeTable": "Top Songs Next 10 9 8 7 6 5 4 3 2 1 View In iTunes Inspiration Information - The Remixes 20. View In iTunes Reggae Icons 19. View In iTunes In the Light Dub 18.", "textAfterTable": "Previous 1 2 3 4 5 6 7 8 9 10 Next Birth Name: Horace Hinds Born: February 19, 1951 in Kingston, Jamaica Genre Reggae Years Active: '70s, '80s, '90s, '00s, '10s Followers Wayne Jarrett Barrington Levy Contemporaries Gregory Isaacs Johnny Osbourne Bob Marley Dennis Brown Peter Tosh Toots Hibbert Jimmy Cliff Desmond Dekker Junior Delahaye Discover and share new apps. Follow us on @AppStore. Discover and share new music, movies, TV, books, and more. Follow us @iTunes and discover new iTunes Radio Stations and the music we", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}