{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8"], ["Name", "Frozen", "Marrow", "Little Indian", "Kakonita", "Sauna", "Simply Soo", "Hurry Slowly (Mungolian Jet Set Edit)", "Solid Ether"], ["Artist", "Nils Petter Molvær", "Nils Petter Molvær", "Nils Petter Molvær", "Nils Petter Molvær", "Nils Petter Molvær", "Nils Petter Molvær", "Nils Petter Molvær", "Nils Petter Molvær"], ["Time", "8:09", "9:00", "4:44", "4:59", "5:46", "7:21", "8:10", "10:52"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "Album Only"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Streamer by Nils Petter Molvær", "title": "", "url": "https://itunes.apple.com/ca/album/streamer/id205659161", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00310-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 881240063, "recordOffset": 881210197, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{18417=Born: 1960 in Sula, Norway, 15566=Norwegian trumpeter Nils Petter Molvær's live recording Streamer was issued in Europe on the Sura label in 2004. Finally issued here in the United States in Thirsty Ear's celebrated Blue Series, it is Molvær's third U.S. CD, and it almost catches us up with his catalog (NP3 is still not in print in the U.S.). Streamer features material from Molvær's second album on ECM, Solid Ether, as well as NP3. Present here is the trumpeter's standard accompanying band which includes atmospheric guitar powerhouse Eivind Aarset, drum master Rune Arnesen, as well as sidemen DJ Strangefruit, and French electronic programmer Raymond C. Pellicer creating loops and interspersing samples and effects. The four cuts performed from NP3, \"Frozen,\" \"Marrow\" \"Little Indian,\" and \"Simply So\" differ substantially from their studio counterparts in that the rhythmic intensity on the former two are more dynamic, and on the latter two, the sounds and placements are more relaxed and organic. The dreaminess inherent in this mix proves beyond the shadow of any doubt that Molvær is a master of his music in a live setting, creating dreamy, shimmering soundscapes in one moment and tribal, ecstatic ones the next, never losing his melodic invention or sense of control. The material from Solid Ether includes the title cut and \"Kakonita.\" In this latter tune, perhaps the most stirringly beautiful cut on the set, the music seems to drift toward the listener without hurry or particular purpose but stays very focused, its delivery being spun out only a little at a time with Molvær's trumpet becoming a slow, languid singer in the heat as it rises from the pavement. It drones its way into \"Sauna,\" a track that is as full of strange, intersecting melodic lines and musical traditions as it is guitar delays; it ominously threatens to explode at various moments, but its tension is held guardedly and tightly by Molvær. The set winds its way to a close with \"Hurry Slowly,\" a rhythmically intense vamp intercut with vocal samples and that ever slowly unwinding trumpet line that never gives the listener much to hold on to as it creates a skeletal frame for the rhythmic invention. It ends with \"Solid Ether,\" another snaky cut that becomes rhythmically more intense moment by moment, its trancelike beat distortedly running home while swirls and textures of electronic noise and samples wind in and out of the foreground and Aarset gets to stretch a bit. It's Streamer that may be the Molvær recording to start with, as it reveals his considerable range not only as an instrumentalist and composer, but as a performer as well., 115694=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 04:06:26 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Nils Petter Molvær Streamer iTunes for Mac + PC Already have iTunes? Click I have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Streamer by Nils Petter Molvær, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store…", "textAfterTable": "8 Songs Album Review Norwegian trumpeter Nils Petter Molvær's live recording Streamer was issued in Europe on the Sura label in 2004. Finally issued here in the United States in Thirsty Ear's celebrated Blue Series, it is Molvær's third U.S. CD, and it almost catches us up with his catalog (NP3 is still not in print in the U.S.). Streamer features material from Molvær's second album on ECM, Solid Ether, as well as NP3. Present here is the trumpeter's standard accompanying band which includes atmospheric guitar powerhouse Eivind Aarset, drum master Rune Arnesen, as well as sidemen DJ Strangefruit, and French electronic programmer Raymond C. Pellicer creating loops and interspersing samples and effects. The four cuts performed from NP3, \"Frozen,\" \"Marrow\" \"Little Indian,\" and \"Simply So\" differ substantially from their studio counterparts in that the rhythmic intensity on the former two are more dynamic, and on the latter two, the sounds and placements are more relaxed and organic. The dreaminess inherent in this mix proves beyond the shadow of any doubt that Molvær is a master of his music in a live setting, creating dreamy, shimmering soundscapes in one moment and tribal, ecstatic ones the next, never losing his melodic invention or sense of control. The material from Solid Ether includes the title cut and \"Kakonita.\" In this latter tune,", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}