{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Gingerbread Man", "Spicy Kid", "You Were a Basket of Flowers", "Translator", "Time Out", "Awake", "A Walk in the Rain", "S.P.E.L.L.", "Puzzle Pieces Within", "What Will You Ever See?"], ["Artist", "Lunch Money", "Lunch Money", "Lunch Money", "Lunch Money", "Lunch Money", "Lunch Money", "Lunch Money", "Lunch Money", "Lunch Money", "Lunch Money"], ["Time", "3:00", "2:33", "3:15", "1:54", "1:41", "1:59", "3:28", "2:18", "3:16", "3:29"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Spicy Kid by Lunch Money", "title": "", "url": "https://itunes.apple.com/us/album/spicy-kid/id536276612", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00024-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 864828583, "recordOffset": 864802431, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{122693=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 07:57:00 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Lunch Money Spicy Kid iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Spicy Kid by Lunch Money, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "10 Songs Customer Reviews A Higher Form of Kids' Music           by B1LParaquat The songs on 'Spicy Kid' showcase Lunch Money's traditional wit (\"S.P.E.L.L\") and inventiveness (\"What Will You Ever See?\") but what is updated is drummer/engineer Jay Barry's lusher instrumentation and mixing (\"Gingerbread Man\" and \"Time Out\" sound stunning) and singer Molly Ledford's expanding storytelling personas. Lunch Money lyrics up to now have mainly focused on seeing the world through a carefree, precocious child's eyes. The songs now point more directly to Molly's experiences as a parent, reading like excerpts from love letters to her kids (\"You were a Basket of Flowers\" , \"Awake\", \"A Walk in the Rain\".) The emotional details paint a very universal mural, capturing the Yin and Yang of our own feelings about our children. In the title track 'Spicy Kid', we get to relive the instant we saw our kid as a complete person, a person independent of our parenting and our genes. \"Watching you trying to cheat at games, in the most creative ways... I'd stop you, but I'm still amazed.\" Some of the standouts include: \"Time Out\"-- Ironically, it's over too quickly,", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}