{"relation": [["Author", "Author", "screbner Private Message Aug 19 2013 at 4:06pm #", "Vannevar Private Message Aug 19 2013 at 4:16pm #", "srpit Private Message Aug 19 2013 at 4:55pm #", "screbner Private Message Aug 19 2013 at 5:21pm #", "Drewbacca Private Message Aug 19 2013 at 6:28pm #", "StuInMcCandless Private Message Aug 19 2013 at 10:05pm #", "StuInMcCandless Private Message Aug 20 2013 at 11:14pm #"], ["Posts", "Posts", "I received a survey form from Rep. Keith Rothfus. Here is my reply: Dear Congressman Rothfus, Thank you for sending me a copy of the “2013 Official U.S. Government Survey,” an official federal document. I believe the intent of this document is to ascertain my views on key critical issues facing our country. I do not believe my responses to the survey would accurately reflect my views on these issues so I am writing you this letter to let you know exactly where I stand. I think you will agree with me that our country faces serious issues that need to be dealt with by all branches of government – legislative, executive and judicial. Furthermore, I think you will agree that some of the bigger ones are national security, the national debt, health care, and energy. These issues need to be addressed in a cohesive, comprehensive, strategic manner to be effectively dealt with, as they are all interrelated. Our nation’s dependence on imported energy has led us to squander several trillions of dollars while annoying 800 million residents of the countries where this energy comes from to the point where they threaten our national security with planned acts of violence. Becoming more self-sufficient in fueling our homes, automobiles and businesses will address both of these issues. There are two key methods for becoming more self-sufficient in energy. These are increasing domestic production and reducing domestic demand. I believe that both approaches should be strongly supported by a rational government. Economists tell us that our national debt is a future claim on our gross domestic product. Today, we owe the Chinese over a trillion dollars. A trillion is a million million. This is not a small sum. I think you would agree that we shouldn’t have to sell our national treasures to pay for money squandered by an irrational government, or leave this debt as a legacy for our children and their children. Health care costs are out of control in our country. I’ve heard that Medicare alone is a $70 trillion unfunded mandate. According to the American Diabetes Association, in 2011 25.8 million children and adults in the United States had diabetes. This is 8.3% of the population. Common complications of diabetes are heart disease, stroke, high blood pressure, blindness, kidney disease, nervous system disease, and amputation. The annual costs of diabetes in the United States were, as of 2013, $245 billion for treatment, including $176 billion for direct medical costs and $69 billion for reduced productivity. These figures do not include the non-monetary impact of managing a relentless, incurable disease for the 25.8 million who suffer from it. Almost all (25 million) of those who have diabetes in the United States have Type 2 diabetes, widely believed to be a direct consequence of obesity and a sedentary lifestyle. If we are to control health care costs, we need to reduce their causes, which are principally behaviorally related. As a society, we don’t get enough exercise in our daily lives to stay healthy, we smoke too much , drink too much, don’t wear our seat belts and motor cycle helmets enough, and eat too much of the wrong foods. I’m not in favor of telling people what they should do, but if they choose to make poor choices, they should suffer the economic consequences of those choices. That’s only fair to the rest of us. Investing money in our communities to encourage behavioral changes that reduce future health care costs makes excellent economic sense. Even the most selfish among us should see the value in encouraging forms of transportation that reduce our consumption of imported energy and decrease future health care costs. There are approximately 315 million people in the U.S. The direct per capita cost of diabetes is $245 billion / 315 million = $777 per person, per year. The U.S. spends $8233 per year on health care per person, according to an article published by PBS on 22 October 2012. What would be the net cost of safe bike routes in our communities for us to take to work and our children to take to school if they led to a sustained and substantial decrease in health care expenses? According to an article on the AARP blog posted 16 April 2013, the average yearly cost to own a car in this country is $9122. Major components include depreciation, maintenance, taxes, insurance, gasoline, oil, tires, parts and fluids. While some of this cost is distributed locally, the largest parts of it go outside the local community. This figure does not include the 40,000 killed and 3,000,000 injured in the six million car accidents that take place each year in the United States. The majority of car accident victims are the drivers, then the passengers of the cars, followed by pedestrians, and lastly cyclists. The leading cause of death in the United States for people aged one to 30 years, is car accidents. Persons aged 15 to 24 and greater than 75 are most severely affected by car accidents. In summary, I have my own survey for Congress to consider in answer to your survey: How many $trillions are we spending to support military operations to continue a car-dependent lifestyle? How many $trillions are we spending to treat the symptoms of obesity, rather than the causes? Why are we spending so much on taxpayer-financed sports arenas and highways, and a pittance on things that will improve the quality of life for millions of Americans? Why are car dealerships the largest contributors to local and congressional elections? How does this affect community and regional planning decisions? Could this be a factor in the reluctance of other locales to follow Portland’s lead? Why are John Mica and Bud Shuster making decisions on transportation at a national level? Isn’t it really a health care/national security/economic issue, not a transportation issue? Respectfully, Kevin R. Craig Allison Park, Pennsylvania 19 August 2013", "Very nice, sir.", "^^What he said. Could we just have your letter on a petition to send to every elected official??", "@srpit Better yet, send it to everyone you know, only put your name on it. Tweet it.", "Nicely stated. I’d only edit the military spending for car-dependent lifestyle part… It goes way deeper than having a death grip on our cars, it’s about trying to live bigger than any of us can actually afford to live; the automobile is the enabler, but there is a bigger underlying cause at work.", "How do we primary this guy out of contention in 2014? I received the same survey and discarded it in disgust. Leading questions, stacked-deck choices for answers. I know that raw politics is not the point of this board, and I applaud screbner for tying this issue to a cycling solution. I just see that the representative for PA-12 is a textbook case of House stupidity. I’m a Republican. Should I run in the 2014 primary?", "The two pages of the Rothfus survey:"]], "pageTitle": "Bike Pittsburgh | Topic: 2013 Official Government Survey Form Received", "title": "", "url": "http://bikepgh.org/mb/topic/2013-official-government-survey-form-received/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00092-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 22851931, "recordOffset": 22839891, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{14276=I’m a Republican. Should I run in the 2014 primary?, 4898=Investing money in our communities to encourage behavioral changes that reduce future health care costs makes excellent economic sense. Even the most selfish among us should see the value in encouraging forms of transportation that reduce our consumption of imported energy and decrease future health care costs. There are approximately 315 million people in the U.S. The direct per capita cost of diabetes is $245 billion / 315 million = $777 per person, per year. The U.S. spends $8233 per year on health care per person, according to an article published by PBS on 22 October 2012., 1591=Thank you for sending me a copy of the “2013 Official U.S. Government Survey,” an official federal document. I believe the intent of this document is to ascertain my views on key critical issues facing our country. I do not believe my responses to the survey would accurately reflect my views on these issues so I am writing you this letter to let you know exactly where I stand., 5699=According to an article on the AARP blog posted 16 April 2013, the average yearly cost to own a car in this country is $9122. Major components include depreciation, maintenance, taxes, insurance, gasoline, oil, tires, parts and fluids. While some of this cost is distributed locally, the largest parts of it go outside the local community. This figure does not include the 40,000 killed and 3,000,000 injured in the six million car accidents that take place each year in the United States. The majority of car accident victims are the drivers, then the passengers of the cars, followed by pedestrians, and lastly cyclists. The leading cause of death in the United States for people aged one to 30 years, is car accidents. Persons aged 15 to 24 and greater than 75 are most severely affected by car accidents., 3446=Health care costs are out of control in our country. I’ve heard that Medicare alone is a $70 trillion unfunded mandate. According to the American Diabetes Association, in 2011 25.8 million children and adults in the United States had diabetes. This is 8.3% of the population. Common complications of diabetes are heart disease, stroke, high blood pressure, blindness, kidney disease, nervous system disease, and amputation. The annual costs of diabetes in the United States were, as of 2013, $245 billion for treatment, including $176 billion for direct medical costs and $69 billion for reduced productivity. These figures do not include the non-monetary impact of managing a relentless, incurable disease for the 25.8 million who suffer from it. Almost all (25 million) of those who have diabetes in the United States have Type 2 diabetes, widely believed to be a direct consequence of obesity and a sedentary lifestyle. If we are to control health care costs, we need to reduce their causes, which are principally behaviorally related. As a society, we don’t get enough exercise in our daily lives to stay healthy, we smoke too much , drink too much, don’t wear our seat belts and motor cycle helmets enough, and eat too much of the wrong foods. I’m not in favor of telling people what they should do, but if they choose to make poor choices, they should suffer the economic consequences of those choices. That’s only fair to the rest of us., 7504=19 August 2013}", "textBeforeTable": "  ← Forums Home Viewing 7 posts - 1 through 7 (of 7 total) This topic contains 6 replies, has 5 voices, and was last updated by  StuInMcCandless 1 yr, 11 mos. 2013 Official Government Survey Form Received Monthly emails, no SPAM. Newsletter Signup Instagram Pinterest Flickr Facebook Twitter Google Plus Login Search Bike Racks Gear", "textAfterTable": "Viewing 7 posts - 1 through 7 (of 7 total) ← Forums Home   You must be logged in to reply to this topic. Become a Member Volunteer Newsletter Subscribe to our mailing list Monthly emails, no SPAM. Search the Forums Search Sponsors Web Design by ClickNathan Handmade Websites All original material is licensed under a Creative", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}