{"relation": [["Label", "Rounder", "Patuxent", "Yodel – Ay – Hee"], ["Artist", "Grascals", "Patuxent Partners", "Big Medicine"], ["CD", "The Famous Lefty Flynn’s", "Seven or Eleven", "Fever in the South"], ["Song", "Everytime", "South to Old Mexico", "The Love and Polly and Jack Monroe"]], "pageTitle": "Bluegrass Review April 30-May 6, 2011 (second hour) # 1018 | BluegrassReview.com", "title": "", "url": "http://enginewit.com/clients/review/?p=292", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00245-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 76388763, "recordOffset": 76380561, "tableOrientation": "VERTICAL", "textBeforeTable": "We feature recent bluegrass at the beginning of the show, including a cut from the new album by the Grascals. Then, our Gems of Bluegrass segment treats the connection between ragtime and bluegrass music. Then, it’s happy – sounding sad songs. Many of the old songs about prison fit the description of a happy – sounding sad song. Then, we contrast that type of song with a current prison song, which features unhappy lyrics as well as music that is unhappy. We talk to progressive banjo stylist, Brian Ford of Duluth, MN. Brian plays with a group called the Fish Heads, and we hear some of Brian’s original compositions, and a recording of the Fish Heads doing a Beatles song. admin by May 5, 2011 Posted on Bluegrass Review April 30-May 6, 2011 (second hour) # 1018 Bluegrass Review April 30 – May 6, 2011 (#1118) → ← Bluegrass Review April 22 – 29 2011 (second hour) # 1017 Listen to a demo", "textAfterTable": "Gem of Bluegrass: The Bluegrass – Ragtime Connection Label Artist CD Song County Eck Robertson 1922-19301922-1930 Ragtime Annie Music for Little People Ric Luchard Ragtime Stomp The Entertainer Hilltop Jesse McReynolds Mandolin Workshop Dill Pickle Rag Epic lp Jim & Jesse Bluegrass Classics Stony Creek Bear Family Flatt & Scruggs 1948-1959 Randy Lynn Rag Happy Sounding Sad Songs – Prison Label Artist CD Song Bear Family Bill Monroe 1950 – 1958 Prisoner’s Song Rural Rhythm Hylo Brown 20 Old Time Favorites Prisoner’s Dream Rounder Del McCoury Band Cold Hard Facts Blackjack County Chains break Label Artist CD Song BMA lp DW Griffiths Workingman’s Banjo Salt Creek Brian Ford", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}