{"relation": [["Author", "ozwalled", "ozwalled", "ozwalled", "ozwalled", "ozwalled"], ["Title", "Filthy Attack Roach", "Fire Plug", "Firebug", "Fleabag", "Flint"], ["Description", "Was originally made for Cap'n Muffin's and chuggaaconroy's EarthBound: Memoirs fangame.", "Tried to visualize the Enraged Fire Plug spraying water, and this is what I came up with.", "An Incendiary Insect (or, Firebug, as I prefer to call them), from Mother 3's first chapter.", "\"You thought I was going to beg for food, didn't you ? I wouldn't do that, even though I am ever so hungry.... Give me something. Whatever it is, just give it to me. Gimme gimme. Please, give me. Why won't you give it to me ? I said please ?... I promise, I 'll give you something in return. What are you going to give me ?... Thanks a lot. To show my gratitude I 'll give you this Flea Bag. Please take it.\" One of the people from Reindeer in Mother 1. Made for a \"We Are Starmen\" contest, on deviantArt.", "One of the lead EB64 characters. I later added an orange background, which I thought worked better."], ["Date", "11/18/06", "9/22/06", "8/11/06", "6/10/10", "4/26/05"], ["Rank", "8.00", "9.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=10238&stuffFirstLetter=F&stuffPageNumber=3", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00132-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 228165476, "recordOffset": 228157274, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> Z Y W V U T S R Q P O N M L K J I H G F E D C B A < Other Submissions by ozwalled added an orange background, which I thought worked better. One of the lead EB64 characters. I later This image has been resized for your convenience. Click on it to view the full size version. Flint Flint - by ozwalled  Earthbound 64", "textAfterTable": "1 2 3 4 5 6 7 8 9 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day. Activities:", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}