{"relation": [["Author", "EB 4 GBA", "EB 4 GBA", "EB 4 GBA", "EB 4 GBA", "EB 4 GBA"], ["Title", "April 14", "Smashing With Ness", "Earthbound Zero's New Name", "Smashing With Ness: Part Two", "Earthbound Zero's New Name, Part II"], ["Description", "772", "779", "785", "787", "788"], ["Date", "7/31/06", "7/31/06", "7/31/06", "7/31/06", "7/31/06"], ["Rank", "0.00", "0.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=14375&stuff=RankASC", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00135-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 233908796, "recordOffset": 233900594, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> 0 < Other Submissions by EB 4 GBA -That Ness's bat reads \"Nett Sports?\" -That Ness's yo-yo pictures a figure that somewhat resembles Giygas' final form, and reads \"Dolphin Loop, Nintendo 2001?\" ***DID YOU KNOW?*** -EB 4 GBA Well, I hope this provides some help for those of you having trouble mastering Ness. Just remember, look for the right situation. This is the key to mastering any character. Develop a strategy, and use it. Soon, you'll find yourself utilizing these solutions without even thinking about it. Well, that concludes my article. Thanks for reading. This is EB 4 GBA, signing off. Next, we'll talk about the \"around the world\" yo-yo move. This move is performed by pressing \"Up-A.\" The yo-yo spins on the ground, like the \"walk-the-dog\", but after this, it spins around above Ness's head before he catches it back in his hand. This move can also be used in the same way as the \"walk the dog\" move to prevent opponents from getting back on the fighting stage. Just do the same thing, but without your back to the edge, and virtually the same effect", "textAfterTable": "1 2 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day. Activities:", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}