{"relation": [["Composer", "Sarasate, Pablo de", "Sarasate, Pablo de", "Sarasate, Pablo de", "Sarasate, Pablo de"], ["Title", "Caprice Basque", "Zapateado", "Zigeunerweisen", "Zigeunerweisen (for Cello and String Quintet)"], ["Instrument", "Viola", "Violoncello", "Violoncello", "Violoncello"], ["Editor", "Dinerchtein, Viacheslav", "Jensen, Hans Jørgen", "Jensen, Hans Jørgen", "Dešpalj, Valter"], ["Instrumentation", "Solo with Piano", "Solo with Piano", "Solo with Piano", "Solo with Orchestra"], ["Price", "$ 10.99", "$ 7.99", "$ 5.99", "$ 16.99"]], "pageTitle": "Pablo de Sarasate | Ovation Press", "title": "", "url": "http://ovationpress.com/c-92-sarasate-pablo-de.aspx", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00210-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 188095921, "recordOffset": 188079527, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1078=Sarasate made his debut as a concert violinist in Paris in 1860, playing in London the following year. Over the course of his career, he toured many parts of the world, performing in Europe, North America, and South America. His artistic pre-eminence was due principally to the purity of his tone and his virtuoso faculty of execution. His performance was often regarded as being independent and free from the tendency towards the sentimental or rhapsodic, which was enhanced by his technical prowess.}", "textBeforeTable": "Exclusive Sarasate Scores for Strings from Ovation Press Sarasate's works are known for their technical emphasis, though many still display musical avenues of expression. Perhaps the best known of his works is Zigeunerweisen (1878), a work for violin and orchestra (but also commonly performed as a violin piano duo). This work and others have been arranged in exclusive editions below. Sarasate made his debut as a concert violinist in Paris in 1860, playing in London the following year. Over the course of his career, he toured many parts of the world, performing in Europe, North America, and South America. His artistic pre-eminence was due principally to the purity of his tone and his virtuoso faculty of execution. His performance was often regarded as being independent and free from the tendency towards the sentimental or rhapsodic, which was enhanced by his technical prowess. Born in Pamplona, Navarre, Sarasate began studying the violin with his father at the age of five. He later took lessons from a local teacher where his musical talent became evident early on, appearing in his first public concert in La Coruña at the age of eight. His performance was well-received and caught the attention of a wealthy patron who provided the funding for Sarasate to study under Manuel Rodríguez Saez in Madrid where he gained the favor of Queen Isabel II. Pablo de Sarasate was a Spanish violinist and composer of the Romantic period. Pablo de Sarasate", "textAfterTable": "    Home    Sitemap    Terms    Privacy Policy    Contact Us © Copyright 2002-2011 Ovation Press, Ltd. All Rights Reserved.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}