{"relation": [["TITLE", "The Werewolf of Paris (ri)", "Aleron", "Quiver (h2tp)", "The Soul Consortium"], ["AUTHOR", "Guy Endore", "Kane", "Holly Luhning", "Simon West-Bulford"], ["SERIES", "H/M", "H - Strigoi 1", "H/M", "SF"]], "pageTitle": "The Qwillery: June 2012", "title": "", "url": "http://qwillery.blogspot.co.uk/2012_06_01_archive.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00241-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 196818135, "recordOffset": 196699762, "tableOrientation": "HORIZONTAL", "lastModified": "Sat, 01 Aug 2015 02:43:05 GMT", "textBeforeTable": "July 1, 2012 Here is The Qwillery's list of books being published in July 2012. If there is something that I've missed, please leave a comment below. Any genre mistakes are mine. Leave a comment below if you feel that the genre is wrong. Also note that this list is always under revision. Publication dates change. I try to keep this as accurate as possible. The most accurate lists can be found for each week in The View From Monday posts. July 2012 Book Releases Friday, June 29, 2012 Share to Pinterest Share to Facebook Share to Twitter BlogThis! Email This Labels: Debris, giveaway, Interview, Jo Anderton, Suited. The Veiled Worlds Links to this post", "textAfterTable": "July 3, 2012 TITLE AUTHOR SERIES Pies and Prejudice Ellery Adams PCM - Charmed Pie Shoppe Mystery 1 Other Worlds Than These John Joseph Adams SF - Anthology The Portrait of Doreene Gray Esri Allbritten PCM - Chihuahua Mystery 2 Iron Gray Sea Taylor Anderson SF - Destroyermen 7 In a Witch's Wardrobe Juliet Blackwell PCM - Witchcraft Mystery 4 Cloaked in Malice Annette Blair PCM - Vintage Magic 5 Wake of the Bloody Angel Alex Bledsoe F/M - Eddie Lacrosse 4 Blood Before Sunrise Amanda Bonilla UF - Shaede Assassin 2 Orion and King Arthur Ben Bova SF/TT A Million Heavens John Brandon G/O/S The Hollow Earth: At the Earth's Core and Pellucidar Edgar Rice Burroughs SF/A The Sleeping and the Dead Jeff Crook M w/PE - Jackie Lyons 1 A Hunger So Wild Sylvia Day PNR - Renegade Angels 2 The Year's Best Science Fiction: Twenty-Ninth Annual Collection Gardner Dozois SF - Anthology The Asylum Interviews: Bronx (e) Jocelynn Drake UF - Asylum Tales Short Story House of Sighs Aaron Dries H Samurai Game Christine Feehan PNR - GhostWalkers 10 Night Seeker Yasmine Galenorn UF - Indigo Court 3 Heaven's", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}