{"relation": [["Title", "The Last Chinese Chef", "River Town", "The Painted Veil", "Wild Swans", "The Last Days of Old Beijing", "Mao's Last Dancer", "Leaving Mother Lake"], ["Author", "Nicole Mones", "Peter Hessler", "Somerset Maugham", "Jung Chang", "Michael Meyer", "Li Cunxin", "Yang Erche Namu"]], "pageTitle": "China | Intrepid Travel", "title": "", "url": "http://www.intrepidtravel.com/china/latest-deals", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00223-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 520963623, "recordOffset": 520899348, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{85293=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 86612=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 186691=Review submitted 24 Jul 2015}", "TableContextTimeStampAfterTable": "{147365=As one of the world's oldest civilisations, China has an intriguing history that spans thousands of years. The Yellow River is known as the Cradle of Chinese Civilisation as it is thought that Chinese civilisation originated on the banks of the river. China's early history is dominated by periods of dynastic rule, fragmentation and imperialistic expansion, with each dynasty contributing something different to the annals of history. Construction of the Great Wall of China was thought to have started during the Qin Dynasty, with the Ming Dynasty enhancing the wall at a later stage. The Tang Dynasty is known as a time of prosperity and artistic expression, the Song Dynasty is famed for being a time of scientific and technological discovery, and Kublai Khan's Yuan Dynasty saw an overall population decline that has been attributed to everything from an administration error to the arrival of the Bubonic Plague. With the Yuan Dynasty being overthrown by the Ming Dynasty in 1368, population numbers began to increase again and urbanisation grew quite rapidly. During this time, private enterprise flourished, with small-scale paper, silk and cotton trading providing trade income to the masses. The following period of rule known as the Qing Dynasty stretched from 1644 to 1911. This is generally seen as a time of rebellion and upheaval with the Taiping Rebellion, Nien Rebellion, Panthay Rebellion and Boxer Rebellion all testing the Qing's ability to rule. Thankfully, remnants of most of these periods of history can be found in China today., 148971=The Republic of China was formed in Nanjing in 1912 after a military uprising. During the following years, leadership changed hands many times until the People's Liberation Army succeeded in ousting the US backed Chiang Kai-Shek after a long and bloody battle. Mao Zedong became Chairman (leader) of the People's Republic of China, which was declared in 1949, and China's society was systematically converted to communism, with land reforms and collectivisation of agriculture changing the structure of society and daily life dramatically. Mao's death in 1976 triggered leadership changes and economic reforms which had impacts that have rippled out into the future. More recently, China has seen Hong Kong and Macau returned from foreign rule, has enjoyed a period of increased economic growth and basked in the international spotlight as the host city of the 2008 Summer Olympics.}", "textBeforeTable": "Recommended reading Further reading To learn more or donate, go to: www.theintrepidfoundation.org Providing skills, training, employment services and housing assistance, this organisation works to better the lives of disabled people in Xi'an by increasing the amount of opportunities available to this marginalised section of the population. Image supplied by Xi'an Huiling. Xi'an Huiling This proactive not-for-profit organisation helps the disadvantaged local community to live more independent lives. Art and craft workshops teach skills and foster employment options while public education projects enlighten the community about the ways in which people with disabilities can contribute to society. Image supplied by Kim Bowden and Jane Crouch. Beijing Huiling This organisation aims to facilitate the integration and acceptance of the blind in Tibetan society by providing rehabilitation and education for blind children. In Lhasa, they have a preparatory school, medical massage training and a Braille printing press. At the vocational training centre and farm in Shigatse they teach skills including animal husbandry, market gardening, agriculture, cheese production, bread baking and kitchen management. Braille Without Borders", "textAfterTable": "Handy links www.lonelyplanet.com/china www.worldtravelguide.net/china www.tourismchina.org × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}