{"relation": [["Author", "Author", "TeamDecaf Private Message Jan 26 2014 at 11:20am #", "stefb Private Message Jan 26 2014 at 6:43pm #", "TeamDecaf Private Message Jan 26 2014 at 9:51pm #", "buffalo buffalo Private Message Jan 27 2014 at 9:19pm #", "StuInMcCandless Private Message Jan 27 2014 at 10:07pm #", "TeamDecaf Private Message Jan 27 2014 at 11:13pm #", "stefb Private Message Jan 28 2014 at 5:44am #"], ["Posts", "Posts", "Thanks for the free tickets to the International show – awesome. Here are some shots of favorites.", "I was gonna take a photo of “I’m with stupid” but it said “no photos” of it! There were personnel standing by every time i walked past. Glad you got one, scofflaw.", "^Yeah, after I took the photo, a standing-by-personnel said “no pictures.” I was surprised, I said ” I saw several signs that said “pictures allowed.” He said, “not this painting.” I thought “Oh well, too late. Recorded digitally.”", "In general, you are allowed to take pictures in the museum (no flash, though). However, special exhibitions and loaners and other pieces that the museum doesn’t own are out.", "I think the highlight for me was running into Mr and Mrs Scott Bricker not 30 seconds after walking in.", "After thinking about it, I decided it’s best to remove the image and respect the artist/owner. Gone.", "I already saved it. Thanks."]], "pageTitle": "Bike Pittsburgh | Topic: Thanks BikePgh for Carnegie Intnl Show", "title": "", "url": "http://bikepgh.org/mb/topic/thanks-bikepgh-for-carnegie-intnl-show/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00045-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 24510063, "recordOffset": 24501320, "tableOrientation": "HORIZONTAL", "textBeforeTable": "  ← Forums Home Viewing 7 posts - 1 through 7 (of 7 total) This topic contains 6 replies, has 4 voices, and was last updated by  stefb 1 yr, 6 mos. Thanks BikePgh for Carnegie Intnl Show Monthly emails, no SPAM. Newsletter Signup Instagram Pinterest Flickr Facebook Twitter Google Plus Login Search Bike Racks Gear", "textAfterTable": "Viewing 7 posts - 1 through 7 (of 7 total) ← Forums Home   You must be logged in to reply to this topic. Become a Member Volunteer Newsletter Subscribe to our mailing list Monthly emails, no SPAM. Search the Forums Search Sponsors Web Design by ClickNathan Handmade Websites All original material is licensed under a Creative", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}