{"relation": [["Author", "senssensibilityr", "Tue Aug 09, 2005 10:26 am"], ["Message", "Dissenting review --- Reason magazine Ronald Bailey is a Exxon Mobil think tank scholar, and most of what he says is garbage, but he seems to make a few good arguments against the Haiti analysis and others before a really dumb attack on the book conclusion: Jared Diamond's new book, Collapse: How Societies Choose to Fail or Succeed, is neither \"superb\" (The New Statesman), \"incisive\" (The Washington Post), \"magisterial\" (BusinessWeek), nor \"insightful and very important\" (Boston Herald). It is, instead, a telling example of how a smart man can be terribly misled by a fixation on one big idea. In this case, Diamond, a biologist, is trying to apply biology's master narrative to human societies. In 1838 the founding father of modern biology, Charles Darwin, read the 1798 edition of the Rev. Thomas Robert Malthus' Essay on the Principle of Population. Malthus famously concluded that human population increased at an exponential rate, while food supplies grew at \"arithmetic\" rates. Thus population would always outstrip food supplies, dooming some portion of humanity to perpetual famine. As a description of human behavior, it was, as we shall see, a wildly inaccurate argument. But it sparked a genuine revolution in the life sciences. Reading Malthus was a \"eureka\" moment for Darwin, who declared in his autobiography, \"I had at last got a theory by which to work.\" Darwin realized that Malthus' thesis applied to the natural world, since plants and animals produce far more offspring than there is food, nutrients, and space to support them. Consequently, Darwin noted, \"It at once struck me that under these circumstances favourable variations would tend to be preserved, and unfavourable ones to be destroyed. The results of this would be the formation of a new species.\" This insight launched one of the most important modern scientific theories, the theory of biological evolution by means of natural selection. Ever since, biologists have been entranced by the idea that if Malthusianism can explain the operation of the natural world, it should also explain human societies. Are we not just complicated animals? Shouldn't this biological insight apply to us too? In Collapse, Diamond proves himself an enthusiastic apostle of Malthusianism. \"Our world society is presently on a non-sustainable course,\" Diamond warns. \"The world's environmental problems will get resolved, in one way or another, within the lifetimes of the children and young adults alive today. The only question is whether they will become resolved in pleasant ways of our own choice, or in unpleasant ways not of our choice, such as warfare, genocide, starvation, disease epidemics, and collapses of societies.\" As prophets go, Diamond certainly has impressive credentials. He is a polymath who speaks 12 languages, won the Pulitzer Prize for his 1997 book Guns, Germs, and Steel, and received a MacArthur Foundation \"genius\" grant. He trained as a physiologist, is an expert ornithologist specializing in the birds of New Guinea, and is now a professor of physiology and geography at the University of California at Los Angeles. In Collapse, Diamond argues that the decline and fall of several relatively small-scale premodern communities are pertinent to our current situation. These include the medieval Norse colony in Greenland, the Polynesian settlers of Easter Island, and the Mayan civilization of Central America. \"It is not a question open for debate whether the collapses of past societies have modern parallels and offer any lessons to us,\" he declares. \"That question is settled, because such collapses have actually been happening recently, and others appear to be imminent.\" By collapse, Diamond means \"a drastic decrease in human population size and/or political/economic/social complexity, over a considerable area, for an extended time.\" Based on his case studies, Diamond concocts a five-point framework to explain why societies collapse: \"environmental damage, climate change, hostile neighbors, and friendly trade partners,\" along with \"the society's responses to its environmental problems.\" Diamond takes readers to the ruins of the Greenland Norse's Eastern Settlement, where he kicks the stones of the cathedral built by Viking settlers. The colonists arrived in Greenland in 984 A.D., led by Eric the Red, and survived there for nearly 500 years, reaching a maximum population of around 5,000. On their arrival, average temperatures in Greenland were slightly higher than they are now. This relatively benign climate permitted a long enough growing season for hay to sustain their cattle, goats, and sheep through the long winters. The milder climate also allowed their open-decked wooden ships to maintain trade with Europe, exporting walrus tusk ivory and polar bear skins in exchange for both necessities (iron, lumber, tar) and luxury goods (stained glass and communion wine for their cathedral at Gardar). According to Diamond, the Greenland Norse fell afoul of all five of his baleful factors. Around 1300, the Little Ice Age commenced and Greenland's climate began to cool. This meant critically shorter growing seasons and trade routes blocked with ice. Meanwhile, the colony found itself fighting with the Inuit, who began moving into Greenland around this time. The Norse also tore up fragile sod to build their houses and overgrazed what remained. Finally, they refused to emulate the lifestyles of the Inuit, who were able to survive the rigors of a climatically harsher Greenland. All true, but worsening climate seems the driving factor for all the others; the Norse might well have been able to hang on had there been no Little Ice Age. Similarly, Diamond describes how Polynesian seafarers settled Easter Island by 900 A.D. This 66-square-mile island is one of the more remote scraps of land on the planet. It lies in the South Pacific 2,300 miles from Chile and 1,200 miles from the next nearest Polynesian island. Easter Islanders don't seem to have had any contact with outsiders until Dutch explorers stumbled on them in 1722. Archaeological evidence shows that Easter Island was once covered with a subtropical forest which was home to the world's biggest species of palm (now extinct). Today, no native tree species exceeds seven feet in height. Evidently the Easter Islanders cut down all of their trees by 1600, leaving none to regenerate the forests. This complete deforestation caused severe soil erosion, which cut farmers' crop yields, leading to starvation and cannibalism. Easter Island society apparently \"collapsed\" in a civil war around 1680, at which time the island's population may have declined by 70 percent. When Diamond discusses the \"collapse\" of the Mayan civilization in Central America around 900 A.D., he hauls out the standard Malthusian explanation: \"It appears to me that one strand consisted of population growth outstripping available resources: a dilemma similar to one foreseen by Thomas Malthus in 1798.\" This population/resource imbalance led to civilization-destroying warfare, which Diamond declares is \"not surprising when one reflects that at least 5,000,000 people...were crammed into an area smaller than the state of Colorado.\" Before nodding your head in sage agreement with this analysis, keep in mind that Colorado itself is today crammed with 4.5 million people whose standards of living are vastly more luxurious than those of 10th-century Mayan nobles and peasants. Anthropologist Lisa Lucero of New Mexico State University at Las Cruces told USA Today that she disagrees with Diamond's analysis of the \"collapse\" of the Mayan civilization: \"There's no evidence for massive violence and massive disease among the classic Maya.\" She believes the evidence indicates that the Mayans simply moved on because of widespread drought. Diamond then turns his attention to modern societies that have \"collapsed.\" His first example is Rwanda. \"Modern Rwanda illustrates a case where Malthus's worst-case scenario does seem to have been right,\" he declares. Diamond gets a lot of his facts right, but his analysis stinks. He essentially claims that Rwanda's genocide, in which Hutus massacred 800,000 Tutsis, was caused by too many people fighting over too little arable land. But what is the population density of Rwanda? About 760 people per square mile. The Netherlands holds 1,008 per square mile. Diamond himself acknowledges that the United Kingdom, with a population density of 631 people per square mile, produces more food than its people consume. Why? Because, he explains, the U.K. has highly efficient mechanized agriculture. Just so. Apparently there is nothing at all necessary about Malthusian collapse, if you've got tractors and fertilizers. Germany, with 602 people per square mile, and India, with 811, both produce more food than their people consume. (By the way, the U.K.'s population has grown sixfold since Malthus wrote his essay.) Another modern \"collapse\" occurred in Haiti, which Diamond says is \"among the most overpopulated countries in the New World.\" To make his case, Diamond compares it to the Dominican Republic, with which it shares the island of Hispaniola. Haiti has a population density of 670 people per square mile; in the Dominican Republic, the figure is 460. Haiti's per capita GDP is $1,600 per year; the Dominican Republic's is $6,000. Today 28 percent of the Dominican Republic is forested; only 1 percent of Haiti is. Diamond asserts that the combination of Haiti's population density and lower rainfall \"was the main factor behind the more rapid deforestation and loss of soil fertility on the Haitian side.\" This simplistic analysis doesn't stand up to scrutiny. Diamond overlooks an even more \"overpopulated\" island right next door, Puerto Rico. Its population density is almost twice that of Haiti, at 1,120 people per square mile. By 1900 Puerto Rico's primary forests had been reduced to 1 percent of their original extent, and in 1953 its secondary forests covered only 6 percent of the island. Today 32 percent of Puerto Rico is forested, and the island's per capita GDP is $16,800 per year. Why is Puerto Rico so much better off than its neighbors? In a word, institutions. Diamond vaguely recognizes the importance of social and political institutions, but his analysis doesn't go much deeper than arguing that Haitian dictators have been more rapacious than Dominican dictators. In fact, the last two centuries have shown that the more a country adheres to the rule of law, protects private property, reduces bureaucratic corruption, nurtures a free press, permits free markets, engages in trade, and allows democratic politics, the less likely it is to suffer from the Malthusian horrors of plagues, famines, and civil wars. What Haiti and Rwanda have in common is not just dense populations but shattered social and political institutions. What the United Kingdom, the Netherlands, and Puerto Rico have in common are not only dense populations, but adequately effective social and political institutions. Nor does low population density correlate with ecological health and social peace. Consider Bolivia, which has 20 people per square mile and a per capita GDP of $2,400. Or Laos, which has 62 people per square mile and a per capita GDP of $1,700. Or Angola, which has 22 people per square mile and a per capita GDP of $1,900. Bolivia, Laos, and Angola all suffer from \"Malthusian\" problems, including pestilence, hunger, and civil unrest. Diamond has confused poverty with overpopulation. Diamond also has some odd notions about economics. He claims, for example, that \"socially stratified societies, including modern American and European society, consist of farmers who produce food, plus non-farmers such as bureaucrats and soldiers who do not produce food but merely consume the food grown by the farmers and are in effect parasites on farmers.\" He points out that only 2 percent of Americans are farmers today and calls the rest of us \"non-producers.\" Let's give Diamond the bureaucrats and soldiers as \"parasites.\" What about the roughnecks who produce and refine the petroleum that drives the farmers' tractors, heats their homes, and is transformed into fertilizer? What about the textile workers who make their clothing, or the miners and steelworkers who produce the steel that makes their plows and tractors, or the academic scientists who create new high-yielding crop varieties, or the pharmaceutical researchers who produce medicines to cure them and their livestock? The list is endless. This elaborate division of labor is what allows modern civilization to become ever wealthier, healthier, and more environmentally benign. Complex modern societies are composed of cooperative networks of people making their livings by supplying the needs of their fellow citizens, not a bunch of \"parasites\" subsisting off the surpluses of farmers. As ecology teaches us, the simplest ecosystems are often the most fragile. Similarly, our modern globally interconnected economy that can draw upon a wide array of resources is far more stable and robust than either the fragile pre-modern or the marginally modern societies cited by Diamond. It's worth noting that in 1800, when the vast majority of people on the planet were farmers, the global average GDP per capita, adjusted for inflation, was about $600. Diamond adheres to the orthodox Malthusian claims that human population growth is exponential while \"improvements in food production add rather than multiply; this breakthrough increases wheat yields by 25%, that breakthrough increases yields an additional 20%, etc.\" But just looking at the history of the 20th century, it is very clear that increases in food production have been exponential too; in fact, food production has been increasing faster than human population growth. Since 1961 world grain production has tripled, while world population has doubled. Consequently, per capita global food production increased by 25 percent between 1961 and 2004, according to the United Nations Food and Agriculture Organization. \"I have not met anyone,\" Diamond writes, \"who seriously argues that the world could support 12 times its current impact, although an increase of that factor would result from all Third World inhabitants adopting first world living standards.\" But increasing human numbers and wealth do not translate automatically into more impact on the natural world. The British demographer Angus Maddison calculates that world GDP increased in real dollars from $2 trillion in 1900 to $37 trillion in 2001, while global per capita income rose from $1,300 annually to more than $6,000. This 18-fold increase in output was not achieved just by doing more and more of the same old things. Most of the increase was achieved through technological innovation: using better recipes to manipulate less physical stuff to give us more services. For example, in the United States producers use less than half the energy they used in 1949 to produce a dollar of GDP. In 2000 a report from the Cap Gemini Ernst and Young Center for Business Innovation calculated that the value of America's GDP per pound of finished product rose from $3.64 in 1977 to $7.96 in 2000. This trend toward ever greater efficiency is driven by the relentless market process that pushes producers to economize on resources. The smart bet is that humanity's steadily dematerializing economy in the 21st century will have less and less \"impact\" on natural systems while enabling much higher living standards. Diamond admits that many previous Malthusian predictions were wrong but feels compelled to defend earlier doomsayers such as Paul Ehrlich, arguing that \"the reason that alarms proved false is often that they convinced us to adopt successful countermeasures.\" That's flat-out wrong. In his 1968 book The Population Bomb, Ehrlich wrote: \"The battle to feed all of humanity is over. In the 1970s, the world will undergo famines", ""]], "pageTitle": "BookTalk.org - View topic - Dissenting review --- Reason magazine", "title": "", "url": "http://www.booktalk.org/post23797.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 14, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00090-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 327408239, "recordOffset": 327377022, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{47830=• Want updates on BookTalk.org calendar events? Mon Jul 27, 2015 12:06 am, 53630=Thu Jul 30, 2015 9:31 am, 56644=Wed Jul 29, 2015 12:40 pm, 58197=Wed Jul 29, 2015 11:32 am, 52615=Thu Jul 30, 2015 5:09 pm, 52107=Thu Jul 30, 2015 6:48 pm, 58715=Wed Jul 29, 2015 11:00 am, 54651=Thu Jul 30, 2015 6:53 am, 53120=Thu Jul 30, 2015 3:41 pm, 60335=Tue Jul 28, 2015 9:03 pm, 59818=Wed Jul 29, 2015 3:46 am, 51594=Thu Jul 30, 2015 11:23 pm, 55621=Wed Jul 29, 2015 8:36 pm, 48161=• What NON-FICTION book would you like to read and discuss in August, September and October 2015? Thu Jul 23, 2015 1:34 am, 54125=Thu Jul 30, 2015 9:07 am, 153=Home Page » Forum index » The Archives » Archived Book Discussion Forums » Archived Book Discussions 2004-2005 » Collapse: How Societies Choose to Fail or Succeed - by Jared Diamond, 55140=Wed Jul 29, 2015 9:23 pm, 48541=• Sunday, August 9th, 6:00 pm Eastern - LIVE chat in the BookTalk.org chat room on ISIS! Tue Jul 07, 2015 11:46 pm, 60859=Tue Jul 28, 2015 7:21 pm, 61428=Tue Jul 28, 2015 7:13 pm, 56146=Wed Jul 29, 2015 1:43 pm, 59241=Wed Jul 29, 2015 8:22 am, 57177=Wed Jul 29, 2015 12:17 pm}", "textBeforeTable": "Dissenting review --- Reason magazine  Previous topic | Next topic  Print view  [ 1 post ] • Topic evaluate:    Page 1 of 1   Dissenting review --- Reason magazine  Tweet This Topic Please click here to view the forum rules Forum rules 6", "textAfterTable": "Display posts from previous: All posts1 day7 days2 weeks1 month3 months6 months1 year  Sort by AuthorPost timeSubject AscendingDescending     Page 1 of 1  [ 1 post ] • Topic evaluate:  ", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}