{"relation": [["Author", "Ysabel Briceño", "World Bank’s Rural Development and Natural Resources Sector Unit of the East Asia and Pacific Region", "Women’s Rights Programme, Association for Progressive Communications", "Women’s Legal and Human Rights Bureau, Inc. for the \"End violence: Women´s rights and safety online\" project", "Women’s Legal and Human Rights Bureau, Inc. (author) and Richa Kaul Padte (editor) for APC's \"End violence: Women's rights and safety online\" project", "Women’s Legal and Human Rights Bureau for the End violence: Women's rights and safety online project", "Women'sNet and OSISA", "Women Human Rights Defender International Coalition", "Willie Currie", "Willie Currie", "Willie Currie", "Willie Currie", "Willie Currie", "WHRDIC", "WHRDIC", "Wairagala Wakabi", "Various", "Various", "Various", "Various"], ["Year", "2009", "2005", "2012", "2015", "2015", "2014", "2005", "2014", "2004", "2005", "2009", "2009", "2010", "2015", "2015", "2009", "2008", "2001", "2012", "2012"], ["Title", "Venezuela: NAP: An Opportunity to Improve Universal Broadband Access?", "Engendering rural information systems in Indonesia", "Going visible: Women’s rights on the internet", "From impunity to justice: Domestic legal remedies for cases of technology-related violence against women", "From impunity to justice: Domestic legal remedies for cases of technology-related violence against women - Summary", "Domestic legal remedies for technology-related violence against women: Review of related studies and literature", "Mainstreaming ICTs: Africa lives the information society.", "Statement from members of the WHRD IC to the Human Rights Council on its 27th Session", "The centrality of e-strategies in the World Summit on the Information Society (WSIS) plan of action", "Creating spaces for civil society in the WSIS – a reply to Michael", "Comments to ICANN: Proposed bylaw changes to improve accountability", "Written Submission to the United Nations Group on the Information Society (UNGIS)", "Comments to ICANN on Discussion Draft: Affirmative Reviews", "Statement: Stop defamation against the women human rights defenders of CEDEHM in Mexico", "WHRDIC urges Chinese authorities to release five young feminists", "Bringing affordable telecommunications services to Uganda: A policy narrative and analysis", "Equitable access: Papers and commentaries", "The History of APC (A collection of feature articles)", "Application of ICTs for climate change adaptation in the water sector: Developing country experiences and emerging research priorities", "GISWatch 2011 Special Edition 1"], ["Publisher", "APC", "The World Bank", "Addressing inequalities - The Heart of the Post-2015 Development Agenda and the Future We Want for All - UN Women, UNICEF and United Nations", "Association for Progressive Communications", "Association for Progressive Communications", "APC", "Women'sNet and OSISA", "APC", "APC", "Heinrich-Böll-Foundation", "APC", "APC", "APC", "APC", "APC", "APC", "APC", "APC", "APC and IDRC", "APC/Hivos"], ["Languages", "English", "", "English", "", "Français", "", "", "", "English", "", "", "English", "", "English", "", "English", "Workshop summary", "", "English", "English"]], "pageTitle": "Publications | Association for Progressive Communications", "title": "", "url": "http://www.apc.org/en/pubs?order=field_author_0_value&sort=desc", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00255-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 290637183, "recordOffset": 290621578, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{20167=Contact us | Editorial policy | Glossary | Association for Progressive Communications (APC) 2014 Unless otherwise stated, content on the APC website is licenced under CreativeCommons Attribution-NonCommercial-ShareAlike 3.0 Developed by GreenNet Web Projects | Design by Grupo Triton}", "lastModified": "Fri, 31 Jul 2015 07:37:34 GMT", "textBeforeTable": "Publications  - Publications Home You are here How is the internet being used to improve people's lives? APC sends you news stories, resources and info about what we are doing twice a month. Close Blog What the media says about us Press releases Press", "textAfterTable": "1 2 3 4 5 6 7 8 9 … next › last » Sign in to APC.org Log in using OpenID: What is OpenID? Username: * Password: * Log in using OpenID Cancel OpenID login", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}