{"relation": [["Title", "When the Ground Turns in its Sleep", "The Bruja’s Tale", "The Heart of the Sky", "The Long Night of White Chickens", "A Forest of Kings: The Untold Story of the Ancient Maya"], ["Author", "Sylvia Sellers Garcia", "Timothy A Madden", "Peter Canby", "Francisco Goldman", "David Freidel"]], "pageTitle": "Guatemala Tours & Travel | Intrepid Travel UK", "title": "", "url": "http://www.intrepidtravel.com/uk/guatemala", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00300-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 520681435, "recordOffset": 520622030, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{87491=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 188718=Review submitted 22 Jul 2015, 88810=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan...}", "TableContextTimeStampAfterTable": "{69635=The dry season is from October to April, and this is generally considered to be the best time to visit as the weather is warm and sunny. However, this is also the busiest time to travel so expect more people about, especially around Christmas and Easter. The wet season is from May to October. During this time, some activities and roads may be restricted; however, it usually only rains for around an hour or two in the afternoon. As this is the low season for travel, you can enjoy the sites with less people around., 79284=Gaining independence in 1821, Guatemala entered into the Mexican Empire and, for a brief period of time, also belonged to the United Provinces of Central America. By the 1900s, Guatemala had been subjected to many changes in government and power, having changed hands between a variety of dictators and insurgents via coups and civil war. Between1960 and 1996, the country endured the effects of the Guatemalan Civil War, which included genocide, economic hardship, violence and displacement. A peace process was underway by the late 1980s, but it took many years to restore democratic rule and peace to the country. More recently, Guatemala’s economy has improved, mainly due to the strength of the local agriculture and tourism industries. Although there have been improvements in the economy of the country, unfortunately many Guatemalans still live in poverty., 78465=Before the Spanish arrived, the Mayan civilisation had long inhabited Guatemala and surrounding countries. Visitors will be able to see traces of this once mighty civilisation all over the country as a remarkable amount of well-preserved ruins still exist in Guatemala. It is thought that the Mayan civilisation was already in a state of decline by the time the Spanish arrived, and between 1523 and 1524 the Mayans were defeated. A Spanish colony was soon established. The first Guatemalan capital was destroyed by an earthquake and flooding in 1542, resulting in Antigua being established as the new capital. Although later earthquakes in 1773 caused widespread damage, much of the colonial-style architecture has been preserved and can be seen if visiting today.}", "textBeforeTable": "Recommended reading Further reading To learn more or donate, go to: www.theintrepidfoundation.org Organisations and projects currently supported by The Intrepid Foundation in Guatemala include: *CasaSito provides educational opportunities in rural areas of Guatemala for children living in poverty. Guatemala has a very high level of illiteracy, particularly in rural areas which lack schools and educational resources. Our support is for their scholarship program, helping keep children in school. CasaSito The Intrepid Foundation provides travellers with an opportunity to give something back to the many wonderful communities we travel to. By donating to The Intrepid Foundation you can make a difference in local communities - in health care, education, human rights, child welfare and the protection of wildlife and the environment. The Intrepid Foundation 10. When on community visits or homestays, refrain from giving gifts or money to locals. 9. Please ask and receive permission before taking photos of people, including children. 8. Refrain from supporting businesses that exploit or abuse endangered animals. 7. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 6. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 5. When bargaining at markets, stay calm, be reasonable and keep a smile on your face. It's meant to be fun! 4. Always dispose of litter thoughtfully,", "textAfterTable": "Handy links www.lonelyplanet.com/guatemala www.worldtravelguide.net/guatemala www.visitguatemala.com × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}