{"relation": [["Title", "The Ecuador Effect", "Galapagos at the Crossroads", "The Queen of Water", "Living Poor: A Peace Corps Chronicle", "The Panama Hat Trail", "Darwin in Galapagos: Footsteps to a New World", "Galapagos"], ["Author", "David E Stuart", "Carol Ann Bassett", "Laura Resau and Maria Virginia Farinango", "Moritz Thomsen", "Tom Miller", "K Thalia Grant and Gregory C Estes", "Kurt Vonnegut"]], "pageTitle": "Ecuador Tours & Travel | Intrepid Travel NZ", "title": "", "url": "http://www.intrepidtravel.com/nz/ecuador", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00039-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 520937807, "recordOffset": 520875251, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{89019=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 87700=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 188861=Review submitted 24 Jul 2015}", "TableContextTimeStampAfterTable": "{134702=There are two seasons in Ecuador, wet and dry, and they vary depending on the region you are travelling in. For the most part, Ecuador is a sunny, warm country, and even the wet season will bring its fair share of sunny days. The best time to visit is largely dependent on your itinerary, although it should be noted that the Christmas period (December - January) is often the busiest, so be prepared for large crowds. In the Amazon, August and December through March are the driest seasons and April to June are the wettest. In the highlands, the dry season is from June to September as well as December. The Galapagos and coastal regions are mainly influenced by ocean currents. The hot and rainy season runs from January to April. It doesn't rain much, but you can expect some downpours at times. From May to December it can be a bit cooler, with more overcast days. High seasons in the Galapagos (June through August, December and January) are generally determined by holiday trends and not by weather conditions.}", "textBeforeTable": "Recommended reading Further reading To learn more or donate, go to: www.theintrepidfoundation.org This vital centre represents and protects fragile species in the Galapagos area by restoring natural environments and increasing habitats for endangered species. Conservation projects work to restore degraded areas, protect precious ecosystems and garner community involvement and support for this important part of the world. Image supplied by Jane Crouch. The Charles Darwin Foundation In Ecuador, the Intrepid Foundation proudly supports: The Intrepid Foundation provides travellers with an opportunity to give something back to the many wonderful communities we travel to. By donating to The Intrepid Foundation you can make a difference in local communities - in health care, education, human rights, child welfare and the protection of wildlife and the environment. The Intrepid Foundation 10. If travelling in the Galapagos, respect the biodiversity of this area by not removing anything from the island - except rubbish! 9. When on community visits or homestays, refrain from giving gifts or money to locals. 8. Please ask and receive permission before taking photos of people, including children. 7. Refrain from supporting businesses that exploit or abuse endangered animals. 6. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 5. Learn some local language and", "textAfterTable": "Handy links www.lonelyplanet.com/worldguide/ecuador-and-the-galapagos-islands www.worldtravelguide.net/ecuador www.ecuador.org × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}