{"relation": [["Title", "The Accidental President of Brazil", "The Brothers", "The War at the End of the World", "The Seamstress", "Gabriel, Clove and Cinnamon"], ["Author", "Fernando Henrique Cardoso", "Milton Hatoum", "Mario Vargas Llosa", "Frances De Pontes Peebles", "Jorge Amado"]], "pageTitle": "Brazil | Intrepid Travel", "title": "", "url": "http://www.intrepidtravel.com/brazil/subscriptions", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00147-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 509171691, "recordOffset": 509108688, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{165476=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 265529=Review submitted 22 Jul 2015, 164157=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o...}", "TableContextTimeStampAfterTable": "{1041=In most parts of Brazil, temperatures range from 20 to 30 degrees Celsius, regardless of the season. The summer months between December and February can be hot and humid, bringing temperatures to the high 30s – perfect weather to enjoy Brazil’s famous beaches. It’s also festival season, so it’s well worth visiting during this time. Rainfall varies greatly around Brazil so depending on where you’re travelling, you could experience some rain. Around the Pantanal, Manaus and the Amazon basin, expect patches of rain all year round. Rio and the areas around Foz de Iguacu don’t have distinct rainy seasons and are typically drier than some other areas of Brazil. The south of Brazil experiences extreme seasonal changes, so pack accordingly., 12706=Indigenous tribes inhabited Brazil for centuries before the arrival of the first European settlers from Portugal in the 1500s. Colonisation brought agriculture and crop growing to Brazil, resulting in extensive land clearing which dispossessed much of the indigenous population. The growing of sugar cane resulted in an influx of new residents, mainly slaves who brought rich African traditions with them. Remnants of this can still be seen in much of today’s music, dance and food. By the 19th century, coffee had taken the place of sugar as Brazil’s most valuable crop. The increase in coffee production brought a new wave of migrants to Brazil, mainly from Europe, and Brazil’s economy continued to flourish until the military coup of 1889., 13503=Brazil’s more recently history has also been characterised by wide spread immigration – especially during and after World War II - with large numbers of Jewish people choosing to flee persecution to live in Brazil, as well as significant numbers of people from the Middle East and other European countries. In 1989, Brazil held its first democratic election in almost 30 years after decades of military rule. More recently, a stable government has resulted in increased economic prosperity, although many of Brazil’s residents are still impoverished, living well below the poverty line.}", "textBeforeTable": "Recommended reading Further reading To learn more or donate, go to: www.theintrepidfoundation.org Working to improve the lives of the families living in the favela in the Roupa Suja neighbourhood, through education. Run by local residents, UMPMRS is providing supplementary education for the disadvantaged local children, family support, a women's group and vocational training in a challenged area of Rio. Image supplied by UMPMRS. Roupa Suja Project (UMPMRS) The Intrepid Foundation provides travellers with an opportunity to give something back to the many wonderful communities we travel to. By donating to The Intrepid Foundation you can make a difference in local communities - in health care, education, human rights, child welfare and the protection of wildlife and the environment. The Intrepid Foundation 8. When on community visits or homestays, refrain from giving gifts or money to locals. 7. Please ask and receive permission before taking photos of people, including children. 6. Refrain from supporting businesses that exploit or abuse endangered animals. 5. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 4. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 3. Always dispose of litter thoughtfully, including cigarette butts. 2. For environmental reasons, try", "textAfterTable": "Handy links www.lonelyplanet.com/brazil www.worldtravelguide.net/brazil www.braziltour.com × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}