{"relation": [["Artist", "Sonora", "Bomba Estereo", "Rye Rye f. M.I.A.", "Kalpana Patowary, Ajay Jhingran", "A R Rahman , Kash n Krissy", "Hyper Crush", "Pitbull f. Machel Montano", "Pitbull", "Manak-E", "Gupsy Aujla ft. Subaig Singh", "Rishi Rich f. Mumzy", "Surchith, Sangeetha Rajeshwaran", "Dhina", "Nina Sky", "Nina Sky", "Juakali", "Alexis y Fido feat. Daddy Yankee", "Alexis y Fido feat. Franco el Gorila", "Los Rakas", "Nadastrom f. Rye Rye", "Edu K f. Marina", "Don Omar feat. Lucenzo", "Shazalakazoo ft. Zanillya", "Bandish Projekt", "V. Naik", "Future Pilot A.K.A.", "Miku Singh & Parvez Peji N Penny Grewal", "Feroz Khan, Salim, Sarabjit Kaur, Ruby Khan & Renu", "Delhi 2 Dublin feat. Mr. Chatman"], ["Title", "Con El Combo", "Cosita Rica", "Sunshine", "Isak Se Meetha (Dhol Mix)", "Irumbile Oru Idhaiyam", "Ayo", "Alright", "Bom Bom", "Dhoor 2010 Remix", "Jatt Di Jawani", "City Guy", "Karigalan", "Dindukalu Dindukalu", "Never Look Back", "Love Song", "Bodega Real Ting", "Rescate", "Mala Conducta", "Abrazame (Uproot Andy remix)", "Shake It To La Cumbia", "me bota pra dancar (Crookers remix)", "Danza Kuduro", "Bula Bai", "Brown Skin Beauty", "guju's pyar rumours 2", "Nothing Without You (tery bina)", "Meharbania", "Balle Balle", "Raise It Up"], ["Album", "Siempre Fresco EP", "Blow Up", "Go! Pop! Bang!", "Aakrosh OST", "Endhiran OST", "", "Planet Pit", "Armando", "Dhoor", "Jatt Di Jawani", "The Streets of Bollywood 3", "Vettaikaaran OST", "Dindigul Sarathy OST", "The Other Side", "The Other Side", "Smoke Clears EP", "Perreologia", "single", "single", "Rum & Coke EP", "single", "Don Omar Presents: Meet the Orphans", "single", "single", "single", "Secrets From The Clockhouse", "Earthquake", "Mel Karade Rabba OST", "Planet Electric"], ["Label", "Bandcamp", "Nacional Records", "N.E.E.T/Interscope", "T-Series", "Think Music", "Universal Motown", "J Records", "J Records", "Speed Records", "Centresonic Sounds", "Moviebox", "Think Music", "Sun Audio", "Bandcamp", "Bandcamp", "Foreign Familiar", "", "white label", "white label", "T&A Records", "Man Recordings", "Orfanato Music Group", "Shazalakazoo", "Bheja Fry Records", "white label", "Creeping Bent", "T-Series", "Tips", "D2D"]], "pageTitle": "KBOO | Community Radio for Portland and beyond", "title": "", "url": "http://www.kboo.org/playlists/2823?page=503", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00191-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 538845807, "recordOffset": 538812391, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{94655=In the past five years he’s released over a dozen singles and EPs while touring throughout North America and Europe. He’s also remixed works by diverse artists such as Bibio, Spor, STS9, Bear In Heaven and Bar9, to name a few. Angelides also runs the Ancestor label, which issued his “Hypercolor” and “Angus Dei” singles in 2009 to positive reviews from numerous magazines, blogs and tastemakers. Ninja Tune recording artist and film composer Amon Tobin hailed his work as “some of the best production I’ve heard in recent times.”, 96058=Angelides initially made music to share with friends using a primitive Miracle instructional keyboard, a four-track recorder and a bass guitar. He used a Roland keyboard to record his first formal work, a CD titled “Machines on Task“, for a school graduation project. After high school, between 1999 and 2005, he wrote two full-length albums that he gave away at small shows. During this time he spent two years working on music in a secluded lakeside house in Connecticut. It was there that he also wrote gentler, melodic material released later under his other production alias, Welder., 96703=Delving into conspiracy theories and moved by the 9/11 attacks, his music took a darker turn. However, by 2005 he grew tired of his remote outpost and emerged to explore new environments and sounds. “The [conspiracies] were separating me from people,” he says of that period. “I wanted [people] to be motivated to come together and make change, but it had the opposite effect. I realized that music could be a tool to bring people together.”, 88693=The Great Mundane- grew up in a southeastern Michigan home where TV was made of cardboard boxes, the tree in the backyard was his best friend and the words “I am bored” were household blasphemy. Aside from occasional piano lessons, he passed time deep in his own imagination and on spontaneous road trips, a.k.a his mother’s famous mystery van rides, that seem to have provoked his current state of restlessness. Itching to hit the road, The Great Mundane left his hip-hop roots in Michigan to delve into Chicago’s house/techno scene before arriving in the Pacific Northwest. Now based in Portland, Oregon he takes listeners on a journey exploring the complexities and intricacies of his minimalist and innovative approach to beatmaking. He invents fractured, heady instrumentals laced with lush synthesizer work that navigate the terrain of forward thinking hip-hop and electro/house, all while exhibiting genuine emotion and talented production skills. Each arrangement is collaged with friends, found sounds, synthesizers, and samples meticulously programmed to convey what it might feel like to fall in love with a tree, travel through a wormhole, or to never be bored again. His debut LP “When Falls Arrive” (psymbolic) was released in 2007 exposing him as one of the top underground electronic musicians to keep an ear out for. Since, he has released “The Wires Remixes” EP (self-released, 2008), a remix of Deru’s “Peanut Butter and Patience” (Mush, 2009) and his second full length entitled “Humdrum” (RunRiotRecords, 2010). The Great Mundane’s music is featured on a long list of compilation albums including Portland’s annual “PDX Pop Now” series. Expect remixes for SPL, Lorn, KiloWatts & Bluetech as well as his next full length in May 2011 on 1320 Records., 98437=Soon after his remix of Warp’s Bibio was featured in Pitchfork, he was asked by Flying Lotus to perform at the Brainfeeder Sessions in LA alongside Nosaj Thing. Angelides has since joined forces with Amon Tobin in a collaborative music project called “Eskamon” that highlights their love of field recoding and unique take on sound manipulation. His first single on Warp entitled “Lands and Bones” featuring Swan is set for an early 2010 release on a split single with good friend EPROM., 117323=Latest newsletter: May 2015, 97644=In early 2006 he was invited to play in San Francisco. He fell in love with the area’s culture, art, music and landscape and relocated to the city soon after. He was immediately embraced by SF’s frenetic electronic producer and label community., 95345=Angelides’ performance moniker was inspired by San Francisco experimental music icons The Residents’ 1979 album “Eskimo”. Drawn to the album’s character-based stories and shamanistic themes, he dropped the title’s middle “I” and launched his Eskmo project in 1999 in his home state Connecticut. Prior to that, in the mid-90s, he was introduced to renegade funk combo Primus and UK breakbeat techno wizards The Prodigy. The music virus soon took hold. He learned to play bass and formed bands while absorbing ‘90s electronic music from Aphex Twin, Frankie Bones, 187, Dieselboy, The Chemical Brothers and Moby among others., 125746=Copyright © 2012 KBOO Community Radio | Copyright Policy | Community Guidelines | Website Illustration & Design by: KMF ILLUSTRATION, 97911=One track that caught on big in 2009 was the self-released “Hypercolor”. “I wanted to write a tune at 140 bpm,” he says of the beaming, colorful song. “I made [the beat] a triplet pattern and added some Tom Waits-y sounds to it. I wanted it to be a really big sounding track without it being an aggro tune.” The track was featured on the Mary Anne Hobbs‘ BBC Radio1 show and was presented by Bleep as one of the top 100 tracks of 2009 in their catalog., 93855=ESKMO-Brendan Angelides is a San Francisco based electronic music producer who records and performs live as Eskmo. His multi-genre compositions have been featured on influential labels like Warp Records and Planet Mu (most recently having been signed to the mighty Ninja Tune). While Angelides’ tracks encompass a wide range of electronic styles, he avoids classifications. Bleep.com described his tracks as “Masterfully produced… sophisticated, post-Dilla hip-hop funk“. His last single of 2009 entitled “Let Them Sing” on Mu was met with equal praise and described by sites like Boomkat as “[Putting] Eskmo on his own electronic plateau.”}", "lastModified": "Fri, 31 Jul 2015 08:02:09 +0000", "textBeforeTable": "10/21/2010 Air date:  Dead Flag Blues playlist for 10/21/2010 Login or register to post comments It's that time of the year when ghosties and ghoulies, witches and warlocks, zombies and princesses will be roaming the streets and demanding treats. So here's three hours of treats to get you in the mood with murder and mayhem and things things that go bump in the night. 01 Murder On The Radio - Dude Martin & His Round Up Gang 02 The Irish Ballad - Tom Lehrer 03 Country Death Song - Violent Femmes 04 Poor Ellen Smith - Neko Case 05 Murder of the Lawson Family - Dave Alvin 06 Blood On The Saddle - Tex Ritter (1945) 07 Tom Dooley - Johnny Duncan 08 Frankie And Johnny - Merle Haggard 09 Cocaine Blues - Roy Hogsed 10 Bad Man's Blunder - Kingston Trio 11 The Life & Death Of John Dillinger - Wilf Carter (aka Montana Slim) 12 Jesse James - Jimmy Driftwood 13 Tennessee Stud - Eddy Arnold", "textAfterTable": "Program name:  Ital Vibes Air date:  10/20/2010 Artist Title Album Label Nas & Damian Marley As We Enter (Kenny Meez/DJ Fashen Bam Bam Remix) Cham ft Bounty Killer & Mykal Rose Stronger Madhouse Sly & Robbie ft Lenky Dirty Taxi One Pop Reggae Taxi Bling Dawg Gangster Numbers Riddim Fat Eyes Delly Ranks Crush Dem Numbers Riddim Fat Eyes Macka Diamond Bad Bad Macka Numbers Riddim Fat Eyes Natalie Storm Anything Numbers Riddim Fat Eyes Konshens & Tifa Unda Fire Numbers Riddim Fat Eyes Tony Curtis Smoke It Up Tonight Ward 21 - The Compilation Vol 1 Ward 21 Mr Vegas ft Shaggy & Josey Wales Sweet Jamaica Clifford Ray Jah Snowcone Ital Stew Riddim Instrumental Ital Stew Riddim Jah Snowcone Tifa Sticky Sticky Ital Stew Riddim Jah Snowcone Rayvon ft C.L Cash You Look Good Ital Stew Riddim Jah Snowcone Busy Signal More Money Ital Stew Riddim Jah Snowcone DwaJay Exit 21 Riddim Instrumental Exit 21 Riddim DwaJay Leftside ft Mystic Phat Punanie Remix Keep Left", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}