{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Top songs", "Little Toy Guns", "Blown Away", "Before He Cheats", "Something in the Water", "Jesus, Take the Wheel", "See You Again", "Two Black Cadillacs", "Good Girl", "How Great Thou Art (with Vince Gill) (Live from ACM Presents: Girls' Night Out)", "All-American Girl"], ["", "", "", "", "", "", "", "", "", "", ""], ["Album", "Greatest Hits: Decade #1", "Blown Away", "Some Hearts", "Something in the Water", "Some Hearts", "Blown Away", "Blown Away", "Blown Away", "Greatest Hits: Decade #1", "Carnival Ride"], ["", "3:30", "4:00", "3:19", "3:57", "3:46", "4:06", "4:57", "3:25", "4:45", "3:32"], ["", "1 $1.29", "1 $1.29", "1 $1.29", "1 $1.29", "1 $1.29", "1 $1.29", "1 $1.29", "1 $1.29", "1 $1.29", "1 $1.29"]], "pageTitle": "Carrie Underwood - Music on Google Play", "title": "", "url": "https://play.google.com/store/music/artist/Carrie_Underwood?id=Ajta7fkh4pkupb33wwfuxha4yqy", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00291-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 887085019, "recordOffset": 887047825, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Description provided by Wikipedia under Creative Commons Attribution CC-BY-SA 4.0 Her debut album, Some Hearts, was released in 2005. Bolstered by the huge crossover success of the singles \"Jesus, Take the Wheel\" and \"Before He Cheats\", it went on to become the fastest selling debut country album in Nielsen SoundScan history, the best-selling solo female debut album in country music history and the best-selling country album of the last ten years. Underwood won three Grammy Awards for the album, including Best New Artist. Released in 2007, her second album, Carnival Ride, had one of the biggest ever opening weeks by a female artist and earned Underwood two Grammy Awards. Carrie Marie Underwood is an American singer, songwriter and actress. She rose to fame as the winner of the fourth season of American Idol in 2005. Underwood has set and broken several records throughout her career. Her achievements led her to be inducted into the Grand Ole Opry in 2008 and into the Oklahoma Music Hall of Fame in 2009. She has won a vast array of awards, including seven Grammy Awards, seventeen Billboard Music Awards, eleven Academy of Country Music Awards and eight American Music Awards, along with being nominated for a Golden Globe Award for Best Original Song. About the artist", "textAfterTable": "Albums Pre-ordered Blown Away Carrie Underwood 1 $11.99 Blown Away is the fourth studio album from American country music singer Carrie Underwood. It was released in the United States and Canada on May 1, 2012 by Arista Nashville. The album debuted at n... 1 $11.99", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}