{"relation": [["Title", "The Book of Laughter and Forgetting", "Bohemia in History", "Closely Watched Trains", "My Golden Trades", "The Engineer of Human Souls", "Sister City Silver"], ["Author", "Milan Kundera", "Mikulas Teich", "Bohumil Hrabal", "Ivan Klima", "Josef Skvorecky", "Jachym Topol"]], "pageTitle": "Czech Republic Tours & Travel | Intrepid Travel NZ", "title": "", "url": "http://www.intrepidtravel.com/nz/czech-republic", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00229-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 522613723, "recordOffset": 522554727, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{188364=Review submitted 24 Jul 2015, 683=The Czech Republic is an exquisite reflection of Europe’s cultural and architectural diversity. With over 2000 castles, keeps and ruins, it boasts one of the highest densities of architectural history in the world – so much so, Hollywood regularly rolls into town when it needs to shoot ‘Ye Olde Europe’. There's no better place to step back in time than on the cobbled streets of Prague’s Old Town, where the scent of chestnut and linden trees fills the air on a warm summer’s eve., 86320=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 87639=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan...}", "TableContextTimeStampAfterTable": "{44917=The Czech Republic enjoys a pleasant central European climate, which means the summers are hot and dry, and the winters are often a wonderland of snow-covered cobblestones. If you’re after the more balmy weather, then June through to August is perfect. Although, this is the high season for tourists, so expect to be darting between the crowds. The cooler spring months of April and May are usually sun-filled, and you’ll find the attractions less busy. For those who want to experience the quintessential ‘winter wonderland’, why not head over from December through to February - there’s even a strong chance of a white Christmas., 25303=Fortunately for those who have skipped a Eurotrip so far, 2015 is looking like the year of the shoestring.}", "textBeforeTable": "Recommended reading Further reading To learn more or donate, go to: www.theintrepidfoundation.org Based in Prague, this organisation helps children and families in crisis by providing financial help, tutoring, housing and recreation activities. Staffed mainly by volunteers and part time staff, this not-for-profit group helps marginalised people who don't receive help from the government. Image supplied by Fond Ohrozenych Deti (Fund for Children in Need). Fond Ohrozenych Deti (Fund for Children in Need) In the Czech Republic, the Intrepid Foundation proudly supports: The Intrepid Foundation provides travellers with an opportunity to give something back to the many wonderful communities we travel to. By donating to The Intrepid Foundation you can make a difference in local communities - in health care, education, human rights, child welfare and the protection of wildlife and the environment. The Intrepid Foundation 7. Please ask and receive permission before taking photos of people, including children. 6. Refrain from supporting businesses that exploit or abuse endangered animals. 5. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 4. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 3. Always dispose of litter thoughtfully, including cigarette butts. 2. For environmental reasons, try", "textAfterTable": "Handy links www.lonelyplanet.com/czech-republic www.worldtravelguide.net/czech-republic www.myczechrepublic.com × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}