{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"], ["Name", "Until Artillery", "Baba Yaga", "Onward", "The Victory of the Echo Over the Voice", "Sevastopol", "Tsars and Hussars", "Battery Smoke", "Belonging", "Pre-Munitions", "Shot and Shell", "Country of Conquest"], ["Artist", "Daedelus", "Daedelus", "Daedelus", "Daedelus", "Daedelus", "Daedelus", "Daedelus", "Daedelus", "Daedelus", "Daedelus", "Daedelus"], ["Time", "2:18", "1:33", "5:14", "2:15", "2:11", "5:00", "2:16", "3:33", "2:24", "1:52", "2:09"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - The Light Brigade by Daedelus", "title": "", "url": "https://itunes.apple.com/us/album/the-light-brigade/id908647062?app=itunes", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00128-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 878567555, "recordOffset": 878537883, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{126672=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 03:31:01 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Daedelus The Light Brigade iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from The Light Brigade by Daedelus, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "11 Songs Album Review Opening with a bit of Lord Tennyson's poem The Charge of the Light Brigade, Daedelus' 15th long-player was inspired by the Crimean War, but it doesn't evoke death, despair, or destruction. Quite the contrary, The Light Brigade is the multi-genre producer in a serene mode, employing harp, nylon-string guitars, and collaborator Young Dad's cooing vocals for a landscape that only represents the battlefield for those well into their morphine drips. \"Onward\" is what the Civil Wars would sound like if they freed themselves from songs and just went for \"feel\"; then \"The Victory of the Echo Over the Voice\" is as precious and violent as its title, which is to say \"yes\" for the first and \"no\" for the latter. \"Pre-Munitions\" is like three flamenco guitarists giggling through their instruments, while \"Baba Yaga\" comes on with the poise of a rich Windham Hill cut delivered in the new age label's prime. Laid end to end, the album offers a cool, breezy getaway to a land where one reflects on the nice bits and forgets all the rest; that's until the grave closer \"Country of Conquest\" comes on with its sobering strings and low tones. Barely any of it fits into the \"left-field hip-hop\" category, although the album carries the crate-crawler spirit of creating new moods through", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}