{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Coil", "Heir Apparent", "The Lotus Eater", "Burden", "Porcelain Heart", "Hessian Peel", "Hex Omega", "Derelict Herds", "Bridge of Sighs", "Den Standiga Resan"], ["Artist", "Opeth", "Opeth", "Opeth", "Opeth", "Opeth", "Opeth", "Opeth", "Opeth", "Opeth", "Opeth"], ["Time", "3:10", "8:50", "8:50", "7:41", "8:00", "11:25", "7:00", "6:28", "5:55", "4:09"], ["Price", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "Album Only", "1,29 €", "Album Only", "1,29 €", "1,29 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Watershed (Special Edition) by Opeth", "title": "", "url": "https://itunes.apple.com/lu/album/watershed-special-edition/id277989716", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00224-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 872420367, "recordOffset": 872392941, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{117241=Copyright © 2014 Apple Inc. Tous droits réservés., 21677=Formed: 1990 in Stockholm, Sweden}", "lastModified": "Sat, 01 Aug 2015 04:39:17 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Opeth Watershed (Special Edition) iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Watershed (Special Edition) by Opeth, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "10 Songs Album Review After album (or \"observation,\" as the band likes to call them) number eight — Ghost Reveries — Opeth could have very easily coasted, merely rehashing their sound. Instead, they opted to challenge themselves and their listeners, creating an album that can — at times — expose its true nature and scope slowly and — at other times — be jarring, as if it were turning itself inside out. Opeth take chances that many bands in the same situation would be too scared to have a go at. It's hard to say if the recent membership changes affected bandleader Mikael Åkerfeldt's writing and production, or if he was enjoying his trip down classic rock (see: Deep Purple) lane. For whatever reason, Watershed is a new benchmark for Opeth. The tricky part is pointing out that while Watershed is a fantastic record, one that takes chances while remaining totally metal (dude), it feels less like a complete statement than a preview for something even greater. After the pastoral introduction of \"Coil,\" Opeth move into pummeling mode with \"Heir Apparent.\" It's one of the few tracks here to feature growling death metal vocals. But it is track three where Opeth really take the listener by the ear and twist. There's a gently humming prologue, then \"The Lotus Eater\" becomes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}