{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"], ["Name", "Faded", "Dissidence", "Fall to Me", "A Drug for All Seasons", "Bleeding", "What I Am", "Dying On the Vine", "Hold Me Down", "Defacing", "X'd Out", "Look You In the Eyes", "Forte Sonata"], ["Artist", "F5", "F5", "F5", "F5", "F5", "F5", "F5", "F5", "F5", "F5", "F5", "F5"], ["Time", "3:13", "2:32", "3:33", "2:31", "3:25", "3:48", "3:08", "3:02", "2:29", "2:36", "4:47", "1:15"], ["Price", "€0.99", "€0.99", "€0.99", "€0.99", "€0.99", "€0.99", "€0.99", "€0.99", "€0.99", "€0.99", "€0.99", "€0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - A Drug for All Seasons by F5", "title": "", "url": "https://itunes.apple.com/ie/album/a-drug-for-all-seasons/id119184072?i=119183481", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00212-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 877607735, "recordOffset": 877578658, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{119781=Shop at the Apple Online Store, call 1800 92 38 98 or find a retailer., 120639=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 07:45:42 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist F5 A Drug for All Seasons iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from A Drug for All Seasons by F5, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes", "textAfterTable": "12 Songs Album Review After a messy split with longtime musical partner Dave Mustaine in Megadeth, bassist Dave Ellefson wasted little time getting his next project a float: F5. In this day and age, most heavy metal bands would like you to believe that they are happy to simply bash away at their instruments 24/7, with their Marshalls cranked up to 11. So it's a bit refreshing to read F5's press release, in which the quintet is honest about its game plan from here on out: \"To be heavy, but always melodic.\" And that's a very fitting description of F5's full-length debut, A Drug for All Seasons. Singer Dale Steele (the most fitting name for a metal singer ever?) has no problem handling the musical curveballs that Ellefson and the other instrumentalists throw his way. But an oddly chosen cover — the hippie anthem \"What I Am\" by Edie Brickell & New Bohemians — will undoubtedly confuse the metalhead following F5 inherited from Ellefson's Megadeth days. But the original material works much better, as evidenced by such standouts as the title track (which sounds quite a bit like John Bush-era Anthrax) and \"Dying on the Vine.\" Certainly not Peace Sells...but Who's Buying, Pt. 2, but that's precisely what Ellefson did not want to do with his new band.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}