{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Emperor March", "Escapade", "Blue Lace", "I Guess I'll Hang My Tears Out to Dry", "For Miles", "Work", "Fire & Ice", "Who Knew?", "Dance of the Infidels", "Klimo"], ["Album", "Resilience", "Resilience", "Resilience", "Resilience", "Resilience", "Resilience", "Resilience", "Resilience", "Resilience", "Resilience"], ["Time", "7:22", "6:50", "5:17", "6:27", "5:15", "6:12", "5:31", "3:51", "4:06", "9:54"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Resilience by Tim Mayer", "title": "", "url": "https://itunes.apple.com/us/album/work/id491395153?i=491395934&ign-mpt=uo%3D4", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00101-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 880018327, "recordOffset": 879989565, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{18960=There's a lot to like about tenor saxophonist Tim Mayer's recording debut as a leader. First of all, he's got solid chops on tenor sax and yet has no intention of hogging the spotlight. Secondly, he put himself in good hands by getting together with veteran producer John Lee (and the young but extremely talented co-producer Michael Dease, who also made musical contributions). Also, he has a top-shelf rhythm section anchored by veteran pianist George Cables, with bassist Dezron Douglas and Willie Jones III. The guests are a mix of young and old players, all first-call musicians: trumpeters Claudio Roditi, Greg Gisbert, and the promising Dominick Farinacci, Michael Dease (a killer trombonist, composer, and arranger), guitarist Mark Whitfield, and flutist Don Braden. To top things off, Mayer chose a terrific mix of overlooked gems by jazz greats, along with newer compositions. Mayer's hard blowing in Kenny Dorham's \"Escapade\" invites comparisons to Dexter Gordon, with Gisbert providing an excellent foil for the leader. Bud Powell's \"Dance of the Infidels\" (incorrectly attributed to Fats Navarro, who did record it) isn't an obscurity by any means, but Mayer's interpretation shines, with his robust tenor sharing the spotlight with Cables, bass trombonist Robert Edwards, and Douglas. On Lee Morgan's punchy \"Blue Lace,\" which deserves wider recognition, Mayer and company deliver potent ensemble work and powerful solos. Charles Tolliver's \"Emperor March\" is a recent work, the title track of Tolliver's 2009 live CD, which featured Michael Dease as part of the big band. Mayer's conception is scaled down for ten pieces, but he delivers an intense performance while sharing space with Gisbert. Dease contributed \"For Miles,\" a peppy opener based on the changes to an easily recognized standard; Mayer explodes out of the gate with a strong showing, then Dease demonstrates on trombone why he has been so in demand as a trombonist for session work since he arrived in New York City. Mayer's intricate bop cooker finds him playing in unison with guitarist Mark Whitfield with nary a misstep by either player, though Whitfield steals the show with his fine solo. Tim Mayer obviously did his homework long before walking into the studio to record his rewarding debut CD., 113045=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 04:33:46 GMT", "textBeforeTable": "View In iTunes Resilience 1. Top Albums and Songs by Tim Mayer Chops like Scott hamilton by Band singer           Tim mayer Customer Reviews There's a lot to like about tenor saxophonist Tim Mayer's recording debut as a leader. First of all, he's got solid chops on tenor sax and yet has no intention of hogging the spotlight. Secondly, he put himself in good hands by getting together with veteran producer John Lee (and the young but extremely talented co-producer Michael Dease, who also made musical contributions). Also, he has a top-shelf rhythm section anchored by veteran pianist George Cables, with bassist Dezron Douglas and Willie Jones III. The guests are a mix of young and old", "textAfterTable": "Listeners Also Bought Gettin' It Done Steve Davis View In iTunes Dease Bones Michael Dease View In iTunes Unanimous Ulysses Owens Jr. View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}