{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"], ["Name", "Even a Gray Day", "I Give You the Morning", "The Love of Loving You", "When Annie Took Me Home", "Dance in the Shadows", "Annie's Going to Sing Her Song", "Corrymeela", "Outward Bound", "Wish I Had a Troubador", "Hold On to Me, Babe", "The Last Thing On My Mind"], ["Artist", "Tom Paxton", "Tom Paxton", "Tom Paxton", "Tom Paxton", "Tom Paxton", "Tom Paxton", "Tom Paxton", "Tom Paxton", "Tom Paxton", "Tom Paxton", "Tom Paxton"], ["Time", "3:02", "2:54", "3:12", "2:54", "3:21", "2:58", "4:55", "3:17", "3:10", "3:43", "3:34"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Even a Gray Day by Tom Paxton", "title": "", "url": "https://itunes.apple.com/si/album/even-a-gray-day/id2566836?i=2566814", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00322-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 875096247, "recordOffset": 875068161, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{120110=Copyright © 2014 Apple Inc. All rights reserved., 22217=Born: 31 October 1937 in Chicago, IL}", "lastModified": "Sat, 01 Aug 2015 04:23:59 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Tom Paxton Even a Gray Day iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Even a Gray Day by Tom Paxton, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes", "textAfterTable": "11 Songs Album Review Even a Gray Day captures Tom Paxton in a perfect setting, with the simple accompaniment of his own guitar, the acoustic stringed instruments of David Bromberg, and vocal harmonies from Anne Hills-Burda and Peggy Compton. On this collection, Paxton foregoes topical satire for the timeless beauty of some of his finest ballads, with the primary subject matter being romantic love and the complexities thereof. There are newly recorded classics from the Paxton catalog, like \"I Give You the Morning,\" \"Outward Bound,\" \"Dance in the Shadows,\" and the oft-recorded \"The Last Thing on My Mind.\" There are also new compositions, including the title track. Because the emphasis here is on his serious, thoughtful side, Even a Gray Day is one of Tom Paxton's most enduring, endlessly enjoyable recordings. Biography Born: 31 October 1937 in Chicago, IL Genre: Singer/Songwriter Years Active: '60s, '70s, '80s, '90s, '00s, '10s Tom Paxton proved to be one of the most durable of the singer/songwriters to emerge from the Greenwich Village folk revival scene of the early '60s. In some ways, he had more in common with the late-'50s generation of folksingers such as Dave Van Ronk (who was 16 months his senior) and even older performers", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}