{"relation": [["Rank", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Title", "The Hobbit", "Catching Fire", "Life of Pi", "Fifty Shades of Grey", "All In: The Education of General David Petraeus", "Cloud Atlas", "Mockingjay", "Gone Girl", "The Racketeer", "The Elf on the Shelf: A Christmas Tradition"], ["Author", "J. R. R. Tolkien", "Suzanne Collins", "Yann Martel", "E.L. James", "Paula Broadwell", "David Mitchell", "Suzanne Collins", "Gillian Flynn", "John Grisham", "Carol V. Aebersold, Chanda B. Bell"], ["Scale*", "10", "7", "5", "3", "2", "2", "2", "1", "1", "1"], ["Male", "42%", "23", "39", "21", "51", "46", "29", "41", "53", "14"], ["Female", "58%", "77", "61", "79", "49", "54", "71", "59", "47", "86"]], "pageTitle": "‘The Hobbit’ Tops in Social Media", "title": "", "url": "http://publishersweekly.com/pw/print/20121203/54974-the-hobbit-tops-in-social-media.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00280-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 198918900, "recordOffset": 198902506, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{35374=Call: 1-800-278-2991 (US) or 1-818-487-2069 (Outside US/Canada) 5 a.m. - 5 p.m. Mon-Fri (Pacific), 10297=The books drawing the most interest on social media in November were mostly tied to movies, according to CoverCake, whose analytical tools track what is trending on various social media platforms. One major exception, however was Paula Broadwell’s All In: The Education of General David Petraeus, the book that played a major role in forcing Petraeus to resign as director of the CIA. Covercake’s Jeff Costello noted that almost all the comments about All In were compressed to the one week after Petraeus’s affair with Broadwell became public., 11605=Fifty Shades Darker, which drew the sixth most comments in October, was replaced by the first book in the series, Fifty Shades of Grey, which took fourth place and had a much larger percentage of male followers than Darker, which had only 5% of comments from men in October. Despite the lack of a movie connection, Gone Girl remained a popular topic in November, dropping just one place from October and drawing a fair number of comments from men. New to the list was the Christmas favorite, The Elf on the Shelf., 12150=Covercake's Top 10 Books in Social Media, November 2012, 9174=Volume 259 Issue 49 12/03/2012}", "textBeforeTable": "Covercake's Top 10 Books in Social Media, November 2012 Fifty Shades Darker, which drew the sixth most comments in October, was replaced by the first book in the series, Fifty Shades of Grey, which took fourth place and had a much larger percentage of male followers than Darker, which had only 5% of comments from men in October. Despite the lack of a movie connection, Gone Girl remained a popular topic in November, dropping just one place from October and drawing a fair number of comments from men. New to the list was the Christmas favorite, The Elf on the Shelf. That is not the case with The Hobbit. Comments about The Hobbit are “astronomical,” Costello said, and the CoverCake team predicts interest in The Hobbit will run well into December, with the movie set to appear in theaters December 14. With the rise of The Hobbit, October’s most discussed book, Catching Fire, fell to #2 on the CoverCake chart. Helped by the November release of the film, Life of Pi landed at #3 last month on the CoverCake list. The books drawing the most interest on social media in November were mostly tied to movies, according to CoverCake, whose analytical tools track what is trending on various social media platforms. One major exception, however was Paula Broadwell’s All In: The Education of General David Petraeus, the book that played", "textAfterTable": "*How many conversations took place for every 10 comments about book #1 TOC ADVERTISEMENT About Us | Contact Us | Submission Guidelines | Subscriber Services | Advertising", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}