{"relation": [["Title", "Alcohol guidelines to reduce the lifetime health risks from drinking alcohol", "Australian guidelines to reduce health risks from drinking alcohol", "Australian guidelines to reduce health risks from drinking alcohol: from research to practice", "Information for health professionals on assessing alcohol consumption in pregnancy using AUDIT-C", "Making sense of Australia's alcohol guidelines", "Measuring alcohol risk in the 2010 National Drug Strategy Household Survey: implementation of the 2009 Alcohol Guidelines", "Tucker talks tips: healthy drinking guidelines"], ["Year", "2011", "2009", "2009", "2014", "2009", "2011", "2011"], ["Author", "Aboriginal Drug and Alcohol Council", "National Health and Medical Research Council", "McClean, R.", "Australian Department of Health", "Roche, A.M.", "Australian Institute of Health and Welfare", "Victorian Aboriginal Community Controlled Health Organisation"], ["Type", "Report", "Report", "Journal article", "Leaflet", "Factsheet", "Report", "Leaflet"]], "pageTitle": "Drinking guidelines « Health Practice resources « Alcohol « AOD Knowledge Centre « Australian Indigenous Alcohol and Other Drugs Knowledge Centre", "title": "", "url": "http://www.aodknowledgecentre.net.au/aodkc/alcohol/health-practice-resources/drinking-guidelines", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00195-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 295475347, "recordOffset": 295459420, "tableOrientation": "HORIZONTAL", "textBeforeTable": "If you have information you would like to have included on this page please contact us. When you click on one of the headings of the table, the list will be sorted according to that heading. For more information about the resource, click on the title. Drinking guidelines » Drinking guidelines » Health Practice resources » Alcohol Home Print News Funding Conferences, workshops and events Job opportunities Courses Workforce Organisations", "textAfterTable": "  Last updated: 11 June 2015   Return to top Contribute Share your information » Give us feedback »   Australian Indigenous Alcohol and Other Drugs, Kurongkurl Katitjin, Centre of Indigenous Australian Studies, Edith Cowan University Edith Cowan University 2 Bradford Street Mt Lawley, WA 6050 +61 8 9370 6336 aodknowledgecentre@healthinfonet.org.au © 2001-2015 Australian Indigenous HealthInfoNet - Disclaimer Stay connected AOD Yarning Place Follow us on Twitter Help A to Z index", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}