{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13"], ["Name", "ExplicitWe Cry", "Before the Worst", "Talk You Down", "The Man Who Can't Be Moved", "Breakeven", "Rusty Halo", "The End Where I Begin", "ExplicitFall for Anything", "If You See Kay", "I'm Yours", "Before the Worst (Live At Shepherds Bush Empire)", "Talk You Down (Live At Shepherds Bush Empire)", "VideoWe Cry"], ["Artist", "The Script", "The Script", "The Script", "The Script", "The Script", "The Script", "The Script", "The Script", "The Script", "The Script", "The Script", "The Script", "The Script"], ["Time", "3:43", "3:23", "3:50", "4:01", "4:21", "3:34", "3:34", "4:32", "3:12", "4:13", "4:37", "3:56", "3:41"], ["Price", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£1.89"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - The Script by The Script", "title": "", "url": "https://itunes.apple.com/gb/album/breakeven/id286710969?i=286710975&affToken=Heart_Miscellaneous&ign-mpt=uo%3D4", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00243-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 889077939, "recordOffset": 889052174, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{28238=Brilliant. I watched them live in march when they were surporting The Hoosiers in Bornemouth and was instantly hooked. The Script are my favourite band. This album is well worth buying!! =] The Man Who Can't Be Moved and The End Where I Begin are my favourite song of the album., 28726=Formed: 2001 in Dublin, Ireland, 129873=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 05:03:15 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist The Script The Script iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from The Script by The Script, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "13 Items Editors’ Notes The Script's roots lay in dear old Dublin, but there's more than a touch Los Angeles sheen to the songs that populate the band’s self-titled debut. It's no casual observation. Members Danny O'Donoghue and Mark Sheehan spent time in the City of Angels working the production and engineering angle for American pop dynamos such as Teddy Riley, the Neptunes, and Rodney Jerkins. When the duo reconvened with drummer Glen Power back home, the Script was born. The resulting burst of creativity brought out singles such as \"We Cry\" and \"The Man Who Can't Be Moved\" — smooth soul numbers with rock overtones that brought the group near-instant success. The full-length debut has all the hallmarks of immediately accessible, soul-injected rock with glimmers of R&B that has made powerful forces out of bands like OneRepublic and Maroon 5. Customer Reviews The wait is finally over!           by Lottie. I've been waiting for this album to come out for months, and believe me it doesn't disappoint! Apart from the two main hit singles, The Man Who Can't Be Moved and We Cry, The Script's album is full of", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}