{"relation": [["Author", "Al-Mansi Qindeel, Muhammad", "Ez Eldin, Mansoura", "Jabir, Rabee", "Khal, Abdo", "Madhoun, Raba’i", "Naji, Jamal"], ["Title", "A Cloudy Day on the West Side", "Beyond Paradise", "America", "She Throws Sparks", "The Lady from Tel Aviv", "When the Wolves Grow Old"], ["Publisher", "Dar Al-Shorouk", "Dar Al-Ain", "Al-Markaz al-Thaqafi al-Arabi (Arab Cultural Centre)", "Al-Jamal Publications", "Arab Institute for Publishing and Studies", "Ministry of Culture Publications"], ["Nationality", "Egyptian", "Egyptian", "Lebanese", "Saudi Arabian", "Palestinian", "Jordanian"]], "pageTitle": "Arab News Blog » THE INTERNATIONAL PRIZE FOR ARABIC FICTION 2010", "title": "", "url": "http://www.arabnewsblog.net/2009/12/16/the-international-prize-for-arabic-fiction-2010/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00014-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 292902971, "recordOffset": 292886577, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{19199=Ministry of Culture Publications, Amman, 2009, 9687=The 2010 prize received 115 eligible submissions from 17 Arab countries – Egypt, Syria, Lebanon, Jordan, Palestine, Iraq, UAE, Kuwait, Saudi Arabia, Yemen, Bahrain, Oman, Morocco, Libya, Sudan, Tunisia and Algeria – and the longlist of 16 titles was announced this November., 15631=Lebanese novelist and journalist born Rabee Jabir was born in Beirut in 1972. He has been editor of Afaq, the weekly cultural supplement of Al-Hayat newspaper, since 2001. His first novel, Master of Darkness, won the Critics Choice Prize in 1992. He has since written 16 novels, including: Black Tea; The Last House; Yousif Al-Inglizi; The Journey of the Granadan (published in German in 2005) and Berytus: A City Beneath the Earth (published in French by Gallimard in 2009)., 14764=Al-Markaz al-Thaqafi al-Arabi (Arab Cultural Centre), Morocco and Lebanon, 2009, 16883=Abdo Khal is a Saudi novelist born in al-Majanah, southern Saudi Arabia, in 1962. He studied political science at King Abdel Al Aziz University in Jeddah before starting writing in 1980. He is the author of several works, including: A dialogue at the Gates of the Earth, There’s Nothing to be Happy About, and Cities Eating the Grass. Some of his works have been translated into English, French and German. In addition to his writing, he is a member of the board of directors of the Jeddah Literary Club and the editor-in-chief of the Ukaz newspaper, for which he writes a daily column., 11314=Dar Al-Shorouk, Cairo, 2009, 12101=Egyptian novelist Muhammad Al-Mansi Qindeel was born in 1946 in the Egyptian delta city of al-Mahalla al-Kubra, where his father was a worker. His first novel, Breaking of the Spirit, was inspired by events surrounding workers’ unrest in the city. A medical school graduate, he worked as a doctor in the countryside before dedicating himself to writing. He currently lives in Kuwait, where he works as an editor for monthly magazine Al-Arabi. He has won two awards for his writing, the State Incentive Award in 1988 and the Sawiris Foundation Award in 2006. He has published several novels, short story collections and children’s books and his novel Moon over Samarkand has been published in English by the American University in Cairo Press., 12997=Al-Ain Publishing, Egypt, 2009, 3632=MUHAMMAD AL-MANSI QINDEEL, MANSOURA EZ ELDIN, RABEE JABIR, ABDO KHAL, RABA’I MADHOUN and JAMAL NAJI are today, Tuesday 15 December, named as the six finalists shortlisted for the International Prize for Arabic Fiction 2010 (IPAF), the prestigious literary award celebrating the very best of contemporary Arabic fiction., 19978=Jamal Naji is a Jordanian writer of Palestinian descent, born in the ‘Aqbat Jaber refugee camp, Jericho (Ariha) in 1954. He began writing in 1975 and his published works include: The Road to Balharith, Time, The Remnants of the Last Storms, Life on the Edge of Death, The Night of the Feathers, What Happened Thursday and The Target.  He was president of the Jordanian Writers Association from 2001-2003 and he currently works as head of the Intelligentsia Centre for Research and Survey in Amman, Jordan., 18403=Palestinian writer Raba’i Madhoun was born in al-Majdal, Ashkelon, Israel, in 1945. Along with his parents, he was uprooted from his homeland during the 1948 Nakba exodus and as a consequence his childhood was spent in the Khan Younis Palestinian refugee camp situated in the Gaza Strip. He studied at Alexandria University, Egypt, and since 1973 has worked as a journalist. His written works include the short story collection, The Idiot of Khan Younis, an academic study (The Palestinian Intifada) and his autobiography, The Taste of Separation. He currently works as an editor for Al-Sharq Al-Awsat newspaper in London., 3984=The shortlist of finalists was announced by Taleb Alrefai, Chair of Judges for the 2010 prize, at a press conference at the Beirut International Book Fair in Lebanon., 16304=Al-Jamal Publications, Baghdad/Beirut, 2009, 17673=Arab Institute for Publishing and Studies, Beirut, 2009, 3174=ARABIC FICTION 2010, 13773=Egyptian novelist and journalist Mansoura Ez Eldin was born in Delta Egypt in 1976. She studied journalism at the Faculty of Media, Cairo University and has since published short stories in various newspapers and magazines: she published her first collection of short stories, Shaken Light, in 2001. This was followed by two novels, Maryam’s Maze in 2004 and Beyond Paradise in 2009. Her work has been translated into a number of languages, including an English translation of Maryam’s Maze by the American University in Cairo (AUC) Press. This year, she was selected for the Beirut39, as one of the 39 best Arab authors below the age of 40. She was also a participant of the inaugural nadwa (writers’ workshop) held by the International Prize for Arabic Fiction in Abu Dhabi this November., 10946=The winner of the International Prize for Arabic Fiction 2010 will be announced at an awards ceremony in Abu Dhabi on Tuesday 2 March 2010, the first day of the Abu Dhabi International Book Fair., 27004=After that there was a discussion about the situation of authors in Egypt, here’s the video to the reading and discussion, it’s in Arabic: http://etalks.tv/blog/2010/10/18/blickwechsel/}", "textBeforeTable": "The six books, selected from a longlist of 16, are (in alphabetical order): The shortlist of finalists was announced by Taleb Alrefai, Chair of Judges for the 2010 prize, at a press conference at the Beirut International Book Fair in Lebanon. MUHAMMAD AL-MANSI QINDEEL, MANSOURA EZ ELDIN, RABEE JABIR, ABDO KHAL, RABA’I MADHOUN and JAMAL NAJI are today, Tuesday 15 December, named as the six finalists shortlisted for the International Prize for Arabic Fiction 2010 (IPAF), the prestigious literary award celebrating the very best of contemporary Arabic fiction. www.arabicfiction.org Shortlist Announced ARABIC FICTION 2010 THE INTERNATIONAL PRIZE FOR Arab News December 16th, 2009 THE INTERNATIONAL PRIZE FOR ARABIC FICTION 2010 Arab Stories > THE INTERNATIONAL PRIZE FOR ARABIC FICTION 2010 Home > //]]> } } return false; if(searchtxt.value == \"\" || searchtxt.value == tiptext) { searchbtn.onclick = function(e) { } } searchtxt.value = tiptext; searchtxt.className += \" searchtip\"; if(searchtxt.value == \"\") { searchtxt.onblur = function(e) { } } searchtxt.className = searchtxt.className.replace(\" searchtip\", \"\"); searchtxt.value = \"\"; if(searchtxt.value == tiptext) { searchtxt.onfocus = function(e) { } searchtxt.value = tiptext; searchtxt.className += \"", "textAfterTable": "Chair of Judges Taleb Alrefai commented on the shortlist of finalists: “A democratic, objective discussion was held, the most important target of which was to reach a list approved by the judging panel. The selected books represent the opinion of the panel, with due respect to and appreciation of all the longlisted novels.” The panel of five judges were also revealed today. All specialists in the field of Arabic literature, they come from Kuwait, Egypt, Tunisia, France and Oman. They are: Taleb Alrefai (Chair of Judges), Kuwaiti novelist and short story writer; Shereen Abu El Naga, Egyptian lecturer of English and comparative literature at Cairo University; Raja’ Ben Salamah, Tunisian lecturer from the Faculty of Letters, Arts and Humanities at Manouba University, Tunisia; Frédéric LaGrange, French academic, translator and Head of the Arabic and Hebraic Department at the Paris-Sorbonne (Paris IV); Saif al-Rahbi, Omani writer and poet. The prestigious literary prize, now in its third year, aims to recognise and reward excellence in contemporary Arabic creative writing and to encourage wider readership of such Arabic literature internationally through translation. It is run with the support of the Emirates Foundation and the Booker Prize Foundation. At today’s press conference Jonathan Taylor, Chair of the Board of Trustees, said: “IPAF is increasingly regarded as the leading prize in the Arab literary world. Its impact is indisputable, with its winners and shortlisted writers recognised as some of the most significant voices in contemporary Arabic literature – many of whom are", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}