{"relation": [["TITLE", "Syrians vote and since they didn't vote for The CIA's Al CIA Duh Candidate The CIA is mad", "wow, things sure do change", "Eyeballs have mainly moved to \"Social Media\""], ["AUTHOR", "Syria votes and CIA Al CIA Duh are mad", "PrionPartyy", "nobody"], ["DATE", "Wednesday, Jun. 04, 2014 at 6:15 PM", "Saturday, Jun. 07, 2014 at 11:06 PM", "Wednesday, Jun. 18, 2014 at 9:56 PM"]], "pageTitle": "Syrians Vote : LA IMC", "title": "", "url": "http://la.indymedia.org/news/2014/06/264476.php", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00143-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 140491671, "recordOffset": 140478743, "tableOrientation": "VERTICAL", "TableContextTimeStampAfterTable": "{43643=NUCLEAR SHUTDOWN NEWS JULY 2015 J27 4:54PM, 38393=Latest Black Flag Newsletter Available J20 8:05PM, 42049=United Nations Votes for Global Bankruptcy Principles J28 11:37AM, 39338=Storm of Swords hack telecharger gratuit [Gems and Gold] cheats Android iOS J29 7:46PM, 44418=War of Empires The Mist Hack iOS Android Cheats J27 1:44PM, 43402=Balkanizing Syria Planned J28 4:01AM, 46311=Saudis Keep Bombing Yemen After Declaring 5-Day Halt J27 6:36AM, 46579=Cleveland Police Attack Black Activists J27 3:36AM, 46044=The Incorruptibles cheats hack mod [GOLD/MANA/GEMS] J27 7:25AM, 43142=Tormenting Greece is about sending a message J28 5:16AM, 40461=US Wants Enhanced UN Peacekeepers Serving Its Interests J29 11:51AM, 43890=4Story M Flying Dragon Arrows Hack iOS Android Cheats J27 1:46PM, 41524=Illegitimate Show Trial Sentences Gaddafi's Son to Death J28 12:15PM, 40733=Russia to Veto UN Resolution for US-Controlled MH17 Tribunal J29 10:57AM, 42319=Greece demonstrate J28 10:28AM, 39629=Pool Star Hack adder unlimited Dollars and Energy cheats Android iOS J29 7:17PM, 42860=Hezbollah's Nasrallah Urges Resistance Against Israeli Lawlessness J28 7:00AM, 42554=Craigslist foot sucker stabs feet takes foot print and places at crime scenes, wofford hei J28 7:44AM, 41273=Another US Jail Cell Death Sentence J29 3:46AM, 38938=12 Peoples Of Rain To the People of California J16 3:36PM, 44157=Kayle League Of Legends Hack iOS Android Cheats J27 1:45PM, 44932=Anti-fascist and anarchist from Russia needs help and solidarity J27 11:17AM, 45741=CFPB Fines Predatory Student Lending Practices; Religious Organizations Pray for Relief J27 9:40AM, 40202=Deer Hunter 2016 Hack - Unlimited Gold Cash J29 2:16PM, 39913=[NEW] Magerealm Rise of Chaos hack cheats [Diamonds and Gold] Android iOS J29 7:00PM, 45467=Bring Me Home Retro Future hack cheats telecharger {CHIPS} J27 9:51AM, 44679=Troika Bandits Want More from Greece J27 11:37AM, 41010=Israel Bombs Syria During Large-Scale War Games J29 6:51AM, 41797=Another Jail Cell Murder in America J28 11:52AM, 45213=Assad Vows to Defend Syria's Homeland J27 11:16AM, 38645=Why The Actual Artists Keep Fleeing What Once Was The Los Angeles Arts District J16 4:15PM}", "lastModified": "Mon, 20 Oct 2014 22:48:26 GMT", "textBeforeTable": "LATEST COMMENTS ABOUT THIS ARTICLE Listed below are the 10 latest comments of 3 posted about this article. These comments are anonymously submitted by the website visitors. add your comments Google+FacebookTwitterShare on , , : qcOfftopic(264476); qcDouble(264476); qcSpam(264476); qcAd(264476); qcHate(264476); qcFraud(264476); qcBestOf(264476);", "textAfterTable": "Local News Latest Black Flag Newsletter Available J20 8:05PM Why The Actual Artists Keep Fleeing What Once Was The Los Angeles Arts District J16 4:15PM 12 Peoples Of Rain To the People of California J16 3:36PM More Local News... Other/Breaking News Storm of Swords hack telecharger gratuit [Gems and Gold] cheats Android iOS J29 7:46PM Pool Star Hack adder unlimited Dollars and Energy cheats Android iOS J29 7:17PM [NEW] Magerealm Rise of Chaos hack cheats [Diamonds and Gold] Android iOS J29 7:00PM Deer Hunter 2016 Hack - Unlimited Gold Cash J29 2:16PM US Wants Enhanced UN Peacekeepers Serving Its Interests J29 11:51AM Russia to Veto UN Resolution for US-Controlled MH17 Tribunal J29 10:57AM Israel Bombs Syria During Large-Scale War Games J29 6:51AM Another US Jail Cell Death Sentence J29 3:46AM", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}