{"relation": [["#", "1", "2", "3", "4", "5", "6", "7", "8"], ["Book", "Anne of Green Gables", "Anne of Avonlea", "Anne of the Island", "Anne of Windy Poplars", "Anne's House of Dreams", "Anne of Ingleside", "Rainbow Valley", "Rilla of Ingleside"], ["Date published", "1908", "1909", "1915", "1936", "1917", "1939", "1919", "1921"], ["Anne Shirley's age", "11 —16", "16 —18", "18 —22", "22 —25", "25 —27", "34 —40", "41", "49 — 53"]], "pageTitle": "Anne's House of Dreams - Wikipedia, the free encyclopedia", "title": "Lucy Maud Montgomery's books on Anne Shirley", "url": "https://en.wikipedia.org/wiki/Anne%27s_House_of_Dreams", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00202-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 858502281, "recordOffset": 858485887, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{2042=Anne's House of Dreams is a novel by Canadian author Lucy Maud Montgomery. It was first published in 1917 by McClelland, Goodchild and Stewart.}", "lastModified": "Tue, 21 Jul 2015 16:28:32 GMT", "textBeforeTable": "Montgomery continued the story of Anne Shirley in a series of sequels. They are listed in the order of Anne's age in each novel. Series[edit] Susan Owen Ford Leslie Moore Miss Cornelia Bryant James Boyd ('Captain Jim') Gilbert Blythe Anne Shirley/Blythe Characters[edit] This book introduces Susan Baker, the elderly spinster who is the Blythes' maid-of-all-work. At the end of the book, Owen Ford's book is published, and Captain Jim dies with a smile on his face after reading his advance copy. Miss Cornelia, thought to be a confirmed spinster, announces that she has decided to marry Marshall Elliott, who may be a Grit but at least is a Presbyterian; she says she could have had him at any time but refused to marry him until he shaved his beard off, which he had refused to do for twenty years until the Grits came into power. Finally, Anne, Gilbert, Jem and their new housekeeper, Susan Baker, move to the old Morgan house in the Glen, later to be named Ingleside. Anne is greatly saddened to leave the House of Dreams, but knows that the little house is outgrown and Gilbert's work as a doctor requires him to live closer to town. Leslie, abruptly set free by this news, returns home, and considers taking a nursing course to get on with her life. Owen Ford returns to the Island", "textAfterTable": "Related books in which Anne Shirley plays a lesser part # Book Date published Anne Shirley's age — Chronicles of Avonlea 1912 — — Further Chronicles of Avonlea 1920 — — The Blythes Are Quoted 2009 — External links[edit] Wikisource has original text related to this article: Anne's House of Dreams L.M. Montgomery Online Formerly the L.M. Montgomery Research Group, this site includes a blog, extensive lists of primary and secondary materials, detailed information about Montgomery's publishing history, and a filmography of screen adaptations of Montgomery texts. See, in particular, the page about Anne's House of Dreams. The L.M. Montgomery Literary Society This site includes information about Montgomery's works and life and research from the newsletter, The Shining Scroll.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}