{"relation": [["Title", "Hearing Birds Fly: A Nomadic Year in Mongolia", "Modern Mongolia: From Khans to Commissars to Capitalists", "Mongolia: Travels in an Untamed Land", "When Things Get Dark: A Mongolian Winter's Tale", "Wild East: Travels in the New Mongolia", "Genghis Khan and the Making of the Modern World"], ["Author", "Louisa Waugh", "Morris Rossabi", "Jasper Becker", "Matthew Davis", "Jill Lawless", "Jack Weatherford"]], "pageTitle": "Mongolia | Intrepid Travel", "title": "", "url": "http://www.intrepidtravel.com/Mongolia/culture-geography-history-show-me", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00069-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 519746755, "recordOffset": 519685009, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{228630=Review submitted 23 Jul 2015, 127344=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 128663=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan...}", "TableContextTimeStampAfterTable": "{10717=Modern Mongolia is an interesting mix of Mongol, Chinese and Russian influences. Rising up to gain independence from decades of communist rule, modern Mongolia is becoming more fast-paced and globalised as the years go by. Holding its first democratic election in 1990, Mongolia now enjoys a time of relative peace and stability, with tourism, agriculture and mineral resources providing more abundance and improvements in infrastructure and living conditions., 10029=The area now known as Mongolia has been inhabited for more than 800,000 years. Archaeological evidence, such as rock paintings, points to groups of hunters and gatherers living throughout Mongolia in prehistoric times. Mongolia’s early history is coloured by battles and invasions, with various nomadic empires laying claim to the land. The most famous of these was the Mongol Empire, created by Genghis Khan in 1206. This empire was known as the largest land-based empire of its time and had great success invading and claiming foreign territory, before declining due to infighting, disunity and the rise of neighbouring territories., 966=Mongolia has an extreme continental climate due to its inland location. The best time for travelling is from May to October when the weather is pleasant. Due to the popularity of the Naadam Festival, July is the busiest time to go; it can get crowded, but Ulaanbaatar buzzes with an incredible vibe during this time. The wet season is from July to August and although it rains frequently during this time, the rain turns the countryside into a pleasant shade of green. It can get extremely cold from June to October, with snowstorms sometimes grounding flights and bringing transport systems to a halt.}", "textBeforeTable": "Recommended reading Further reading To learn more or donate, go to: www.theintrepidfoundation.org Providing much-needed shelter, education, food and health care to many homeless and orphaned Mongolian children, this centre, which is located just outside of Ulaanbaatar, receives no government funding and relies solely on grants and donations to continue providing this essential service. Image supplied by Lotus Children’s Centre. Lotus Children’s Centre In Mongolia, The Intrepid Foundation proudly supports: The Intrepid Foundation provides travellers with an opportunity to give something back to the many wonderful communities we travel to. By donating to The Intrepid Foundation you can make a difference in local communities - in health care, education, human rights, child welfare and the protection of wildlife and the environment. The Intrepid Foundation 12. Be respectful of monks, this includes refraining from taking photos of them. Women should also avoid touching or handing items directly to monks. 11. When on community visits or homestays, refrain from giving gifts or money to locals. 10. Please ask and receive permission before taking photos of people, including children. 9. Refrain from supporting businesses that exploit or abuse endangered animals. 8. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 7. Learn some local language and don't be", "textAfterTable": "Handy links www.lonelyplanet.com/mongolia www.worldtravelguide.net/mongolia www.mongoliatourism.gov.mn × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea,", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}