{"relation": [["Author", "GintokisGirl95", "P0isonIvy543", "pengli", "GintokisGirl95", "StayInYourLane", "StayInYourLane", "GintokisGirl95", "AdnarimSmada", "GintokisGirl95", "AgentKilljoy"], ["Message", "Does Anyone Get Tired of My Chemical Romance?...I don't know. I've just never liked the band, no offense to anyone that is a fan....but it's like every time I want to take a peek at the newer stories, My Chemical Romance is everywhere! Does anyone write original stories anymore, or is this site dominated by MCR people? Posted at 2011-08-02 19:50", "I never liked them, either. What's with all the fanfics about this band, anyway? Posted at 2011-08-03 13:19", "I absolutely love the series True Blood!I absolutely love the series True Blood! [url=http://www.hotdvdorder.com/true-blood-seasons-13-dvd-boxset-p-1099.html]True blood DVD[/url]Of course, I am a big fan of books as well. I saw several places that the series of books varies too, but it is in the TV series of its people do not need to be accurate books. My husband and I are dependent on the series. [url=http://www.hotdvdorder.com/house-md-seasons-16-dvd-boxset-p-821.html]House MD DVD[/url]We can not watch it on HBO so we had to wait until the second season was released. We have seen the entire season with a Saturday night. [url=http://www.hotdvdorder.com/two-and-a-half-men-seasons-17-dvd-boxset-p-787.html]Two and a Half Men DVD[/url]When we put the final disc, I was sad that I had only two episodes left. [url=http://www.hotdvdorder.com/cold-case-seasons-17-dvd-boxset-p-1060.html]Cold Case DVD[/url]I can not wait for the next! Posted at 2011-08-03 22:30", "@P0isonIvy543 I don't know. I'm a bit new here, but it's just that I get tired of the MCR New Stories that are basically about the same story line. I guess it's just us....I'm not sure lol Posted at 2011-08-05 15:49", "MCR sucks ass. I get tired of those assholes updating the same shitty crap over and over and over...I don't like MCR, plain and simple....my sis annoys me with the 'OMG MCR\" They're all about Frerards anyway. Posted at 2011-08-10 12:52", "They get more reviews than any writer I've seen before, too. All the good ones are unrated and get no reviews while the My Chemical Romance people get EVERY REVIEW UNDER THE SUN! Posted at 2011-08-10 12:53", "@StayInYourLane Whoa! I don't mean for all of the hate, it was just a simple question. It shouldn't really matter who likes what and what likes who, because we all have different choices as far as music goes; no need to be so hateful towards those of the MCRmy...I was just curious to whether people get tired of the band/writing stories of them. Sorry if you got the wrong idea of my question. Posted at 2011-08-11 15:37", "To answer your question, I'd imagine if you like the band, you wouldn't get tired of writing about them and if you do, you move on to another subject. Granted, people do tend to write the same plot line over and over again and it gets annoying. The ones that are truly original, are underated or not rated at all just like writing in every other category on the website. I don't just write for MCR by the way, I am working on a novel in my spare time that I hope to publish later on. I am a fan though and I thought you might want one of our perspectives on this, I'm not here to pick a fight with anyone here. By the way, if you guys don't like the band, don't go in the section. No one is forcing you to read the stuff. -Adnarim Smada Posted at 2011-08-12 5:51", "@AdnarimSmada I would never go into that section; if anything, I'd be flooding the Led Zeppelin with serious slashy stuff :S I'm not here to pick a fight, either; it's just that, in the 'Recent Stories' section, there happens to always be something dealing with the band or other. I'm not worried about anyone being known as a 'band fan' or whatever, like I stated before, I am curious to see whether anyone gets tired of updating the same thing. I don't read the stuff. I'm just curious, like I said. Thanks for you reply. --Taylor Posted at 2011-08-12 10:00", "When you like something you update it. The band is red hot from the new album and they are still in the whole guitar and go for your dreams thing. They inspire people so it is easier for some people to write about them cause they have more meaning to some people than others. I am a fan. And yes it can get annoying cause it's all Ferard or Waycest but some people want to express them selves. Its lie going and saying there to many led Zeppelin or The Used. Everyone likes something and right now MCR has new things coming out, Give it a year and it will die down. No need to be hating or calling the ass wholes. The people being is an ass whole is you the haters. Not talking about you GintokisGirl95. Talking about haters in general who don;t know shit about music if you need to judge others tastes. If you don't like them get the fuck off the page and go listen to the shit you listen to. The MCRmy are not judging crap others listen to, so we would like the same respect. Posted at 2011-09-09 19:00"]], "pageTitle": "FicWad: fresh-picked original and fan fiction", "title": "", "url": "http://ficwad.com/forum/topic/2241", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00307-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 87524965, "recordOffset": 87516763, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{8032=Site design Copyright 2005, K&D Lynch. All stories contained in this archive are the property of their respective authors, and the owners of this site claim no responsibility for their contents., 8254=Page created in 0.2423 seconds}", "textBeforeTable": "» 3 2 1 « Home > The Melting Pot > Does Anyone Get Tired of My Chemical Romance? Lost password Register Log in Remember me Log in ▼ Sign up to adjust the filter You won't see stories with a lower score when you browse or search. Filter Filter: 0 Help Forum Search Browse FicWad", "textAfterTable": "« 1 2 3 » Site design Copyright 2005, K&D Lynch. All stories contained in this archive are the property of their respective authors, and the owners of this site claim no responsibility for their contents. Page created in 0.2423 seconds", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}