{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15"], ["Name", "São Gonça (Ao Vivo)", "Problema Sócial (Ao Vivo)", "Zé do Caroço (Ao Vivo)", "Carolina (Ao Vivo)", "Comparsas / O Pequenez e o Pit Bull (Ao Vivo)", "Tanta Saudade (Ao Vivo)", "É Issó Aí (The Blower's Daughter) [Ao Vivo]", "Prá Rua Me Levar (Ao Vivo)", "Chatterton (Ao Vivo)", "Beatriz (Ao Vivo)", "Brasil Corrupção (Unimultiplicidade) [Ao Vivo]", "Mais Que Issó (Ao Vivo)", "Garganta (Ao Vivo)", "Vestido Estampado (Ao Vivo)", "O Beat da Beata (Ao Vivo)"], ["Artist", "Seu Jorge", "Seu Jorge", "Seu Jorge", "Seu Jorge", "Ana Carolina & Seu Jorge", "Ana Carolina & Seu Jorge", "Ana Carolina & Seu Jorge", "Ana Carolina & Seu Jorge", "Ana Carolina & Seu Jorge", "Ana Carolina", "Ana Carolina", "Ana Carolina", "Ana Carolina", "Ana Carolina", "Ana Carolina & Seu Jorge"], ["Time", "4:57", "4:13", "4:11", "4:48", "4:57", "3:22", "5:17", "3:41", "4:22", "6:40", "2:50", "2:28", "4:19", "3:51", "5:33"], ["Price", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Ana e Jorge (Ao Vivo) by Ana Carolina & Seu Jorge", "title": "", "url": "https://itunes.apple.com/no/album/pra-rua-me-levar-ao-vivo/id366503289?i=366503592", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00040-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 877535855, "recordOffset": 877508120, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{29046=This is a live recording from a show by Seu Jorge and Ana Carolina in São Paulo in August 2005. Jorge and Carolina are two of the most successful artists who appeared on the Brazilian popular music scene during the first years of the new millennium. The concert was largely acoustic, with rather sparse musical arrangements. This creates a more intimate atmosphere as Carolina and Jorge perform songs from their respective solo careers. Jorge's \"Beat da Beata,\" as the song title suggests, has a stronger and fuller beat than the other songs. \"É Isso Aí\" is a version of Damien Rice's \"Blower's Daughter,\" written by Carolina. ~ Philip Jandocvský, Rovi, 130705=Copyright © 2014 Apple Inc. Alle rettigheter forbeholdes.}", "lastModified": "Fri, 31 Jul 2015 08:42:25 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Ana Carolina & Seu Jorge Ana e Jorge (Ao Vivo) iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Ana e Jorge (Ao Vivo) by Ana Carolina & Seu Jorge, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes", "textAfterTable": "15 Songs Album Review This is a live recording from a show by Seu Jorge and Ana Carolina in São Paulo in August 2005. Jorge and Carolina are two of the most successful artists who appeared on the Brazilian popular music scene during the first years of the new millennium. The concert was largely acoustic, with rather sparse musical arrangements. This creates a more intimate atmosphere as Carolina and Jorge perform songs from their respective solo careers. Jorge's \"Beat da Beata,\" as the song title suggests, has a stronger and fuller beat than the other songs. \"É Isso Aí\" is a version of Damien Rice's \"Blower's Daughter,\" written by Carolina. ~ Philip Jandocvský, Rovi Biography Genre: MPB Years Active: '90s, '00s Owner of a distinctively deep tone, singer/songwriter Ana Carolina began as a singer in little bars in her native Juiz de Fora. Her early theater performances were produced by singer/actress Zezé Motta. In 1999, Ana Carolina released her first CD, which had the hit \"Garganta\" (written for her by Totonho Villeroy) and her pop/rock/blues renditions... Full bio Top Albums and Songs by Ana Carolina", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}