{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Saturday Night", "Seven Years", "Flex of Green", "Einstein of Love", "Stella, Please", "Giantess", "Wheels On Fire", "Hope Springs Eternal", "Forbidden Intruder", "Snake Bite"], ["Artist", "Giantess", "Giantess", "Giantess", "Giantess", "Giantess", "Giantess", "Giantess", "Giantess", "Giantess", "Giantess"], ["Time", "3:28", "2:24", "3:55", "4:54", "3:32", "7:09", "3:51", "3:39", "3:15", "3:46"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Giantess by Giantess", "title": "", "url": "https://itunes.apple.com/mt/album/forbidden-intruder/id261188814?i=261189901", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00183-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 860495767, "recordOffset": 860469045, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{108197=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 03:55:40 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Giantess Giantess iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Giantess by Giantess, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "10 Songs Album Review Growing out of bandleader Stephen Wood's work leading the Battles — and handily avoiding confusion with the other, increasingly more-well-known Battles on Touch and Go — Giantess' self-titled debut features Wood and companions creating an amiable collection of garagey songs both hyperactive and reflective. Wood's approach is loving but a bit hampered by its formalism — much of it feels like the '80s indie rock that in itself was a tribute to '60s rock & roll, and while sound and approach is as sound and approach does, there's almost nothing on the album that hasn't been heard before by any number of bands. As a result, it's the details more than the songs which stand out on Giantess, though often those details are killer, like the stop-start ending and keyboard sparkle on the opening \"Saturday Night,\" a deft shift to Velvets/Modern Lovers-style chug halfway through the winning \"Flex of Green.\" (\"Wheels on Fire\" — not the Dylan song — does an even better job with that approach; a whole album in that vein might well have been a good path to try.) \"Einstein of Love\" stands out as the highlight, a slow, heartfelt number with some lovely guitar performances throughout, including a stellar concluding solo. Otherwise, what Giantess feels like in the end is a celebration", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}