{"relation": [["Rank", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Album", "Forgiveness Rock Record", "Teen Dream", "Halcyon Digest", "Gemini", "Swim", "Forget", "Before Today", "Color Your Life", "The Suburbs", "High Violet"], ["Artist", "Broken Social Scene", "Beach House", "Deerhunter", "Wild Nothing", "Caribou", "Twin Shadow", "Ariel Pink’s Haunted Graffiti", "Twin Sister", "Arcade Fire", "The National"], ["Label", "Arts & Crafts", "Sub Pop", "4AD", "Captured Tracks", "Merge", "Terrible", "4AD", "Infinite Best", "Merge", "4AD"]], "pageTitle": "2010 Top Ten List Spotlight: DJ Tim", "title": "", "url": "http://blog.kexp.org/2010/12/28/2010-top-ten-list-spotlight-dj-tim/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00049-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 27551635, "recordOffset": 27532448, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{835=When it comes to albums released in 2010, you’d be hard-pressed to find anyone who’s pored over them more intensely than a KEXP DJ. So, what were their favorites? Which CDs did they reach for the most, or, uh, “click on” the most in their iTunes players? Find out as KEXP looks at each DJ’s list through the month of December, leading up to our 2010 Top 90.3 Countdown, as voted on by YOU, the KEXP listener, airing Monday, January 3rd., 61=DJ Tim’s 2010 Top Ten Albums}", "TableContextTimeStampAfterTable": "{4267=The fact that nobody at KEXP has the best record of 2010 listed means that nobody has heard the best record of 2010. That record is ‘White Magick Summer’ by The Velcro Lewis Group.}", "textBeforeTable": "DJ Tim’s 2010 Top Ten Albums photo by Chona Kasinger When it comes to albums released in 2010, you’d be hard-pressed to find anyone who’s pored over them more intensely than a KEXP DJ. So, what were their favorites? Which CDs did they reach for the most, or, uh, “click on” the most in their iTunes players? Find out as KEXP looks at each DJ’s list through the month of December, leading up to our 2010 Top 90.3 Countdown, as voted on by YOU, the KEXP listener, airing Monday, January 3rd. December 28, 2010 Published: | Janice Headley By 2010 Top Ten List Spotlight: DJ Tim Scribes Sounding Off: Vintage Violence » « Song of the Day: Keep Shelly in Athens – Running Out of You googletag.cmd.push(function() { googletag.display('div-gpt-ad-1351061405777-0'); });", "textAfterTable": "DJ Tim is on the air Wednesday mornings from 1-6AM. This entry was posted in 2010 Countdown, KEXP. Bookmark the permalink. Post a comment or leave a trackback: Trackback URL. « Song of the Day: Keep Shelly in Athens – Running Out of You Scribes Sounding Off: Vintage Violence » 2 Comments Herb Garcia Posted December 29, 2010 at 11:08 am | Permalink The fact that nobody at KEXP has the best record of 2010 listed means that nobody has heard the best record of 2010. That record is ‘White Magick Summer’ by The Velcro Lewis Group. jessica Posted December 29, 2010 at 3:13 pm | Permalink", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}