{"relation": [["Title", "Like Water for Chocolate", "Oh Mexico!", "Mexico: Biography of Power", "First Stop in the New World", "Rain of Gold"], ["Author", "Laura Esquivel", "Lucy Neville", "Enrique Krauze", "David Lida", "Victor E Villasenor"]], "pageTitle": "Mexico | Intrepid Travel", "title": "", "url": "http://www.intrepidtravel.com/Mexico/expressblog", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00265-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 525034875, "recordOffset": 524967745, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{85399=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 187230=Review submitted 24 Jul 2015, 86718=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan...}", "TableContextTimeStampAfterTable": "{97195=People have been living in Mexico for more than 13,000 years. Mesoamericans occupied the area early on, with archaeological evidence pointing towards Mesoamericans leading a hunter-gatherer existence. Maize farming is thought to have become commonplace by 1500 BC, which led to the farming of other commodities as well. A variety of cultures contributed to the early history of Mexico, with the Olmec, Toltec, Maya, Teotihuacan and Aztecs all bringing unique cultural, religious and artistic styles to the region, with the Mayan and Aztec Empires having the greatest (and most enduring) impact on the region. Mayan society can be traced back to 300 BC, while the Aztecs enjoyed prosperity from 1325 to around 1521 AD. Many ancient ruins and constructions from these periods are still standing all throughout Mexico, and can be visited and viewed today. By the 16th century, the Spanish had arrived in Mexico and what followed was a period of colonialism that lasted nearly 300 years. During this time, Mexico was seen as a part of ‘New Spain’ along with Cuba and Puerto Rico. This was not a particularly good time for Mexicans who (under colonial law) were generally not allowed to travel outside of Mexico and were denied access to education. Mexico achieved independence from the Spaniards after the War of Independence (1810-1821) but peace was short lived as two decades later the Mexican-American War brought more confrontation and armed conflict to parts of Mexico., 98748=Mexico’s Revolution of 1910 - 1921 was a period of instability, marked by political turmoil and bloodshed. More recently, Mexico has enjoyed an economic resurgence after decades of economic hardship, which lasted from the 1970s to the mid 1990s. The earthquake of 1985 didn’t help matters, with wide-scale damage and loss of life compounding the economic problems and political uncertainty of Mexico. Currently, Mexico is benefiting from a period of improved economic conditions, although the gap between the wages earned by Mexicans and their northern neighbours continues to widen. Mexico is now operating in a free market economy and the growth of tourism, agriculture and industry has ensured an improved economy for the country, although financial inequality still exists within., 89121=Mexico is generally most pleasant in the cool, dry season between September and June. July and August can be very hot and humid, but perfect for swimming, snorkelling and lazing on the beach. It is, however, the busiest months for travel as this is the time of the North American school holidays. Highland areas such as Chiapas and Oaxaca tend to be cooler year round, with cold nights.}", "textBeforeTable": "Recommended reading Further reading 9. When on community visits or homestays, refrain from giving gifts or money to locals. 8. Please ask and receive permission before taking photos of people, including children. 7. Refrain from supporting businesses that exploit or abuse endangered animals. 6. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 5. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 4. When bargaining at markets, stay calm, be reasonable and keep a smile on your face. It's meant to be fun! 3. Always dispose of litter thoughtfully, including cigarette butts. 2. For environmental reasons, try to avoid buying bottled water. Fill a reusable water bottle or canteen with filtered water instead. 1. Be considerate of Mexico’s customs, traditions, religion and culture. Top responsible travel tips for Mexico Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this in mind while travelling. Mexico Travel Tips Responsible Travel also provides useful", "textAfterTable": "Handy links www.lonelyplanet.com/mexico www.worldtravelguide.net/mexico www.visitmexico.com × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}