{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", ""], ["Name", "Don't Believe In Love", "Quiet Times", "Never Want to Say It's Love", "Grafton Street", "It Comes and It Goes", "Look No Further", "Us 2 Little Gods", "The Day Before the Day", "Let's Do the Things We Normally Do", "Burnin Love", "Northern Skies", "For One Day", "Summer", "Northern Skies (Remix)", "VideoDon't Believe In Love (Short Film Version)", "BookletDigital Booklet - Safe Trip Home"], ["Artist", "Dido", "Dido", "Dido", "Dido", "Dido", "Dido", "Dido", "Dido", "Dido", "Dido", "Dido", "Dido", "Dido", "Dido", "Dido", "Dido"], ["Time", "3:52", "3:17", "3:35", "5:57", "3:27", "3:13", "4:49", "4:13", "4:09", "4:11", "8:55", "5:41", "3:52", "5:53", "4:35", "--"], ["Price", "$1.29", "$1.29", "$0.99", "$1.29", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "Album Only", "Album Only", "Album Only", "$1.99", "Album Only"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Safe Trip Home (Deluxe Version) by Dido", "title": "", "url": "https://itunes.apple.com/us/album/dont-believe-in-love/id296017286?i=296017287&ign-mpt=uo%3D4", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00238-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 888664411, "recordOffset": 888637871, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{33626=Born: December 25, 1971 in Kensington, London, England, 133738=Copyright © 2014 Apple Inc. All rights reserved., 28225=This English chanteuse takes her time and immerses herself in placid, soothing soundscapes that compliment her smooth, pretty voice to the point where you might miss the emotional insecurities that run just beneath the surface. On just her third solo album since her 1999 debut, Dido continues her streak of attractive adult-contemporary pop. “Don’t Believe In Love” and “Never Want to Say It’s Love” use Jon Brion’s creamy keyboards and steadying production hand to hide the tough questions facing lovers at any point of introspection. Brian Eno adds his extra flourishes to “Grafton Street,” a six-minute ethereal moan through flute-inspired fields of remorse. Mick Fleetwood, Citizen Cope and Questlove from the Roots make cameo appearances that strengthen the tunes in subtle ways. But it’s still Dido’s show. It’s her melancholy that shadows the sweet melodies of “It Comes and It Goes” and “Northern Skies” and paces the slow mourn of the piano ballad “Look No Further.”  “Us 2 Little Gods” adds an extra skip-step for balance, while “Let’s Do the Things We Normally Do” pushes through with a nightclub ambience, but it’s only a diversion from the ominous clouds that circle her existence.}", "lastModified": "Sat, 01 Aug 2015 04:42:07 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Dido Safe Trip Home (Deluxe Version) iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Safe Trip Home (Deluxe Version) by Dido, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "16 Items Editors’ Notes This English chanteuse takes her time and immerses herself in placid, soothing soundscapes that compliment her smooth, pretty voice to the point where you might miss the emotional insecurities that run just beneath the surface. On just her third solo album since her 1999 debut, Dido continues her streak of attractive adult-contemporary pop. “Don’t Believe In Love” and “Never Want to Say It’s Love” use Jon Brion’s creamy keyboards and steadying production hand to hide the tough questions facing lovers at any point of introspection. Brian Eno adds his extra flourishes to “Grafton Street,” a six-minute ethereal moan through flute-inspired fields of remorse. Mick Fleetwood, Citizen Cope and Questlove from the Roots make cameo appearances that strengthen the tunes in subtle ways. But it’s still Dido’s show. It’s her melancholy that shadows the sweet melodies of “It Comes and It Goes” and “Northern Skies” and paces the slow mourn of the piano ballad “Look No Further.”  “Us 2 Little Gods” adds an extra skip-step for balance, while “Let’s Do the Things We Normally Do” pushes through with a nightclub ambience, but it’s only a diversion from the ominous clouds that circle her existence. Customer Reviews Beautifully Written  ", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}