{"relation": [["", "", "", "", "", "", "", "", "", "", "", "", ">>", "", "", "", "", "", "", "", ""], ["", "1.", "2.", "3.", "5.", "6.", "7.", "15.", "16.", "18.", "19.", "20.", "4.", "8.", "9.", "12.", "13.", "14.", "17.", "10.", "11."], ["Date", "Nov 7, 10:54", "Nov 7, 11:50", "Nov 7, 12:21", "Nov 7, 13:37", "Nov 7, 14:14", "Nov 7, 14:32", "Nov 7, 18:43", "Nov 7, 18:52", "Nov 7, 19:11", "Nov 7, 20:14", "Nov 8, 05:25", "Nov 7, 12:52", "Nov 7, 15:17", "Nov 7, 15:40", "Nov 7, 17:09", "Nov 7, 18:26", "Nov 7, 18:40", "Nov 7, 18:57", "Nov 7, 16:09", "Nov 7, 16:35"], ["Subject", "No subject", "Re: No subject", "Re: No subject", "Re: No subject", "Re: No subject", "Re: No subject", "Re: No subject", "Re: No subject", "Re: No subject", "Re: No subject", "Re: No subject", "Re: No subject", "No subject", "Unreal 3", "Re: Unreal 3", "Re: Unreal 3", "Re: Unreal 3", "Re: Unreal 3", "No subject", "Re: No subject"], ["Author", "Elf Shot The Food", "Fion", "Undead Scottsman", "Masa", "Bhruic", "Lorcin", "Riley Pizt", "Elf Shot The Food", "Riley Pizt", "Lorcin", "Carver", "Choachy", "FourPak", "Cheese", "Squirmer", "Elf Shot The Food", "Riley Pizt", "Squirmer", "Retired", "Elf Shot The Food"]], "pageTitle": "Ships Ahoy - RoboBlitz - Blue's News Comments", "title": "", "url": "http://www.bluesnews.com/cgi-bin/board.pl?action=viewthread&boardid=1&threadid=72619&id=352590&view=threads", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 20, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00291-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 324605903, "recordOffset": 324591777, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{46005=News CGI copyright © 1999-2015 James \"furn\" Furness & Blue's News. All rights reserved., 16339=Los Angeles -- Nov. 06, 2006 - Naked Sky Entertainment, an independent game development studio specializing in physics driven games for the PC and next-gen consoles, launched the worldwide PC version of RoboBlitz, the first Unreal Engine 3 game to market. RoboBlitz is a humorous single-player action, platformer full of inventive gizmos, weapons and characters. Players take on the role of Blitz, a multi-talented robot who must activate an aging space cannon to save his world from a band of maladjusted space pirates. Set in seven distinct environments, RoboBlitz features 19 levels of puzzle-solving and high-intensity action. The unique, physics-driven gameplay in RoboBlitz empowers players to use creative solutions in a world rife with emergent behaviors. \"In the past, games have been limited to hand-animation driven gameplay where the players' actions are bound by the designer's own imagination. With physics, the only limitations are rules based on the game world,\" said Joshua Glazer, Chief Technology Officer, Naked Sky Entertainment, Inc. \"In our game, almost every puzzle can be solved in multiple ways. If the player comes up with a solution for which we didn't plan, it will still work because everything is driven by physics.\" To support the modding community, the PC release will include the same custom build of the Unreal Engine 3 Editor that the Naked Sky team uses in-house. RoboBlitz will be available in 8 languages: English, Chinese, French, German, Italian, Japanese, Korean, and Spanish. RoboBlitz is rated E10+ (Everyone Ages 10+) by the ESRB. At launch, the game will be available for download through the RoboBlitz website www.roboblitz.com, Valve's Steam platform at www.steamgames.com, www.LiquidGeneration.com and www.DISCoverMyGames.com for $14.99. A free three-level trial version of RoboBlitz will also be available. The Xbox 360 version of RoboBlitz will launch later this year on the Xbox Live Arcade. For more information on RoboBlitz, please visit www.roboblitz.com., 46208=Chatbear v1.4.0/blue++: Page generated 30 July 2015, 00:22. Chatbear Announcements., 44090=Copyright © 1996-2015 Stephen Heaslip. All rights reserved. All trademarks are properties of their respective owners.}", "textBeforeTable": "Los Angeles -- Nov. 06, 2006 - Naked Sky Entertainment, an independent game development studio specializing in physics driven games for the PC and next-gen consoles, launched the worldwide PC version of RoboBlitz, the first Unreal Engine 3 game to market. RoboBlitz is a humorous single-player action, platformer full of inventive gizmos, weapons and characters. Players take on the role of Blitz, a multi-talented robot who must activate an aging space cannon to save his world from a band of maladjusted space pirates. Set in seven distinct environments, RoboBlitz features 19 levels of puzzle-solving and high-intensity action. The unique, physics-driven gameplay in RoboBlitz empowers players to use creative solutions in a world rife with emergent behaviors. \"In the past, games have been limited to hand-animation driven gameplay where the players' actions are bound by the designer's own imagination. With physics, the only limitations are rules based on the game world,\" said Joshua Glazer, Chief Technology Officer, Naked Sky Entertainment, Inc. \"In our game, almost every puzzle can be solved in multiple ways. If the player comes up with a solution for which we didn't plan, it will still work because everything is driven by physics.\" To support the modding community, the PC release will include the same custom build of the Unreal Engine 3 Editor that the Naked Sky team uses in-house.", "textAfterTable": "18. Nov 7, 19:11        Re: No subject Riley Pizt   19. Nov 7, 20:14         Re: No subject Lorcin   20. Nov 8, 05:25     Re: No subject Carver >> 4. Nov 7, 12:52  Re: No subject Choachy   8. Nov 7, 15:17 No subject FourPak   9. Nov 7, 15:40 Unreal 3 Cheese   12.", "hasKeyColumn": true, "keyColumnIndex": 3, "headerRowIndex": 0}