{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Manteca (Funky Lowlives Remix)", "A Night In Tunisia", "On the Sunny Side of the Street", "Exactly Like You", "A Night In Tunisia", "Mayflower Rock (Master Take)", "Salt Peanuts", "A Night In Tunisia", "Salt Peanuts", "Manteca"], ["Album", "Verve Remixed 2", "Bebop Professor", "Sonny Side Up", "Dizzy: The Music of John Birks Gillespie", "Night In Tunisia: The Very Best of Dizzy Gillespie", "Birks Works: The Verve Big-Band Sessions", "Groovin' High", "Birks Works: The Verve Big-Band Sessions", "Odyssey 1945-1952", "Greatest Hits"], ["Time", "6:45", "3:04", "5:40", "4:57", "3:07", "3:13", "3:16", "5:34", "3:18", "3:06"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$1.29", "$0.99", "$1.29", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Jazz in Paris: The Giant by Dizzy Gillespie", "title": "", "url": "https://itunes.apple.com/WebObjects/MZStore.woa/wa/viewAlbum?playListId=104301", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00000-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 877187695, "recordOffset": 877160862, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{113480=Copyright © 2014 Apple Inc. All rights reserved., 9774=This 1973 Paris studio session first appeared on the European label America as The Giant, but there has been some confusion as various combinations of songs have appeared under the same album title with Dizzy Gillespie's name over the years. Although rather brief in length with just five tracks and clocking in at under 34 minutes, this lively date has some strengths. The trumpeter turns over the solo spotlight to the extraordinary bassist Niels Pedersen and pianist Kenny Drew, prior to featuring himself in brief spurts with drum breaks by Kenny Clarke. Pedersen's fine arco technique introduces the brief ballad \"I Waited for You,\" in which Gillespie is clearly at the top of his game. His muted horn saunters over Clarke's crisp brushwork during \"Girl of My Dreams,\" although the overlong Latin original \"Fiesta Mojo\" quickly grows tiresome, in spite of a guest appearance by tenor saxophonist Johnny Griffin. Drew contributed the lush ballad \"Serenity,\" which closes the CD. It's obvious that Dizzy Gillespie's chops are just starting to slip at this point in his career, but fans of his work will want to pick up this enjoyable reissue, as Gillespie at 90 percent is far more listenable than many well-known trumpeters at 100 percent., 11178=Born: October 21, 1917 in Cheraw, SC}", "lastModified": "Sat, 01 Aug 2015 03:36:13 GMT", "textBeforeTable": "View In iTunes The Quintet: Jazz At Massey Hall (Live) 5. View In iTunes The Complete RCA Victor Recordings: Dizzy Gillespie (1994 Remastered) 4. View In iTunes Tijuana Moods 3.", "textAfterTable": "Listeners Also Bought Roy and Diz Dizzy Gillespie & Roy Eldridge View In iTunes Afro-Cuban Jazz Moods Dizzy Gillespie & Machito View In iTunes Paris blues Raquel Bitton View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}