{"relation": [["Title", "Bilingual Hotline Opens For Immigrant Children", "Tucson Heroin Bust Worth $7.5 Million", "Close Calls: Hikers Survive Grand Canyon Rock Slide", "Why Long Hours Are Good For Young Docs", "Smokejumpers Create Generations Of Brotherhood", "Activist: Dead MCSO Deputy Wanted To Be Whistleblower", "DOJ Will Provide Legal Aid To Child Migrants", "Helping Kids Avoid Summer Brain Drain", "Power Outage Creates Delays At Phoenix Sky Harbor Airport", "Police Bust Phoenix Motel For Drugs, Guns", "Bark Beetles Targeted For Wildfire Control", "Arizona Well Represented In National Geography Bee", "Three Killed As Interstate 17 Snarled By Two Accidents", "A Top VA Official Resigns Following Health Care Scandal", "Sky Harbor Hits Passenger Record", "The Hidden Value Of Donated Junk", "10 Intel Workers Exposed In Ammonia Spill", "Westminster College Pulls Out Of Mesa", "Another Arizona College Student Killed By Fall From Building", "More Custom Agents To Be Hired At Arizona Ports Of Entry", "Prescott Plans For One Year Anniversary Of Yarnell Hill Fire", "$25 Corn Dog Debuts At Chase Field", "U of A Moves MBA Students To Downtown Phoenix", "In-Flight Emergency Calls Land In Phoenix", "BLM Looking For Burro Birth Control"], ["Author", "Peter O'Dowd", "Peter O'Dowd", "Laurel Morales", "", "Monica Ortiz Uribe", "Jude Joffe-Block", "Peter O'Dowd", "Peter O'Dowd", "Peter O'Dowd", "Sarah Ventre", "Peter O'Dowd", "Peter O'Dowd", "Peter O'Dowd", "Peter O'Dowd", "Peter O'Dowd", "Peter O'Dowd", "Peter O'Dowd", "Peter O'Dowd", "Peter O'Dowd", "Peter O'Dowd", "Peter O'Dowd", "Peter O'Dowd", "Peter O'Dowd", "Peter O'Dowd", "Peter O'Dowd"], ["Publication Date", "June 19, 2014", "June 17, 2014", "June 16, 2014", "June 13, 2014", "June 13, 2014", "June 13, 2014", "June 06, 2014", "May 26, 2014", "May 22, 2014", "May 21, 2014", "May 21, 2014", "May 19, 2014", "May 16, 2014", "May 16, 2014", "May 12, 2014", "May 06, 2014", "May 05, 2014", "April 22, 2014", "April 04, 2014", "April 01, 2014", "March 28, 2014", "March 28, 2014", "March 20, 2014", "March 14, 2014", "March 12, 2014"]], "pageTitle": "| KJZZ", "title": "", "url": "http://kjzz.org/staff/%2012", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00236-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 131368540, "recordOffset": 131347892, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{2735=O’Dowd grew up in Phoenix and graduated from Brophy College Prep in 1999.  He then attended Georgetown University to pursue an undergraduate degree in English. With diploma in hand, O’Dowd decided to teach English in the suburbs of Tokyo, Japan. Looking back, he notes, “It was the most thrilling year of my life.” It was also one that eventually sparked an interest in serving as an international journalist. , 1135=In 2007, O’Dowd moved to Wyoming to report on classic Western issues like oil, coal and wolves  for Wyoming Public Radio and realized he had found his niche. , 4101=O'Dowd, who oversees all daily editorial direction of the KJZZ newsroom, took on the role of news director in February 2011, after serving as an assignment editor and reporter for the station since 2009., 3536=Covering Arizona SB 1070 news has been one of the most exciting highlights in his career. Determined to provide KJZZ listeners with as many perspectives as possible, O’Dowd followed boycotters representing both sides, met with Latinos who favored the bill, visited churches that opposed it and spent months trying to find sources willing to talk about employers who knowingly hire illegal immigrants., 3045=O’Dowd was part of a KJZZ team that won a 2011 Edward R. Murrow Award for continuing coverage of SB 1070. He has also received Associated Press awards for news writing and several Public Radio News Director Inc. awards.}", "lastModified": "Sat, 01 Aug 2015 04:03:23 GMT", "textBeforeTable": "  Contact Peter O’Dowd at 480-774-8463, podowd@rioradio.org or by way of Twitter @odowdpeter. “I believe public radio journalism is the most compelling of any medium. When I’m reporting a story for the radio, I look for emotion in my interviews. Over the radio, grief and anger, fear and embarrassment can be felt in a way that is mostly absent from print journalism.” In 2007, O’Dowd moved to Wyoming to report on classic Western issues like oil, coal and wolves  for Wyoming Public Radio and realized he had found his niche.  “I took a two-week class on radio basics. I went around New York recording the sounds of bustling street vendors, college marching bands, and then wrote up short stories that were completely empty of news. All of a sudden, the medium opened up to me, so I decided to change my focus to radio journalism.  I often think about how that decision changed my career and my life.” With that, O’Dowd set his sights on pursuing a master’s degree in Journalism from Columbia University.  His introduction to public radio came about almost by accident.  When he returned from Japan, he began working for the Peoria Independent.  “I almost enrolled in graduate school to get my MFA", "textAfterTable": "Pages 1 2 3 4 5 6 7 8 next › last » Wait Wait Don't Tell Me Saturday at 11 a.m.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}