{"relation": [["", "101", "102", "103", "104", "105", "106", "107", "108", "109", "110", "111", "112", "113", "114", "115", "116", "117", "118", "119", "120", "121", "122", "123", "124", "125"], ["Name", "Coming and Going (Vou alí já volto)", "Choro", "When You Wish Upon a Star", "Peggy's Blue Skylight", "Moments", "Illusions", "Falling In Love with Love", "Beautiful Love", "Cross Currents", "Falling In Love with Love", "Chan's Song", "When You Wish Upon a Star", "Loco Motif", "Moments", "Illusions", "Through the Fire", "Choro", "Cross Current", "Beautiful Love", "One Side of You", "Falling In Love With Love", "Comin' and Goin'", "Falling In Love With Love", "Moments", "Falling In Love With Love"], ["Album", "Giants of Jazz: Eliane Elias", "Giants of Jazz: Eliane Elias", "Giants of Jazz: Eliane Elias", "Giants of Jazz: Eliane Elias", "Giants of Jazz: Eliane Elias", "Giants of Jazz: Eliane Elias", "Giants of Jazz: Eliane Elias", "Giants of Jazz: Eliane Elias", "Giants of Jazz: Eliane Elias", "Giants of Jazz: Piano", "The Best of Eliane Elias On Denon", "The Best of Eliane Elias On Denon", "The Best of Eliane Elias On Denon", "The Best of Eliane Elias On Denon", "The Best of Eliane Elias On Denon", "The Best of Eliane Elias On Denon", "The Best of Eliane Elias On Denon", "The Best of Eliane Elias On Denon", "The Best of Eliane Elias On Denon", "The Best of Eliane Elias On Denon", "The Best of Eliane Elias On Denon", "The Best of Eliane Elias On Denon", "The Most Romantic Jazz Music in the Universe", "More of the Most Relaxing Jazz Music in the Universe", "The Most Relaxing Jazz Standards In the Universe"], ["Time", "3:48", "4:40", "6:43", "5:16", "5:54", "7:12", "6:26", "6:57", "5:36", "6:27", "6:19", "7:29", "5:44", "5:56", "7:14", "6:09", "4:42", "5:38", "6:59", "6:22", "6:26", "3:50", "6:20", "5:54", "6:25"], ["Price", "12,00 kr", "12,00 kr", "12,00 kr", "12,00 kr", "12,00 kr", "12,00 kr", "12,00 kr", "12,00 kr", "12,00 kr", "12,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "12,00 kr", "9,00 kr"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Eliane Elias", "title": "", "url": "https://itunes.apple.com/no/artist/eliane-elias/id2422895?trackPage=5", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00251-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 868410499, "recordOffset": 868384205, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{35523=She signed with Blue Note in 1989, and released her debut for the label, So Far So Close, the same year with a slew of guests. While most of her recordings have been instrumental, Elias introduced her soft but coarse vocals on her 1990 album Eliane Elias Plays Jobim, and has employed vocals on occasion ever since. Her 1995 album Solos and Duets featured a brilliantly executed duet with Herbie Hancock. In addition to working periodically with Toots Thielemans' Brasil Project, Elias has served as musical director for Gilberto Gil's group. While she continued to record for the rest of the '90s, it was 2000's Impulsive! that proved one of the largest surprises in her career as she collaborated with conductor and arranger Bob Brookmeyer leading the Danish Radio Jazz Orchestra. In 2002 she left Blue Note for RCA's Bluebird label, where she debuted with Kissed by Nature, a primarily vocal album, and followed it up with the lovely Dreamer in 2004. Elias released Around the City in 2006, a collection of primarily vocal tracks that moved ever further into pop territory, covering music by Santana, Bob Marley, and even Beck. It was her final album for Bluebird., 34326=She returned to Blue Note for 2007's Something for You: Elaine Elias Sings & Plays Bill Evans, fronting a trio with Johnson (who played with Evans) and drummer Joey Baron. In 2009, she issued what many have argued is her finest recording, Bossa Nova Stories, fully engaging her Brazilian heritage in bossa and samba and illustrating her singular jazz instincts as a pianist. In 2010, Savoy Records issued Timeless Eliane Elias, a compilation of tracks culled from her mid-'80s recordings Illusions and Cross Currents. In late 2010, Elias signed with Concord; in the late spring of 2011 she released Light My Fire, her debut set on the label. A year later, Elias paired with bassist and husband Johnson for the instrumental ECM date Swept Away. In 2013, Elias paid homage to trumpeter/vocalist Chet Baker with I Thought About You: A Tribute to Chet Baker. Two years later, she delivered the lush homage to her Brazilian roots with Made in Brasil. ~ Craig Harris & Thom Jurek, Rovi, 37724=The classical tradition meets the spontaneity of jazz through the virtuosic playing of Brazil-born and New York-based pianist Eliane Elias. A former member of jazz ensemble Steps Ahead, Elias has continued to explore two distinct musical streams through her solo recordings and her performances since the mid-'80s. In 1993, she became one of the few artists to release jazz and classical albums simultaneously. In a review of a concert in her homeland, Brazil magazine praised Elias for \"her dazzling right-hand runs, executed often at frightening speeds. Her command of the keyboard was total. Her harmonic sensibility caused a sense of wonderment.\", 37034=Elias may have inherited at least some of her musical talents from her mother, Lucy, a classical pianist who often played jazz records in the family home. After studying for six years at the Free Center of Music Apprenticeship in São Paulo, she continued to study classical technique with Amilton Godoy and Amaral Vieira. By her teens, Elias was composing her own pieces and performing in jazz clubs. While touring in Europe in 1981, she met jazz bassist Eddie Gomez and was encouraged to travel to New York. Arriving in the Big Apple the following year, she studied privately with Olegna Fuschi at the Juilliard School of Music. Elias' professional career received a boost when she was invited to join Steps Ahead, a jazz \"supergroup\" featuring Michael Brecker, Peter Erskine, Mike Manieri, and Eddie Gomez. She recorded one album with the group — Steps Ahead — in 1983. Shortly after leaving Steps Ahead, Elias began collaborating with trumpet player Randy Brecker, whom she subsequently married but later divorced. Their sole duo album, released in 1985, was named after their daughter Amanda. The following year, Elias launched her career as a bandleader. Since then, she's alternated tours with two different trios, one featuring drummer Jack DeJohnette and bassist Gomez and the other featuring drummer Erskine and her current husband, bassist Marc Johnson. Elias has also performed with a third trio, featuring Johnson on bass and Satoshi Takeishi on drums.}", "TableContextTimeStampAfterTable": "{63063=Copyright © 2014 Apple Inc. Alle rettigheter forbeholdes., 54734=19 March 1960 in São Paulo, Brazil}", "lastModified": "Fri, 31 Jul 2015 08:02:10 GMT", "textBeforeTable": "Top Songs 2 1 View In iTunes Everything I Love 20. View In iTunes Movin' Me On - EP 19. View In iTunes Eliane Elias Plays (Live) 18.", "textAfterTable": "Previous 1 2 3 4 5 6 7 8 9 10 Next Born: 19 March 1960 in São Paulo, Brazil Genre Jazz Years Active: '70s, '80s, '90s, '00s, '10s Influencers Chick Corea Astrud Gilberto Elis Regina Contemporaries Jorge Dalto Tania Maria Michel Camilo Vanessa da Mata Viktoria Tolstoy Diana Krall Wynton Marsalis Vince Guaraldi Trio Ana Caram Ricardo Silveira Oppdag nye apper og del dem med andre. Følg oss på @AppStore. Oppdag og del ny musikk, nye filmer, nye bøker og annet. Følg oss på @iTunes, og oppdag musikken", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}