{"relation": [["Title", "Fantasie Impromptu", "Slot Machine", "Everything Is Everything", "Passing Clouds", "Rent Party", "Jano’s Revenge", "Go Down Old Hannah", "Hung-Up", "Let’s Call The Whole Thing Off"], ["Artist", "Les Baxter", "Sound Games Orchestra", "Booker T. Jones", "The Dick Hunter Five", "Booker T. Jones", "Los Sospechos", "Leadbelly", "Salt", "Ella Fitzgerald"], ["Album", "Moog Rock: Great Classic Hits", "Games Power", "The Road From Memphis", "Melody and Rhythm Vol 7", "The Road From Memphis", "Jano’s Revenge 45rpm", "Go Down Old Hannah – The Library of Congress Recordings", "Hung-Up 45rpm", "Ella Fitzgerald Sings The George and Ira Gershwin Song Book"], ["Label", "GNP Crescendo", "Music Scene", "Anti Records", "Apollo Sound", "Anti Records", "Colemine Records", "Rounder", "Choctaw Records", "Verve"]], "pageTitle": "A Way with Words | Kissing Games", "title": "", "url": "http://www.waywordradio.org/kissing-games/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00107-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 825455735, "recordOffset": 825425868, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{58223=Here is a Tex Ritter version with some different syllables in places: Froggie In the Thomas Ravencroft version (1611, Melismata. Mvsicall Phansies. Fitting the Covrt, Citie, and Covntrey Hvmovrs. To 3, 4, and 5. Voyces. The Marriage of the Frogge and the Movse), the nonsense syllables are simply: “… Humble-dum, humble-dum. … tweedle, tweedle twino.”, 57573=I remember a lot of songs with strings of nonsense syllables. There was a version of “Three Little Fishies,” one of “Mr. Froggie Went A-Courtin’,” and of course, the pseudo-nonsense song “Mairzy Doats” (1943 by Milton Drake, Al Hoffman and Jerry Livingston)., 23833=What’s the best way to help your child learn to speak a foreign language? One option is an immersion school, where teachers avoid speaking English. Also, did you ever play padiddle while riding in a car? Plus, what your signature says about you, what to call that last serving of food, sitting on your tuchus, alphabet riddles, camp songs, soup to nuts, and the weather-related phrase “Who let the hawk out?” This episode first aired Friday, February 17, 2012., 83868=I learned a song out of our textbook in music class in elementary school called “King of the Cannibal Islands”. It contains nonsense lyrics in the chorus, and from my recent searching apparently it was a popular camp song and dates all the way back to 1813. I wonder if any of these other songs/lyrics are related? A good thread about the song, with various interpretations is here: http://www.mudcat.org/thread.cfm?threadid=9724}", "textBeforeTable": "Book Mentioned in the Broadcast Photo by Akuppa John Wigham. Used under a Creative Commons license.  The Long Up, A Poem Martha reads a poem by former U.S. Poet Laureate Kay Ryan called “The Long Up.”  Soup to Nuts If something is described as soup to nuts, it’s “the whole thing” or it “runs the gamut.” The phrase refers to an old-fashioned way of dining, beginning with soup and ending with nuts for dessert. The ancient Romans used an analogous expression in Latin: ab ovo usque ad malum, literally, “from the egg to the apple.”  Finding New Words Twitter is a great way to discover words that are new to you and to others. Just search with #newword or “new word,” and you’ll find gems like holus-bolus, meaning the whole thing or all together.  Hannah, the Sun Among some African-Americans, the term Hannah means “the sun.” This sense is memorialized in the lyrics of “Go Down Old Hannah,” a work song from the 1930s. One writer said of this haunting melody: “About 3 o’clock on a long summer day, the sun forgets to move and stops, so then the men sing this song.” The great folklorist Alan Lomax also made recordings of prison workers singing this song.  Another Alphabet", "textAfterTable": "Let’s Call The Whole Thing Off Ella Fitzgerald Ella Fitzgerald Sings The George and Ira Gershwin Song Book Verve Tagged with → Game • song • soup  27 Responses", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}