{"relation": [["Topic", "Meet Hot Younger Girls Who Like Older Men For Sex, Dating and ...", "Young Girl and Like Older Men?", "Did this site move to a facebook group?", "let's date tonight"], ["Author", "Mary003", "Unsubscribed", "Beverly", "Unsubscribed"], ["Replies", "0", "0", "0", "0"], ["Last Post", "June 10, 2015", "April 21, 2015", "March 16, 2015", "March 10, 2015"]], "pageTitle": "purse stiffener - Crafty Vixens - tribe.net", "title": "", "url": "http://craftyvixens.tribe.net/thread/16198e66-0488-449a-af62-6603a733a3f0", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00205-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 59980611, "recordOffset": 59960673, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Recent topics in \"Crafty Vixens\" join to post I make my own purses too. I like for them to be at least semi-washable so I typically use plastic canvas to stiffen them. As long as you don't dry them in a dryer, you can usually hand wash them and hang or dry flat. If I am making one out of a fabric, I have used heavy duty fusible interfacing too. Hand washing ensures that the fusible will not bubble. Making a simple lining for any purse/tote is not difficult. I use the same pattern pieces and a slightly larger seam allowance, i.e., a 1/2\" s/a for the exterior and a 5/8\" s/a for the lining. Simple, easy & fast. Since I draft my own patterns for these things, I don't like for anything to be harder than it has to be. For me, making the lining is the most difficult part since I usually add many special pockets for checkbooks, credit cards, cell phone, pens, etc. And I use various fasteners to secure each pocket, depending on its use. I like to make matching little bags for cosmetics, change, etc. I also usually add a special pocket or hanger for my keys. Once you get used to adding linings, you will find that", "textAfterTable": "^ top of page | view all topics | back to Crafty Vixens » Advertisement Boston | Chicago | Los Angeles | Miami | New York City | Philadelphia | San Diego | SF", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}