{"relation": [["Resource", "WordNet", "eXtended Wordnet", "Augmented Wordnet", "Verbnet", "VerbOcean", "FrameNet", "NomBank", "PropBank", "Nomlex Plus", "Dekang Lin’s Thesaurus", "Grady Ward's Moby Thesaurus", "Roget's Thesaurus", "Wikipedia", "Umbel", "YAGO", "DBpedia", "DIRT Paraphrase Collection", "TEASE Collection", "BADC Acronym and Abbreviation List", "Catvar The Categorial Variation Database (English)", "Acronym Guide", "Web1T 5-grams", "Normalized Google Distance (RTE3&RTE4)", "Normalized Google Distance (RTE5)", "GNIS - Geographic Names Information System", "Geonames", "Sekine's Paraphrase Database", "Microsoft Research Paraphrase Corpus", "Downward entailing operators", "WikiRules!", "DART", "FRED", "DIRECT", "binaryDIRT", "unaryBInc", "New resource"], ["Type", "Lexical DB", "Lexical DB", "Lexical DB", "Lexical DB", "Lexical DB", "Lexical DB", "Lexical DB", "Lexical DB", "Lexical DB", "Thesaurus", "Thesaurus", "Thesaurus", "Encyclopedia", "Ontology", "Ontology", "Ontology", "Collection of paraphrases", "Collection of Entailment Rules", "Word List", "Word List", "Word List", "Word list", "Word Pair Co-occurrence", "Word Pair Co-occurrence", "Gazetteer", "Gazetteer", "Collection of paraphrases", "Collection of paraphrases", "Collection of entailing operators", "Lexical Reference rule-base", "Collection of \"world knowledge\" propositions", "FrameNet-derived entailment rule-base", "Directional Distributional Term-Similarity Resource", "Entailment rules between binary templates using DIRT algorithm", "Entailment rules between unary templates using BInc algorithm", ""], ["Author", "Princeton University", "Human Language Technology Research Institute, University of Texas at Dallas", "Stanford University", "University of Colorado Boulder", "Information Sciences Institute, University of Southern California", "ICSI (International Computer Science Institute) - Berkley University", "New York University", "University of Colorado Boulder", "New York University", "University of Alberta", "University of Sheffield", "Peter Mark Roget (Electronic version distributed by University of Chicago)", "", "Structured Dynamics LLC, Coralville, IA", "Max-Planck Institute for Informatics, Saarbrücken, Germany", "Open community project", "University of Alberta", "Bar-Ilan University", "BADC (British Atmospheric Data Centre)", "University of Maryland", "Acronym-Guide.com", "Linguistic Data Consortium, University of Pennsylvania; Google Inc.", "Saarland University", "Saarland University", "USGS (United States Geological Survey)", "", "Department of Computer Science, New York University", "Microsoft Research", "Department of Computer Science, Cornell University, Ithaca NY", "Bar-Ilan University", "Boeing Research and Technology", "Bar-Ilan University", "Bar-Ilan University", "Bar-Ilan University", "Bar-Ilan University", ""], ["Brief description", "Lexical database of English nouns, verbs, adjectives and adverbs", "Extension of WordNet based on the exploitation of the information contained in WordNet definitional glosses: the glosses are syntactically parsed, transformed into logic forms and content words are semantically disambiguated. The Extended Wordnet is an ongoing project.", "The resource is the result of the application of a learning algorithm for inducing semantic taxonomies from parsed text. The algorithm automatically acquires items of world knowledge, and uses these to produce significantly enhanced versions of WordNet (up to 40,000 synsets more).", "Lexicon for English verbs organized into classes extending Levin (1993) classes through refinement and addition of subclasses to achieve syntactic and semantic coherence among members of a class", "Broad-coverage semantic network of verbs", "Lexical resource for English words, based on frame semantics (valences) and supported by corpus evidence", "Lexical resource containing syntactic frames for nouns, extracted from annotated corpora", "Lexical resource containing syntactic frames for verbs, extracted from annotated corpora", "Dictionary of English nominalizations: it describes the allowed complements for a nominalization and relates the nominal complements to the arguments of the corresponding verb", "Thesaurus automatically constructed using a parsed corpus, based on distributional similarity scores", "Thesaurus containing 30,260 root words, with 2,520,264 synonyms and related terms. Grady Ward placed this thesaurus in the public domain in 1996.", "Roget's Thesaurus is a widely-used English thesaurus, created by Dr. Peter Mark Roget in 1805. The original edition had 15,000 words, and each new edition has been larger. The electronic edition (version 1.02) is made available by University of Chicago.", "Free encyclopedia. Used for extraction of lexical-semantic rules (from its more structured parts), named entity recognition, geographical information etc.", "UMBEL stands for Upper Mapping and Binding Exchange Layer and is a lightweight ontology structure for relating Web content and data to a standard set of subject concepts", "Light-weight and extensible ontology. It contains more than 2 million entities and 20 million facts about these entities. The facts have been automatically extracted from Wikipedia and unified with WordNet.", "DBpedia is a community effort to extract structured information from Wikipedia and to make this information available on the Web. The DBpedia knowledge base currently describes more than 2.9 million things in 91 different languages and consists of 479 million pieces of information.", "DIRT (Discovery of Inference Rules from Text) is both an algorithm and a resulting knowledge collection. The DIRT knowledge collection is the output of the DIRT algorithm over a 1GB set of newspaper text.", "Output of the TEASE algorithm", "Acronym and Abbreviation List", "A Categorial-Variation Database (or Catvar) is a database of clusters of uninflected words (lexemes) and their categorial (i.e. part-of-speech) variants. The database was developed for English using a combination of resources and algorithms, including the LCS Verb and Preposition Databases (Dorr 2001), the Brown Corpus section of the Penn Treebank (Marcus et al. 1994), an English morphological analysis lexicon developed for PC-Kimmo (ENGLEX) (Antworth 1990), WordNet1.6 (Fellbaum 1998), an English Verb-Noun list extracted from Nomlex (Macleod et al. 1998), a similar list extracted from LDOCE (Procter 1978) and the Porter stemmer (Porter 1980).", "Acronym and Abbreviation Lists for English, branched in thematic directories", "Data set containing English word n-grams and their observed frequency counts. The n-gram counts were generated from approximately 1 trillion word tokens of text from publicly accessible Web pages", "Co-occurrence of the word pairs in RTE3 and RTE4 using Normalized Google Distance (Cilibrasi and Vitanyi, 2004). The word pairs are all the possible combinations of content words in T and H. In practice, we used Yahoo! as the search engine.", "Co-occurrence of the word pairs in RTE3 and RTE4 using Normalized Google Distance (Cilibrasi and Vitanyi, 2004). The word pairs are all the possible combinations of content words in T and H. In practice, we used Yahoo! as the search engine.", "Database containing the Federal and national standard toponyms for USA, associated areas and Antarctica", "Database containing eight million geographical names. It is integrating geographical data such as names of places in various languages, elevation, population and others from various sources.", "Data-base created using Sekine's method, NOT cleaned up by human. It includes 19,975 sets of paraphrases with 191,572 phrases.", "Text file containing 5800 pairs of sentences which have been extracted from news sources on the web, along with human annotations indicating whether each pair captures a paraphrase/semantic equivalence relationship.", "System output of an unsupervised algorithm recovering many Downward Entailing operators, like 'doubt'.", "Extraction of about 8 million lexical reference rules from the text body (first sentence) and from metadata (links, redirects, parentheses) of Wikipedia. Provides better performance than other automatically constructed resources and comparable performance to WordNet. Offers complementary knowledge to WordNet.", "23 million tuples such as \"airplanes can fly to airports\", \"rivers can flood\" collected from abstracted parse trees.", "This package contains the outputs of the FRED algorithm which extracts entailment rules from FrameNet.", "This is a resource of directional distributional term-similarity rules (mostly lexical entailment rules) automatically extracted using the inclusion relation as described in (Kotlerman et.al., ACL-09).", "This resource contains entailment rules over binary templates learned over the Reuters corpus using the DIRT algorithm of Lin and Pantel.", "This resource contains entailment rules over unary templates learned over the Reuters corpus using the BInc algorithm of Szpektor and Dagan (2008).", "Participants are encouraged to contribute"], ["PAST Users [1]", "3", "0", "0", "2", "2", "1", "2", "2", "0", "0", "0", "1", "0", "0", "0", "0", "2", "0", "0", "0", "1", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", ""], ["RTE4 Users[2]", "21", "0", "0", "2", "3", "1", "1", "1", "1", "1", "0", "0", "3", "0", "0", "0", "4", "0", "1", "0", "1", "1", "0", "0", "1", "1", "0", "0", "0", "1", "0", "0", "0", "0", "0", ""], ["RTE5 Users[3]", "18", "2", "1", "1", "6", "2", "0", "1", "0", "1", "1", "1", "6", "1", "1", "1", "3", "0", "1", "0", "3", "0", "1", "1", "0", "0", "0", "0", "1", "1", "0", "0", "0", "0", "0", ""], ["RTE6 Users[4]", "22", "0", "0", "0", "7", "3", "0", "0", "0", "2", "0", "0", "6", "0", "0", "0", "4", "0", "0", "1", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", ""], ["Usage info", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users"]], "pageTitle": "RTE Knowledge Resources - ACL Wiki", "title": "", "url": "http://aclweb.org/aclwiki/index.php?title=RTE_Knowledge_Resources&oldid=8896", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00003-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 2963587, "recordOffset": 2949963, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Publicly available Resources RTE6 - Ablation Tests RTE5 - Ablation Tests An ablation test consists of removing one module at a time from a system, and rerunning the system on the test set with the other modules, except the one tested. Ablation test are meant to help better understand the relevance of the knowledge resources used by RTE systems, and evaluate the contribution of each of them to the systems' performances. In fact, comparing the results achieved in the ablation tests to those obtained by the systems as a whole allows assessing the contribution given by each single resource. Ablation Tests RTE7 - Call for Resources RTE6 - Call for Resources In order to help the research, all the participants are invited to contribute, sharing their own resources with the RTE community. Making the resources available to be used by other systems has several advantages. On the one hand, it helps improve the TE technology; on the other hand, it offers an opportunity to further test and evaluate the resource. Call for Resources 5 Footnotes 4 Not available Resources", "textAfterTable": "Not available Resources The following table lists the unpublished resources used by RTE participants. Some of them have been developed by Users themselves specifically for RTE. Interested people may turn to authors to obtain further information. Resource Type Author Brief description PAST Users RTE4 Users RTE5 Users RTE6 Users Usage info PARC Polarity Lexicon Lexical DB PARC - Palo Alto Research Center Verbs classification with respect to semantic polarity 0 1 0 0 Users Gazetteer from TREC Gazetteer NIST - National Institute of Standards and Technology Cities and other geographical names 1 0 0 0 Users DFKI Geographic Ontology (to be released) Ontology DFKI - German Research Center for Artificial Intelligence Ontology containing geographic terms and two kinds of relations: the directional part-of relation, and the equal relation", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}