{"relation": [["", "1", "3", "4", "5", "6", "8", "9"], ["Name", "The Madness and the Damage Done", "Exit Sun", "Exit Sun", "Healter Skelter", "The Madness and the Damage Done", "Omen", "21st Century Schizoid Man"], ["Artist", "Shining", "Shining", "Shining", "Shining", "Shining", "Shining", "Shining"], ["Time", "5:20", "8:35", "0:57", "5:35", "3:23", "8:45", "8:41"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Blackjazz by Shining", "title": "", "url": "https://itunes.apple.com/us/album/madness-damage-done/id351691345?i=351691354", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00151-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 877357511, "recordOffset": 877332432, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{13325=An astonishing blend of industrial, metal, free jazz, and raw electronic noise, Shining's Blackjazz represents more than a leap forward for the band; it's the kind of album artists will be striving to equal for years to come. Comparable to Ministry's The Mind Is a Terrible Thing to Taste, Blackjazz mixes scorched-earth synth-guitar riffs and concussive drumming with the unholy shrieks and post-Coltrane saxophone of group leader Jørgen Munkeby. The production by Sean Beavan, who's worked with Nine Inch Nails and Marilyn Manson, among others, gives this a pummeling edge — the drums sound sampled from NIN's \"March of the Pigs,\" while the synths and guitars have a fullness and warmth that are crushingly heavy without being mere noise for its own sake. Munkeby's vocals are a death metal roar, his lyrics the usual metallic litany of rage and despair. All this would be impressive enough, but it's even more so considering how mild, relatively speaking, Shining's last two discs, 2005's In the Kingdom of Kitsch You Will Be a Monster and 2007's Grindstone, were. The electronics and general loudness of those two albums were significantly reined-in compared with the howling chaos of songs like \"Healter Skelter,\" \"The Madness and the Damage Done,\" and \"Exit Sun,\" not to mention the positively apocalyptic, nearly nine-minute cover of King Crimson's \"21st Century Schizoid Man,\" sung by Enslaved vocalist Grutle Kjellson, that closes the disc. This is one of the most assaultive, addictive albums around, a rip-roaring journey through sonic violence that will leave most quivering in the corner and others (a special few) totally enraptured., 119329=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 05:17:58 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Shining Blackjazz iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Blackjazz by Shining, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "7 Songs Album Review An astonishing blend of industrial, metal, free jazz, and raw electronic noise, Shining's Blackjazz represents more than a leap forward for the band; it's the kind of album artists will be striving to equal for years to come. Comparable to Ministry's The Mind Is a Terrible Thing to Taste, Blackjazz mixes scorched-earth synth-guitar riffs and concussive drumming with the unholy shrieks and post-Coltrane saxophone of group leader Jørgen Munkeby. The production by Sean Beavan, who's worked with Nine Inch Nails and Marilyn Manson, among others, gives this a pummeling edge — the drums sound sampled from NIN's \"March of the Pigs,\" while the synths and guitars have a fullness and warmth that are crushingly heavy without being mere noise for its own sake. Munkeby's vocals are a death metal roar, his lyrics the usual metallic litany of rage and despair. All this would be impressive enough, but it's even more so considering how mild, relatively speaking, Shining's last two discs, 2005's In the Kingdom of Kitsch You Will Be a Monster and 2007's Grindstone, were. The electronics and general loudness of those two albums were significantly reined-in compared with the howling chaos of songs like \"Healter Skelter,\" \"The Madness and the Damage Done,\" and \"Exit Sun,\" not to mention the positively apocalyptic, nearly nine-minute cover of", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}