{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"], ["Name", "Emotion Sickness", "Anthem for the Year 2000", "Ana's Song (Open Fire)", "Spawn (Again)", "Miss You Love", "Dearest Helpless", "Do You Feel the Same", "Black Tangled Heart", "Point of View", "Satin Sheets", "Paint Pastel Princess", "Steam Will Rise"], ["Artist", "Silverchair", "Silverchair", "Silverchair", "Silverchair", "Silverchair", "Silverchair", "Silverchair", "Silverchair", "Silverchair", "Silverchair", "Silverchair", "Silverchair"], ["Time", "6:00", "4:07", "3:42", "3:27", "4:00", "3:34", "4:18", "4:33", "3:35", "2:24", "4:33", "5:17"], ["Price", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Neon Ballroom by Silverchair", "title": "", "url": "https://itunes.apple.com/ca/album/do-you-feel-the-same/id322951127?i=322951227", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00195-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 880107855, "recordOffset": 880083380, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{122116=Copyright © 2014 Apple Inc. All rights reserved., 24597=Formed: 1992 in Newcastle, Australia, 24116=By far one of the best albums to come out of 1999. It was barely noticed but struck the perfect cord as the grunge era came to a close and the uncertain new millennium rolled in. If you loved the 90s here is your loving pain filled farewell to everything that was grunge.}", "lastModified": "Sat, 01 Aug 2015 05:15:43 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Silverchair Neon Ballroom iTunes for Mac + PC Already have iTunes? Click I have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Neon Ballroom by Silverchair, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store…", "textAfterTable": "12 Songs Album Review Silverchair's third full-length release is a confusing affair that reveals a band more talented than their critics realized and more confused than their fans could tolerate. The Australian trio never made any secret of their respect for Nirvana, and on Neon Ballroom Silverchair does one of the best impersonations of their Seattle counterparts on record. It would be easy to convince any Kurt Cobain fan that \"Spawn Again\" and \"Dearest Helpless\" are actually In Utero outtakes, and quite good ones at that! When the weepy ballads, like the Goo Goo Dolls-esque \"Miss You Love,\" pull Neon Ballroom into an overtly radio-friendly direction, all the promise of a gritty grunge tribute fades, and Silverchair appears to be serving two masters. The resultingly incongruent musical textures stifled Neon Ballroom and assured a certain amount of fan disenchantment despite the minor airplay success of \"Ana's Song (Open Fire).\" There are still enough nice moments on this CD to recommend it to even casual fans of the Aussie outfit. Those who had enough of Silverchair when modern rock radio played their mid-'90s hits to death need not concern themselves with this mixed effort. Customer Reviews The most underrated album of the 90s  ", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}