{"relation": [["Thread", "Slow", "RE: Slow"], ["Author", "doublep", "doublep"], ["Date", "Sun 19 Nov 2006 08:56:57 PM UTC", "Sun 19 Nov 2006 09:13:50 PM UTC"]], "pageTitle": "News: Services Availability & Announced: Homepage code repositories moving to SVN next weekend [Gna!]", "title": "", "url": "http://gna.org/forum/message.php?reload=1&msg_id=241", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00233-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 102856611, "recordOffset": 102848692, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{13374=Copyright (C) 2004-2006, the Gna! people. Posted items are owned by whoever posted them. Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved., 570=Item posted by Mathieu Roy <yeupou> on Fri 10 Nov 2006 09:45:52 AM UTC.}", "textBeforeTable": "Comments: Homepage source content will be stored in directory called website in each project repository. During the move, write-access will not be possible. Between Saturday the 11th afternoon and Sunday the 12th, homepages code repositories will move from CVS to SVN. Item posted by Mathieu Roy <yeupou> on Fri 10 Nov 2006 09:45:52 AM UTC. Services Availability & Announce: Homepage code repositories moving to SVN [124 news in archive] posted by beuc, Sat 08 Mar 2014 11:02:17 PM UTC - 0 replies mail subsystem automatically reinstalled posted by beuc, Wed 09 Apr 2014 09:47:29 AM UTC - 0 replies Heartbleed status and measures posted by zerodeux, Thu 24 Apr 2014 07:13:06 AM UTC - 0 replies Gna.org SSL certificate renewed posted by beuc, Thu 21 May 2015 10:12:23 PM UTC - 1 reply dl/home/cvs/svn/www.gna.org upgraded to debian8 posted by beuc, Sat 23 May 2015 06:17:18 PM UTC - 2 replies mail subsystem upgraded Latest News Show feedback again    ", "textAfterTable": "Slow doublep Sun 19 Nov 2006 08:56:57 PM UTC       RE: Slow doublep Sun 19 Nov 2006 09:13:50 PM UTC   Post a followup to this message You could post if you were logged in Show feedback again Copyright (C) 2004-2006, the Gna! people. Posted items are owned by whoever posted them. Verbatim copying and distribution of this entire article is permitted in any medium, provided this notice is preserved. Powered by Savane 3.1-cleanup", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}