{"relation": [["Title", "The Sly Company of People Who Care", "Wild Coast: Travels on South America's Untamed Edge", "The Coloured Girl in the Ring: A Guyanese Woman Remembers", "Heartland"], ["Author", "Rahul Bhattacharya", "John Gimlette", "Brenda Chester DoHarris", "Wilson Harris"]], "pageTitle": "Guyana Tours & Travel | Intrepid Travel UK", "title": "", "url": "http://www.intrepidtravel.com/uk/guyana", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00143-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 521148383, "recordOffset": 521098140, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{99285=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 100604=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan...}", "TableContextTimeStampAfterTable": "{1013=Guyana's tropical climate ensures warm temperatures and high humidity all year round. May, June, July, December and January typically see the most rainfall, with storms and downpours of heavy rain more prevalent in the afternoon. Coastal regions tend to catch cool sea breezes, which bring the temperature down and provide respite from the heat. Generally, a great variety of birds, mammals and amphibians can be found in Guyana at any time of year.}", "textBeforeTable": "Recommended reading Further reading 10. Ramadan is the fasting month for all Muslims, and is observed by some parts of the Guyanese population. During this month no food, drink or smoking is permitted during daylight hours. While non-Muslims aren't expected to fast, it's important to be mindful of Ramadan while travelling in Guyana. 9. When on community visits or homestays, refrain from giving gifts or money to locals. 8. Please ask and receive permission before taking photos of people, including children. 7. Refrain from supporting businesses that exploit or abuse endangered animals. 6. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 5. When bargaining at markets, stay calm, be reasonable and keep a smile on your face. It's meant to be fun! 4. Always dispose of litter thoughtfully, including cigarette butts. 3. For environmental reasons, try to avoid buying bottled water. Fill a reusable water bottle or canteen with filtered water. 2. Dress modestly and respectfully. Shoulders to knees should be covered, especially when entering places of worship. 1. Be considerate of Guyana’s customs, traditions, religion and culture. Top responsible travel tips for Guyana Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember", "textAfterTable": "Handy links www.lonelyplanet.com/the-guianas/guyana www.worldtravelguide.com/guyana www.guyana-tourism.com × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}