{"relation": [["Subject", "Patch limit_rate_max: for your review", "Re: Patch limit_rate_max: for your review", "Re: Patch limit_rate_max: for your review", "Re: Patch limit_rate_max: for your review"], ["Author", "crirus", "Jonathan Matthews", "crirus", "Jonathan Matthews"], ["Posted", "October 25, 2012 02:26AM", "October 25, 2012 08:50AM", "October 25, 2012 09:14AM", "October 25, 2012 11:14AM"]], "pageTitle": "Patch limit_rate_max: for your review", "title": "", "url": "http://forum.nginx.org/read.php?2,232178,232178", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00309-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 90489615, "recordOffset": 90481413, "tableOrientation": "HORIZONTAL", "textBeforeTable": "RSS Quote Reply I thank to Andrei (Latzease) for his contribution to this... he made it happen. If anyone can review this and find it useful, let me know, it works for my needs. The index for each file is different and with this I control how much burst we need, usefull when users seek a lot and index is recalculated on seek for each file... } $limit_rate_after $arg_burst; if ($arg_burst != \"\"){ I need this to control the burst quantity on the fly based on url param. Another change I made is to put the limit_rate_after in server variables. I created a new config directive limit_rate_max that applies to initial burst speed. However, if you have 500 new users per seconds you can choke the bandwidth so the need to control the burst speed. This is usefull when sending mp4 that have a 2 to 6MB of index data at the beginning of the file and playback only starts after this is received. This way I can start the video playback faster not after 20 seconds or so. I have a new patch for Nginx. I use this server to stream videos. I needed a way to burst the rate with limit_rate_after but controlled from config, not at", "textAfterTable": "Sorry, only registered users may post in this forum. Click here to login Online Users Guests: 70 Record Number of Users: 6 on July 30, 2015 Record Number of Guests: 206 on July 23, 2015 This forum is powered by Phorum.                    ", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}