{"relation": [["Subject", "Re: [gentoo-hppa] Ramdisk error and the mux board", "Re: [gentoo-hppa] Ramdisk error and the mux board"], ["Author", "Guy Martin", "Brett Johnson"]], "pageTitle": "[gentoo-hppa] Ramdisk error and the mux board - gentoo-hppa - Gentoo Mailing List Archives", "title": "", "url": "https://archives.gentoo.org/gentoo-hppa/message/92ae674743932b858fd5d7f848775b55", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00070-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 857427269, "recordOffset": 857419067, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Replies Call me 'The PUNISHER'! Frank Castle is dead! -- Dieter cu That would be great! like, where i can find it and how i can remove it? could you please describe to a newbie what that mux-board is, what it looks http://www.mail-archive.com/gentoo-hppa@l.g.o/msg00008.html i have exactly the same ramdisk problem as described on this email: very important to me: hi, I am new to the list, but ive read something in the archive which seems  200604232106.45643.clip2@gmx.de Message-Id: Sun, 23 Apr 2006 19:07:21 Date: [gentoo-hppa] Ramdisk error and the mux board Subject: gentoo-hppa@l.g.o To: Dieter Ries <clip2@×××.de> From: Gentoo Archives: gentoo-hppa gentoo-hppa All Archives Home Toggle navigation Archives Infra Status Sources Archives", "textAfterTable": "Report Message Find on GMANE Find on MARC All times displayed are UTC (GMT+0). Contents reflect the opinion of the author, not the Gentoo project or the Gentoo Foundation. Questions or comments? Please feel free to contact us. © 2001–2015 Gentoo Foundation, Inc. Gentoo is a trademark of the Gentoo Foundation, Inc. The contents of this document, unless otherwise expressly stated, are licensed under the CC-BY-SA-3.0 license. The Gentoo Name and Logo Usage Guidelines apply.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}