{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Nessun dorma", "Con te partiro (Italian Version of 'Time To Say Goodbye')", "Amapola", "Ognuno soffre (Italian Verson of 'Everybody Hurts')", "Caruso", "Nella fantasía", "Por ti seré (Italian Version of 'You Raise Me Up')", "Mi manera (Spanish Version of 'My Way')", "Cavatina", "Music of the Night"], ["Artist", "Paul Potts, London Symphony Orchestra, Carmine Lauri & David Snell", "Paul Potts, London Symphony Orchestra & Carmine Lauri", "Paul Potts, Andreas \"Quiz\" Romdhane, London Symphony Orchestra, Carmine Lauri, Josef Larossi & Peter Ljung", "Paul Potts, Andreas \"Quiz\" Romdhane, London Symphony Orchestra, Carmine Lauri & Josef Larossi", "Paul Potts, London Symphony Orchestra, Carmine Lauri, Simon Lee & Yvie Burnette", "Paul Potts, Per Magnusson, Ulf Janson, Henrik Janson & Jan Bengtsson", "Paul Potts, Steve Mac, Chris Laws, Dave Arch & Frissy Karlsson", "Paul Potts, Steve Mac, Chris Laws, Frissy Karlsson, Dave Arch & Frank Ricotti", "Paul Potts, London Symphony Orchestra, Carmine Lauri & Simon Lee", "Paul Potts, Geoff Foster, London Symphony Orchestra, Carmine Lauri, David Snell & Yvie Burnette"], ["Time", "2:53", "4:03", "3:44", "4:50", "3:50", "4:25", "4:01", "4:26", "3:47", "5:18"], ["Price", "10,00 kr", "10,00 kr", "10,00 kr", "10,00 kr", "10,00 kr", "10,00 kr", "10,00 kr", "10,00 kr", "10,00 kr", "10,00 kr"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - One Chance by Paul Potts", "title": "", "url": "https://itunes.apple.com/dk/album/con-te-partiro-italian-version/id259984159?i=259984216&l=en&v0=WWW-EUDK-ITUHOME-TOPMUSIC&ign-mpt=uo%3D2", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00323-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 860740203, "recordOffset": 860707734, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{22151=In 1990, the joint efforts of the World Cup and the Three Tenors provided opera singing with its biggest ever foray into the pop charts. Unassuming tenor Paul Potts, originally from Bristol, took opera back to the very top of the charts with the album One Chance 17 years later, and he too had a helping hand from the enormously popular television talent show Britain's Got Talent. There is no denying that Paul Potts has indeed got talent, but is he a better singer than any of the Three Tenors? Certainly not. Still, a TV talent show captures the public almost as much as the World Cup, and Potts rides this wave extremely well. He began his trip into TV stardom singing that staple of operatic performance Nessun Dorma, and this aria opens the album too. The problem is that by 2007 the song was so famous that Potts openly invites comparisons with a multitude of operatic tenors who have sung it before. Not that this is any bad thing; it's a difficult song to sing well and Potts does sing nicely in tune, every note well rehearsed, but there is a lack of real feeling and emotion that betrays his rapid rise. In fact, One Chance is not really an opera album at all, and the millions of people who bought it thinking they were buying into a slice of high culture got an album filled with tracks like \"Time to Say Goodbye\" (Con Te Partirò), a hit single from Sarah Brightman and Andrea Bocelli; \"Everybody Hurts\" (Ognuno Soffre), originally by R.E.M.; and versions of \"My Way,\" \"Cavatina\" (the theme from The Deer Hunter), and Andrew Lloyd Webber's \"Music of the Night\" from Phantom of the Opera. The track \"Caruso\" had been recorded by almost everyone in this genre from Russell Watson to Il Divo, and in a similar way that Vittorio Grigolo took a modern pop song, Keane's \"Bedshaped,\" and made it sound like an operatic aria, so Potts translates Westlife's \"You Raise Me Up\" into Italian and produces a sound far removed from the Westlife hit. One Chance was the sort of album that had the stamp of Simon Cowell all over it, very similar to his Il Divo projects. Cowell had an ear for a good tune, and knew what would sell and how to package the moment to maximum effect. This is the type of album that comes along every so often and persuades people that they like opera, when previously they might have thought they did not. If it went on to introduce anybody to other singers in the genre aside from Paul Potts, no doubt he would be one of the first to cheer, but unfortunately, as with the Three Tenors, once out of the spotlight, so was the music. [A ten-track U.K. version of One Chance was also released.], 28155=Born: 13 October 1970 in Bristol, England, 133166=Copyright © 2014 Apple Inc. Alle rettigheder forbeholdes.}", "lastModified": "Sat, 01 Aug 2015 05:00:36 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Paul Potts One Chance iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from One Chance by Paul Potts, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "10 Songs Album Review In 1990, the joint efforts of the World Cup and the Three Tenors provided opera singing with its biggest ever foray into the pop charts. Unassuming tenor Paul Potts, originally from Bristol, took opera back to the very top of the charts with the album One Chance 17 years later, and he too had a helping hand from the enormously popular television talent show Britain's Got Talent. There is no denying that Paul Potts has indeed got talent, but is he a better singer than any of the Three Tenors? Certainly not. Still, a TV talent show captures the public almost as much as the World Cup, and Potts rides this wave extremely well. He began his trip into TV stardom singing that staple of operatic performance Nessun Dorma, and this aria opens the album too. The problem is that by 2007 the song was so famous that Potts openly invites comparisons with a multitude of operatic tenors who have sung it before. Not that this is any bad thing; it's a difficult song to sing well and Potts does sing nicely in tune, every note well rehearsed, but there is a lack of real feeling and emotion that betrays his rapid rise. In fact, One Chance is not really an opera album at all, and", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}