{"relation": [["Title", "Death in the Borders: 19th Century Border Murder Cases", "The poor, crime and punishment,and the power of the Kirk in the Borders, 17th & 18th Centuries", "Greenlaw Jail", "Poor Relief in the 1840s"], ["Synopsis", "This is the review of a book by Norrie McLeish, Border Murder Cases with a great deal of research that has gone into this volume. Gypsies, Landlords, and farm workers.", "When paupers died, the contents of their houses were sold by public roup. This is an account of one sale and the strength of the Kirk.", "List of prisoners in Greenlaw Jail in the 1851 census.", "A review of the operation of the poor relief in the early 19th century. It includes the size of the allowances paid and an estimate of the cost of living at the time."], ["Size Description", "2 pages or more", "2 pages or more", "1 page or more", "4 pages or more"], ["Issue No", "30", "31", "35", "71"], ["Author", "Norrie McLeish .(Review by Hugh K. Mackay)", "M. C. Lawson", "Carol Trotter", "Peter Munro"]], "pageTitle": "Greenlaw", "title": "", "url": "http://bordersfhs.org.uk/greenlaw.asp", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00264-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 36309647, "recordOffset": 36301832, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{3164=1841 census Greenlaw. 1851 census Greenlaw. 1861 census Greenlaw. Greenlaw Burials 1780-1854 by Nigel Hardie. Greenlaw Memorial Inscriptions transcribed by Carol Trotter (including poll tax, militia list, transcription of War Memorial and list of ministers) was published by the Society in 1996. Unfortunately this is currently out of print., 3902=Greenlaw Memorial Transcriptions as above. Pre 1855 Memorial inscriptions of Berwickshire by David Cargill. List of Elders, Deacons and Church Officers of Greenlaw Free Church 1885. The Churches and Churchyards of Berwickshire by G.A.C. Binnie. C.D. The Churches and Churchyards of Berwickshire by James Robson 1896. Index to Particular Register of Sasines for Berwickshire. Pigot's 1837 Directory of Berwickshire and Roxburghshire. Rutherford's Southern Counties Register and Directory 1867. C.D. Slater's Directory of Berwickshire 1903. County Directory of Scotland 1912 - Borders Towns and Villages., 12508=The population has been recorded as follows: 1755 - 895, 1785 - 1210, 1801 - 1270, 1811 - 1260, 1821 - 1349, 1831 - 1442, 1841 - 1355, 1851 - 1378, 1861 - 1370, 1871 - 1381, 1901 - 1014., 11055=Farm Horse tax 1797-1798. Medical Officer's of Health Reports 1891. Land Ownership Commission Report 1872 -1873 (available in Society Archives)., 11287=1841 census: Greenlaw, Crook Inn, Crumrigg, Rowchester, Howlaws, Gordonbank, Fairhill, Howlawrigg, Foulshotlaw, Old Greenlaw, Catmoss, Westerraw, Eastfield, Slegden, Lintmill, Rowieston, Angelraw, Cowridge, Lambden, Elwartlaw, Castle Mill, Claydub, Whitside, Flourishwalls, Polwarth Woodheads, Mossend, Beadshill, Milknow, Hardlaw, Todelhouse, Halyburton, Cralaw, Broomhill, Woodend, Greenlawden. 1851 census: Greenlaw, Waulk Mill, Toad Holes, Green, Whiteside, Greenlawdean, Broomhill, Crawely, Hallyburton, Hardlaw, Bedshiel, Woodheads, Flourishwalls, Slegden, Eastfield, Castle Mill, Elwartlaw, Lint Mill, Rowieston, Angelraw, Crumrigg, Rowchester, Cowrigg, Lambden, Old Lambden, Wester Howlaws, East Howlaws, Fairhill, Gordonbank, Howlawrigg, Fowlshotlaw, Catmoss. 1861 census: Greenlaw, Toad Holes, Castle Mill, Lintmill, Ewartlaw, Crumrigg, Angelrow, Rowieston, Lamden, Cowrigg, Rowchester, Gordon Bank, East Howlaws, West Howlaws, Catmoss, Foulshotlaw, East Howlaws, Eastfield, Slegden,Woodheads, Flourishwalls, Bedshiel, Hurdlaw, Toddlehouse, Hallyburton, Broomhill, Greenlawdean, Marchmont, Whiteside., 2927=Old Parish Birth Records exist from 1691 to 1854. Marriage Records from 1648 to 1854. Death records exist from 1719 to 1776 and from 1780 to 1854.}", "textBeforeTable": "Please note that the heading Author includes persons who have compiled or transcribed records; and that the topics indexed, and the synopses are subjective opinions. See the Sales List to buy copies of the magazines containing articles in which you're interested. Magazine Articles; Greenlaw Memorial Transcriptions as above. Pre 1855 Memorial inscriptions of Berwickshire by David Cargill. List of Elders, Deacons and Church Officers of Greenlaw Free Church 1885. The Churches and Churchyards of Berwickshire by G.A.C. Binnie. C.D. The Churches and Churchyards of Berwickshire by James Robson 1896. Index to Particular Register of Sasines for Berwickshire. Pigot's 1837 Directory of Berwickshire and Roxburghshire. Rutherford's Southern Counties Register and Directory 1867. C.D. Slater's Directory of Berwickshire 1903. County Directory of Scotland 1912 - Borders Towns and Villages. Volumes available for consultation within our Archive; Greenlaw Parish Church Greenlaw is centrally situated in the County of Berwick being bounded on the north by the Parishes of Longformacus, Polwarth and Fogo, on the east by the Parish of Eccles, on the south by the Parishes of Hume and on the west by the Parish of Gordon. Old Parish Birth Records exist from 1691 to 1854. Marriage Records from 1648 to 1854.", "textAfterTable": "Map of Greenlaw from Quarter-inch to the mile, Scotland, 1921-1923 or One-inch to the mile, Popular edition, Scotland, 1920-1930 by kind permission of the National Library of Scotland. Use the control at the top left of the map to zoom in or out and drag the map left, right, up, or down as you wish. 20 Most Common Surnames The 20 most common surnames on gravestones recorded by us in the Greenlaw monumental inscriptions volume are (number of gravestones in brackets): WILSON (20), BROWN (18), HUNTER (16), WATSON (15), HENDERSON (14), HUME (14), SCOTT (14), SMITH (13), PURVES (13), TURNBULL (12), THOMSON (12), ROBERTSON (12), YOUNG (11), MILLER (11), REDPATH (11), PRINGLE (10), NISBET (10), FAIRBAIRN (10), ARMSTRONG (10), FRATER (10). Other Records; An Old Berwickshire Town - history of Greenlaw from the earliest times to the present by Robert Gibson - Edinburgh 1905. Frequent Flitting - Geographical Mobility and Social Structure in mid nineteenth century Greenlaw by R Houston - Vol 27 Scottish Studies (Journal of the School of Scottish Studies Edinburgh University). Scottish Borders Archives, The Hub Hawick hold the following records; Greenlaw School minutes etc. 1873 to 1919 ref; B/ED/1/55-59. The Scottish National Archives Edinburgh hold the following records; Greenlaw Parish Church;", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}