{"relation": [["Title", "Needle in a Haystack", "The Buenos Aires Broken Hearts Club", "Long After Midnight at the Nien Bien", "The Tao of Tango", "Santa Evita", "Far Away and Long Ago: A Childhood in Argentina", "On Argentina"], ["Author", "Ernesto Mallo", "Jessica Morrison", "Brian Winter", "Johanna Siegmann", "Tomas Eloy Martinez", "W. H Hudson", "Jorge Luis Borges"]], "pageTitle": "Argentina Tours & Travel | Intrepid Travel AU", "title": "", "url": "http://www.intrepidtravel.com/au/argentina", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00157-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 516715975, "recordOffset": 516648796, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{87544=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 86225=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 188235=Review submitted 21 Jul 2015}", "TableContextTimeStampAfterTable": "{165257=Argentina's temperate climate means it experiences four distinct seasons. Summer (December to February) is the best time for visiting Patagonia as the weather is at its mildest. In contrast, summer can be very hot and humid in Buenos Aires, with spring and autumn offering milder weather. Autumn is a good time to visit Mendoza, Cordoba and the Lake District. The busiest times to travel in Argentina are during the main vacations - January, February and July., 141713=When Parm Parmar arrived in Mendoza, little did she know that night she would be dining at a family home and getting an inside view of life in Argentina.}", "textBeforeTable": "Recommended reading Further reading 8. When on community visits or homestays, refrain from giving gifts or money to locals. 7. Please ask and receive permission before taking photos of people, including children. 6. Refrain from supporting businesses that exploit or abuse endangered animals. 5. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 4. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 3. Always dispose of litter thoughtfully, including cigarette butts. 2. For environmental reasons, try to avoid buying bottled water. Instead, fill a reusable water bottle or canteen with filtered water. 1. Be considerate of Argentina’s customs, traditions, religion and culture. Top responsible travel tips for Argentina Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this in mind while travelling. Argentina Travel Tips", "textAfterTable": "Handy links www.lonelyplanet.com/argentina www.worldtravelguide.net/argentina www.turismo.gov.ar/eng × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}