{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Easy People", "This Town Is Wrong", "Snowman", "Jeremy Newborn Street", "Jennifer Falling Down", "Georgia O", "In the Hush Before the Heartbreak", "One Hundred Names", "Last Kisses", "I'm so Lonesome I Could Cry"], ["Album", "Play", "If You Lived Here You'd Be Home Now", "Play", "If You Lived Here You'd Be Home Now", "Play", "Play", "Play", "If You Lived Here You'd Be Home Now", "Play", "If You Lived Here You'd Be Home Now"], ["Time", "3:49", "4:12", "4:11", "3:34", "2:52", "3:50", "4:31", "4:30", "3:29", "4:22"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - The Full Catastrophe by The Nields", "title": "", "url": "https://itunes.apple.com/us/album/the-full-catastrophe/id515327929", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00028-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 882590903, "recordOffset": 882559622, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{24770=Even though I downloaded this album on Tuesday when it was released, I wasn't planning on writing a review for a while. I like to give albums and chance to grown on me, especially new releases by my favorite bands. It only took me five days, though, to become aboslutely engrossed in this album. Some tracks are immediate standouts on first listen (i.e. \"Your House is Strong\" and \"Which Side Are You On?\"). Others are the kind that work their way into your subconcious and start to go on heavy rotation in your mind after repeated listens (i.e. \"Can I love you Too Much?,\" \"Good Times are Here\"). \"Your House is Strong\" is my favorite new Nields song since \"Easy People.\" \"Which Side Are You On\" has a verse that is reminiscent of \"Ash Wednesday\" but actually improves upon it. \"I am Half My Mother's Age\" is a poignant song that manages to hit the sweet spot between humor and longing in the way that some of my favorite Mousse era songs did. I won't mention every song but, as I said, they are all excellent and all fall into the category of immediate standout or slowly-sneak-up-on-you favorite. A Nields fan since 1997, I have to say how inspiring it is to have a nelease that shows one of my all-time favorite bands squarly on their A game with song writing, performing and recording. I look forward o spending this spring and summer with this album as my companion. I can't wait to see what song, verse or moment will be the next to claim me for a day. Thank you, Nields!, 129432=Copyright © 2014 Apple Inc. All rights reserved., 28801=Formed: 1991}", "lastModified": "Fri, 31 Jul 2015 08:54:22 GMT", "textBeforeTable": "View In iTunes XVII 5. View In iTunes The Full Catastrophe 4. View In iTunes All Together Singing In the Kitchen 3. View In iTunes", "textAfterTable": "Listeners Also Bought Nomads Indians Saints (feat. Bruce Dukov, Joel Derovin, Larry Corbett & Robert Becker) Indigo Girls View In iTunes Sister Holler Nerissa & Katryna Nields View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}