{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Little Red Corvette", "When Doves Cry", "I Would Die 4 U", "Darling Nikki", "1999", "When Doves Cry (Edit)", "When Doves Cry", "I Wanna Be Your Lover", "1999 (Edit)", "I Wanna Be Your Lover (Single Version)"], ["Album", "The Very Best of Prince", "Purple Rain (Soundtrack from the Motion Picture)", "The Very Best of Prince", "Purple Rain (Soundtrack from the Motion Picture)", "1999", "The Very Best of Prince", "The Hits / The B-Sides", "Prince", "The Very Best of Prince", "The Very Best of Prince"], ["Time", "4:56", "5:52", "2:58", "4:14", "6:19", "3:50", "3:50", "5:49", "3:38", "2:58"], ["Price", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Dirty Mind by Prince", "title": "", "url": "https://itunes.apple.com/us/album/id214145168?i=214145242", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00020-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 880020815, "recordOffset": 879991351, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{17825=I had heard cuts from his self-titled solo album before, but this was the very first one I bought back-in-the-day, when vinyl LP's were still played over record store speakers. Once you finished picking up your jaw after hearing the 2Phreaky4Every1 lyrics, you dropped it on the floor again at His Purple Badness's sheer grasp of songcraft and musicianship. Call him whatever you will, but you better add \"genius\" to it. For anybody who only knows 1999, PURPLE RAIN or the BATMAN soundtrack, start your early Prince education here., 124126=Copyright © 2014 Apple Inc. All rights reserved., 20643=Born: June 7, 1958 in Minneapolis, MN, 19034=I started digging Prince's music when everyone else jumped off of the bandwagon. This was the post-purple rain Prince. I typically dislike what the masses like because the masses seem to follow each other in lockstep without forming an individual opinion or thought. So when Prince became \"out of fashion\" of sorts, I realized that it was worth checking out. What it allowed me to do is judge his music without the hype and the machine called the record industry. That machine tells us who we should listen to based on how much money they can make and control they can have. Can you say Clay Aiken? Puh-lease. Anyway, I discovered this album a while back in the no-hype era of Prince's career and it plays as well today as it did when I first listened about 18 years ago. Prince's music blends multiple genres into an individual and distinctly recognizable Prince sound. His influence can be heard throughout today's so-called pop stars. Justin Timberlake totally bit Prince's 1988 LoveSexy for his recent tour. This album is part rock, part R & B, part disco and totally listenable. It's a must for anyone who wants to take a seriously enjoyable look into the beginnings of a music icon. Buy it and listen. But remember, with Prince, one listen can never define an experience. It takes a solid three or four listens to really understand what he's attempting to do...trust me....enjoy!}", "lastModified": "Sat, 01 Aug 2015 04:42:44 GMT", "textBeforeTable": "View In iTunes 1999 5. View In iTunes The Hits / The B-Sides 4. View In iTunes ART OFFICIAL AGE 3. View In iTunes Purple Rain (Soundtrack from the Motion Picture)", "textAfterTable": "Listeners Also Bought The Hits / The B-Sides Prince View In iTunes 20th Century Masters - The Millennium Collection: The Best of Rick James Rick James View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}