{"relation": [["Subject", "Is this real??? Efficiency of Militia Bill H.R. 11654", "Wikipedia, You are correct (if the Guard was created in 1903, who is this \"guard\" gun control refers to from the founding of our nation?)", "Re: Is this real??? Efficiency of Militia Bill H.R. 11654", "Re: Is this real??? Efficiency of Militia Bill H.R. 11654"], ["Author", "R-n-R Magnolia Springs,Ala", "vlad", "Jim Pa", "bayman"], ["Views", "4849", "505", "320", "181"], ["Posted", "July 22, 2011 05:56PM", "December 25, 2012 10:23AM", "July 24, 2011 07:29AM", "December 24, 2012 09:21AM"]], "pageTitle": "Is this real??? Efficiency of Militia Bill H.R. 11654", "title": "", "url": "http://www.findmall.com/read.php?20,1515235,1515235", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00087-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 447626907, "recordOffset": 447619059, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Quote Reply Edited 1 time(s). Last edit at 07/22/2011 05:57PM by R-n-R Magnolia Springs,Ala. Calling illegal aliens I didn't surrender, but they captured my horse and made him surrender.- 10 Bears Old Bandito 1, Sidewinder Umax w/ S-7 coil.(wife and son) Beach Hunter ID w/ 9.5!!!!!. White's XLT \"E\" W/ 9.5 ! ! ! Vlad - look into this, I know you can weed this out if anybody can. I can't find the whole bill, but bits and pieces I did find said in no uncertin terms that ANG ie - National Guard units COULD NOT BE USED OVERSEAS...... \"Be it enacted that the militia shall consist of every able-bodied male citizen, respective of States, Territories, and the District of Columbia and every able-bodied male of foreign birth who has declared his intention to become a citizen, who is more than 18 and less than 45 years of age, shall be divided into three classes; the organized militia, to be known as The National Guard of the State, Territory or District of Columbia, or by such other designations by the laws of the respective States or Territories, as may be given by the laws of", "textAfterTable": "Sorry, only registered users may post in this forum. Click here to login This forum is powered by Phorum.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}