{"relation": [["Plate", "7369", "9669", "10272", "10300"], ["Composer", "Ancliffe", "Debussy", "Palmgren", "Schubert"], ["Work", "Nights of Gladness", "Prélude à l'après-midi d'un faune (arrangement for piano solo)", "En Route, Op.9", "Fantasie in F minor, D.940 (Op.103) (arrangement for piano solo)"], ["Year", "1932", "1930", "1935", "1935"]], "pageTitle": "Edward B. Marks - IMSLP/Petrucci Music Library: Free Public Domain Sheet Music", "title": "", "url": "http://imslp.org/wiki/Edward_B._Marks", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00032-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 119310624, "recordOffset": 119294230, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{1249=Edward B. Marks founded the firm in 1919 with the purchase of J. Stern & Co. Marks bought out George M. Cohan in 1967. The current importance of Marks is mostly in his being USA agent for PWM and Josef Weinberger, but the firm publishes just about every kind of music, including works by Bolcom and Sessions.}", "lastModified": "Thu, 30 Jul 2015 03:06:15 GMT", "textBeforeTable": "Plate Numbers Imprints, Agencies, Addresses Editions Edward B. Marks founded the firm in 1919 with the purchase of J. Stern & Co. Marks bought out George M. Cohan in 1967. The current importance of Marks is mostly in his being USA agent for PWM and Josef Weinberger, but the firm publishes just about every kind of music, including works by Bolcom and Sessions. History 6 Authority control 5 Sources Consulted 4 Plate Numbers 3 Imprints, Agencies, Addresses 2 Editions 1 History Contents Contributor Portal Orchestrators, Arrangers and Editors Writers, Lyricists and Translators Editions Series Editions Manual of Style Publisher Pages Manual of Style Publishers’ Catalogues Overview Music Publishers and Plate Number Styles Historical Publication Info", "textAfterTable": "Sources Consulted 1. The New Grove Dictionary of Music and Musicians, edited by Stanley Sadie. New York and London: Macmillan Publications, 1980. Authority control VIAF (Edward B. Marks Music Co.) Retrieved from \" http://imslp.org/index.php?title=Edward_B._Marks&oldid=1532221\" Category: Music Publishers Personal tools Log in / create account Namespaces Page Discussion (0) Variants", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}