{"relation": [["Title", "The Camel Bookmobile", "The Shadow of Kilimanjaro", "The Worlds of a Maasai Warrior", "It's Our Turn to Eat: The Story of a Kenyan Whistleblower", "Wildflower: An Extraordinary Life and Untimely Death in Africa"], ["Author", "Masha Hamilton", "Rick Ridgeway", "Tepilit Ole Saitoti", "Michela Wrong", "Mark Seal"]], "pageTitle": "Kenya Tours & Travel | Intrepid Travel UK", "title": "", "url": "http://www.intrepidtravel.com/uk/kenya", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00303-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 513974607, "recordOffset": 513906846, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{87474=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 86155=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 188030=Review submitted 21 Jul 2015}", "TableContextTimeStampAfterTable": "{127637=Kenya receives a lot of tourists in January and February when the weather is hot and dry and generally the most pleasant. It’s also the best time for bird watching, as birds migrate to the lakes of the Rift Valley in large numbers. It’s generally less busy from June to September, but the weather is still dry during this time. Wet season is from March to May and October to December. During this time tourist sites are less crowded, hotels have more rooms available and prices are usually cheaper. The annual wildebeest migration occurs between July and August, and again in October each year. Millions of wildebeest migrate from the Serengeti in search of greener pastures and then return. The Masai Mara National Park is the best place to see this event., 153224=Feasts, speeches, parades, music and dance all feature in this national holiday commemorating Kenya’s independence and the establishment of its republic. A mass celebration of freedom and unity, this is a big day for all Kenyan people. The day is celebrated on 12th December each year., 139866=After much infighting, confrontation, uprising and reform, Kenya was granted its independence from British colonial rule in 1963. The “Mau Mau Uprising” of the 1950s was responsible for drawing attention to the plight of the African population, and was also the catalyst for the change in how Kenya is governed. The 1970s saw Kenya’s international economic profile grow due to the successful development of a free-market economy, with agriculture and tourism creating more a more stable economy. More recently, Kenya’s tourism industry has continued to develop and flourish, mainly due to its wealth of exotic animals, national parks, coastal hot-spots and unique cultures. Standards of living have also improved in Kenya, with an overall improvement in life expectancy, infant mortality and fertility rates – probably due to the increased investment in family planning, education and health by both the Kenyan government and NGOs. Despite this, many Kenyans still live below the poverty line and struggle to provide the bare necessities for themselves and their children. Regardless of this, travellers will be touched by the generosity of spirit and genuine hospitality that Kenyans display to visitors.}", "textBeforeTable": "Recommended reading Further reading To learn more or donate, go to: www.theintrepidfoundation.org Providing a safe home for Kenya’s orphaned and underprivileged children, the New Hope Children’s Centre receives no government funding. Relying on donations from generous patrons and supporters, this centre provides housing, food, clean water, education and health care for some of Kenya’s most vulnerable kids. Image supplied by New Hope Children's Centre. New Hope Children's Centre Providing a secure place for orphans and abandoned or abused children, this organisation offers a feeding and education program for children living in disadvantage, and support for HIV impacted mothers and their children in the Gilgil region. Image supplied by Mark Mitchell Saidia Children's Home In Kenya, The Intrepid Foundation proudly supports: The Intrepid Foundation provides travellers with an opportunity to give something back to the many wonderful communities we travel to. By donating to The Intrepid Foundation you can make a difference in local communities - in health care, education, human rights, child welfare and the protection of wildlife and the environment. The Intrepid Foundation 12. Be aware that many coastal", "textAfterTable": "Handy links www.lonelyplanet.com/kenya www.worldtravelguide.net/kenya www.magicalkenya.com × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}