{"relation": [["Author", "BlackAngelChick", "XxIceCreamHeadachexX", "XxIceCreamHeadachexX", "BlackAngelChick", "infinite-oddity", "cretingirl", "BlackAngelChick", "helluin", "BlackAngelChick", "hermitrisin"], ["Message", "Rating storiesEveryone keeps complaining about not getting reviews, but what about getting your stories rated? If you like the story, rate it! Posted at 2008-05-25 0:50", "I somewhat agree. But, a review tells the reader what they really think of the story. But, I do think ratings are just as important. And it's far easier and quicker to rate than it is to take your time to review. =/ Posted at 2008-05-26 15:31", "*the writer. Not the reader. I despise typos. Posted at 2008-05-26 15:32", "I fully agree that reviews are good, and sometimes better than ratings, but how are you supposed to tell if it's a good story or not if you are just browsing? Posted at 2008-05-27 23:44", "I think reviews are important, and as a writer, I love them. But, I know, sometimes when reading I don't want to write up how and why a fic is good or bad. I rate to let the community know what fics, in my opinion are worth reading, or not. But sadly, it is a common courtesy overlooked by many. Posted at 2008-06-02 16:06", "I love the reviews because they give me a healthy self esteem boost, but I would love to get a rating every now and then...if you have the time to review how much more time does it take to rate??? riddle me that Posted at 2008-06-03 23:37", "I think that some people are so caught up in trying to review a story that they forget to rate it. A long time ago (look at the very last page of the categories) people rated stuff a lot. Most of the stories on the very last pages are green!! I am just a little bit jealous. Posted at 2008-06-10 6:01", "The green stories on the last page are partly because if a story has been around for years, it's probably received 5 ratings. My newer stuff is better, but unrated. Posted at 2008-06-10 11:45", "Ah. I know so little... But some categories are really long! Anyone reading right to the end must have quite a lot of spare time. Posted at 2008-06-11 1:02", "ratings are convienient, i mean you don't always have the words to relate your response to a given story, but it still shows your appreciation (or at least that someone bothered to actually read it which is a nice feeling) and gives the writer an idea of what was good or needs improvement. it amazes me that anyone could read thru a catagory all the way. man, that's kind of awesome. Posted at 2008-06-14 4:07"]], "pageTitle": "FicWad: fresh-picked original and fan fiction", "title": "", "url": "http://ficwad.com/forum/topic/1328", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00234-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 86851990, "recordOffset": 86843788, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{4845=Site design Copyright 2005, K&D Lynch. All stories contained in this archive are the property of their respective authors, and the owners of this site claim no responsibility for their contents.}", "textBeforeTable": "» 2 1 « Home > The Melting Pot > Rating stories Lost password Register Log in Remember me Log in ▼ Sign up to adjust the filter You won't see stories with a lower score when you browse or search. Filter Filter: 0 Help Forum Search Browse FicWad", "textAfterTable": "« 1 2 » Site design Copyright 2005, K&D Lynch. All stories contained in this archive are the property of their respective authors, and the owners of this site claim no responsibility for their contents. Page created in 0.0457 seconds", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}