{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Rock and Roll, Hootchie Koo (Live)", "Third Degree", "Sweet Sixteen (feat. Joe Bonamassa)", "Be Careful With a Fool", "Sound the Bell", "Can't Hold Out (Talk to Me Baby) [feat. Ben Harper]", "Johnny B. Goode (Live at The Woodstock Music & Art Fair, August 18, 1969)", "Love, Life & Money", "Rock Me Baby", "Mojo Boogie"], ["Album", "No Time to Live", "Deluxe Edition: Johnny Winter", "Step Back", "Johnny Winter", "Serious Business", "Step Back", "The Woodstock Experience: Johnny Winter", "3rd Degree", "Essential 70s Rock", "Deluxe Edition: Johnny Winter"], ["Time", "3:18", "6:35", "7:57", "5:18", "3:30", "4:08", "5:36", "5:20", "3:50", "4:53"], ["Price", "$1.79", "$1.79", "$2.39", "$2.39", "$1.79", "$2.39", "$1.79", "$1.79", "$2.39", "$1.79"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Serious Business by Johnny Winter", "title": "", "url": "https://itunes.apple.com/nz/album/sound-the-bell/id5353869?i=5353851", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00160-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 887906975, "recordOffset": 887878802, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{19135=Although it could be argued that, for the most part, Johnny Winter has gotten better and better as a guitarist over the years, his career has had its ups and downs for personal and professional reasons. Especially after involving himself in the latter stages of Muddy Waters' career and helping the veteran bluesman achieve a comeback with 1977's Hard Again, Winter made superior music of his own on the blues-oriented Nothin' But the Blues and White, Hot & Blue. But those albums didn't sell as well as some of his earlier rock-oriented ones, and after his 1980 album Raisin' Cain moved back toward rock, but didn't even make the charts, he left his major label and spent a few years without a record company. Signing to the Chicago-based independent blues label Alligator Records, he staged his own comeback with 1984's Guitar Slinger, and its follow-up, Serious Business, is in the same vein. That vein is straight Chicago-style electric blues in the manner of Muddy Waters. No more is Winter trying to justify the big record contract that hung over him after he signed to Columbia Records in 1969, a contract that seemed to demand he become the next Jimi Hendrix. On Alligator, Winter is far more relaxed. But it isn't just the change of venue; he was already developing from his old mile-a-minute playing style into more of an expressive bluesman in the late ‘70s. Here, the transition is complete. Ken Saydak provides some piano interludes and Jon Paris, an old Winter bandmate, blows harmonica on several songs. But for the most part, this is Winter and his rhythm section of bass player Johnny B. Gayden and drummer Casey Jones, exploring familiar styles of electric blues from the jump style of \"It Ain't Your Business\" and the uptempo \"Give It Back,\" to the slow \"Murdering Blues,\" with its threatening lyric to a cheating woman. Maybe Johnny Winter isn't trying to be a superstar anymore, but his striving to be a consummate bluesman is wholly successful., 21256=Born: 23 February 1944 in Beaumont, TX, 123414=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 04:52:18 GMT", "textBeforeTable": "View In iTunes Deluxe Edition: Johnny Winter 5. View In iTunes The Progressive Blues Experiment (Remastered) 4. View In iTunes Original Album Classics: Johnny Winter 3.", "textAfterTable": "Listeners Also Bought Whoopin' Sonny Terry View In iTunes Hot Wires Roy Buchanan View In iTunes Don't Lose Your Cool Albert Collins View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}