{"relation": [["Title", "Everything is Illuminated", "Sweet Darusia", "Voices from Chernobyl", "Wolves Eat Dogs"], ["Author", "Jonathan Safran Foer", "Maria Matios", "Svetlana Alexievich", "Martin Cruz Smith"]], "pageTitle": "Ukraine Tours & Travel | Intrepid Travel NZ", "title": "", "url": "http://www.intrepidtravel.com/nz/ukraine", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00289-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 503755907, "recordOffset": 503697557, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{212663=Review submitted 28 Jul 2015, 110488=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 111807=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan...}", "TableContextTimeStampAfterTable": "{6739=Born and bred a boxer, Ponomaryov was devastated when his deteriorating eyesight began to derail his chosen career path. Undeterred by a lack of musical knowledge or training, he decided to follow his other great passion, striking a deal with a prestigious music college which agreed to provide him with tutorage - on the condition that he complete the gruelling 7-year curriculum in the space of 12 months. Apparently he passed, and in 2003 he went on to be the first artist to represent Ukraine at the Eurovision Song Contest, impressing the judges with an act that combined contortionists with an Apollo spacecraft. He finished 14th., 5421=One of Ukraine’s most celebrated stars, Iryna Bilyk has released 12 albums and continues to attract large crowds to her energetic live shows. At 25, Bilyk had the honour of performing for the President of the United States, Bill Clinton. More recently, she released ‘I Love You’, a duet with Jean-Claude-Van Dam, who is reportedly a huge fan of her music. In 2007, she married her dancing partner from the local TV show Dances with the Stars 2., 5924=Beginning his musical career in 1969 with a televised dance performance with a group of school students, Petrynenko rose to become the undisputed leader of Ukrainian rock music. After serving a brief period in the army, Petrynenko was banned from performing his controversial ‘Song about the Song’, and fled to Russia with his new group, Magic Guitars. After returning to Ukraine and recording a new album, Petrynenko’s newly formed band, Hrono, endured a forced break-up, mainly because the accompanying musicians refused to return from the band’s international tour. Despite this, Petrynenko went on to be crowned a ‘living legend’ of Ukrainian music and played a big part in the Orange Revolution, performing his songs to a passionate crowd in Kyiv., 3996=Don’t let the movie-star good looks fool you, Ruslana is one of Ukraine’s most talented musicians. Proficient in vocals, piano, guitar, drums, keyboards and of course, the Ukrainian alpine horn, Ruslana channelled her Carpathian Mountain-dwelling roots and became the pride of the nation by winning the 2004 Eurovision Song Contest with her original composition ‘Wild Energy’. Currently living in Hollywood and mixing it with the stars, Ruslana’s latest projects include collaborations with T-Pain and Missy Elliot, as well as her new single ‘Wow! (I’m so amazing)’, which features a street dance hip hop battle between her two alter egos: Ruslana-boy and Ruslana-girl.}", "textBeforeTable": "Recommended reading Further reading 7. Please ask and receive permission before taking photos of people, including children. 6. Refrain from supporting businesses that exploit or abuse endangered animals. 5. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 4. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 3. Always dispose of litter thoughtfully, including cigarette butts. 2. For environmental reasons, try to avoid buying bottled water. Instead, fill a reusable water bottle or canteen with tap or filtered water. 1. Be considerate of Ukraine’s customs, traditions, religion and culture. Top responsible travel tips for Ukraine Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this in mind while travelling. Ukraine Travel Tips Responsible Travel also provides useful health information: Go to: http://www.who.int/en/ The World Health Organisation Go to: http://www.fco.gov.uk/en/ From UK? Go to: http://travel.state.gov/ From US? Go to: http://www.voyage.gc.ca/ From Canada? Go to: http://www.safetravel.govt.nz/ From New Zealand?", "textAfterTable": "Handy links www.lonelyplanet.com/ukraine www.worldtravelguide.net/ukraine www.ukraine.org × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}