{"relation": [["Title", "Catfish and Mandala", "The Quiet American", "Peace is Every Step", "The Girl in the Picture", "The Sorrow of War"], ["Author", "Andrew X Pham", "Graham Greene", "Thich Nhat Hanh", "Denise Chong", "Bao Ninh"]], "pageTitle": "Vietnam | Intrepid Travel", "title": "", "url": "http://www.intrepidtravel.com/vietnam/subscriptions", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00319-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 522228271, "recordOffset": 522160217, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{187061=Review submitted 25 Jul 2015, 86719=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 85400=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o...}", "TableContextTimeStampAfterTable": "{134969=Generally, there's no 'best' time for travelling in Vietnam as the seasons are a little vague and vary considerably from north to south, and within regions. In the south, the dry season generally runs from December to June with March to May being particularly hot and humid. Temperatures usually range from 27°C to 36°C during this time. The wet season brings short and heavy rain showers from July to November, with temperatures averaging between 22°C and 27°C. Unlike the South, the northern regions of Vietnam have four seasons. Winter is from December to February - it can be extremely cold in Hanoi and the mountainous regions, with overnight temperatures of 4°C and daytime highs between 10°C and 20°C. Summer is June to August - expect hot and humid conditions at this time, with temperatures averaging between 27°C to 30°C and high humidity., 145585=The land now known as Vietnam has been inhabited since prehistoric times. Archaeological finds suggest that structured societies were in existence from as early as the 1st millennium BC. Early society was mostly feudal and agriculture-based, with various dynasties overseeing different parts of Vietnam until the Chinese invasion of 111 BC, which saw the societies of Vietnam and China become intertwined. Various Chinese dynasties dominated the area for hundreds of years, although revolts finally led to Vietnam gaining self-autonomy in 905. By 938, this period of Chinese imperial domination came to a close and Vietnam entered into an age of independence., 146298=During the 19th century, Vietnam came under the influence of French colonisers, who assumed control of Vietnam after the Sino-French War of 1884 and 1885. French Indochina was formed in 1887, and included parts of Vietnam, Cambodia and, later on, Laos. Although the French managed to suppress internal movements towards independence for many years, their control was finally relinquished in 1954 when Vietnamese forces overcame the French during the first Indochina War. Following this war, Vietnam was divided, with separate forces ruling the north (led by Ho Chi Minh) and the south (led by Ngo Dinh Diem, with support from the United States). The second Indochina War created wide-scale devastation and turmoil for the people of Vietnam, leading to mass migration to other parts of the world as asylum seekers tried to escape the conflict that ravaged their homeland. By the 1980s Vietnam's economy had all but collapsed, leading to further waves of migration out of Vietnam. More recently, Vietnam has benefited from the free market economy that was set up in 1986. Vietnam's economy continues to expand, with agriculture and industry providing the backbone, and the tourism sector also contributing. Although many Vietnamese people live below the poverty line, there have been widespread improvements in literacy and health which hopefully will continue to improve in the years to come., 96792=Our Vietnam trips score an average of 4.8 out of 5 based on 1519 reviews in the last year.}", "textBeforeTable": "Recommended reading Further reading To learn more or donate, go to: www.theintrepidfoundation.org This not-for-profit restaurant and vocational training program changes the lives of disadvantaged youth in Vietnam. Providing hospitality training, English language education and life skills, the KOTO cafe not only serves up great food, but also changes people's lives in the process. Image supplied by KOTO. KOTO Saigon Training Centre Caring for some of Vietnam's neediest children, this grassroots organisation provides life-saving medical treatment, therapy programs and education opportunities to families without means. Image supplied by Children's Hope in Action. Children's Hope in Action This organisation supports some of the most vulnerable children in Vietnam. Homeless, disabled and poverty stricken kids are greatly assisted by the health, education and social development programs run by this worthy organisation. Image supplied by Blue Dragon Children's Foundation. Blue Dragon Children's Foundation The Cuc Phuong Turtle Conservation Centre works to protect the many species of endangered turtle that", "textAfterTable": "Handy links www.lonelyplanet.com/vietnam www.worldtravelguide.net/vietnam www.vietnamtravelguide.com www.vietnamtourism.com × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}