{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Automatic", "Bad Girl", "So Long", "Are You Alone", "Alright, Okay, You Win", "Boys Must Be Strong", "Showdown", "Quick Turns", "U.S. Girls", "Eddie's Pals"], ["Artist", "Off Broadway", "Off Broadway", "Off Broadway", "Off Broadway", "Off Broadway", "Off Broadway", "Off Broadway", "Off Broadway", "Off Broadway", "Off Broadway"], ["Time", "3:41", "2:40", "3:53", "3:21", "2:40", "5:06", "4:02", "2:52", "4:20", "3:43"], ["Price", "$0.99", "$0.69", "$0.69", "$0.99", "$0.99", "$0.69", "$0.99", "$0.99", "$0.99", "$0.69"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Quick Turns by Off Broadway", "title": "", "url": "https://itunes.apple.com/us/album/showdown/id285615401?i=285615504", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00136-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 879799247, "recordOffset": 879776556, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{117966=Copyright © 2014 Apple Inc. All rights reserved., 21723=I don't like \"Quick Turns\" as much as their extraordinary debut \"On\"...but that is mainly because I prefer the classic '70's sound of \"On\". Production-wise \"Quick Turns\" sounds much more like an '80's record, which I assume was their intention, given that they recorded it in 1980, and it thus sounded quite contemporary at the time. Be that as it may, it is indeed quite a fine LP. Cliff Johnson + John Ivan = power pop magic...this band was so terrific, it so sad that they only made two proper records in their heyday. The tunes are good...the performances are great...the arrangements are terrific! When it comes to classic power pop there are very few bands who can hang with the great Off Broadway.}", "lastModified": "Fri, 31 Jul 2015 08:10:05 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Off Broadway Quick Turns iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Quick Turns by Off Broadway, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "10 Songs Album Review So the name Off Broadway screams N.Y.C., but these are Illinois boys, and one of the myriad skinny-tie bands (actually only a couple dudes sport ties) that should've hit the big time. The mileage Off Broadway gets from a cliché remains nothing less than extraordinary: \"U.S. Girls\" cops an age-old opening from the Beatles; \"Eddie's Pals\" delivers a power pop missive almost in a league with the Hollies' \"Dear Eloise\" (or maybe Rundgren's \"We Gotta Get You a Woman,\" but at least REO's \"In Your Letter\"). \"Boys Must Be Strong\" pleads poignantly and painfully long before the Cure's \"Boys Don't Cry.\" Even without Tom Werman on the boards (he guided Off Broadway's inaugural On, and also produced hometown heroes Cheap Trick before he transmogrified into a pop-metal maven), Quick Turns is a pleasing platter impossible to resist. ~ Whitney Z. Gomes, Rovi Customer Reviews Great Power Pop from the early '80's           by chicagorocks64 It's an absolute shame that this release didn't break Off Broadway. Automatic, Boys Must Be Strong, and Showdown are incredible songs, and the rest of the album is really", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}