{"relation": [["Author", "Gijs from Apeldoorn, NL", "KaiRo Webmaster", "Ratty from The Orient", "Vlad from NN", "Ricardo Palomares from Madrid, Spain"], ["Entry", "Composer, Venkman, ChatZilla? So does this new build not contain Composer, Venkman and ChatZilla? Has their code been imported into HG with/without consulting them? What's the plan in that space? 2008-06-29 00:26", "Gijs: We're importing ChatZilla, venkman, and in the future also DOMi from whatever repository they are using. Currently this is CVS, but I think it would be best for all of those to go for hg, using one repository per extension, just like what DOMi is working on, see bug 437064. Composer is a different story, it's currently part of mozilla-central, which we pull into the build tree using the client.py script (that is also used to pull in all those extensions). 2008-06-29 01:53", "Repository Name Hey KaiRo, What about my suggestion for the combined repository: \"Thundermonkey\"? 2008-06-29 05:36", "Name setca caset macasu secam masca 2008-06-30 21:52", "Congratulations!! Congratulations on this, Robert!! This may sound as uninteresting to some people, but the fact that SeaMonkey can continue its development on Mercurial as soon as it is needed looks wonderful to me. 2008-06-30 22:41"]], "pageTitle": "Home of KaiRo: Build From New Test Repository Works!", "title": "", "url": "http://home.kairo.at/blog/2008-06/build_from_new_test_repository_works", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00181-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 111830274, "recordOffset": 111822072, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{626=Entry written by KaiRo and posted on June 28th, 2008 21:55 | Tags: hg, Mozilla, SeaMonkey, Thunderbird | 5 comments | TrackBack}", "lastModified": "Sat, 01 Aug 2015 03:30:26 GMT", "textBeforeTable": "Comments Entry written by KaiRo and posted on June 28th, 2008 21:55 | Tags: hg, Mozilla, SeaMonkey, Thunderbird | 5 comments | TrackBack Monkey), which was a proposal in #maildev. There's still some need to discuss this topic between our projects, I guess. MoMo\" + Sea suite), internally, I'm currently using \"momomo\" (Mozilla Messaging, i.e. \" mail- calendar- It looks like we can soon end up with a working code repository for our projects - what we still need is a good name for it. My first temporary name was \"calemaisu\" ( The next steps I'll work on are getting Lighting to build with Thunderbird, make tests run correctly, drive the two needed patches into mozilla-central and get my changes (build system, mainly) reviewed. Please let me know of any problems when trying to build this or run the resulting binaries. SeaMonkey:hg-based_build page on the wiki to describe how to build with that test repository, and as of now, the instructions there (should) lead to fully working builds of SeaMonkey and hopefully also Thunderbird! For this purpose, I rewrote the I volunteered to create a test repository and work on getting things to build on local computers, eventually even work on test/build machines so that we have", "textAfterTable": "Add comment Copyright © 2005-2015 KaiRo.at. powered by CBSM.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}