{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14"], ["Name", "Evergreen", "Light My Fire", "You and I", "Leave Right Now", "Your Game", "Friday's Child", "Switch It On", "All Time Love", "Who Am I", "Changes", "Grace", "Let It Go", "Hopes & Fears", "If It Hadn't Been for Love"], ["Artist", "Will Young", "Will Young", "Will Young", "Will Young", "Will Young", "Will Young", "Will Young", "Will Young", "Will Young", "Will Young", "Will Young", "Will Young", "Will Young", "Will Young"], ["Time", "4:11", "3:27", "4:03", "3:32", "4:08", "8:58", "3:46", "3:55", "4:25", "3:57", "4:35", "3:37", "3:43", "3:36"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Will Young: The Hits by Will Young", "title": "", "url": "https://itunes.apple.com/mt/album/will-young-the-hits/id336609517", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00235-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 873758199, "recordOffset": 873731506, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{28655=Born: 20 January 1979 in Hungerford, Berkshire, England, 123155=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 07:37:31 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Will Young Will Young: The Hits iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Will Young: The Hits by Will Young, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes", "textAfterTable": "14 Songs Album Review Breaking the mold of the archetypal pop idol, Will Young has avoided the here today, gone tomorrow fate of many other talent contest winners, arguably thanks to a determination to distance himself from Simon Cowell as quickly as possible. The Hits, which features 12 singles from his four studio albums plus two new tracks, only emphasizes what a wise decision that was. Early post-Idol singles \"Evergreen,\" a rather clichéd Westlife album track that became the template for the TV show winners' debut singles, and \"Light My Fire,\" a competent but unexciting rendition of the Doors classic, have Cowell's stamp all over them. Luckily, his Gareth Gates duet, \"The Long and Winding Road,\" undoubtedly the dullest number one this decade, isn't included here. But it's pretty likely that if the other two hadn't been such gargantuan successes (\"Evergreen\" is the biggest-selling single of the noughties), Young would quite happily have omitted them as well. Only the gorgeous string-soaked \"You and I\" hinted that Young could fulfill his initial promise if he weren't lumbered with such pure karaoke material. Fortunately, second album Friday's Child saw Young take his career into his own hands, eschewing the Burt Bacharach-influenced sounds of his debut in favor of the blue-eyed soul-pop that Simply Red based a career on. The simple acoustic ballad", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}