{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15"], ["Name", "Intro", "Chewing Gum", "Always Too Late", "Me Plus One", "Heartbeat", "Helpless Fool for Love", "Anniemal", "No Easy Love", "Happy Without You", "Greatest Hit", "Come Together", "My Best Friend", "Always Too Late (Y$ Remix)", "Heartbeat (Royksopp Remix)", "Helpless Fool for Love (Patrick Wolf Remix)"], ["Artist", "Annie", "Annie", "Annie", "Annie", "Annie", "Annie", "Annie", "Annie", "Annie", "Annie", "Annie", "Annie", "Annie", "Annie", "Annie"], ["Time", "0:54", "3:56", "4:16", "3:38", "3:06", "3:57", "3:35", "4:02", "3:16", "3:39", "7:49", "3:56", "3:39", "5:52", "3:52"], ["Price", "$1.79", "$1.79", "$1.79", "$1.79", "$1.79", "$1.79", "$1.79", "$1.79", "$1.79", "$1.79", "$1.79", "$1.79", "$2.39", "$1.79", "$2.39"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Anniemal by Annie", "title": "", "url": "https://itunes.apple.com/nz/album/heartbeat/id337329830?i=337329975", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00001-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 876453319, "recordOffset": 876429420, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{27774=In 1999, Annie and her boyfriend/producer, Erot, made a slippery-sexy single called \"The Greatest Hit.\" Though it came out of Norway, it sounded more than a little American, sampling Madonna's \"Everybody\" while also echoing the nonchalant ecstasy of Patrice Rushen's \"Forget Me Nots.\" It didn't take off, at least not in the traditional sense. It floated around the underground, saw release on labels in different territories, and eventually became a pseudo-secret smash. Within a couple years, dancers and DJs in a few countries began to wonder what became of Annie. Erot's life was claimed by a heart defect in 2001; his partner, quite understandably, went quiet for a while. She picked herself up, took a very active role in the Bergen, Norway, music community, and recorded Anniemal with production help from Richard X, Röyksopp, and Op:L Bastards' Timo Kaukolampi. \"The Greatest Hit,\" thankfully reprised here, is indicative of the album as a whole, bursting with sparkling melodies (often spiked with just a hint of melancholy) over mostly danceable rhythms that are either wholly modern or mischievously referential to early-'80s club hits (Tom Tom Club, the Human League, Arthur Russell's Dinosaur L). Annie's voice might be a little thin, but that's no real factor when it's so sweet and likable. The topics — teasing, aching, longing — aren't unfamiliar, yet they're often dealt with in a clever manner. Take \"Chewing Gum,\" in which a dumped boy gets sort of objectified and verbally slain at the same time (\"You think you're chocolate when you're chewing gum\"), or \"The Greatest Hit,\" containing the most foolproof come-on you could ever give a record geek (\"C'mon, baby, you're my greatest hit\"). As cunning as it is, Anniemal is also deeply affecting. \"Heartbeat\" is the least resistible of all, glowing with anticipatory pulses, tremulous sighs, and quivering electric piano vamps., 129685=Copyright © 2014 Apple Inc. All rights reserved., 29885=Born: 21 November 1977 in Norway}", "lastModified": "Fri, 31 Jul 2015 08:45:34 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Annie Anniemal iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Anniemal by Annie, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "15 Songs Album Review In 1999, Annie and her boyfriend/producer, Erot, made a slippery-sexy single called \"The Greatest Hit.\" Though it came out of Norway, it sounded more than a little American, sampling Madonna's \"Everybody\" while also echoing the nonchalant ecstasy of Patrice Rushen's \"Forget Me Nots.\" It didn't take off, at least not in the traditional sense. It floated around the underground, saw release on labels in different territories, and eventually became a pseudo-secret smash. Within a couple years, dancers and DJs in a few countries began to wonder what became of Annie. Erot's life was claimed by a heart defect in 2001; his partner, quite understandably, went quiet for a while. She picked herself up, took a very active role in the Bergen, Norway, music community, and recorded Anniemal with production help from Richard X, Röyksopp, and Op:L Bastards' Timo Kaukolampi. \"The Greatest Hit,\" thankfully reprised here, is indicative of the album as a whole, bursting with sparkling melodies (often spiked with just a hint of melancholy) over mostly danceable rhythms that are either wholly modern or mischievously referential to early-'80s club hits (Tom Tom Club, the Human League, Arthur Russell's Dinosaur L). Annie's voice might be a little thin, but that's no real factor when it's so sweet and likable. The topics — teasing, aching, longing —", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}