{"relation": [["Author", "Kandathil, AJ", "Kandathil, AJ"], ["Title", "The frequency of HIV-I drug resistance mutations among treatment-naive individuals at a tertiary care centre in South India.", "A comparison of interpretation by three different HIV type 1 genotypic drug resistance algorithms using sequences from non-clade B HIV type 1 strains."], ["Citation", "Int J STD AIDS, 2009", "ARHR, 2009"]], "pageTitle": "Isolate Data", "title": "", "url": "http://hivdb.stanford.edu/cgi-bin/GetIsolateData.cgi?IsolateID=137886", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00167-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 110729254, "recordOffset": 110721052, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Isolate Data hivdb program Genotype-Clinical Genotype-Pheno Genotype-Rx HOME --> For production, rootDir should be http://hivdb.stanford.edu/ we specify where the root is by using a variable \"rootDir\".", "textAfterTable": "C Plasma None Treatment History Order Regimen Weeks 1 None NA Protease Sequence PIMajorDRMs PIMinorDRMs Polys UnusualMuts     K14R, I15V, M36I, N37S, R41K, L63T, H69K, V82I, L89M, I93L   >VL07_237| codons 1-99 PQITLWQRPLVTIRVGGQLKEALLDTGADDTVLEEISLPGKWKPKMIGGIGGFIKVRQYD QITIEICGKKAIGTVLVGPTPINIIGRNMLTQLGCTLNF RT Sequence NRTIMajorDRMs NRTIMinorDRMs NNRTIMajorDRMs NNRTIMinorDRMs Polys UnusualMuts         V35T, T39D, S48T, V60I, D121Y, K122E, I135R, S162A, K173A, D177E, V179I, Q197H, T200A, I202V, Q207E, R211K, V245Q, A272P, E291D, V292I, I293V, E297A   >VL07_237| codons 1-300 PISPIETVPVKLKPGMDGPKVKQWPLTEEKIKALTEICDEMEKEGKITKIGPENPYNTPI FAIKKKDSTKWRKLVDFRELNKRTQDFWEVQLGIPHPAGLKKKKSVTVLDVGDAYFSVPL YEDFRKYTAFTIPSRNNETPGIRYQYNVLPQGWKGSPAIFQASMTKILEPFRAQNPEIII YQYMDDLYVGSDLEIGHHRAKVEELREHLLKWGFTTPDKKHQKEPPFLWMGYELHPDKWT VQPIQLPEKDSWTVNDIQKLVGKLNWASQIYPGIKVKQLCKLLRGTKALTDIVPLTAEAE References Author Title Citation Kandathil, AJ The frequency of HIV-I drug resistance mutations among treatment-naive individuals at a tertiary care centre in South India. Int J STD AIDS, 2009 Kandathil, AJ A comparison of interpretation by three different HIV type 1 genotypic drug resistance algorithms", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}