{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"], ["Name", "The Show", "Bring Me Down", "Skipalong", "Don't Let Me Fall", "Anything I'm Not", "Knock Knock", "Dangerous and Sweet", "Trouble Is a Friend", "Live Like You're Dying", "Like a Song", "We Will Not Grow Old", "Force of Nature (Bonus Track)"], ["Artist", "Lenka", "Lenka", "Lenka", "Lenka", "Lenka", "Lenka", "Lenka", "Lenka", "Lenka", "Lenka", "Lenka", "Lenka"], ["Time", "3:55", "3:28", "3:52", "2:50", "3:18", "3:40", "3:31", "3:35", "3:49", "3:20", "3:18", "3:33"], ["Price", "$1.29", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$1.29", "$0.99", "$0.99", "$0.99", "Album Only"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Lenka by Lenka", "title": "", "url": "https://itunes.apple.com/us/album/lenka/id289423632?i=289423671", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00235-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 873837047, "recordOffset": 873813153, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{124705=Copyright © 2014 Apple Inc. All rights reserved., 26466=Born: March 19, 1978 in Bega, New South Wales, Australia}", "lastModified": "Fri, 31 Jul 2015 08:59:34 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Lenka Lenka iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Lenka by Lenka, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "12 Songs Album Review Those looking to satisfy a sweet-toothed craving for pop music should sink their teeth into this debut, which introduces Lenka as one of 2008's strongest newcomers. Horns, cellos, violas, keyboards, and vibraphones share equal space here, creating a sound that's at once lushly elegant and bubbly commercial. Having already cut her teeth with the Decoder Ring, Lenka now asserts herself as a competent vocalist and songwriter, penning three of the album's tracks while co-writing the remaining eight. \"The Show,\" \"Bring Me Down,\" and \"Trouble Is a Friend\" all brim with the cleverly crafted hooks of a Max Martin composition, and Lenka's fondness for internal rhyme helps tighten her phrases into concentrated balls of pop melody. The results are pure radio gold, perhaps alarmingly so, but Lenka's voice helps bring a sense of playfulness to what might otherwise be an exercise in all too perfect pop music. Singing in her endearing Australian accent, she shifts between the breathy sighs of \"Don't Let Me Fall\" and the measured, innocent confidence of \"Like a Song.\" Quiet piano chords and a sparse trumpet riff provide the instrumental backing for the latter tune, and \"Like a Song\" shows that Lenka still shines when the thick instrumental padding is stripped away, making this candy-coated debut that much sweeter.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}