{"relation": [["", "1.", "2.", "3.", "4."], ["Date", "02 Jun 2015", "18 Oct 2011", "16 Dec 2006", "22 Jun 2006"], ["Author", "JUAN", "Frank McDONOUGH", "Robert Lewis", "mike carambat"], ["Subject", "(0) General coverage mod for Heathkit SB-1400", "(0) Heathkit Transformer", "(0) Fix For Frequency \"Jumping\"", "(0) Heath SB-1400"], ["", "", "View article", "", "View article"]], "pageTitle": "mods.dk - Articles for Heathkit 'SB-1400'", "title": "", "url": "http://www.mods.dk/index.php?ModelId=880&RadioId=1-heathkit", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 13, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00122-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 582905718, "recordOffset": 582897516, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{16037=This forum message list include all message for that is related to SB-1400, this include message that also is related to articles. If the message is relate to an article, the article can be selected next to each message., 19968=Click here to see the article list for SB-1400.}", "textBeforeTable": "This forum message list include all message for that is related to SB-1400, this include message that also is related to articles. If the message is relate to an article, the article can be selected next to each message. Note that page can take a while to load, if there are many modifications. Click here to view all the ABOVE modifications for sb-1400 in one page. General coverage mod for Heathkit SB-1400 19 Jul 1998 Radio \"Jumps\" in Frequency 17 Dec 2006 Description Uploaded Articles for Heathkit 'SB-1400'   Other", "textAfterTable": "Click here to write a new message or comment for SB-1400 Note that the message is not related to any article. Click here to see the article list for SB-1400. Do you have any tricks, modifications or constructions for homebrewed equipment that are not on mods.dk, please send the information to mods.dk. If you prefer to be anonymous write it in the message.   Heathkit Menu Manuals Pictures", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}