{"relation": [["Tutorial/Guide Link", "Raspberry Pi YouTube Tutorials", "Introducing the Raspberry Pi", "The Coding Club Free eBook(s)", "DracoSoftware", "Easy GPIO Hardware & Software (Wiki)"], ["Description", "Forum Link: Liam Fraser's Video Tutorials", "h2g2 project: Introducing the Raspberry Pi", "Forum Link: Teaching Youngsters Programming", "Forum Link: Blog about working with Raspberry Pi for Windows users", "Forum Link: Easy GPIO Hardware & Software Aim to introduce the basic circuits for interfacing through the GPIO."], ["Level", "Beginner", "Beginner", "Beginner (~ages 10)", "Beginner", "Beginner"], ["Tags", "Teaching, Python", "Startup guide", "Teaching, Python", "Teaching, Windows, Linux", "Teaching, Basic Hardware"], ["Author", "Liam Fraser", "Tufty", "Sciman", "dracolytch", "Meltwater - Open Project"], ["Status", "Available", "Available", "Available", "Available", "In-Progress"]], "pageTitle": "RPi Projects - eLinux.org", "title": "", "url": "http://elinux.org/index.php?title=RPi_Projects&oldid=94196", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00268-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 81587542, "recordOffset": 81571148, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Tutorials/Guides List Project Status (Not Started/In-Progress/Available). Author(s) or group who have produced it (also if it is an Open/Community Project for anyone to contribute) Tags (key words related to the project, i.e. LCD Screen, Teaching, Python) Skill level/Ages it is aimed at (Any/Beginner/Intermediate/Advanced) Project Description (including any additional links or information Project Title (as a link to the project webpage or connected wiki page) Fill in each section: Please add links to your projects (and ones you find interesting). The Raspberry Pi Forum has a list of Project Ideas & Links, to help people get started. Introduction to R-Pi Projects, Guides & Tutorials Games - all kinds of computer games. Community - links to the community elsewhere on the web. Education - a place to share your group's project and find useful learning sites. Datasheets - a frambozenier.org documentation project. Tasks - for advanced users to collaborate on software tasks. Projects - a list of community projects. Help others out. Guides - a list of informative guides. Make something useful. Tutorials - a list of tutorials. Learn by doing. Community Pages: Back to the Hub.", "textAfterTable": "Community Project List Project Title Link Project Description Level Tags Author Status Pi In The Sky (Wiki) Cloud Storage and Management - Basic concept: Enable ways to easily switch and share system images for the R-Pi and manage user data, allowing joint development and easy management of set-ups. Fast/Easy backup of system/data to external storage or network (local or cloud). Management/Repository of base images. Boot from network Forum Link: Pi in the Sky - Cloud management? Advanced Cloud, Storage, Management Meltwater - Open Project Not Started General Project List Project Title Link Project Description Level Tags Author", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}