{"relation": [["", "1", "2", "3", "4", "5", "6", "7"], ["Name", "India", "Gazzelloni", "Water Babies", "Machine Gun", "Something Sweet, Something Tender", "Sometimes, Perpetually", "Three Wishes"], ["Artist", "Robert Dick With The Soldier String Quartet, Robert Dick & The Soldier String Quartet", "Robert Dick, Robert Dick With The Soldier String Quartet & The Soldier String Quartet", "The Soldier String Quartet, Robert Dick With The Soldier String Quartet & Robert Dick", "Valerie Naranjo, Dave Soldier, Dawn Buckholz, Judith Insell, Kermit Driscoll, Mark Dresser, Regina Carter, Richard Bona, Robert Dick, Steve Argüelles & Ben Perowsky", "Robert Dick With The Soldier String Quartet, Robert Dick & The Soldier String Quartet", "Robert Dick With The Soldier String Quartet, Robert Dick & The Soldier String Quartet", "Robert Dick With The Soldier String Quartet, Robert Dick & The Soldier String Quartet"], ["Time", "7:24", "7:49", "5:19", "8:02", "9:31", "7:25", "6:21"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Jazz Standards On Mars by Robert Dick & The Soldier String Quartet", "title": "", "url": "https://itunes.apple.com/lv/album/machine-gun/id270057271?i=270057442", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00242-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 878649859, "recordOffset": 878621298, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{112497=Autortiesības © 2014 Apple Inc. Visas tiesības aizsargātas., 16454=Born: 04 January 1950 in New York}", "lastModified": "Fri, 31 Jul 2015 08:25:57 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Robert Dick & The Soldier String Quartet Jazz Standards On Mars iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Jazz Standards On Mars by Robert Dick & The Soldier String Quartet, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open,", "textAfterTable": "7 Songs Album Review Flutist Robert Dick decided to do a CD with several of the spacier jazz standards, and with the Soldier String Quartet, he succeeds in bringing life to John Coltrane's \"India\" and Jimi Hendrix's \"Machine Gun,\" among others. His highly expressive playing harks back to Eric Dolphy, and though this disc might not be a good choice for purists, the playing is highly enjoyable. Biography Born: 04 January 1950 in New York Genre: Jazz Years Active: '80s, '90s, '00s The traditions of classical music are combined with the improvisation of and technical skills of jazz to create the imaginative music of New York-born and Switzerland-based flute player, Robert Dick. Describing himself as \"a musician with twenty-first century skills and eighteenth century attitudes,\" Dick continues to pioneer a new role for the flute in modern music. Performing as a soloist, or in a duo that he shares with pianist Anthony DeMare, Dick continues to take such a high energy approach... Full bio Top Albums and Songs by Robert Dick", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}