{"relation": [["Title", "Naples 44", "The Sicilian", "Ancient Rome: The Rise and Fall of an Empire", "The Name of the Rose", "A Thousand Days in Venice", "The Divine Comedy"], ["Author", "Norman Lewis", "Mario Puzo", "Simon Baker", "Umberto Eco", "Marlena de Blasi", "Dante Alighieri"]], "pageTitle": "Italy | Intrepid Travel NZ", "title": "", "url": "http://www.intrepidtravel.com/nz/italy/sail-italy-amalfi-procida-2015-84609", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00209-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 515142635, "recordOffset": 515078083, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{188192=Review submitted 25 Jul 2015, 87392=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 86073=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o...}", "TableContextTimeStampAfterTable": "{131923=Held on the first Sunday of September and dating back to the 13th century, this historic event sees the canals of Venice turned into a competitive rowing race between colourful, carved boats. Passionate supporters line the banks of the canals and street performers and artists come out to celebrate too., 120467=After the Renaissance, Italy was unified with Sardinia in 1861, becoming the Kingdom of Italy. After World War I, Italy came under the fascist rule of Benito Mussolini, who ruled until 1943. Siding with Nazi Germany in World War II, the Italian Army suffered many losses and ultimately surrendered in 1945. After a referendum in 1946, Italy became a Republic and flourished well during the 1950s and 1960s. The post-war period marks a time of economic progress for Italy, also largely reflected by the rest of the world's increased economic stability during this period of relative peace. From the 1970s, Italians have lived with political upheaval and uncertainty. Corruption, organised crime, terrorism and government debt have created times of turmoil and concern. In 1994, media mogul Silvio Berlusconi was elected into office as Prime Minister but was forced to step down later in the year after losing support from his political partners. Undeterred, Berlusconi regained power in 2008 and has continued to rule Italy amid much controversy and scandal., 118955=The rise of the Roman Empire has been the subject of much fascination, intrigue and interest from scholars, artists, travellers and students around the world, and through the ages. Dominating the world for many centuries, the modern world can pay great respect to the fruits of this mighty civilisation, with many important scientific inventions, art movements, architectural triumphs and philosophical ideas being born during Roman civilisation - most notably during the Renaissance. Founded sometime around 750 BC, Rome endures as one of the most important cities in the world. Home to such famous citizens as Julius Caesar, Emperor Augustus, Claudius, Nero, Mark Antony and Marcus Aurelius, Rome has enjoyed the great highs of dominating the Mediterranean region and the artistic triumphs of the Renaissance, but also the lows of the Great Fire of Rome, which ended up destroying a large part of the city. Rome has survived natural disasters, political turmoil, feuding families, the plague, war and more, to be the great city that is it today. Still a cultural and political powerhouse, any visit to Italy needs to include Rome's major sites in order to understand the birth of this nation. The Colosseum, The Pantheon, Circus Maximus and Palatine Hill are all great places to start. Lasting centuries, the amazing history of Ancient Rome is full of dramatic twists and turns, and we suggest you read up on it before visiting., 105817=Italy enjoys a temperate climate most of the year, with June, July and August being the warmest months. Popular tourist spots can get very busy and crowded during the European summer, but the sun is shining and the weather is hot so it's still a great time to go. April - May and September - October (while not as hot) still offer great conditions for travel, with milder temperatures and fewer crowds at the sights and beaches. It can get quite cold in the winter months, especially in the north, with cities like Milan, Turin and Venice often seeing snow, fog and rain in December and January. Major coastal tourist spots like the Amalfi Coast and Cinque Terre all but close (except to locals) during winter and are truly best seen in the warmer months.}", "textBeforeTable": "Recommended reading Further reading 7. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 6. Learn some Italian and don't be afraid to use it - simple greetings will help break the ice. 5. Refrain from touching or interfering with ancient monuments, relics or historic sites. 4. Try to use public transport wherever possible. 3. For environmental reasons, try to avoid buying bottled water. Fill a reusable water bottle or canteen with filtered water instead. 2. Please ask and receive permission before taking photos of people, including children. 1. Always dispose of litter thoughtfully, including cigarette butts. Top responsible travel tips for Italy Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this in mind while travelling. Italy Travel Tips Responsible Travel also provides useful health information: Go to: http://www.who.int/en/ The World Health Organisation Go to: http://www.fco.gov.uk/en/ From UK? Go to: http://travel.state.gov/ From US? Go to: http://www.voyage.gc.ca/", "textAfterTable": "Handy links www.lonelyplanet.com/italy www.worldtravelguide.net/italy www.wikitravel.org/en/Italy × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}