{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14"], ["Name", "Massive Cure", "It's Cold", "It's Not Your Day to Shine", "Rad", "Take It Away", "La Pump", "Pygmy Motorcycle", "About the Picture", "Bottlenose", "Make It Through", "I've Got My Own Problems to Fix", "The Quack", "To Walk Away From", "But Now I Know"], ["Artist", "Smoosh", "Smoosh", "Smoosh", "Smoosh", "Smoosh", "Smoosh", "Smoosh", "Smoosh", "Smoosh", "Smoosh", "Smoosh", "Smoosh", "Smoosh", "Smoosh"], ["Time", "1:59", "2:48", "2:04", "1:51", "2:56", "2:59", "2:40", "3:08", "1:34", "3:11", "1:14", "0:49", "2:18", "2:11"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - She Like Electric by Smoosh", "title": "", "url": "https://itunes.apple.com/ee/album/but-now-i-know/id39976745?i=39976739", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00121-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 876811243, "recordOffset": 876789331, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{27239=Formed: 2002 in Seattle, WA, 116934=Autoriõigus © 2014, Apple Inc. Kõik õigused on reserveeritud.}", "lastModified": "Sat, 01 Aug 2015 04:31:46 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Smoosh She Like Electric iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from She Like Electric by Smoosh, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "14 Songs Album Review The whole swirl of attention Smoosh got out of the gate due to the performers' age was understandable, but so was the reason why people were listening to start with. She Like Electric is great, brawling, fun, rock pop without obvious rock signifiers via guitars. The duo of Asya and Chloe only needed vocals, keyboards, and drums to whip out one engaging, enjoyably brisk song after another, kicking off with the stutter drum groove of \"Massive Cure\" and not holding back. Asya's voice tries on both a to-the-fore style and a softer croon here and there, but on \"Take It Away,\" the latter interpretation works incredibly well, understated but full and fun like the music. The music, meanwhile, constantly varies its ideas of what a verse-chorus structure could be like, although not completely reinventing the conventional pop form. Chloe's drumming throws in all kinds of unexpected touches per song: \"It's Cold\" is a miniature showcase for cymbal accents alone. The great bass keyboard growl and hook kicking off \"La Pump\" is another wonderful moment, while the minute-long \"The Quack,\" meanwhile, could be something out of 1981's no wave. \"It's Not Your Day to Shine\"'s happily forthright hip-hop-meets-new-wave adds to the standouts throughout, something that puts everything together into something fun, a little rough around the edges,", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}