{"relation": [["Author", "Kemayo", "KurtPikachu2001", "Kemayo", "KurtPikachu2001", "ThomasStephen", "DickJemi"], ["Message", "Upcoming downtimeI will soon have to put FicWad into a read-only mode for a little while so I can migrate its database to a different host. (It's a slow thing. Dump a backup of gigabytes and gigabytes of database, scp them to a different server, import the backup.) Translation: FicWad will experience a period of non-interactivity which will last several hours at some point in the next few days. Enjoy. Posted at 2013-01-27 15:24", "Is that why my fanfic \"Mr. Smith Goes To Egypt\" didn't get posted today? Posted at 2013-02-06 15:58", "Nope, that'd be something else. Posted at 2013-02-13 11:54", "Oops! Never mind! It finally got published! I had to promise I wasn't a 'filthy spammer'. Posted at 2013-02-14 7:16", "I am not getting it properly, do show some demo. Posted at 2013-03-12 15:00", "Waiting for the update. Posted at 2013-03-25 4:43"]], "pageTitle": "FicWad: fresh-picked original and fan fiction", "title": "", "url": "http://rune.cain.thecatandtheprodigy@ficwad.com/forum/topic/8661", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00182-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 208868261, "recordOffset": 208860059, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{2172=Site design Copyright 2005, K&D Lynch. All stories contained in this archive are the property of their respective authors, and the owners of this site claim no responsibility for their contents.}", "textBeforeTable": "Home > Announcements > Upcoming downtime Lost password Register Log in Remember me Log in ▼ Sign up to adjust the filter You won't see stories with a lower score when you browse or search. Filter Filter: 0 Help Forum Search Browse FicWad", "textAfterTable": "Site design Copyright 2005, K&D Lynch. All stories contained in this archive are the property of their respective authors, and the owners of this site claim no responsibility for their contents. Page created in 0.0324 seconds", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}