{"relation": [["Side D Titles", "1. Lost For Words", "2. High Hopes"], ["Artist", "Pink Floyd", "Pink Floyd"], ["Length", "05:14", "07:58"]], "pageTitle": "Pink Floyd - The Division Bell [20th Anniversary Edition] (Vinyl LP) - Amoeba Music", "title": "", "url": "http://www.amoeba.com/the-division-bell-20th-anniversary-edition-lp-pink-floyd/albums/3266733/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00083-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 296050401, "recordOffset": 296034007, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1244=After The Wall, Roger Waters wanted to continue taking Pink Floyd in the same ever-darker, ambitious, experimental direction, accidentally alienating both fans and his band members in the process. The band reached its tipping point with the brooding, intellectual Final Cut and called it quits. When David Gilmour reformed the band four years later, it took some time to retool the Floyd back into the well-oiled machine it once was. The band would tour, write, rehearse, and record, but it wasn't until the 1994 release of The Division Bell that Pink Floyd really felt like a band again, both from the inside and from the perspective of the public. Considered by many to be the first proper Pink Floyd album of their second era, the era in which Roger Waters was no longer a part of the picture, the 20th anniversary edition of the band's return to their groovy and slightly menacing, slow lurking moody psychedelic form comes in the form of double 180 gram LPs featuring original full length versions of songs shortened for the album's initial release., 1329=06/28/2014}", "TableContextTimeStampAfterTable": "{12258=Copyright © 2015 Amoeba, All Rights Reserved. Amoeba and the Amoeba Music mark and logo are trademarks of Amoeba Music Inc.}", "lastModified": "Sat, 01 Aug 2015 03:47:36 GMT", "textBeforeTable": "Track Listing After The Wall, Roger Waters wanted to continue taking Pink Floyd in the same ever-darker, ambitious, experimental direction, accidentally alienating both fans and his band members in the process. The band reached its tipping point with the brooding, intellectual Final Cut and called it quits. When David Gilmour reformed the band four years later, it took some time to retool the Floyd back into the well-oiled machine it once was. The band would tour, write, rehearse, and record, but it wasn't until the 1994 release of The Division Bell that Pink Floyd really felt like a band again, both from the inside and from the perspective of the public. Considered by many to be the first proper Pink Floyd album of their second era, the era in which Roger Waters was no longer a part of the picture, the 20th anniversary edition of the band's return to their groovy and slightly menacing, slow lurking moody psychedelic form comes in the form of double 180 gram LPs featuring original full length versions of songs shortened for the album's initial release. 06/28/2014 Amoeba Review CD Also available in: SHIPS FREE in U.S. $49.98 BUY", "textAfterTable": "3. Poles Apart Pink Floyd 07:04 Side B Titles Artist Length 1. Marooned Pink Floyd 05:28 2. A Great Day For Freedom Pink Floyd 04:18 3. Wearing The Inside Out Pink Floyd 06:48 Side C Titles Artist Length 1. Take It Back Pink Floyd 06:12 2. Coming Back To Life Pink Floyd 06:19", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}