{"relation": [["Title", "Karateka", "Prince of Persia", "Prince of Persia 2: The Shadow and the Flame", "The Last Express", "Prince of Persia: The Sands of Time", "Karateka"], ["Year", "1984", "1989", "1993", "1997", "2003", "2012"], ["Platform", "Apple II", "Apple II", "DOS", "Windows, DOS, Mac OS", "PlayStation 2, Xbox", "Xbox 360"], ["Publisher", "Brøderbund Software", "Brøderbund Software", "Brøderbund Software", "Brøderbund Software", "Ubisoft", "D3 Publisher"]], "pageTitle": "Jordan Mechner - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/Jordan_Mechner", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00156-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 857120899, "recordOffset": 857104554, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{2202=Jordan Mechner (born 4 June 1964)[2] is an American video game designer, author, screenwriter, and filmmaker, best known for creating the Prince of Persia video game franchise and the 8-bit game Karateka., 10392=In 2003, Mechner wrote and directed the documentary film, Chavez Ravine: A Los Angeles Story. It won the 2003 IDA award for Best Short Documentary, was short-listed for an Academy Award nomination, and received its broadcast premiere on PBS Independent Lens in 2005.[5], 8212=In 2001, Mechner worked with Ubisoft to reboot Prince of Persia. Developed at Ubisoft Montreal with Mechner as game designer, writer and creative consultant, Prince of Persia: The Sands of Time was released in 2003. It received 12 nominations and 8 awards at the Interactive Achievement Awards (D.I.C.E.).[4] Ubisoft has since published four more Prince of Persia sequels and several spinoffs., 9111=Mechner became one of the few video game creators to adapt his own creation as a feature film with Disney's Prince of Persia: The Sands of Time, produced by Jerry Bruckheimer, directed by Mike Newell, and starring Jake Gyllenhaal, Gemma Arterton, Ben Kingsley, and Alfred Molina. Disney released Prince of Persia movie on May 28, 2010. Mechner wrote the first drafts of the screenplay and is an executive producer of the film., 4533=Mechner was born in New York City. He is a graduate of Yale University where he received a BA in psychology in 1985., 6327=Mechner designed and directed the first sequel, Prince of Persia 2: The Shadow and the Flame[citation needed], released in 1993. By then, he was focused on game design and story mechanics and was no longer programming., 10779=Mechner's original graphic novel Templar, illustrated by LeUyen Pham & Alex Puvilland, was published by First Second Books in July 2013.[6] (Book One, Solomon's Thieves, was published in paperback in May 2010.)[7] Templar became a New York Times best-selling book and was nominated for an Eisner award.[8] Mechner previously collaborated with First Second, Pham & Puvilland on the 2008 Prince of Persia graphic novel written by A.B. Sina. Mechner also wrote the graphic novel, Prince of Persia: Before the Sandstorm, to tie in with the release of the film in 2010., 5624=His second game, Prince of Persia, was released in 1989 after over four years of work. He wrote both games in 6502 assembly language for the Apple II, though that system was in decline through the late 1980s and little new software was released by 1989. Initially Prince of Persia sold poorly, but as it was ported to other systems sales increased. Eventually it was adapted for nearly every computer and console platform., 6937=Mechner founded independent developer Smoking Car Productions in 1993, where he led the production of the CD-ROM adventure game The Last Express. Smoking Car grew to sixty people,[3] a huge game development team for the mid-1990s, and the game took longer to finish than anticipated. When finally released in 1997, it was positively reviewed but sold poorly. The Last Express was re-released in 2012 by French publisher DotEmu for mobile and other platforms.}", "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT", "textBeforeTable": "Published games[edit] Mechner has published his game development journals from the 1980s, describing the making of the first Prince of Persia game and its predecessor, Karateka, on his website,[10] where he also posts sketches and current information about his projects.[11] Mechner was able to recover the source code of the Prince of Persia game from recently found 23-year-old 3.5″ Apple ProDOS floppy disks[12] and posted it online.[13] Mechner has written a screenplay for a film adaptation of Michael Turner's Fathom for Fox Studios with actress Megan Fox.[9] Mechner's original graphic novel Templar, illustrated by LeUyen Pham & Alex Puvilland, was published by First Second Books in July 2013.[6] (Book One, Solomon's Thieves, was published in paperback in May 2010.)[7] Templar became a New York Times best-selling book and was nominated for an Eisner award.[8] Mechner previously collaborated with First Second, Pham & Puvilland on the 2008 Prince of Persia graphic novel written by A.B. Sina. Mechner also wrote the graphic novel, Prince of Persia: Before the Sandstorm, to tie in with the release of the film in 2010. In 2003, Mechner wrote and directed the documentary film, Chavez Ravine: A Los Angeles Story. It won the 2003 IDA award for Best Short Documentary, was short-listed for", "textAfterTable": "Published books[edit] Title Year Publisher Collaborators Templar 2013 First Second Books LeUyen Pham & Alex Puvilland (illus.) The Making of Karateka: Journals 1982-1985 2012 Amazon The Making of Prince of Persia: Journals 1985-1993 2010 Amazon Prince of Persia: Before the Sandstorm 2010 Disney Todd McFarlane, Bernard Chang, Cameron Stewart, et al. (illus.) Solomon's Thieves (Templar: Book One) 2010 First Second Books LeUyen Pham & Alex Puvilland (illus.) Prince of Persia: The Graphic Novel 2008 First Second Books A.B. Sina (writer), LeUyen Pham & Alex Puvilland (illus.) Movies[edit] Waiting for Dark (1993) Chavez Ravine: A Los Angeles Story (2003) Prince of Persia: The Sands of Time (2010) (screenwriter) References[edit] ^ Mechner, Jordan (7 April 2014). \"Jordan Mechner on Twitter\". Twitter. Retrieved 3 October 2014. ", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}