{"relation": [["Title", "Andorra", "A Tramp in Spain: From Andalusia to Andorra", "Mr. S and the Secrets of Andorra’s Box"], ["Author", "Peter Cameron", "Bart Kennedy", "Ross O’Carroll-Kelly"]], "pageTitle": "Andorra Tours & Travel | Intrepid Travel FR", "title": "", "url": "http://www.intrepidtravel.com/fr/andorra", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00095-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 527290919, "recordOffset": 527238445, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{206755=Review submitted 24 Jul 2015, 105621=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 104302=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o...}", "TableContextTimeStampAfterTable": "{3453=In 2003, Marc Forné Molné, the former Andorran Prime Minister, revealed that the country’s military budget relies exclusively on voluntary donations., 927=The best time to visit Andorra really depends on what you’re after. If it’s a temperate alpine escape, summer (June–August) is your man – though evenings can still get cold. If it’s the country’s world-famous skiing you’re seeking, then it’s winter (December–February) you’ll be wanting. Daytime temperatures from mid-November to May tend to hover around 6-degrees Celcius and the snow falls in abundance., 2789=While it may not have actually seen any fighting, Andorra qualifies as the longest combatant in the First World War. Courtesy of being forgotten from the Versailles Peace Conference, it was technically at war with Germany from 1914 to 1958.}", "textBeforeTable": "Recommended reading Further reading 6. 6. Please ask and receive permission before taking photos of people, including children. 5. 5. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive and supports the local community. 4. 4. Learn some local language – Catalan and Spanish – and don't be afraid to use it; simple greetings will help break the ice. 3. 3. Always dispose of litter thoughtfully, including cigarette butts. 2. 2. Andorra’s tap water is considered safe to drink. For environmental reasons, try to avoid buying bottled water and instead fill and refill a reusable water bottle or canteen. 1. 1. Be considerate of Andorra’s customs, traditions, religion and culture. Top responsible travel tips for Andorra Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this in mind while travelling. Andorra Travel Tips Responsible Travel also provides useful health information: Go to: http://www.who.int/en/ The World Health Organisation Go to: http://www.fco.gov.uk/en/ From UK? Go to: http://travel.state.gov/ From US? Go to: http://www.voyage.gc.ca/ From Canada?", "textAfterTable": "Handy links lonelyplanet.com/andorra visitandorra.com/en/home/ × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}