{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16"], ["Name", "Tennis Court", "400 Lux", "Royals", "Ribs", "Buzzcut Season", "Team", "Glory and Gore", "Still Sane", "White Teeth Teens", "A World Alone", "No Better", "Bravado", "Million Dollar Bills", "The Love Club", "Biting Down", "Swingin Party"], ["Artist", "Lorde", "Lorde", "Lorde", "Lorde", "Lorde", "Lorde", "Lorde", "Lorde", "Lorde", "Lorde", "Lorde", "Lorde", "Lorde", "Lorde", "Lorde", "Lorde"], ["Time", "3:18", "3:54", "3:10", "4:18", "4:06", "3:13", "3:30", "3:08", "3:36", "4:54", "2:50", "3:41", "2:18", "3:21", "3:33", "3:42"], ["Price", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Pure Heroine (Extended) by Lorde", "title": "", "url": "https://itunes.apple.com/us/album/pure-heroine-extended/id773618496?app=itunes", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00003-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 871726211, "recordOffset": 871693643, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{29595=Signed to a major label at an early age, she was groomed in the darkness of studios, the label knowing the potential they had in their singer/songwriter. She wrote on her own, then she was paired with a sympathetic producer/songwriter, live performances taking a back seat to woodshedding. If this story in the early years of the 2010s brings to mind Lana Del Rey, it's no coincidence that it also applies to New Zealand singer/songwriter Lorde, whose 2013 debut, Pure Heroine, contains all of the stylized goth foreboding of LDR's Born to Die and almost none of the louche, languid glamour. This is not a small thing. Lana Del Rey is a self-created starlet willing herself into stardom but Lorde fancies herself a poet, churning away at the darker recesses of her soul. Some of this may be due to age. Lorde, as any pre-release review or portrait helpfully illustrated, was only 16 when she wrote and recorded Pure Heroine with producer Joel Little, and an adolescent aggrievance and angst certainly underpin the songs here. Lorde favors a tragic romanticism, an all-or-nothing melodrama that Little accentuates with his alternately moody and insistent productions. Where Lana Del Rey favors a studiously detached irony, Lorde pours it all out which, in itself, may be an act: her bedsit poetry is superficially more authentic but the music is certainly more pop, both in its construction — there are big hooks in the choruses and verses — and in the production, which accentuates a sad shimmer where everything is beautiful and broken. [Pure Heroine was also released on LP.], 33582=Born: November 7, 1996 in Auckland, New Zealand, 131988=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 07:20:20 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Lorde Pure Heroine (Extended) iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Pure Heroine (Extended) by Lorde, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "16 Songs Album Review Signed to a major label at an early age, she was groomed in the darkness of studios, the label knowing the potential they had in their singer/songwriter. She wrote on her own, then she was paired with a sympathetic producer/songwriter, live performances taking a back seat to woodshedding. If this story in the early years of the 2010s brings to mind Lana Del Rey, it's no coincidence that it also applies to New Zealand singer/songwriter Lorde, whose 2013 debut, Pure Heroine, contains all of the stylized goth foreboding of LDR's Born to Die and almost none of the louche, languid glamour. This is not a small thing. Lana Del Rey is a self-created starlet willing herself into stardom but Lorde fancies herself a poet, churning away at the darker recesses of her soul. Some of this may be due to age. Lorde, as any pre-release review or portrait helpfully illustrated, was only 16 when she wrote and recorded Pure Heroine with producer Joel Little, and an adolescent aggrievance and angst certainly underpin the songs here. Lorde favors a tragic romanticism, an all-or-nothing melodrama that Little accentuates with his alternately moody and insistent productions. Where Lana Del Rey favors a studiously detached irony, Lorde pours it all out which, in itself, may be an act: her bedsit", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}