{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "ExplicitR.I.P. (feat. 2 Chainz)", "ExplicitGet Right", "ExplicitI Luv It", "ExplicitR.I.P (Remix) [feat. Chris Brown, Yg & Kendrick Lamar]", "ExplicitHot N***a (Jeezy Remix)", "ExplicitAct Right (feat. Yg & Yo Gotti)", "ExplicitI Need Dollas", "ExplicitRack City (Remix) [feat. Wale, Fabolous, Meek Mill, Tyga & T.i]", "ExplicitChampagne for the Pain (feat. Red Cafe)", "Its Been a Pleasure"], ["Album", "R.I.P. (feat. 2 Chainz) - Single", "Get Right - Single", "The Inspiration", "The Poems of Jay Jenkins", "We Bout Dat Life, Vol. 4", "The Poems of Jay Jenkins", "Camaro Music", "Get It Right", "Me Against the World", "God of War, Vol. 13 (Jeezy Edition)"], ["Time", "3:19", "4:17", "4:00", "3:40", "2:15", "4:01", "3:01", "4:18", "4:06", "4:07"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "1,29 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - TM:103 Hustlerz Ambition by Young Jeezy", "title": "", "url": "https://itunes.apple.com/hu/album/oj-feat.-fabolous-jadakiss/id485938088?i=485938148", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00212-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 877582135, "recordOffset": 877556070, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{107961=Copyright © 2014 Apple Inc. Minden jog fenntartva., 31022=Born: 12 October 1977 in Columbia, SC, 28748=After releasing The Recession in 2008, Young Jeezy suffered his own three-year layoff due to legal problems and a fight with the crippling disease Bell's palsy. Add a paradigm shift in hip-hop radio, where the introspection of Drake and Kid Cudi found favor over Jeezy and T.I.'s extroverted pusher music, then top if off with a slew of missed released dates and the whole thing stinks of a setup, which is why any fond appreciation of TM:103 must come from the \"warts and all\" department. This unforgiving return to form doesn’t suffer from being over-thought and it’s not even overwrought, but it is overstuffed at 14 tracks (make that 18 for the deluxe version) and the most welcoming moments are pushed to the back (the \"F.A.M.E.\"/\"I Do\"/\"Higher Learning\" sequence is like a trap music glitter dome with Jay-Z, André 3000, T.I., and Snoop Dogg all on the guest list). These minor complaints will matter little to returning fans as their needs are put first with the front half of album rolling like a steamroller fueled by grind-time anthems. Even the hack \"game needs me\"-styled opener is welcome as the rapper forces \"Waiting\" out of his hoarse throat like it was gravel, and after \"What I Do\" does something infectious and incredible with an economic hook and a Drumma Boy beat, the bold \"OJ\" comes along filled with iffy metaphors and a trailer load of controversy. The scattershot and irresponsible number is a red herring and kept a safe distance from the album’s true key track, \"Trapped,\" where Jeezy and Jill Scott offer a crafted and complicated social statement, one that’s soulful and the worthy successor to \"My President.\" What’s made Jeezy's evolution as an artist interesting is that this rebel without a cause sometimes finds one, and even when he's more Hulk than Bruce Banner, his changes are driven by emotion rather than something calculated. Here he's driven by the hunger to put things back where they were and live up to TM:103's official subtitle, Hustlerz Ambition, along with its unofficial one, Trap or Die Tryin'.}", "lastModified": "Fri, 31 Jul 2015 07:59:48 GMT", "textBeforeTable": "View In iTunes Soul Survivor (Featuring Akon) - EP 5. View In iTunes Soul Survivor - Single 4. View In iTunes When the North and South Collide, Pt. 2 3.", "textAfterTable": "Listeners Also Bought Unexpected Arrival (Deluxe Version) Diggy View In iTunes N.W.A. The Game View In iTunes Dipset Mania HD Various Artists View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}