{"relation": [["Title", "CARPA standard treatment manual [6th ed.]", "Eye health education resource kit: I see for culture", "Kimberley Aboriginal Medical Services Council standing orders: 7th edition - 2012", "NHMRC guidelines for the screening, prognosis, diagnosis, management and prevention of glaucoma 2010"], ["Year", "2014", "2009", "2012", "2010"], ["Author", "Central Australian Rural Practitioners Association", "International Centre for Eyecare Education", "Kimberley Aboriginal Medical Services Council", "National Health and Medical Research Council"], ["Type", "Book", "Resource package", "Report", "Report"]], "pageTitle": "Health practice resources « Resources « Other eye conditions « Eye health workers « Other health conditions « Australian Indigenous HealthInfoNet", "title": "", "url": "http://www.healthinfonet.ecu.edu.au/other-health-conditions/eyeworkers/other-eye-conditions/resources/health-practice-resources", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00144-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 499396160, "recordOffset": 499380235, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{9424=© Australian Indigenous HealthInfoNet 2015 This product, excluding the Australian Indigenous HealthInfoNet logo, artwork, and any material owned by a third party or protected by a trademark, has been released under a Creative Commons BY-NC-ND 3.0 (CC BY-NC-ND 3.0) licence. Excluded material owned by third parties may include, for example, design and layout, images obtained under licence from third parties and signatures.}", "textBeforeTable": "If you have information you would like to have included on this page please contact us. When you click on one of the headings of the table, the list will be sorted according to that heading. For more information about the resource, click on the title. Health practice resources » Health practice resources » Resources » Other eye conditions » Eye health workers » Other health conditions Home Print About this resource Funding Conferences, workshops and events Job opportunities Courses and training Workforce", "textAfterTable": "  Last updated: 5 June 2015   Return to top Contribute Share your information » Give us feedback » Sign our guestbook » Australian Indigenous HealthInfoNet, Kurongkurl Katitjin, Centre of Indigenous Australian Studies, Edith Cowan University Edith Cowan University 2 Bradford Street Mt Lawley, WA 6050 +61 8 9370 6336 healthinfonet@ecu.edu.au © 2001-2015 Australian Indigenous HealthInfoNet - Disclaimer Stay connected Yarning places Follow us on Twitter Like us on Facebook Message stick Sign our Guestbook", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}