{"relation": [["Publication", "CMS Family Guide", "CMS Family Album"], ["Publisher", "UNEP/CMS Secretariat", "UNEP/CMS Secretariat"], ["Type", "Leaflets & Brochures", "Leaflets & Brochures"], ["Published Date", "10 2011", "08 2011"]], "pageTitle": "Monk Seal in the Atlantic | Atlantic Turtles", "title": "", "url": "http://www.cms.int/atlantic-turtles/en/legalinstrument/monk-seal-atlantic", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00195-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 373533704, "recordOffset": 373517756, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{3592=Since 1986, the populations of Mediterranean Monk Seals have been at the centre of the Mediterranean Action Plan of UNEP. The Mediterranean Monk Seal has also been a main focus of CMS conservation measures for marine mammals. The Mediterranean Monk Seal is one of the most threatened marine mammals in the world and is listed on the Appendices of the Convention. Appendix I Listing commits member states to ban seal hunting and capture and to conserve its habitat to counteract factors impeding migration. This includes surveying other threat factors as well as preventing disturbance to the species., 5140=The Memorandum of Understanding (MOU) concerning Conservation Measures for the Eastern Atlantic Populations of the Mediterranean Monk Seal (Monachus monachus) was concluded under the auspices of the Convention on Migratory Species (CMS) and came into effect on 18 October 2007 when all four Range States signed the MOU in Spain. The MOU was open for signature to all the Atlantic Range States. The Action Plan, annexed to the MOU, is an integral part thereof.}", "TableContextTimeStampAfterTable": "{18418=This site is maintained by the UNEP/CMS Secretariat © 2014  | Disclaimer UNEP/CMS Secretariat, Platz der Vereinten Nationen 1, 53113 Bonn, Germany Tel. (+49 228) 815 2401, Fax. (+49 228) 815 2449, Contact}", "textBeforeTable": "Eastern Atlantic Completed Fundación CBD para la Conservación de la Biodiversidad y su Habitat (CBD-Habitat) Action Plan for the recovery of the Mediterranean Monk Seal in the Eastern Atlantic (Meeting of the Action Plan working group in the Mauritania) Region Status Implementing Agency End date Start date Project 1979 / 1979 Phocidae Carnivora Mammalia Mediterranean Monk Seal Monachus monachus Appendix (App. I / App. II) Family Order Class Common name Scientific name", "textAfterTable": "News News Media Watch Notifications Op-ed Press releases Education & Awareness Campaigns Meetings & Events Standing Committee Scientific Council Related Links The CMS Family E-community login CMS ScC Workspace Contact Secretariat Standing Committee members CMS newsletter E-mail * Subscribe", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}