{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25"], ["Name", "I Need a Girl, Pt. 2 (feat. Ginuwine)", "Coming Home (feat. Skylar Grey)", "ExplicitDiddy Boppin' (feat. Yung Joc & Xplicit)", "Come to Me (feat. Nicole Scherzinger) [ATFC Mix]", "Last Night (feat. Diddy)", "Last Night", "Come to Me (Reggae Remix) [feat. Elephant Man & Nicole Scherzinger]", "ExplicitPartners for Life (feat. Jamie Foxx)", "ExplicitThrough the Pain (She Told Me) [feat. Mario Winans]", "ExplicitTell Me (feat. Christina Aguilera)", "ExplicitCome to Me (feat. Nicole Scherzinger)", "ExplicitWe Gon' Make It (feat. Jack Knight)", "The Last Song", "Can't Believe", "I Need a Girl (To Bella)", "So Complete", "Child of the Ghetto", "Where's Sean?", "On Top", "Airport (Interlude)", "Blast Off", "Diddy", "Let's Get It", "The Saga Continues", "Toe Game (Interlude)"], ["Album", "R&B Old School, Vol. 4 (Spéciale dédicace, 100% RnB Old School)", "Rap Force One", "Diddy Boppin' (feat. Yung Joc & Xplicit) - Single", "Bad Boy Dance Mixes, Vol. 4", "Just Like You (Deluxe Version)", "Just Like You (Bonus Track Version)", "Come to Me (Reggae Remix) - Single [feat. Elephant Man & Nicole Scherzinger]", "Press Play", "Press Play", "Press Play", "Press Play", "Press Play", "The Saga Continues...", "The Saga Continues...", "The Saga Continues...", "The Saga Continues...", "The Saga Continues...", "The Saga Continues...", "The Saga Continues...", "The Saga Continues...", "The Saga Continues...", "The Saga Continues...", "The Saga Continues...", "The Saga Continues...", "The Saga Continues..."], ["Time", "2:39", "3:58", "4:26", "7:55", "4:15", "4:15", "4:46", "4:31", "5:28", "4:06", "4:36", "3:33", "3:49", "3:49", "4:11", "3:36", "3:43", "5:05", "3:57", "0:27", "3:40", "3:54", "4:16", "3:51", "1:06"], ["Price", "0,99 €", "0,99 €", "1,29 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Diddy", "title": "", "url": "https://itunes.apple.com/lu/artist/diddy/id186775115", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00163-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 875282383, "recordOffset": 875256849, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{29610=Combs took a serious blow in the spring of 2002 when Arista stopped distributing Bad Boy and took Evans with them. A collection of Bad Boy remixes entitled We Invented the Remix became his last album for Arista. 112 also attempted to jump ship to Def Jam, but a restraining order was filed before the group could make a clean break. It was around this time that Diddy broke into reality television by becoming the focal point of Making the Band 2, and subsequently Making the Band 3 (which birthed the group Danity Kane), Making the Band 4, and Making His Band. Bad Boy was revived during the summer of 2006 through the success of both Yung Joc's \"It's Going Down\" and Cassie's \"Me&U,\" which helped set the stage for his own star-studded Press Play, released that October. After numerous holdups, Diddy issued his fifth album in December 2010. Co-billed to Dirty Money, his group featuring Kalenna Harper and Danity Kane's Dawn Richard, Last Train to Paris was as heavy on high-profile guest collaborators as the previous Diddy release., 36940=One of the biggest hip-hop impresarios ever, Sean Combs — known as Puff Daddy until his professional name change to P. Diddy, then just Diddy — created a multi-million-dollar industry around Bad Boy Entertainment, with recordings by the Notorious B.I.G., Craig Mack, Faith Evans, 112, and Total all produced and masterminded by Combs himself. Responsible for over $100 million in total record sales and named ASCAP's 1996 Songwriter of the Year, Combs was, on the other hand, criticized by many in the hip-hop community for watering down the sound of the underground and also for a perceived over-reliance on samples as practically the sole basis for many of his hits. A very successful A&R executive at Uptown Records during the early '90s responsible for sizable hit records by Father MC, Mary J. Blige, and Jodeci, Combs formed his own Bad Boy label, signed B.I.G., Evans, and Mack, and earned enough hits to cement an alliance with Arista Records. A highly publicized feud with Death Row Records (in which Tupac Shakur and label head Suge Knight served as West Coast/Dark Side equivalents to the Notorious B.I.G. and Combs) was summarily ended in late 1996, when Shakur was murdered and Knight jailed. Six months later, the Notorious B.I.G. was dead as well, and after Combs mourned his friend's death, he hit the pop charts in a big way during his biggest year, 1997., 32120=Combs' subsequent LP as Puff Daddy, No Way Out, shot straight to number one and was certified platinum several times over; in 1998 it won the Grammy Award for Best Rap Album and \"I'll Be Missing You\" won the award for Best Rap Performance by a Duo or Group. Forever followed in 1999, but the rushed release and lack of any new ideas disappointed fans and dampened sales. On top of that, on April 15 of that year he was accused of severely beating Interscope Records exec Steve Stoute and was brought to court for the incident. Puffy managed to get his sentence trimmed down to second-degree harassment when he finally reached the courts in September, much to his detractors' dismay., 33935=Sean \"Puffy\" Combs began branching out with Bad Boy during 1995, adding platinum R&B acts Faith Evans and Total (both of whom were connected to B.I.G., Evans as his wife and Total as his former backing vocal group) plus another platinum seller, 112, in 1996. He also produced for many outside artists (including Aretha Franklin, Boyz II Men, Mariah Carey, TLC, SWV, and Lil' Kim) and added two straight-ahead hip-hop acts, Mase and the LOX. By that time, however, Combs and B.I.G. were embroiled in a feud with Death Row Records' head, Suge Knight, and star, Tupac Shakur. Shakur accused Combs of involvement in his 1994 shooting, mocked B.I.G. by saying he had slept with Faith Evans, and threatened the two in the lyrics to his hit song \"Hit 'Em Up.\" (The video for the track featured two characters, P.I.G. and Buffy, who are humiliated in various ways.), 28521=Acting and the launch of a music television channel called Revolt occupied the years 2011-2013, and Combs announced early in 2014 that he was resurrecting the Puff Daddy alias for his fifth album, MMM. The single \"Big Homie\" premiered in February, featuring Rick Ross and French Montana. ~ John Bush & Bradley Torreano, Rovi, 33024=In September 1996, however, Shakur was shot and killed by unknown assailants; just six months later, in March of 1997, B.I.G. himself was killed in the same fashion. Just three weeks later, his second album debuted at number one and was eventually certified six times platinum. The single \"Hypnotize\" also hit number one and stayed on the charts for months after B.I.G. was killed. Though Combs had been preparing his own solo debut, under the name Puff Daddy, he quit working for several months out of grief for his longtime friend. When he returned in mid-1997, it was with a vengeance, as the single \"Can't Nobody Hold Me Down\" held the top spot on the singles charts for almost two months. Following quickly behind was another monster number one hit, \"I'll Be Missing You,\" a tender tribute to B.I.G. with Evans providing background vocals., 30467=A planned gospel album was pushed back to a summer release during the mess, but by March some good news finally hit the Bad Boy camp. Puffy was acquitted of all charges stemming from the club incident, which also snuffed out the civil suits revolving around his involvement in the club situation. In a move sure to spark comparisons with Prince (and not the good kind of comparisons), he announced that he was changing his professional name to P. Diddy at the end of the month, and also predicted a new direction for himself and his label. He recorded a gospel album, Thank You, as well as a new solo album, The Saga Continues, but the former was never released. \"Bad Boy for Life\" became his biggest hit in years late in the summer, and a collaboration with David Bowie appeared on the Training Day movie soundtrack., 34758=He worked as a remixer during 1993 and set up Bad Boy Entertainment as his own venture, running the label out of his apartment during long hours with only several employees. After more than a year of hard work, he finally signed two hit artists: former EPMD roadie Craig Mack and the Notorious B.I.G. Mack hit the big time in mid-1994, when a remix of his \"Flava in Ya Ear\" single (featuring LL Cool J, Busta Rhymes, Rampage, and the Notorious B.I.G.) hit the Top Ten and became the first platinum record for Bad Boy. At the beginning of 1995, B.I.G. notched the second, when his own second hit, \"Big Poppa,\" reached number six on the pop charts. Mack's album Project: Funk da World eventually went gold and the Notorious B.I.G.'s Ready to Die was certified double platinum., 35535=Born in Harlem in 1969, Sean Combs spent much of his childhood in nearby Mt. Vernon, NY. Already a shrewd businessman through his two paper routes, Combs applied to Howard University in Washington, D.C., and while attending, convinced childhood friend Heavy D to sign him up as an intern at the label for which he recorded, Uptown Records. Several months later, he was an A&R executive with his sights set on the vice presidency, serving as the executive producer for Father MC's 1990 album Father's Day, which became a hit. Successful albums followed for Mary J. Blige (What's the 411?) and Heavy D & the Boyz (Blue Funk) during 1992, though Combs was fired from Uptown by the following year (probably because he was a bit too ambitious)., 31399=More controversy started brewing when his relationship with singer/actress Jennifer Lopez was made public around the same time. Engagement rumors haunted them for a few months, but the real problems began when they were present at a shooting in a New York City club that December. The couple was brought in for questioning and eventually both faced charges for illegal possession of a firearm. Meanwhile, rapper Shyne was indicted for the incident, but Puffy was not dismissed because of the weapons charge. His trial date for the club shooting was finally set, while October found two new lawsuits facing the rapper. First, his driver sued for three million dollars due to personal injury and stress, followed by a $1.8 million suit from the club owner stemming from poor business following the shooting. Though Lopez initially supported Puffy, she broke off their relationship on Valentine's Day 2001.}", "TableContextTimeStampAfterTable": "{66488=Copyright © 2014 Apple Inc. Tous droits réservés., 61684=04 November 1969 in New York, NY [Harlem]}", "lastModified": "Fri, 31 Jul 2015 07:53:45 GMT", "textBeforeTable": "Top Songs View In iTunes Tell Me - EP 15. View In iTunes Come to Me (Reggae Remix) - Single [feat. Elephant Man & Nicole Scherzinger] 14. View In iTunes Get Buck In Here (feat. Akon, Diddy, Ludacris & Lil Jon) - Single 13.", "textAfterTable": "1 2 3 Top Music Videos 1. Scream & Shout (feat. Britney Spears, Hit Boy, Waka Flocka Flame, Lil Wayne & Diddy) [Remix] View In iTunes 2. Me & U (Remix) [feat. Diddy & Yung Joc] View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}