{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Sunrise", "Morning In Soweto", "The Thousand Petalled Lotus", "I and Thou", "Uma Lake", "Ancient Peoples", "Calling to the Luminous Beings", "Roundhouse", "Molimo", "Sunset"], ["Artist", "Adam Rudolph", "Adam Rudolph", "Adam Rudolph", "Adam Rudolph", "Adam Rudolph", "Adam Rudolph", "Adam Rudolph", "Adam Rudolph", "Adam Rudolph", "Adam Rudolph"], ["Time", "19:12", "5:00", "6:59", "2:05", "3:14", "7:35", "5:54", "2:28", "2:44", "5:08"], ["Price", "Album Only", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Spirits by Adam Rudolph, Hamid Drake & Pharoah Sanders", "title": "", "url": "https://itunes.apple.com/us/album/spirits/id63490512", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00239-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 882267267, "recordOffset": 882238269, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{119964=Copyright © 2014 Apple Inc. All rights reserved., 20559=Born: September 12, 1955 in Chicago, IL}", "lastModified": "Fri, 31 Jul 2015 08:43:19 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Adam Rudolph, Hamid Drake & Pharoah Sanders Spirits iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Spirits by Adam Rudolph, Hamid Drake & Pharoah Sanders, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your", "textAfterTable": "10 Songs Album Review This in-concert recording at the Montreal Jazz Festival is a continual performance that acts as a suite in three basic parts, with Sanders on tenor sax, wood flutes, and percussion, helped by multipercussionists Hamid Drake and Adam Rudolph. The music is as the title suggests: spiritual, multi-ethnic, mostly serene, and quite improvisationally derived. It's a beautiful statement from Sanders, very similar to the music Yusef Lateef has played (with Rudolph and Eternal Wind) and different than his more major-label efforts. \"Sunrise,\" running over 19 minutes, begins the hour-long program. Soft drone tones set up tenor meditations, slight percussive inserts, mbira and driftwood wordless vocals, and soulful chanting, then move back to tenor musings with bells, and visceral, gutteral chants. \"Morning in Soweto\" and \"The Thousand Petaled Lotus\" segue together with hand drum and tenor groove in a manner reminiscent of Thelonious Monk's \"Well, You Needn't\" nestled in the Sudan! The next movement of the suite is in five parts. A demure gong, animal growls, and moans from \"I & Thou\" easily move into free and repeated wood flute phrases and insistent hand percussion as a driving force on \"Uma Lake.\" \"Molimo\" is a separate entity, as counterpointed wood flutes hoot like owls with sexual overtones and rattling percussion. Fans of Sanders will be easily able to", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}