{"relation": [["Title", "Sesame salad dressing", "Authentic paella?", "IMPORTANT: If you have a blog on JustBento...", "Shiso - uses for this herb", "Fuki (Japanese Butterbur) Tsukemono Recipes"], ["Author", "Supertaster", "maki", "maki", "Loretta", "kumo"], ["Answers", "9", "10", "2", "0", "5"], ["Last Post", "1 year 47 weeks ago", "1 year 48 weeks ago", "1 year 51 weeks ago", "2 years 1 week ago", "2 years 1 week ago"]], "pageTitle": "Bento for Life | Just Bento Community Forum", "title": "", "url": "http://justbento.com/forum/bento-life", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00114-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 129078907, "recordOffset": 129043315, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{25979=So I've been working out, and following South Beach diet since Dec. 27. I'd love to incorporate bentos into this, and I'd love someone to buddy with as far as goals are concerned, if you're interested., 48244=I am pretty sure your body thought it was starving, when that happens your body will conserve every ounce of energy it can but you will begin to lose lean body mass, and many people actually gain weight this way. When you lose lean body mass you are not only losing muscle but bone and other parts of your body, which makes this particularly dangerous. 1200 calories is about the lowest recommendation that I have seen and even this is not safe for everyone. But the best idea would probably be figuring out how many calories your body actual needs and trimming your calories by a reasonable rate., 16389=I did Maki's five week bento challenge last year and lost six kg. I seem to have put it all back on again though - every time I go away on holiday I seem to gain a kg or so, and every feasting occasion (like Christmas) I put on two. I need to get my act together again and lose those six kg before my next wee trip away at the end of March., 163234=EDIT: Woo pictures: http://www.flickr.com/photos/44171194@N03/sets/72157623655582771/ hana.yori.dango, 44784=*400 net I was eating around 900 to 1000 calories a day and usually doing around 600 cal of exercise (about an hour on the treadmill with the incline cranked up), 118572=Well, I lost the 15 lbs I wanted to lose. In two weeks. This was after I had planned a gradual, 1-2lb/week loss, and followed a 2000 calorie diet, and exercised for only 30-35 minutes, 4x weekly. And I still ended up having problems with ketosis and other issues from the rapid loss. I've toned down the exercise and beefed up my bentos, but I'm still losing, and I feel like garbage. Not how I wanted to do things, all in all.}", "lastModified": "Sat, 01 Aug 2015 03:31:16 GMT", "textBeforeTable": "New forum activity since your last visit More information about formatting options Web page addresses and e-mail addresses turn into links automatically. Each email address will be obfuscated in a human readble fashion or (if JavaScript is enabled) replaced with a spamproof clickable link. You may quote other posts using [quote] tags. Allowed HTML tags: <h3> <h4> <h5> <h6> <object> <a> <em> <strong> <p> <br> <i> <b> <cite> <code> <ul> <ol> <li> <dl> <dt> <dd> <img> You can use Markdown syntax to format and style the text. Markdown Lines and paragraphs break automatically. You may quote other posts using [quote] tags. Each email address will be obfuscated in a human readble fashion or (if JavaScript is enabled) replaced with a spamproof clickable link. Web page addresses and e-mail addresses turn into links automatically. Allowed HTML tags: <h3> <h4> <h5> <h6> <object> <a> <em> <strong> <p> <br> <b> <i> <blockquote> <cite> <code> <ul> <ol> <li> <dl> <dt> <dd> <img> Filtered HTML Input format", "textAfterTable": "    » See more activity Join the Just Bento flickr pool Join the Bento Gear flickr pool Recently commented articles Tuna tofu miso mini burgers (42 comments) Stewed hijiki seaweed with carrots and fried tofu", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}