{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Sidi Ifni", "Shine", "Low", "I Could Be Wrong, I Could Be Right", "Low", "Sunrise In the Land of Milk and Honey", "We All Shine a Light (feat. John Doe)", "Turn On Tune In Drop Out With Me", "Show Me How This Thing Works", "Rainy Days and Mondays"], ["Album", "Greenland", "Forever", "Kerosene Hat", "Sunrise In the Land of Milk and Honey", "First Annual Camp Out Live", "Sunrise In the Land of Milk and Honey", "Sunrise In the Land of Milk and Honey", "Sunrise In the Land of Milk and Honey", "Sunrise In the Land of Milk and Honey", "If I Were a Carpenter"], ["Time", "6:05", "4:20", "4:36", "4:51", "5:25", "3:26", "3:38", "4:11", "2:50", "3:45"], ["Price", "0,99 €", "0,99 €", "1,29 €", "1,29 €", "0,99 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Sunrise In the Land of Milk and Honey by Cracker", "title": "", "url": "https://itunes.apple.com/gr/album/i-could-be-wrong-i-could-be/id307840628?i=307840679", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00041-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 871317031, "recordOffset": 871287310, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{124143=Copyright © 2014 Apple Inc. Με επιφύλαξη παντός δικαιώματος., 23709=Of all the bands that enjoyed a flirtation with fame and fortune during the alternative rock boom of the 1990s, few success stories seemed more of a fluke than Cracker. While David Lowery and Johnny Hickman were (and are) talented songwriters and the band could play tight, accessible rock & roll in a manner that startled many fans of Lowery's earlier band Camper Van Beethoven, it was clear from the outset that Cracker were only willing to set aside a certain number of their eccentricities in favor of a shot at the big time, and the longer they went on, the loopier their music became, which pleased the hardcore fans who appreciated their off-kilter humor and musical eclecticism but ensured that albums like Forever and Countrysides would never spawn a hit like \"I Hate My Generation\" or \"Low.\" Now that 17 years have elapsed following the release of their first album and with the band safely removed from the intrusive eyes of the major labels, Cracker's ninth studio album, Sunrise in the Land of Milk and Honey, is as engaging and enjoyable as anything they have released since Kerosene Hat in 1993. Though the feel of the material is loose and easygoing, this edition of Cracker — Lowery and Hickman on guitars and keyboards, Sal Maida on bass, and Frank Funaro on drums — plays with an efficiency and force that make the ambling, beer-soaked country of \"Friends\" work just as well as the straight-ahead '70s-style hard rock of \"We All Shine a Light\" and the L.A. punk gestures of \"Hand Me My Inhaler\" (which borrows an obvious riff from X's \"Los Angeles\") and \"Time Machine\" (whose lyrics mention listening to Black Flag cassettes before opining \"I think I liked 'em better with Dez Cadena\"). But just when \"Darling One\" and \"Turn on, Tune in, Drop Out with Me\" have you convinced that Cracker have made an album for the masses again, Sunrise in the Land of Milk and Honey throws in tunes like \"Yalla Yalla (Let's Go)\" (which is overrun with wink-and-nudge phallic references), \"Show Me How This Thing Works\" (in which Lowery is befuddled by some nameless gadget from outer space), and the title tune (one of several vaguely apocalyptic messages that dot the album), and you realize that Cracker are as slyly weird as ever. Cracker are better than they've ever been at honoring both the straight and the twisted sides of their musical personality, and Sunrise in the Land of Milk and Honey balances them with an acrobatic skill that's impressive and a lot of fun to hear., 26438=Formed: 1991 in Redlands, CA}", "lastModified": "Fri, 31 Jul 2015 08:11:44 GMT", "textBeforeTable": "View In iTunes Forever 5. View In iTunes Hello, Cleveland! (Live from the Metro) 4. View In iTunes Countrysides 3. View In iTunes Greenland 2.", "textAfterTable": "Listeners Also Bought Palmhenge Johnny Hickman View In iTunes La Costa Perdida (Bonus Track Version) Camper Van Beethoven View In iTunes Still BoDeans View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}