{"relation": [["Author", "ozwalled", "ozwalled", "ozwalled", "ozwalled", "ozwalled"], ["Title", "Young Ness Was in Magicant", "Starman", "Inside the BOOGIE Tent", "Bad Buffalo", "Mummy"], ["Description", "This was SUPPOSED to be sent in for LAST Holiday Funfest, but I slacked. :P Sung to the tune of the carol \"Good King Wenceslas\".", "This one started off as many of my pictures start out: playing around with colour. I started with the warm grey to rusty red background gradient, and for some reason, it was time to draw a Starman. Also see the Ghost of Starman I did with some help from Z-Row.", "This is what REALLY goes on inside the nefarious Boogie Tent. Get DOWN!", "This is one of those EB enemies I've avoided drawing for a while, due to lack of interest. In the summer of 2006, I was without a computer to draw with, so I tried to draw most all of the EB enemies on paper over about a month. When I got to the Bad Buffalo, it occurred to me that one of the things he can drop was a towel. Nearly a year later, digitally inked and coloured the drawing to get what you see here. :)", "This had been sitting on my harddrive unfinished for a good while, and with Halloween approaching, I figured it was time to finish it up. Based on the \"mummy\"-looking sprite from map screens."], ["Date", "1/13/08", "6/26/05", "11/7/07", "7/12/07", "10/25/05"], ["Rank", "0.00", "0.00", "0.00", "9.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=12990&stuff=DescDESC&stuffPageNumber=10", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00182-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 224311050, "recordOffset": 224302848, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> Z Y W U T S R P O N M L K J I H G F E D C B A 8 7 < Other Submissions by ozwalled Pokey fleeing Fourside's Monotoli building in the helicopter. This one started to take form pretty randomly, but I like how it turned out a lot -- subtle and simple, you proabbly have to know what you're looking at in order to figure out what you're looking at... if that makes any sense. This image has been resized for your convenience. Click", "textAfterTable": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}