{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Nos Sobran los Motivos", "Tan Joven y Tan Viejo", "Una Canción Para la Magdalena", "Ruido", "De Purisima y Oro", "Calle Melancolia", "Rosa de Lima", "Que Se Llama Soledad", "19 Días y 500 Noches", "Contigo", "Noche de Boda / ... y Nos Dieron las Diez", "Yo Me Bajo en Atocha", "Princesa / Barbi Superestar", "Quien Me Ha Robado el Mes de Abril / Así Estoy Yo Sin Ti", "Medias Negras", "Pacto Entre Caballeros", "Donde Habita el Olvido", "Conductores Suicidas", "La del Pirata Cojo", "Y Sin Embargo Te Quiero (Intro Olga Roman)", "Y Sin Embargo"], ["Artist", "Joaquín Sabina", "Joaquín Sabina", "Joaquín Sabina", "Joaquín Sabina", "Joaquín Sabina", "Joaquín Sabina", "Joaquín Sabina", "Joaquín Sabina", "Joaquín Sabina", "Joaquín Sabina", "Joaquín Sabina", "Joaquín Sabina", "Joaquín Sabina", "Joaquín Sabina", "Joaquín Sabina", "Joaquín Sabina", "Joaquín Sabina", "Joaquín Sabina", "Joaquín Sabina", "Joaquín Sabina", "Joaquín Sabina"], ["Time", "5:45", "5:25", "4:46", "5:20", "5:50", "5:45", "3:53", "6:19", "5:19", "5:04", "7:23", "5:25", "8:28", "6:53", "5:20", "4:14", "4:13", "5:03", "4:54", "2:03", "6:04"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Nos Sobran los Motivos by Joaquín Sabina", "title": "", "url": "https://itunes.apple.com/be/album/nos-sobran-los-motivos/id266186047", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00025-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 876471963, "recordOffset": 876445000, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{40881=This 2 CD live set contains well differentiated sections. The first album, the unplugged side, contains acoustic versions played by a small band: Sabina and his longtime collaborators Antonio García de Diego, Pancho Varona and Pedro Barceló. Recorded in small spanish theatres in may of 2000, includes some classics like \"Calle Melancolía\" and \"Rosa de Lima.\" One of the big surprises here is how better sounds the song \"Nos sobran los motivos\" than the original (really over-produced) included in the previous studio album 19 días y 500 noches. It proves that when Sabina is raw and naked he achieves his finest moments. The second album, the electric side, was recorded with a bigger band during the 19 días y 500 Noches Tour. This second volume shows how good Sabina rocks if he's inspired. The best proofs of that fact are songs like \"Conductores Suicidas\" and \"La del Pirata Cojo\".\" It's a fully enjoyable album that won't disappoint die-hard fans neither newcomers. ~ Iván Adaime, Rovi, 42089=Born: 12 February 1949 in Úbeda, Spain, 145693=Copyright © 2014 Apple Inc. Tous droits réservés.}", "lastModified": "Fri, 31 Jul 2015 08:30:46 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Joaquín Sabina Nos Sobran los Motivos iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Nos Sobran los Motivos by Joaquín Sabina, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes", "textAfterTable": "21 Songs Album Review This 2 CD live set contains well differentiated sections. The first album, the unplugged side, contains acoustic versions played by a small band: Sabina and his longtime collaborators Antonio García de Diego, Pancho Varona and Pedro Barceló. Recorded in small spanish theatres in may of 2000, includes some classics like \"Calle Melancolía\" and \"Rosa de Lima.\" One of the big surprises here is how better sounds the song \"Nos sobran los motivos\" than the original (really over-produced) included in the previous studio album 19 días y 500 noches. It proves that when Sabina is raw and naked he achieves his finest moments. The second album, the electric side, was recorded with a bigger band during the 19 días y 500 Noches Tour. This second volume shows how good Sabina rocks if he's inspired. The best proofs of that fact are songs like \"Conductores Suicidas\" and \"La del Pirata Cojo\".\" It's a fully enjoyable album that won't disappoint die-hard fans neither newcomers. ~ Iván Adaime, Rovi Biography Born: 12 February 1949 in Úbeda, Spain Genre: Pop in Spanish Years Active: '70s, '80s, '90s, '00s, '10s Singer and songwriter Joaquín Sabina was born in Úbeda, Spain, in February 12, 1949. At the age", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}