{"relation": [["Data", "Vehicle registration fees", "Funding options", "Index or increase the motor fuel tax", "Other possibilities"], ["Author", "Texas Department of Motor Vehicles", "TxDOT Testimony to the Select Committee on Transportation Funding", "Dye Management Group, Inc.", "Texas Comptroller of Public Accounts"], ["Source", "Information provided by the Texas Dept. of Motor Vehicles to the Texas House Appropriations Subcommittee on Articles VI, VII and VIII and the Subcommittee on Funding, July 9, 2012", "Legislator Requests Options to Increase Annual Transportation Funding Options, 83rd State Legislature", "Findings and Analysis: Texas Transportation Funding Challenge, updated April 2009", "2012-2013 Certification Revenue Estimate, December 2011"]], "pageTitle": "Funding Needs and Potential Sources", "title": "", "url": "http://MediaRelations@txdot.gov/inside-txdot/division/finance/funding-sources.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00195-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 1657167, "recordOffset": 1632728, "tableOrientation": "HORIZONTAL", "lastModified": "Sat, 01 Aug 2015 01:39:21 GMT", "textBeforeTable": "The Challenges The Texas Challenge in the Twenty-First Century: Implications of Population Change for the Future of Texas, December 2002 Center for Demographic and Socioeconomic Research and Education Texas Population Growth chart, 1970-2030 Presentation to the Texas Transportation Commission, May 28, 2009 Association of Texas Metropolitan Planning Organizations Revenue projections Referenced in the Texas Statewide Long-Range Transportation Plan 2035 - Executive Summary, November 2010 TxDOT Transportation Planning and Programming Division Estimated Construction and Maintenance Needs map Statewide Long-Range Transportation Plan, 2010 Report TxDOT Transportation Planning and Programming Division Long-range planning Texas Transportation Needs Report, \"It’s About Time: Investing in Transportation to Keep Texas Economically Competitive,\" March 2011 2030 Committee Needs update (2035) Texas Transportation Needs Report, February 2009 2030 Committee 2030 needs Source Author Data Transportation Needs and Costs TxDOT has developed a Statewide Funding Brochure that outlines the needs of highway and road funding in the state in order to kick-start", "textAfterTable": "The Discussion Data Author Source Vehicle registration fees Texas Department of Motor Vehicles Information provided by the Texas Dept. of Motor Vehicles to the Texas House Appropriations Subcommittee on Articles VI, VII and VIII and the Subcommittee on Funding, July 9, 2012 Funding options TxDOT Testimony to the Select Committee on Transportation Funding Legislator Requests Options to Increase Annual Transportation Funding Options, 83rd State Legislature Index or increase the motor fuel tax Dye Management Group, Inc. Findings and Analysis: Texas Transportation Funding Challenge, updated April 2009 Other possibilities Texas Comptroller of Public Accounts 2012-2013 Certification Revenue Estimate, December 2011 Inside TxDOT Connect With Us", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}