{"relation": [["ARTIST", "Julia Moody", "Julia Moody", "Leroy Carr", "Furry Lewis", "Romeo Nelson", "Big Joe Williams", "Big Joe Williams", "Scott Dunbar", "Lee Kizart", "Lovey Williams", "Roosevelt Sykes", "Hal Singer", "J.B. Lenoir", "Junior Wells", "Smoky Babe", "Smoky Babe", "Scrapper Blackwell", "Robert Wilkins", "Rocky Fuller (Louisiana Red)", "Robert Pete Williams", "Mississippi Fred McDowell", "Arizona Dranes", "Otis Spann", "Blind Willie McTell", "Peetie Wheatstraw", "Sippie Wallace", "Blind Willie McTell", "De Ford Bailey", "Co Cow Davenport", "Lil Johnson", "Sippie Wallace"], ["SONG", "Police Blues", "Midnight Dan", "Eleven Twenty-Nine Blues", "Judge Harsh Blues", "1129 Blues (The Midnight Special)", "All I Want Is My Train Fare Home", "Cow Cow Blues", "It's So Cold Up North", "Don't Want No Woman Telling Me What To Do", "Train I Ride", "Jivin' the Jive", "Disc Jockey Boogie", "Everybody Is Crying About Vietnam", "Vietnam Blues", "Boss Man Blues", "Goin' Home Blues", "Alley Sally Blues", "New Stock Yard Blues", "The Moon Won't Go Down", "Midnight Boogie", "I Walked All The Way From East St Louis", "I Shall Wear A Crown", "Make A Way", "Lay Some Flowers On My Grave", "Bring Me Flowers While I'm Living", "Up The Country Blues", "Statesboro Blues", "Up The Country Blues", "Plenty Gals Blues", "Minor Blues", "Woman Be Wise"], ["ALBUM", "Tight Women And Loose Bands", "Tight Women And Loose Bands", "Whiskey Is My Habit, Women Is All I Crave: The Best of Leroy Carr", "When The Sun Goes Down", "Boogie Woogie & Barrelhouse Piano Vol. 2 1928-1930", "A Man Sings The Blues Vol. 1", "A Man Sings The Blues Vol. 2", "Blues From The Delta", "Blues From The Delta", "Blues From The Delta", "Roosevelt Sykes Vol. 7 1941-1944", "Hal Singer 1948-51", "Bye Bye Bird", "Lookout Sam", "Way Back in the Country Blues", "Way Back in the Country Blues", "Scrapper Blackwell Vol. 2 1934-1958", "Masters of the Memphis Blues", "Forrest City Joe & Rocky Fuller: Memory Of Sonny Boy", "Bye Bye Bird", "Good Morning Little Schoolgirl", "Vintage Mandolin Music", "Sweet Giant of the Blues", "The Best Of", "Peetie Wheatstraw Vol. 7 1940-1941", "Sippie Wallace Vol. 1 1923-1925", "The Best Of", "History Of Blues Harmonica 1926-2002", "Cow Cow Davenport - The Accompanist 1924-1929", "Lil Johnson Vol. 1 1929-1936", "Up The Country"]], "pageTitle": "Cow Cow Davenport | Big Road Blues", "title": "", "url": "http://sundayblues.org/archives/tag/cow-cow-davenport", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00187-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 240743267, "recordOffset": 240708189, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{3765=William Smith and his wife recorded four songs for Paramount in 1927 while Eddie Head cut the same number for Columbia in 1930., 11531=Today's show is something of a sequel to a couple of  related shows I aired a couple of years back: Fence Breakin' Blues – Great Country Blues Guitar Duets and Play It It 'Till I Turn High Yeller – Great Guitar/Piano Duets. Today we spotlight some classic blues and gospel female/male duets spanning the years 1925 through 1938. Along the way we hear classic partnerships like Memphis Minnie and Kansas Joe and Victoria Spivey and Lonnie Johnson, blues in the vaudeville tradition from Butterbeans & Susie and Coot Grant &  Wesley Wilson, some moving gospel performances, well known artists such as Blind Willie McTell and Charlie Patton and a slew of fine lesser known artists who left behind memorable recordings., 9794=Butterbeans and Susie were a comedy duo made up of Jodie Edwards and Susie Edwards. Edwards began his career in 1910 as a singer and dancer. The two met in 1916 when Hawthorne was in the chorus of the Smart Set show. They married on stage the next year. The two did not perform as a comic team until the early 1920s. heir act, a combination of marital quarrels, comic dances, and racy singing, proved popular on the TOBA tour. They later moved to vaudeville and appeared for a time with the blackface minstrel troupe the Rabbit's Foot Company. They cut over sixty sides between 1924 and 1930., 26012=We spin  a few tracks today from a groundbreaking concert held in New York City in 1938. From Spirituals to Swing was the title of two concerts presented by John Hammond in Carnegie Hall on 23 December 1938 and 24 December 1939. The event was dedicated to singer Bessie Smith, who died a year before in a car accident in Virginia. The concerts included performances by Count Basie, Benny Goodman, Big Joe Turner and Pete Johnson, Helen Humes, Meade Lux Lewis, Albert Ammons, Mitchell's Christian Singers, the Golden Gate Quartet, James P. Johnson, Big Bill Broonzy and Sonny Terry. The idea was a history, starting with spirituals and leading up to big swing bands, involving African American performers. Hammond had difficulty gaining sponsorship for the event because it involved African American artists and an integrated audience. However, The New Masses, the journal of the American Communist Party, agreed to finance it. The boogie-woogie craze of the late 1930s and early 1940s dates from these concerts. Johnson and Turner, along with Lewis and Ammons, continued as an act after the concerts with their appearances at the Cafe Society night club, as did many of the other performers., 5221=Between 1930 and 1931 J. T. \"Funny Paper\" Smith had recorded some twenty issued sides. Among those were a pair of fine duets we feature today: \"Tell It To The Judge Part 1 & 2\" with Dessa Foster and Mama's Quittin' And Leavin' Part 1 & 2\" with Magnolia Harris., 526=Sun 13 Jul 2014, 7733=Victoria Spivey and Lonnie Johnson did several duets together that have vaudeville feel to them.  Johnson backed Spivey on numerous recordings in 1926 and 1927 and they made several duets together  in 1928 and 1929 including \"New Black Snake Blues Part 1 & 2\", \"Toothache Blues Part 1 & 2 and \"You Done Lost Your Good Thing Now Part 1 & 2 .\", 28684=From 1934 until 1945 there were three main race labels, all selling at 35 cents: Decca, the Brunswick Record Corporation's Vocalion, and RCA-Victor's Bluebird. There were two other labels that featured a fair number of blues during this period; the store group Montgomery Ward, with a label of the same name, drew at various times on Gennett, Decca and Bluebird and Sears Roebuck used ARC material on its Conqueror label. Race record sales were up around 15 per cent in 1937: Decca and Bluebird each put out around 120 items whilst BRC-ARC issued almost on Vocalion and another 100 on the dime-store labels., 24773=As in the previous year the blues market was dominated by Chicago singers but there several down-home singers recorded. wo down home singers who could hold their own in terms of popularity against the urban artists were Sleepy John Estes and Blind Boy Fuller. Fuller cut twenty-two sides in 1938 for Vocalion. Estes cut an eight song session on April 22, 1938 and at the same session Son Bonds cut one 78 backed by Estes. Other down-home singers featured today include Big Joe Williams, Leadbelly and John Henry Barbee., 4200=Bertha Lee met Charlie Patton in 1930 and remained his wife until his death in 1934. During this time, she sang on several of Patton's recordings, which resulted in the recording of three of her own songs, \"Yellow Bee\", \"Dog Train Blues\" (unissued), and \"Mind Reader Blues\". Patton accompanied her on guitar on these records., 7326=More in down-home vein were recordings by Memphis Minnie and Kansas Joe, J. T. \"Funny Paper\" Smith and Blind Willie McTell with different partners. Memphis Minnie's marriage and recording debut came in 1929, to and with Kansas Joe McCoy, when a Columbia Records talent scout heard them playing in a Beale Street barbershop. It was supposedly a Columbia A and R man who gave the duo their names. Between 1929 and 1934 Minnie and Joe cut around one hundred sides together. McCoy and Minnie recorded songs together and on their own for Decca Records until they divorced in 1934., 39266=Mon 5 Jan 2015, 20563=Sun 3 Aug 2014, 6727=Mary Willis recorded with several Atlanta artists including Blind Willie McTell, Curley Weaver and Buddy Moss. McTell also recorded with singer Ruby Glaze and Kate McTell who are likely the same person. One of the featured tracks, \"Talkin To You Wimmen' About The Blues\",  was not issued until just a few years ago.  The track and it's flip side, \"Merciful Blues\", was issued on the CD that accompanies Tefteller's 2008 blues artwork calendar. To quote Tefteller: \"the record you see in the center of this page [Talkin' To You Wimmen About The Blues] apparently has not been heard by anyone since its release back in the late fall of 1931. I have had this record in my collection for almost ten years. I had no idea that it was potentially a one-of-a-kind record! …Late last year, legendary Blues reissue producer Larry Cohn called me about his upcoming Blind Willie McTell box set. He told me he would like to borrow certain records from my collection …I sent him a list of what I had. To my amazement , he called immediately with the comment, \"I've never heard the Mary Willis record!\" Apparently, there is no master in the Columbia vaults. Cohn is aware of no other copy of the record anywhere. Finding this hard to believe, I started calling \"all the usual suspects\" and sure enough, none of them had the record or had ever heard it.\", 4909=Also on tap today are several fine gospel performances by Blind Willie Johnson, Charlie Paton, Eddie Head and William & Versey Smith . Johnson  may have married Willie B. Harris who sang accompaniment with Johnson on some of his recordings for Columbia Records between 1927 and 1930. Today we feature one of my favorites, \"You're Gonna Need Somebody on Your Bond.\", 30227=Today’s show is the twelfth installment of an ongoing series of programs built around a particular year. The first year we spotlighted was 1927 which was the beginning of a blues boom that would last until 1930; there were just 500 blues and gospel records issued in 1927 and increase of fifty percent from 1926 a trend that would continue until the depression. To feed the demand other record companies conducted exhaustive searches for new talent, which included making trips down south with field recording units. The Depression, with the massive unemployment it brought, had a shattering effect on the pockets of black record buyers. Sales of blues records plummeted in the years 1931 through 1933. Things picked up again in 1934 with the companies recording full-scale again. During this period there was far less recording in the field during this period and in view of the popularity of Chicago singers there was less need. From 1934 until 1945 there were three main race labels, all selling at 35 cents: Decca, the Brunswick Record Corporation's Vocalion, and RCA-Victor's Bluebird. There were two other labels that featured a fair number of blues during this period; the store group Montgomery Ward, with a label of the same name, drew at various times on Gennett, Decca and Bluebird and Sears Roebuck used ARC material on its Conqueror label. Race record sales were up around 15 per cent in 1937. Sales were a bit down by 1938 with an average of eight race records a week, down from seven a week from the previous year., 28063=According to John Godrich and Robert M.W. Dixon in their classic book Recording The Blues, the record companies \"had three way of unearthing new talent: by placing advertisements in local newspapers, especially just before a field unit was due in a nearby town; by just relying on chance comments from singers, concerning other who might be good recording propositions; and by employing their own talent scouts, who carry out steady, systematic searches. The last method was intensively employed in the the thirties – Roosevelt Sykes, for instance, would find likely artists for Decca (or, sometimes, for Lester Melrose). But despite this, race catalogs in the thirties relied more heavily on a small nucleus of popular singers than they had in the twenties. It was the urban style of blues that now dominated the market – and as in the previous years it was artists such as Tampa Red, Kokomo Arnold, Washboard Sam, Jazz Gillum, Memphis Minnie, Big Bill Broonzy, Peetie Wheatstraw and the Harlem Hamfats who dominated the market. Tampa cut 26 sides, the Hamfats cut around numbers under there own name as well as backing other singers, Peetie Wheatstraw cut 17 sides, Washboard Sam cut over two-dozen sides, Jazz Gillum cut a dozen numbers and Broonzy cut around two-dozen sides. Several big name artists had their careers end during this period including Bumble Bee Slim who's last sides were cut in 1937 (he would record again in the 50's and 60's), while Kokomo Arnold and Casey Bill weldon cut their finals sessions in 1938., 8158=In his early years Cow Cow Davenport toured TOBA with an act called Davenport and Company with Blues singer Dora Carr and they recorded together in 1925 and 1926. The act broke up when Carr got married. Davenport briefly teamed up with Blues singer Ivy Smith in 1928. Smith and Davenport cut some two-dozen sides together between 1927 and 1930., 9188=Coot Grant was the main stage name of Leola B. Pettigrew, a  blues singer from Alabama whose legal name became Leola Wilson following her marriage to performing partner Wesley Wilson. The pair met and began performing together in 1905 and were wed in 1913. Coot had been involved in show business  since she was a child, beginning as a dancer in vaudeville. Her husband, who played both piano and organ, was performing as early as 1905. He performed under a variety of stage names including Catjuice Charlie in a duo with Pigmeat Pete, as well as Kid Wilson, Jenkins, Socks, and Sox Wilson. The husband and wife, billed as Grant & Wilson, Kid & Coot, and Hunter & Jenkins, cut over sixty sides between 1925 and 1938, often backed with top jazz artists.}", "TableContextTimeStampAfterTable": "{15537=We feature terrific piano blues and gospel piano today from Otis Spann, Arizona Dranes, Cow Cow Davenport, Montana Taylor and Roosevelt Sykes. Leaving Muddy Waters’ group in 1968, Otis Spann made a flurry of recordings, including an album with Fleetwood Mac as his backing band. It was at this point Bob Thiele invited him to record for his Bluestime label. The album, Sweet Giant Of The Blues, has now been reissued by Ace Records. Unfortunately, his health had been compromised by years of alcohol abuse and he died a few months after these recordings at the age of 40., 45732=During the beginning of the space race in the early 1960's many songs appeared to cash in with space themed topics. With the landing on the moon in 1969 there were many more, but many, particularly by African Americans, took on a more political tone often contrasting the money and conditions of black people with the amount of money that went into the putting a man on the moon while ignoring the dire conditions at home. This is the topic of Gil Scott-Heron's \"Whitey On The Moon\" and Otis Spann's \"Moon Blues.\" Howlin' Wolf was fascinated by space flight and asked his saxophonist Eddie Shaw to write a song on the subject. \"Coon On The Moon\" is more about how things have changed during Wolf's lifetime than an overt political statement. 35 years before it happened the song predicted the first black president:, 12795=Born in Itta Bena, Mississippi, Robert Brown AKA Smoky Babe had found his way to Scotlandville, Louisiana by the age of 20. It was there that Harry Oster recorded him on several occasions between 1959-1961 with material appearing on the labels Folk-Lyric, Storyville and Bluesville. Smoky cut two full length albums: Smoky Babe and His Friends and Hottest Brand Goin' plus a few scattered sides on different anthologies. The recordings featured today are previously unreleased and have just been issue on Way Back in the Country Blues on Arhoolie Records. As the notes state: \"Upon Harry’s death in 2001, his widow Caroline shipped what was understood to be the balance of his tapes. Nowhere in the pile were the unissued Smoky Babe recordings. Recently, in the early stages of preparing a box set of Harry’s work, we noticed that many other known recordings of his were missing from our collection, and reached out again to Caroline to see if any had been overlooked. The following week, a shipment of boxes arrived filled with tapes dating back to Harry’s Louisiana days. Among this last batch were several reels of Smoky Babe containing many unissued recordings as strong as anything previously available. This record represents what we feel is the best of those long lost performances.\", 14136=The American Folk Blues Festival (AFBF) was an annual event, beginning in 1962, that featured the cream of American blues musicians barnstorming their way across Europe. The recordings from these tours have been collected on numerous anthologies over the years. Toda's AFBF recordings come from the Scout label which was Horst Lippmann's and Fritz Rau's label preceding L + R Records. Lippmann' and Rau were the men responsible for organizing the AFBF. Just about everything on the label was from the concerts and today we feature the following collection: Look Out Sam!, Bye Bye Bird…and Up The Country!., 20029=Sun 2 Mar 2014, 7775=Sippie Wallace made her first record in 1923 and her last in 1984. Thomas grew up in Houston, Texas where she sang and played the piano in her father's church. While still in her early teens she and her younger brother Hersal and older brother George began playing and singing the Blues in tent shows that traveled throughout Texas. In 1915 she moved to New Orleans and lived with her older brother George. During her stay there she met many of the great Jazz musicians like King Oliver and Louis Armstrong who were friends of her brother George. During the early 1920s she toured the TOBA vaudeville circuit where she was billed as \"The Texas Nightingale\". In 1923 she followed her brothers to Chicago and began performing in the cafes and cabarets around town. In 1923 she recorded her first records for Okeh and went on to record over forty songs for them between 1923 and 1929. “Up The Country Blues b/w Shorty George Blues” was her debut and an immediate success. The songs were written by her brother George. Blind Willie McTell borrowed part of the lyrics for his classic \"Statesboro Blues.\" \"Statesboro Blues\" was covered famously by Taj Mahal in 1968 and The Allman Brothers in 1971. We also play De Ford Bailey's superb instrumental of \"Up The Country Blues\" from 1927.Interestingly, in December 1923, just a few months after Sippie's recording, a singer by the name of Tiny Franklin cut six sides backed by Wallace's brother George on piano which included versions of \"Up The Country Blues\" and \"Shorty George Blues,”, 42333=Rosa Henderson is sings about Jim Crow in \"Back Woods Blues\" from 1924 (Clara Smith recorded a version the same year):, 11487=Not much is know about Julia Moody who cut sixteen sides between 1922 and 1925. She was known to have been involved in the stage prior and after her brief recording career. Our two songs \"Midnight Dan\" and \"Police Blues\" come from her final 1925 session and find her backed by a fine jazz band called the Dixie Wobblers. \"Midnight Dan\" has a dramatic feel which probably owes to Moody's stage background while Police Blues\" is a wonderfully sung slow blues:, 33869=As mentioned above, within black society there was a class system based on skin color – yellow, brown and black – each hue having their own stereotypes. In Blues Fell This Morning, Paul Oliver had the following to say: \"Blacks frequently aspired to the conditions of being white, as they saw the better jobs, the higher standard of living Whites enjoyed. Men spent large sums of money on hair-straightening  greases and combs that were supposed to remove the kinks in African hair. Woman dyed their hair to a brick-red, powdered their faces and applied artificial color in order to make their skins lighter and their complexions more 'white.' …This primitive distinction by color was passed on to Blacks themselves and their population was many times divided by grades of skin pigmentation. In the caste system that evolved from this arbitrary means of discrimination, the lighter skinned tended to be on a higher plane, whilst the extremely black-skinned mas was looked down on… To differentiate between their many shades of color they evolved many words which are applicable to certain shades: 'ashy black', 'chocolate-brown', 'coffee', 'sealskin-brown', 'brightskin', 'high yaller', 'lemon', and others… Blacks of one particular skin hue kept together and may certainly  have a had a preference for that color…\" In her popular 1927 number, \"Brown Skin Blues\", Lillian Glinn stated her preference:, 16700=Cow Cow Davenport, Montana Taylor and Roosvelt Sykes were some of the great early piano players. We hear Taylor playing superbly behind Lil Johnson's debut record \"Minor Blues\" which went unissued and hear Davenport on \"Plenty Gals Blues\" backing obscure singer Memphis Joe (Joe Byrd). Roosevelt Sykes is heard on the jumping \"Jivin' the Jive\" from 1944 backed by a combo that included Ted Summit on guitar and Jump Jackson on drums., 30275=Paul Oliver had this to say about the number: \"At times the characteristics of African racial features and color have an ominous significance in the blues, which may hint that they are indirectly related to social problems. So the state of being 'blue' is associated with alienation, and is linked with an 'evil mind' or an inclination to violence. Both are coupled with the inescapable condition of being black.\" There's also, I think, a way of diffusing the negative \"black\" by owning it as Moore does, a way of empowering oneself by taking the negative associations of black and turning it around and even reveling in it. Moore's song was covered by Lil Johnson, Lightnin' Hopkins and Leroy Ervin. Another song from the same period with a similar sentiment is \"(What Did I Do To Be So) Black & Blues\", originally written by Fats Waller in 1929, it was a hit for Ethel Waters in 1930. Like Moore's song this one too equates blackness with being \"blue\"but some of the lyrics give one an uneasy feeling:, 16131=Arizona Dranes born was born blind in 1889 or 1891. Between 1926 and 1928, Dranes recorded sixteen numbers for OKeh Records and soon became a gospel music star. Unfortunately, her recording career suffered due to misunderstandings between Dranes and the record company’s executives. After 1928 and until her death in 1963, Dranes served the Church of God in Christ by performing at churches around the country, quickly falling into near-complete obscurity (her last public appearance, where she was billed as the “Famous Blind Piano Player,” was in 1947)., 36566=In a similar vein was Fats Hayden's 1939 number \"Brown Skin Gal Is The Best Gal After All\" where he elaborates in detail to prove the song's title throwing quite a few disparaging comments on the other hues (\"When a yellow gal gets old/She draw up like tripe\"). Hayden's song is very similar to a number of earlier songs including Butterbeans & Susie's \"Brown Skin Gal\" from 1925 and Barbecue Bob's \"Brown Skin Gal\" from 1927. Bill & Mary Mack's \"Black But Sweet, Oh God!\" from 1925 has Bill asking for Mary's company and with the following reply: \"Now listen hear man you too black and ugly, the type of man is out of my life.\" Then shes goes on about her \"brown\" who is \"little an cute, chocolate to the bone.\" Jim Jackson recorded a song titled \"Black But Sweet\" which is likely the same song  although it was never issued. In the 1970's Furry Lewis recorded \"a little jive\" he claims to have made up called \"B-L-A-C-K\" which bears a striking resemblance to Bill & Mary Mack's number but Furry turns it around a bit:, 46811=Several songs featured today don't fall into any particular category but lyrically fit into the topic of today's show: There's Andy Boy who sings \"I got the evil blues, prejudicy on my mind\" on \"Evil Blues\" from 1937 and Robert Wilkins who on \"Fallin' Down Blues\" from 1929 sings:, 40650=Blues songs that speak directly to racial issues are relatively rare in early blues, while the 1960's saw more explicit songs dealing with the turbulent civil rights era. During the Jim Crow era, racial segregation laws were enacted between 1876 and 1965 at the state and local level that mandated racial segregation in all public facilities in Southern states. There were several songs that explicitly dealt with the topic. An early one from singer Maggie Jones, \"Northbound Blues\" from 1925, talks about heading away from Jim Crow:, 38623=Palmer's Skin Success was the trade name of a popular skin bleach which claimed o be able to make you \"one shade lighter.\" The product was advertised in black newspapers like the Chicago Defender probably not coincidentally on the same pages that advertised blues records. Then there's  Rev. J.M. Gates' \"Kinky Hair is No Disgrace\" which, despite the title, is more in a slapstick vaudeville vein than a black pride one. The 1960's saw a new found era in black pride with James Brown's \"Say It Loud – I'm Black and I'm Proud\" from 1968 becoming an unofficial anthem of the Black Power movement. The same year Juke Boy Bonner cut \"Being Black and I'm Proud\" and Bee Houston recorded \"Be Proud To Be A Black Man\" in 1970. There were black pride sentiments in earlier songs like Ruby Smith on \"Black Gal\" from 1941. Chris Smith wrote that \"it's a fascinating, uneasy mixture of self-abasement with early 'black is beautiful' ideology: \", 44266=Overt political commentary became increasingly more common by the 1960's. Several blues and gospel numbers were recorded about Martin Luther King and the civil rights movement. In \"Birmingham Blues\" John Lee Hooker forcefully sings about the Birmingham campaign which was a strategic effort by the Southern Christian Leadership Conference (SCLC) to promote civil rights for black Americans. 1962's Louisiana Red's \"Ride On Red, Ride On\" is a civil rights themed blues mainly about leaving the racist south and its subject not far removed from Rosa Henderson's “Back Woods Blues” mentioned above.  Few bluesman were as outspoken and eloquent as J.B. Lenoir who cut some hard hitting topical numbers shortly before his untimely death in 1967. Here's his \"Born Dead\" from 1966:, 29476=Alice Moore, Little Alice, as she was known, achieved a measure of success with her first record, \"Black And Evil Blues\" cut at her first session 1929 with three subsequent versions cut during the 1930's., 12410=We play a trio of songs from the album Blues From the Delta which was the companion album to the book of the same name by William Ferris. The recordings were made in the summer of 1968 and included the debut recordings James “Son” Thomas. The album also includes excellent recordings by under-recorded artists such as Lovey Williams, Scott Dunbar and Lee Kizart., 9372=\"11-29,\" is a reference found in a number of blues songs dealing with the subject of court sentencing in southern states for criminal behavior. The sentence was often the maximum for a misdemeanor crime, thus keeping the convict in local confinement as long as possible. This interpretation is borne out in a number of blues songs. Blac ks were often given more severe sentences than whites in a local court of law. And the experience of either county or state incarceration during the historical period that shaped early blues lyrics was, in reality, very cruel. We play a trio of songs using the theme including Leroy Carr's \"Eleven Twenty-Nine Blues\", Furry Lewis' \"Judge Harsh Blues\" and Romeo Nelson's \"1129 Blues (The Midnight Special).\"  Charley Patton refers to the \"11-29\" jail sentence of eleven months and twenty-nine days in \"Jim Lee Blues, Part 1\" recorded in 1929 which I've played several tomes on the show: \"When I got arrested what do you reckon was my fine?/Say they give all coons eleven twenty-nine.\", 11155=We spotlight twin spins today by Big Joe Williams and Julia Moody. Thes Big Joe Williams  songs were released two four-song EP's on the British Jen label (A Man Sings The Blues Vol. 1 & 2). These sides were recorded in the summer of 1957 in Chicago by Erwin Helfer who plays the piano on these sides.}", "textBeforeTable": "Posted by Jeff under Playlists No Comments Big Road Blues Show 7/13/14: Mix Show Sun 13 Jul 2014   --> trackback:ping=\"http://sundayblues.org/archives/8376/trackback\" /> dc:title=\"Big Road Blues Show 8/3/14: Talkin' to You Wimmen About the Blues – Classic Female/Male Duets\" dc:identifier=\"http://sundayblues.org/archives/8376\" xmlns:dc=\"http://purl.org/dc/elements/1.1/\" Tags: Bertha Lee, Blind Willie Johnson, Blind Willie McTell, Bobbie Cadillac, Charley Patton, Clara Smith, Coot Grant & Wesley Wilson, Cow Cow Davenport, Eddie Head, Georgia Tom, Hattie Hart, J. T. ''Funny Paper'' Smith, Kansas Joe, Lonnie Johnson, Ma Rainey, Mae Glover, Memphis Jug Band, Memphis Minnie, Mississippi Sarah & Daddy Stovepipe, Victoria Spivey, William & Versey Smith William Smith and his wife recorded four songs for Paramount in 1927 while Eddie Head cut the same number for Columbia in 1930. Bertha Lee met Charlie Patton in 1930 and remained his wife until his death in 1934. During this time, she sang on several of", "textAfterTable": "Show Notes: Today's mix show has several themes and featured artists running throughout. On deck today we play songs revolving around the term \"11-29\" and spin a trio of songs based on Sippie Wallace's \"Up The Country Blues.\" We also feature twin spins form Julia Moody, Big Joe Williams and Blind Willie McTell. We hear some fine down-home blues including previously unreleased sides from Smoky Babe and a trio of tracks from the long out-of-print Blues From The Delta album. We spin some fine piano blues by Otis Spann, Arizona Dranes, Cow Cow Davenport, Montana Taylor and Roosevelt Sykes. In addition we play several recordings from the American Fol Blues Festival. Sippie Wallace made her first record in 1923 and her last in 1984. Thomas grew up in Houston, Texas where she sang and played the piano in her father's church. While still in her early teens she and her younger brother Hersal and older brother George began playing and singing the Blues in tent shows that traveled throughout Texas. In 1915 she moved to New Orleans and lived with her older brother George. During her stay there she met many of the great Jazz musicians like King Oliver and Louis Armstrong who were friends of her brother George. During the early 1920s she toured the TOBA vaudeville circuit where she was billed as \"The Texas Nightingale\". In 1923 she", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}