{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Atlanta Blues", "Blues My Naughty Sweetie Gives to Me", "Take It In Stride (Ewell)", "Davenport Blues", "Yes Yes In Your Eyes", "100 Years from Today (Robinson)", "Get Happy (Arlen / Koehler)", "Of All the Wrongs (Alternate Take)", "Waltz You Saved For Me", "I Can't Believe That You're In Love With Me"], ["Album", "Saga Jazz: Saga City - A Jazz Travel Guide", "Free 'N Easy", "Solo Piano 1967-1973", "Solo Piano 1967-1973", "Reunion", "Solo Piano 1967-1973", "Solo Piano 1967-1973", "Reunion", "Reunion", "Music to Listen to Don Ewell By"], ["Time", "2:41", "3:55", "3:38", "4:21", "4:29", "5:20", "2:37", "6:10", "5:50", "3:20"], ["Price", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Solo Piano 1967-1973 by Don Ewell", "title": "", "url": "https://itunes.apple.com/gb/album/davenport-blues/id74376645?i=74375857", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00208-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 877359891, "recordOffset": 877334359, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1999=We are unable to find iTunes on your computer. To preview and buy music from Solo Piano 1967-1973 by Don Ewell, download iTunes now.}", "TableContextTimeStampAfterTable": "{148916=Copyright © 2014 Apple Inc. All rights reserved., 65848=Don Ewell was never a huge name in the jazz world, but the small following that he enjoyed was an enthusiastic one — and those who were hip to the late pianist really swore by him. Listening to Solo Piano 1969-1973, it isn't hard to understand why; this two-CD set paints a consistently attractive picture of Ewell's talents as a stride pianist. Born in 1916, Ewell was in his fifties when these unaccompanied solo piano recordings were made in the late '60s and early '70s — and much to the delight of die-hard stride enthusiasts, Ewell never changed with the times. He was totally unaffected by bebop pianists like Bud Powell, Thelonious Monk, and Al Haig — for that matter, Ewell favored a style that was even older than the swing pianism of Teddy Wilson, Nat King Cole, Count Basie, and Jess Stacy. Ewell was stride all the way; his roots were the '20s recordings of Jelly Roll Morton, James P. Johnson, Fats Waller, and Earl \"Fatha\" Hines, and he was great at what he did. All of those influences can be heard on this 2003 release, which contains three of Ewell's Chiaroscuro LPs in their entirety (Jazz on a Sunday Afternoon, A Jazz Portrait of the Artist, and Take It in Stride) as well as a previously unreleased performance of \"I Found a New Baby\" from 1967. The inclusion of that 1967 recording makes the title Solo Piano 1969-1973 inaccurate, but an inaccurate title certainly doesn't make Ewell's performances any less memorable — performances that are stylistically right out of the '20s and are totally oblivious to what was going on in the late '60s/early '70s. This excellent reissue is happily recommended to anyone who is seriously interested in '20s-style stride piano., 67677=Born: 14 November 1916 in Baltimore, MD}", "lastModified": "Sat, 01 Aug 2015 04:34:29 GMT", "textBeforeTable": "View In iTunes This Kid's the Greatest (feat. Teddy Buckner, Pud Brown, Lloyd Glenn, Julian Davidson, Ed Garland, Minor Hall, Bob Mccracken, Don Ewell, Morty Corb, George Probert, Alvin Alcorn, Barney Kessel, Phil Gomez, Cedric Haywood & Wellman Braud) 5. View In iTunes Don Ewell Denver Concert With Barbara Dane 4.", "textAfterTable": "Listeners Also Bought \"Straight Up\" Solo Piano Brad Hatfield View In iTunes   Name Album Artist Time Price   1 Take Five", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}