{"relation": [["Title", "Superboy", "Superboy", "Superboy", "Superboy", "Superboy", "Superboy", "Superboy", "Superboy", "Superboy", "Superboy", "Superboy", "Superboy", "Superboy", "Legion of Super-Heroes"], ["Issue", "184", "188", "190", "191", "193", "195", "197", "198", "199", "200", "201", "202", "205", "300"], ["Date", "Apr 72", "Jul 72", "Sept 72", "Oct 72", "Feb 73", "Jun 73", "Sept 73", "Oct 73", "Nov 73", "Feb 74", "Apr 74", "Jun 74", "Dec 74", ""], ["Story", "One Legionnaire Must Go!", "Curse Of The Blood-Crystals", "Murder The Leader", "Attack Of The Sun Scavenger", "War Between The Nights And The Days", "The One-Shot Hero", "Timber Wolf, Dead hero, Live Executioner", "The Fatal Five Who Twisted Time", "The Gun That Mastered Men The Impossible Target", "The Legionnaire Bride Of Starfinger", "The Betrayer From Beyond The Silent Death", "Lost A Million Miles From Home The Wrath of The DevilFish Lore of The Legion (character sketches)", "Lore Of The Legion (character sketches)", ""], ["Writer", "Cary Bates", "Cary Bates", "Cary Bates", "Cary Bates", "Cary Bates (Nick Pascale)", "Cary Bates", "Cary Bates", "Cary Bates", "Cary Bates", "Cary Bates", "Cary Bates", "Cary Bates", "Cary Bates", "Paul Levitz"], ["Inker/Penciller", "Murphy Anderson", "Murphy Anderson", "Murphy Anderson", "", "", "", "", "", "", "", "", "Mike Grell Wiacek", "", ""], ["Pages", "8", "10", "11", "9½", "10½", "9", "13", "20", "13 7", "20", "13 7", "6 14 4", "2", "5"]], "pageTitle": "The Legion Files ~ Dave Cockrum", "title": "", "url": "http://www.thelegionfiles.co.uk/Library/Creators/Cockrum/cockrum.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00254-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 761465922, "recordOffset": 761457720, "tableOrientation": "HORIZONTAL", "lastModified": "Sun, 06 Mar 2005 18:39:48 GMT", "textBeforeTable": "Accomplishment It was the 1970\u0092s, the Legion had left the Action and Adventure series and was now relegated to a series of occasional back-ups in Superboy, the Legion\u0092s popularity was waning. The art and stories were little better than pedestrian, with settings, costumes and equipment dating from a previous decade and showing their age. With the arrival of Cockrum, the Legion was finally dragged kicking and screaming into the 30th Century. The then youthful new-comer gave the Legion a face-lift. Enthusiastically, he provided most of the Legion with new costumes many of which continued to be used for many years afterwards. (which only he could interpret well \u0096 witness Tinya\u0092s bell bottoms), and the Legion cruisers and HQ were redesigned to give a newer more futuristic feel. Ever inventive, he was responsible for the introduction Wildfire, the first of a \"new wave\" of heroes (and my personal favourite - sorry guys) distinguished by having lame or overly complex powers (MatterEater Lad or Chemical King), nor lame code names (MatterEater Lad). Unfortunately, the stories were still total pants for the most part, illogical, inconsistent, dull and pointless. On one occasion, Superboy was rendered so weak by Green Kryptonite that he doesn\u0092t have the strength to talk, but happily inhales and then expels the Green-K with super-breath, which is inexplicably immune to Kryptonite exposure (a precedent that allowed the TV Superman to pick a", "textAfterTable": "  - Home - Gallery - Library - Links - - Feedback - Search - Site Map - The Legion of Super-Heroes, all characters and distinctive likenesses thereof \u0099©®DC Comics. These pages \u0099©®¥¤µAmnesiac5 and are protected under United Planet statutes relating to intellectual stuff and any naughty sentients infringing such will have their brains sucked out by Tangleweb... so there (hey, I've seen it done, it's not pretty)... or maybe a lecture on the evils of the imperialistic fascist hate-mongering UP, courtesy of Gates (hey, I've seen it done, it's not pretty). Any mistakes, omissions or trangressions, please let me know and I'll sort it. Free JavaScripts provided by The JavaScript Source", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}