{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"], ["Name", "That's How Heartaches Are Made", "In These Shoes?", "God Give Me Strength", "Just My Imagination", "Love T.K.O.", "Moses", "Nobody Else But You", "Color of Roses", "Bless You Child", "When Your Life Was Low", "Shining Star"], ["Artist", "Bette Midler", "Bette Midler", "Bette Midler", "Bette Midler", "Bette Midler", "Bette Midler", "Bette Midler", "Bette Midler", "Bette Midler", "Bette Midler", "Bette Midler"], ["Time", "3:08", "3:41", "6:31", "3:54", "4:47", "4:31", "2:53", "4:41", "4:35", "3:55", "4:49"], ["Price", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Bette by Bette Midler", "title": "", "url": "https://itunes.apple.com/gr/album/bette/id296194346", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00193-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 871229775, "recordOffset": 871204593, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{21243=Using her regular touring band and employing Don Was, an expert on helping pop veterans reclaim the sounds that made them successful, Bette Midler makes an excellent album to tie in with the premiere of her network television show. Was seems to conceive of Midler as a kind of pre-rock, neo-Brill Building performer, frequently putting her into mid-tempo pop arrangements of old R&B ballads, here including Baby Washington's 1960 hit \"That's How Heartaches Are Made,\" the Temptations' 1971 hit \"Just My Imagination (Running Away With Me)\" (which here sounds even more like an old Drifters hit than it does usually), and a pair of 1980 titles, Teddy Pendergrass' \"Love TKO\" and the Manhattans' \"Shining Star.\" The album's tour de force, a six-and-a-half-minute version of Burt Bacharach and Elvis Costello's \"God Give Me Strength,\" also recalls the Brill Building, as does the bouncy pop tune \"Nobody Else but You,\" co-written by Midler and Marc Shaiman to be the theme for the TV show. Was and Midler also satisfy the need for up-tempo material with a trio of genre exercises, Latin pop in \"In These Shoes,\" mbaqanga in \"Moses,\" and dance in \"Bless You Child.\" Bette is a tasteful album that showcases Midler's expressive singing but avoids her excesses. \"In These Shoes\" is an amusing novelty that does not play too heavily to the singer's broad comic style, while ballads like \"Color of Roses\" and \"When Your Life Was Low\" are striking for their restraint, not going for the maudlin extremes Midler has been guilty of indulging in the past. That means fans of the bawdy Bette and the bathetic Bette may be disappointed, but the rest of her followers will enjoy the balance and consistency of this collection., 23198=Born: 01 December 1945 in Honolulu, HI, 122545=Copyright © 2014 Apple Inc. Με επιφύλαξη παντός δικαιώματος.}", "lastModified": "Sat, 01 Aug 2015 05:06:31 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Bette Midler Bette iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Bette by Bette Midler, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "11 Songs Album Review Using her regular touring band and employing Don Was, an expert on helping pop veterans reclaim the sounds that made them successful, Bette Midler makes an excellent album to tie in with the premiere of her network television show. Was seems to conceive of Midler as a kind of pre-rock, neo-Brill Building performer, frequently putting her into mid-tempo pop arrangements of old R&B ballads, here including Baby Washington's 1960 hit \"That's How Heartaches Are Made,\" the Temptations' 1971 hit \"Just My Imagination (Running Away With Me)\" (which here sounds even more like an old Drifters hit than it does usually), and a pair of 1980 titles, Teddy Pendergrass' \"Love TKO\" and the Manhattans' \"Shining Star.\" The album's tour de force, a six-and-a-half-minute version of Burt Bacharach and Elvis Costello's \"God Give Me Strength,\" also recalls the Brill Building, as does the bouncy pop tune \"Nobody Else but You,\" co-written by Midler and Marc Shaiman to be the theme for the TV show. Was and Midler also satisfy the need for up-tempo material with a trio of genre exercises, Latin pop in \"In These Shoes,\" mbaqanga in \"Moses,\" and dance in \"Bless You Child.\" Bette is a tasteful album that showcases Midler's expressive singing but avoids her excesses. \"In These Shoes\" is an amusing novelty that does", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}