{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13"], ["Name", "Love So Deep", "Outta Control", "Lookin' for the Promised Land", "Ride 'Till I'm Satisfied", "Go the Distance", "Message On the Doorway", "Faithful", "Down to You", "Bugle Billy", "Gotta Leave This Town", "I Don't Want My MTV", "Doin' Just Fine", "Always Been a Dreamer"], ["Artist", "Walter Trout", "Walter Trout", "Walter Trout", "Walter Trout", "Walter Trout", "Walter Trout", "Walter Trout", "Walter Trout", "Walter Trout", "Walter Trout", "Walter Trout", "Walter Trout", "Walter Trout"], ["Time", "5:09", "5:09", "5:28", "4:38", "6:09", "5:39", "4:42", "4:17", "3:57", "6:05", "2:53", "5:36", "3:23"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Go the Distance by Walter Trout", "title": "", "url": "https://itunes.apple.com/cz/album/message-on-the-doorway/id264349270?i=264350163", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00201-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 860391319, "recordOffset": 860366252, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{123679=Copyright © 2014 Apple Inc. Všechna práva vyhrazena., 26434=Born: 06 March 1951 in Ocean City, NJ}", "lastModified": "Fri, 31 Jul 2015 09:04:37 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Walter Trout Go the Distance iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Go the Distance by Walter Trout, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "13 Songs Album Review One of the songs on Go the Distance that tells listeners a lot about Walter Trout is \"I Don't Want My MTV,\" a humorous rock & roll number that finds the blues-rocker railing against MTV for — as he sees it — making image, looks, and physical appearance more important than the quality of the music itself. Trout even rewrites a line from Chuck Berry's \"Roll Over Beethoven,\" singing, \"Roll over, Martha Quinn, and tell Kurt Loder the news.\" The tune is a defining moment for Trout because it tells you a lot about him. \"I Don't Want My MTV\" expresses, without apology, Trout's impatience with slickness — and whether or not you share his opinion of MTV, it is his down-home earthiness that makes Go the Distance an honest blues-rock/roots rock outing. Trout's sincerity is one of his strongest assets, and it comes through on gritty offerings like \"Message on the Doorway\" and \"Lookin' for the Promised Land.\" This CD isn't for blues purists, however; Go the Distance has as much to do with roots rock as it does with the blues. But regardless of whether or not a song has 12 bars, Trout brings the feeling of the blues to everything he does. Go the Distance falls short of remarkable, but it's a solid,", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}