{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Little Lies", "Everywhere", "Everywhere", "The Chain", "Big Love", "Go Your Own Way", "Big Love", "Little Lies", "Dreams", "Go Your Own Way"], ["Album", "Tango In the Night", "Tango In the Night", "Greatest Hits", "Rumours", "Tango In the Night", "Greatest Hits", "Greatest Hits", "Greatest Hits", "Greatest Hits", "Rumours"], ["Time", "3:37", "3:43", "3:43", "4:30", "3:38", "3:38", "3:38", "3:38", "4:14", "3:43"], ["Price", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - The Essential: Fleetwood Mac by Fleetwood Mac", "title": "", "url": "https://itunes.apple.com/gr/album/the-essential-fleetwood-mac/id277238467", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00082-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 873827951, "recordOffset": 873796051, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{61705=Formed: 1967 in London, England, 160457=Copyright © 2014 Apple Inc. Με επιφύλαξη παντός δικαιώματος., 58756=This double-CD set may well mislead listeners on two counts. On the one hand, there will be some neophyte listeners expecting to hear the silky pop/rock strains of the Lindsey Buckingham/Stevie Nicks-era Fleetwood Mac. This is, indeed, the original version of the band organized in 1967 by virtuoso blues guitarist/singer Peter Green, in which the latter shared the spotlight with fellow guitarist Jeremy Spencer, and they got no closer to pop/rock than renditions of Howlin' Wolf and B.B. King material. But even for listeners aware of the history of the band represented here, the \"essential\" will probably require some qualification — Sony/BMG's license on Fleetwood Mac's early library only encompasses the two years of recordings (1967-1969) that they made for Mike Vernon's Blue Horizon label; those recordings, especially the debut album and the singles \"Black Magic Woman\" and \"The Green Manalishi,\" were hugely popular in England but were little more than cult items in America; most pointedly, they did not include the somewhat more diverse music that this version of the group cut for Warner Bros. in 1969-1971, at the tail-end of Green's tenure with the band. So even those listeners expecting the bluesy side of the group's history may be a little disappointed by the absence of anything here from that portion of their history that was widely distributed — at Blue Horizon, the group tended to plays and record nothing but blues, which ultimately limited even Green's creativity. Having said that, however, it should also be conceded that this set is probably the best overview of the group's Blue Horizon output that one is ever likely to find, containing virtually the entire debut album (a classic in any context) as well as the hit singles they generated, and filled out with the less-inventive but still worth hearing second album, all in state of the art sound. And unlike the six-CD Complete Blue Horizon Sessions set, this double-disc compilation contains only the finished, released masters, cleanly edited with no false starts and other digressions. So even if one already owns Blue Horizon box, this is a worthwhile acquisition. And the makers have also thrown in a handful of superb live tracks — featuring Willie Dixon, Buddy Guy, and Otis Spann from the group's Blues Jam in Chicago album. The annotation is surprisingly thorough, though whoever designed this set should have gone up one font in the type-face, for the benefit of the older listeners to whom this release will primarily appeal. Would-be American purchasers should also note that, because Sony's license on this material is limited to Europe, this set is an import to the United States and, thus, tends to be a bit pricier than the conventional domestic issues in the label's \"Essential\" series.}", "lastModified": "Fri, 31 Jul 2015 07:36:48 GMT", "textBeforeTable": "View In iTunes Fleetwood Mac 5. View In iTunes The Very Best of Fleetwood Mac (Remastered) 4. View In iTunes Tango In the Night 3.", "textAfterTable": "Listeners Also Bought Lost Without Your Love Bread View In iTunes The Essential Redgum Redgum View In iTunes Eddie Money Eddie Money View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}