{"relation": [["Publication", "CMS Family Guide", "CMS Family Album", "Conservation Measures for Marine Turtles of the Atlantic Coast of Africa"], ["Publisher", "UNEP/CMS Secretariat", "UNEP/CMS Secretariat", "CMS"], ["Type", "Leaflets & Brochures", "Leaflets & Brochures", "Technical Series"], ["Published Date", "10 2011", "08 2011", "11 2000"]], "pageTitle": "Atlantic Turtles | CMS", "title": "", "url": "http://www.cms.int/node/12", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00185-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 379976027, "recordOffset": 379958234, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{3084=From 2005 to 2012 coordination services for the MOU had been provided by SINEPAD/URTOMA, a Senegal based Coordination Unit. CMS is now exploring avenues for long-term coordination arrangements for the MOU. , 4801=In April 2013, while appraising the Signatories about the progress on the implementation of the MOU, CMS invited the Signatories for information on their activities and progress on implementation of the Conservation Plan at the national level., 3376=On the more practical level of marine turtle conservation efforts, CMS has funded a project, which started in 2001 and was successfully concluded in 2003, aimed at uncovering the migratory patterns of the Green Turtle population nesting at Poilão, Guinea-Bissau., 5987=In May 2002, Range States gathered in Nairobi to conclude a comprehensive Conservation Plan. The bulk of the Conservation Plan focuses on the establishment of a database on turtle ecology (distribution, migration patterns, etc) and on threats (nature and extent of direct exploitation, bycatch rate, impact of coastal management, pollution, etc). The project aims to create a monitoring and protection network for nesting and feeding sites in close collaboration with local communities, fishermen, travel operators and coastal developers., 5426=The “Nairobi Declaration\", adopted at the conclusion of the May 2002 meeting, drew attention to the problem of marine turtle by-catch in industrial fishing operations and emphasized the importance of involving local communities in the development and implementation of conservation activities., 7108=The Memorandum of Understanding (MOU) was concluded under the Convention on Migratory Species (CMS) auspices and became effective on 1 July 1999. It will remain open for signature indefinitely. It aims at safeguarding six marine turtle species that are estimated to have rapidly declined in numbers during recent years due to excessive exploitation (both direct and incidental) and the degradation of essential habitats.}", "TableContextTimeStampAfterTable": "{43325=This site is maintained by the UNEP/CMS Secretariat © 2014  | Disclaimer UNEP/CMS Secretariat, Platz der Vereinten Nationen 1, 53113 Bonn, Germany Tel. (+49 228) 815 2401, Fax. (+49 228) 815 2449, Contact}", "lastModified": "Sat, 01 Aug 2015 03:38:42 GMT", "textBeforeTable": "Atlantic Ocean Completed WWF – Latin America & the Caribbean Program (LAC) Movements of Atlantic leatherback turtles – Steps toward by-catch reduction and trans-oceanic cooperation for conservation Region Status Implementing Agency End date Start date Project AEWA, Atlantic Turtles, Birds of Prey (Raptors), CMS, Gorilla Agreement, Sharks, West African Elephants, Western African Aquatic Mammals South Africa Concluded 29.10.2013 CMS Family Manual - Workshop for African National Focal Points Atlantic Turtles Senegal Concluded 05.03.2008 2nd Meeting of Signatories Atlantic Turtles", "textAfterTable": "Document Number Title Publish date CMS Instrument UNEP/CMS/MT-AFR2/Report Annex 7 CONSERVATION AND MANAGEMENT PLAN FOR MARINE TURTLES OF THE ATLANTIC COAST OF AFRICA (Revised) 07.03.2008 Atlantic Turtles News News Media Watch Notifications Op-ed Press releases Education & Awareness Capacity Building Campaigns Meetings & Events Standing Committee Related Meetings Related Links The CMS Family E-community", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}