{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Thnks fr th Mmrs", "Dance, Dance", "This Ain't a Scene, It's an Arms Race", "Beat It", "My Songs Know What You Did In the Dark (Light Em Up)", "Sugar, We're Going Down", "I Don't Care", "\"The Take Over, The Breaks Over\"", "This Ain't a Scene, It's an Arms Race", "Centuries"], ["Album", "Infinity On High", "From Under the Cork Tree", "Believers Never Die - Greatest Hits (Deluxe Version)", "Believers Never Die - Greatest Hits (Deluxe Version)", "Save Rock and Roll", "From Under the Cork Tree", "Believers Never Die - Greatest Hits (Deluxe Version)", "Infinity On High", "Infinity On High", "American Beauty / American Psycho"], ["Time", "3:23", "3:00", "3:33", "3:49", "3:06", "3:49", "3:38", "3:33", "3:32", "3:48"], ["Price", "€1.29", "€1.29", "€1.29", "€1.29", "€1.29", "€1.29", "€1.29", "€1.29", "€1.29", "€1.29"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - From Under the Cork Tree by Fall Out Boy", "title": "", "url": "https://itunes.apple.com/ie/album/from-under-the-cork-tree/id68246049", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00331-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 869783243, "recordOffset": 869752349, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{135093=Copyright © 2014 Apple Inc. All rights reserved., 134235=Shop at the Apple Online Store, call 1800 92 38 98 or find a retailer., 25495=Fall Out Boy's 2003 LP stacked sarcasm, wronged romance, and hardcore-derived passion on the head of a punk-pop pin. Take This to Your Grave was urgent at every turn, and though it fit the conventions of its genre, it was bolder and more memorable than the average release on Kung Fu or Drive-Thru. The kids responded — Fall Out Boy were fast favorites of the online social networks (MySpace), and an endless tour schedule solidified their rep. With 2005's From Under the Cork Tree, the band fully delivers on their first full-length's promise. Sure, it nods a little more to the standard dynamics and production tweaks of pop-punk and emo in the mid-2000s — Cork Tree was produced by Neal Avron, who's worked with A New Found Glory. But in many more ways it's the same album as Grave, a youth-intense blast of pop culture reference, pop-punk hyperactivity, and the feeling that we'll never understand life until Patrick Stump or Pete Wentz tells us about it. And we believe them. Stump is Fall Out Boy's vocalist and guitarist, Wentz its bassist and lyricist. Wentz' verbiage can be lengthy — \"I Slept With Someone in Fall Out Boy and All I Got Was This Stupid Song Written About Me,\" one title goes — but he has an innate ability to simultaneously acknowledge and deconstruct the mushy emo soliloquy. Temper that with a road-hardened cynicism about band life, superficial love, and the adventure of signing a record contract, and you have lyrics with a point beyond simply acting up or getting sentimental. \"Champagne for My Real Friends, Real Pain for my Sham Friends\" is blunt. \"Yeah we're friends,\" Stump says, \"Just because we move units.\" But the album also has a current of longing to it, of missing regular life, regular relationships. Musically, Cork Tree's first five tracks are relentless, with razor-sharp melodies that seem familiar but sound totally unique at the same time. The \"Oh! Oh!\"s and punchy chords of \"Of All the Gin Joints in All the World\" are a thrill greater than any Jimmy Eat World album ever; \"Sugar, We're Goin Down\"'s half-time shifts are triumphs of tumbling words; and the opening track meditates wryly on all-ages shows' fame. Further, when Fall Out Boy rip into \"Sophomore Slump or Comeback of the Year,\" summer 2005 will not be able to ignore them. \"We're the therapists pumping through your speakers/Delivering just what you need,\" they sing. It's obviously time to embrace our inner mall kid., 30813=Formed: 2001 in Chicago, IL}", "lastModified": "Fri, 31 Jul 2015 07:42:45 GMT", "textBeforeTable": "View In iTunes Folie à deux 5. View In iTunes From Under the Cork Tree 4. View In iTunes Infinity On High 3.", "textAfterTable": "Listeners Also Bought Almost Here The Academy Is... View In iTunes Pretty. Odd. (Deluxe Version) Panic! At the Disco View In iTunes Under Pressure - Single", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}