{"relation": [["", "1", "2"], ["Name", "The Smooth Ones Part 1", "The Smooth Ones Part 2"], ["Artist", "Art Ensemble of Chicago", "Art Ensemble of Chicago"], ["Time", "20:01", "20:46"], ["Price", "Album Only", "Album Only"], ["", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Reese And The Smooth Ones by Art Ensemble of Chicago", "title": "", "url": "https://itunes.apple.com/us/album/reese-and-the-smooth-ones/id355387877", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00003-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 871743619, "recordOffset": 871718884, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{5451=Formed: 1966 in Chicago, IL, 61505=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 08:46:01 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Art Ensemble of Chicago Reese And The Smooth Ones iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Reese And The Smooth Ones by Art Ensemble of Chicago, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock", "textAfterTable": "2 Songs Album Review Recorded when the Art Ensemble of Chicago was in Paris and between drummers (Don Moye would not join up until 1970), this English imported LP has a continuous piece featuring trumpeter Lester Bowie, reed players Roscoe Mitchell and Joseph Jarman and bassist Malachi Favors all playing plenty of \"little instruments\" (which include various horns, gongs, logs, bells, sirens, whistles, steel drums, marimba, and banjo, among others) in addition to their mainstays. The episodic music continually holds one's interest, and overall, it makes a unified (if unpredictable) statement. Biography Formed: 1966 in Chicago, IL Genre: Jazz Years Active: '60s, '70s, '80s, '90s, '00s Originally comprised of saxophonists Roscoe Mitchell and Joseph Jarman, trumpeter Lester Bowie, bassist Malachi Favors, and later, drummer Famoudou Don Moye, the Art Ensemble of Chicago enjoyed a critical reputation as the finest and most influential avant-garde jazz ensemble of the 1970s and '80s. Whether or not that reputation was wholly deserved is, in retrospect, subject to debate — the World Saxophone Quartet and the Cecil Taylor Unit may well have been more influential. Nevertheless,... Full Bio Top Albums and Songs", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}