{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", ""], ["Name", "Manos al Aire", "Más", "Mi Plan", "Sueños", "Bajo Otra Luz", "Vacación", "Suficiente Tiempo", "Fuerte", "Silencio", "Como Lluvia", "Feliz Cumpleaños", "Fantasmas", "BookletDigital Booklet - Mi Plan"], ["Artist", "Nelly Furtado", "Nelly Furtado", "Nelly Furtado", "Nelly Furtado", "Nelly Furtado", "Nelly Furtado", "Nelly Furtado", "Nelly Furtado", "Nelly Furtado", "Nelly Furtado", "Nelly Furtado", "Nelly Furtado", "Nelly Furtado"], ["Time", "3:29", "3:31", "4:05", "3:10", "4:19", "3:43", "3:03", "3:24", "3:34", "3:37", "4:11", "3:33", "--"], ["Price", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "Album Only"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Mi Plan by Nelly Furtado", "title": "", "url": "https://itunes.apple.com/us/album/mi-plan/id330210652", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00265-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 870109719, "recordOffset": 870080039, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{27055=Born: December 2, 1978 in Victoria, British Columbia, Canad, 126689=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 07:23:48 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Nelly Furtado Mi Plan iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Mi Plan by Nelly Furtado, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "13 Items Editors’ Notes Restless as ever, Nelly Furtado dives head-first into Latin music on 2009’s Mi Plan. The Portuguese-Canadian songstress forsakes the mainstream dance-pop of 2006’s Loose in favor of something riskier and ultimately more satisfying. In these tracks, Furtado works within the boundaries of the Latin market without sublimating her own freewheeling personality. In her typically eclectic fashion, she combines earthy traditional instrumentation with contemporary techno-dance beats, never stinting on the pop hooks in the process. Tracks like “Bajo Otra Luz” (a reggaeton/cumbia fusion featuring rapper La Mala Rodriguez) and “Fuerto” (Spanish in feel, with a sleekly contemporary groove) glide with an easy yet insistent flow. As on previous releases, Furtado doesn’t shy away from soul-bearing — the volatile “Manos al Aire” and the tender “Josh Groban” (the latter a duet with Josh Groban) hold little back emotionally. Acoustic-centered numbers like “Suenoz” and “Mas” are reminiscent of her early work, while “Sufficient Tempo” is a straight shot into today’s high-gloss Latin pop. Customer Reviews No hablas           by Huyyy I have no idea what she is saying but there is so much beauty in", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}