{"relation": [["Artist", "KGB", "Bela Fleck & The Flecktones", "Joseph Spence", "Bill Evans & Megan Lynch", "David Hildalgo & Louie Perez", "Doug Smith", "Johnny Edson", "Crow Quill Night Owls", "Steve Cheseborough", "The Low Tide Drifters", "Dar Williams", "Steve Noonan", "Mike Eckstein", "Jaime RT and Andy Hillhouse", "Guy Klucevsek and the Ain't Nothin' But a Polka Band", "Chris Thile", "Drum Lords of Pendarvia", "Sallie Ford & The Sound Outside", "Martha Scanlan"], ["Title", "The Banshee's Wail Over the Mangel Pit / Cottonwood / In from the Cold / The Seattle Fault", "Cheeseballs in Cowtown", "When the Saints Go Marching In", "I Was Just Thinking", "Take My Hand", "At the Boardwalk", "She Works Days", "Sweet Reedie Brown", "Shake Your Hips", "Broken Bootstraps", "The Baby Sitter's Here", "Buy For Me the Rain", "Til Then", "The New Real / La Grande Rencontre", "Peek-A-Boo Polka", "The Eleventh Reel", "Aerial Walkabout", "Vocal Chords", "Seeds of the Pine"], ["Album", "In from the Cold", "Live Art", "Living on the Hallelujah Side", "Let's Do Something", "The Long Goodbye", "Guitar Parts", "Favorites", "Mechanical Unicorn", "Fetch It!", "Progress & Porchlights", "Best of the Kerrville Folk Festival, Vol. 1", "11 Selections", "Far West Day Dream", "Spark", "Polka Dots and Laser Beams", "How to Grow a Woman from the Ground", "Church of the Get Down: Songs for Pendarvis Farm", "Not An Animal", "Pick-A-Thon 2006"]], "pageTitle": "KBOO | Community Radio for Portland and beyond", "title": "", "url": "http://kboo.org/playlists/6057?page=523", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 7, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00246-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 139750351, "recordOffset": 139721816, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{25242=Artist-Title-Album (Label, year recorded) Cabaret Voltaire – Voice of America – Voice of America (Rough Trade, ’80) Cabaret Voltaire – Do the Mussolini Headkick – Living Legends (Mute, ’78) Cabaret Voltaire – Baader/Meinhof – Original Sounds of Sheffield (Mute, ’78) Cabaret Voltaire – The Dada Man – 1974-1976 (Industrial Records ’78) Cabaret Voltaire – No Escape – Original Sounds of Sheffield (Mute, ’78) Cabaret Voltaire – Nag Nag Nag – Living Legends (Mute, ’78) Cabaret Voltaire – Do the Snake – 1974-1976 (Industrial Records ’78) Cabaret Voltaire – Seconds Too Late – Living Legends (Mute, ’78) Cabaret Voltaire – This is Entertainment – Voice of America (Rough Trade, ’80) Cabaret Voltaire – If Shadows Could March – Voice of America (Rough Trade, ’80) Cabaret Voltaire – Stay Out Of It – Voice of America (Rough Trade, ’80) Cabaret Voltaire – Red Mask – Red Mecca (Rough Trade, ’81) Cabaret Voltaire – Split Second Feeling – Red Mecca (Rough Trade, ’81) Cabaret Voltaire – Sluggin’ Fer Jesus – Eight Crepescule Tracks (Interior Music, ’87) Cabaret Voltaire – Yashar – 2 X 45 (Rough Trade, ’81) Cabaret Voltaire – Hallucination Sequence – Johnny Yesno OST (Doublevision, ’83) Cabaret Voltaire – Do Right – Microphonies (Virgin, ’84) Cabaret Voltaire – Sensoria – Sensoria 12″ (Virgin/Some Bizarre, ’84) Cabaret Voltaire – I Want You – Arm of the Lord (Virgin/Some Bizarre, ’85) Cabaret Voltaire – Hell’s Home – Arm of the Lord (Virgin/Some Bizarre, ’85) Cabaret Voltaire – James Brown – James Brown 12″ (Virgin/Some Bizarre, ’85) Cabaret Voltaire – Shakedown – Drain Train (Doublevision, ’86) Cabaret Voltaire – Taxi Mutant – International Language (Instinct, ’92) Cabaret Voltaire – Soul Vine (70 Billion People) – Plasticity (Instinct, ’93), 65604=Arcade Fire – Neighborhood #2 (Laika) – Funeral (Merge, 2004) Love And Rockets – Motorcycle – Love And Rockets (Beggars Banquet, 1989) The Psychedelic Furs – Dumb Waiters – Talk Talk Talk 2002 Reissue (Columbia, 1981) Cornelius – Count Five Or Six – Everything Is Nice: Matador 10th Anniversary Anthology (Matador, 1999) Tobacco – Fresh Hex (featuring Beck) – Maniac Meat (Anticon, 2010), 65016=HOUR ONE: Easy Star All-Stars – With A Little Help From My Friends – Easy Star’s Lonely Hearts Dub Band (Easy Star, 2009) **REQUEST The Special AKA – Racist Friend – In The Studio (Chrysalis, 1984) The Slits – Heard It Through The Grapevine – Cut 2009 Reissue (Universal, 1979) Tomata Du Plenty – Screamers Radio Spot – Yeti Issue #1 (self, 2000) The Screamers – If I Can’t Have What I Want (I Don’t Want Anything) – Live At The Mabuhay Gardens (boot, 1977) Echo & The Bunnymen – Over The Wall – Heaven Up Here (Sire, 1981), 24126=A Different Nature Presents: Strange Sounds From Sheffield: A Look at Cabaret Voltaire August 4, 2010 A look at the Dada-infused group from Sheffield UK, Cabaret Voltaire. Cabaret Voltaire formed in 1973, around Richard H. Kirk, Stephen Mallinder and Chris Watson. Initially utilizing minimal electronics and tape to make their highly original sounds, they eventually incorporated Funk, dance and Dub in the mix and released numerous singles, EPs and albums. Watson left the group in the early 80′s to pursue a career in television and has since gained acclaim as an environmental sound recordist. Cabaret Voltaire’s output slowed to a crawl in the Nineties and there has yet to be a proper CV recording in this century. Richard H. Kirk continues to put out releases under his own name, as Sandoz, Biochemical Dread and more. He has lately said in interviews that the last three or four Cabaret Voltaire albums were the work of himself alone., 110095=Latest newsletter: May 2015, 3467=Neil Simon's You Ought To Be In Pictures ... Aug 12, 13, 14, and 15 at The Headwaters Theatre in NE Portland.  For tickets and more information www.bit.ly/ioughttobe or 503 929 6169., 51090=With an incredible luck of the draw, with the Blues Festival moving the entire collective up one week in programming, I got the opportunity to do a show for Jerry Garcia's Birthday, which falls on the 1st of August. After a little bit of fun and frivolity, we finished some past buisness by playing the remainder of Madison Square Garden 09-09-91 SBD. At this point, we aired a beautiful \"Killer Audience Tape\" of The Jerry Garcia Band at The Orpheum Theater in Boston Ma. 12-02-77 Early Show. This has always been a favorite of mine. I was given a cassette copy of a bootleg album called \"The Grateful Dead Featuring Jerry Garcia Boston Ma. 12-02-77. (Bootleg albums were famous for not getting it right). This was a fine performance of a very up show! Content worthy of playing for everyone in the family! We were joined about midway through the program by Scotty Gillan from The Jerry Garcia Birthday Band to talk about Jerry's Birthday at The McMenamens Edgefield. This is where the J.G.B.B. got it's start, playing sets every year on Jerry's Birthday. Boy! What a fabulous weekend for DeadHeads! Saturday night at the Tonic Lounge, Tom Wright brought his Garcia cover band \"Cats Down Under The Stars\" in for a Jerry Garcia Band hoedown! (Tom also fronts \"Ramblin' Rose\", the Grateful Dead cover band). And then the Garcia Birthday thing at The Edgefield! (With The Freak Mountain Ramblers putting the cap on a perfect day!). Tom Chiles is taking a little time off to get some things taken care of, and we hope he will be back very soon! I'll be on the air again August 28th. Hmmmmm, what to play?, 118518=Copyright © 2012 KBOO Community Radio | Copyright Policy | Community Guidelines | Website Illustration & Design by: KMF ILLUSTRATION, 66934=Nena – 99 Luftballoons – 99 Luftballoons (Epic, 1984) Robyn Hitchcock & The Venus 3 – Ordinary Millionaire – Propellor Time (Sartorial, 2010) Laura Veirs – Life Is Good – July Flame (Raven Marching Band, 2010), 67184=Devo – Don’t Shoot (I’m A Man) – Something For Everybody (Warner Bros, 2010) Eurythmics – Beethoven (I Love To Listen To) – Savage (Sony BMG, 1987) The Books – It’s A Cold Freezing Night – The Way Out (Temporary Residence Ltd, 2010) Miranda July – How’s My Driving – 10 Million Hours A Mile (Kill Rock Stars, 1997), 61935= On Monday Music, RaScHo plays music from twenty-two of the thirty-eight artists performing at 2010 Pickathon}", "lastModified": "Fri, 31 Jul 2015 08:06:11 +0000", "textBeforeTable": "08/01/2010 Air date:  Portland Jewish Hour Program name:  World - Ethnic Categories: Portland Yiddish Hour playlist for 08/01/2010 view full schedule All Black Everything 3:00am-5:30am The Sacred Circle \"TEMENOS\" Mobile Support Archives Listen Schedule Programs  ", "textAfterTable": "Reggae - Caribbean Program name:  Shocks of Sheba Air date:  08/04/2010 Artist Title Album Label Augustus Pablo Revelation Time ...ras CD Starkey Banton Fed Up Ah Babylon ...bantonic CD Ras Zacharri No Bad Mind ...roots garden 7\" Martin Campbell Rootsman ...log on 10\" EP King General Got To Be Conscious ...conscious sounds 12\" King General You Wrong ...conscious sounds 12\" King Kong He Was A Friend ...digikiller 12\" K Vibes Raggamuffin Soldier ...digital english 10\" Christine Miller Higher ...conscious sounds 12\" Dezzi-D The Wicked Can't Enter ...vibes house 10\" Colourman Vibes Up A Sound ...creation LP Colourman The Mood ...witty 12\" UFO Who!! (Break Them Down) ...mjm CD Linval Thompson Roll River Jordan ...happy faces 7\" Omar Bernard # Man A Kill Man ...uhuru 7\" Piza # More Peace On The Land ...uhuru 7\" Audley Rollen ## Repatriation ...mistic 7\" I Roy ## Repatriation Is A", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}