{"relation": [["Title", "12 Fabulously Funny Fairy Tale Plays", "Action Safety", "Alexander, Who Used to Be Rich Last Sunday", "Beatrix Potter", "Beginning to Read, Thinking and Learning About Print", "Breaking the Code; The New Science of Beginning Reading and Writing", "Catching Readers Before They Fall: Supporting Readers Who Struggle, K-4", "Catching Readers Grade 1", "Catching Readers Grade 2", "Catching Readers Grade 3", "Catching Readers Grade K", "Cat's Diary", "Creating Readers", "Elephants, Wildlife in Danger", "Eva the Beekeeper", "Fins, Wings, and Legs", "Five Senses", "Fun at the Beach", "Gardener", "Guided Reading, Good First Teaching for All Children", "Guided Reading, Making it Work", "Guided Reading, The Four-Blocks Way", "Guide to Interactive Read-Alouds 2-3", "Guide to Interactive Read-Alouds K-1", "Inventing the Telephone", "Matching Books to Readers", "Miss Malarkey Won’t Be in Today", "Newts & Salamanders", "No Need for Words", "On Solid Ground - Strategies for Teaching Reading K-3", "Phonemic Awareness in Young Children", "Reading and Writing Informational Text in the Primary Grades", "Reading and Writing, Nonfiction Genres", "Reading Essentials", "Reading Research", "Reading with Meaning", "Reality Checks--Teaching Comprehension with Nonfiction K-5", "Research-Based Methods of Reading Instruction, Grades K-3", "Road to the Code", "Small-Group Reading Instruction, A Differentiated Teaching Model for Beginning and Struggling Readers", "Smarter Charts", "Strategies For Struggling Readers", "Teaching Reading Source Book for K-8", "Then and Now", "Using Picture Storybooks to Teach Literary Devices", "What's the Address?", "Word Journeys"], ["Author", "Scholastic", "Sharon Parsons", "Judith Viorst", "Rosie McCormick", "Marilyn Jager Adams", "J. Richard Gentry, Ph.D.", "Pat Johnson and Katie Keier", "Barbara M. Taylor", "Barbara M. Taylor", "Barbara M. Taylor", "Barbara M. Taylor", "Jill Eggleton", "Pam Schiller", "Louise Martin", "Jane Manners", "Margaret Clyne and Rachel Griffiths", "Alan Trussell-Cullen", "Heather Hammonds", "Sarah Stewart", "Irene C. Fountas and Gay Su Pinnell", "Mary Browning Schulman and Carleen DaCruz Payne", "Patricia M. Cunningham, Dorothy P. Hall and James W. Cunningham", "Linda Hoyt", "Linda Hoyt", "Sue Graves", "Irene C. Fountas and Gay Su Pinnell", "Judy Finchler, illustrated by Kevin O’Malley", "Graham Meadows and Claire Vial", "Frances Bacon", "Sharon Taberski", "Marilyn Jager Adams Barbara R. Forrman, Ingvar Lundberg, and Terri Beeler", "Nell Duke and V. Armistead", "Kathleen Buss and Lee Karnowski", "Regie Routman", "CORE", "Debbie Miller", "Tony Stead", "Sharon Vaughn and Sylvia Linan-Thompson", "Benita Blachman, Eileen Ball, Rochella Black, and Darlene Tangel", "Beverly Tyner", "Marjorie Martinelli and Kristine Mrza", "Maria Meyerson and Dorothy Kulesza", "Bill Honig, Linda Diamond, and Linda Gutlohn", "Jenny Vaughan", "Susan Hall", "Rachel Griffiths", "Kathy Ganske"], ["Description", "Students will have oodles of fun building essential reading skills with funny versions of beloved fairy tales turned into read-aloud plays.", "This children's book is about the activities and sports we enjoy that involve movement.", "Readers of all ages will be delighted by this picture book.", "This book tells how a love for animals caused Beatrix Potter to draw pictures and write stories.", "This reconciles the debate that has divided theorists for decades over the “right” way to help children learn to read. Drawing on a rich array of research on the nature and development of reading proficiency, Adams shows educators that they need not remain trapped in the phonics versus teaching-for-meaning dilemma. She proposes that phonics can work together with the whole language approach to teaching reading and provides an integrated treatment of the knowledge and process involved in skillful reading, the issues surrounding their acquisitions, and the implications for reading instruction.", "Gentry combines cutting-edge, brain-based research with sound classroom knowledge to explore early literacy development. Starting with the crucial inter-relationship of reading and writing, he looks inside and out at the minds of emerging readers to find out how they construct the idea and process of reading.", "Every teacher of reading plays a vital role in helping to catch those readers for whom learning to read does not come easily. If you have ever been at a loss for what to say and do when confronted with a child who struggles, this book is for you.", "The author provides powerful intervention strategies for your classroom and empowering professional development for your school. (This book includes a DVD.)", "The author provides powerful intervention strategies for your classroom and empowering professional development for your school. (This book includes a DVD.)", "The author provides powerful intervention strategies for your classroom and empowering professional development for your school. (This book includes a DVD.)", "The author provides powerful intervention strategies for your classroom and empowering professional development for your school. (This book includes a DVD.)", "This is from the Sails Literacy Series. (2 copies)", "This book has games, activities, tongue twisters, fingerplays, songs, and stories to get children excited about reading. (2 copies)", "This book will take you on a learning safari where you will uncover the true facts about endangered animals. (2 copies)", "This book tells why Eva likes beekeeping.", "This story tells how animals can move quickly from place to place.", "This children's book is from the Factivity Series. (2 copies)", "The theme is Earth and beyond with the text type being expository. The structural format is sequence. (2 copies)", "This 1998 Caldecott Honor Book is about a young country girl who is sent to live with her uncle in the city. (2 copies)", "Guided Reading was written for K-3 classroom teachers, reading resource teachers, preservice teachers, teacher educators, researchers, administrators, and staff developers. It explains how to create a balanced literacy program based on guided reading and supported by reading aloud, shared reading, interactive writing, and other approaches. (2 copies)", "Two teachers share their insights, strategies, and lessons for helping every child become a successful reader. This book provides strategies to help novice readers through Guided Reading instruction. It provides ideas on how to observe and assess students for optimum grouping and instruction, matching books to readers, planning Guided Reading lessons, designing extension activities, incorporating phonics, managing flexible grouping, and setting up and maintaining literacy centers.", "This resource provides thorough explanations and instructions for teaching reading comprehension skills and strategies, and a variety of before, during, and after reading activities. The teacher will learn how a classroom looks when students and teachers are actively engaged in Guided Reading; understand how Guided Reading fits into the Four Blocks, Literacy Models, and how it can be linked to other curriculum areas, such as Science and Social Studies; learn how to effectively use the materials for Guided Reading and how to obtain additional materials.", "The book contains over 60 standards-based lessons designed around children's classics with Share the Reading texts and Readers Theater scripts for each lesson. The Guide to Interactive Read-Alouds outlines the thinking behind Interactive Read-Alouds and describes how to apply the strategies in your own classroom. The CD provides all of the Share the Reading texts and Readers Theater scripts in an easily accessible PDF format. (comes with CD)", "The book contains over 60 standards-based lessons designed around children's classics with Share the Reading texts and Readers Theater scripts for each lesson. The Guide to Interactive Read-Alouds outlines the thinking behind Interactive Read-Alouds and describes how to apply the strategies in your own classroom. The CD provides all of the Share the Reading texts and Readers Theater scripts in an easily accessible PDF format. (comes with CD)", "This book tells the story of Alexander Graham Bell's discovery.", "In addition to an expanded list of books, the book includes helpful descriptions of a leveled book collection and how best to use it. Included information: how to use running records & benchmark books for assessment; how to create a school book room; how to create classroom collections and how to select quality books; and how to acquire books. (2 copies)", "This great book explores the feelings of a teacher when she has to be absent and have a substitute.", "This book provides information and pictures about newts and salamanders. (2 copies)", "Many people enjoy art of all kinds. With art, there's no need for words!", "This book is organized around a series of interconnected interactions with the learner: Assessment, Demonstration, Practice, and Response. (3 copies)", "Brimming with fun, adaptable activities and games, this supplemental language and reading curriculum compliments a pre-reading program. Preschool, Kindergarten, and first-grade teachers can use these engaging activities in any classroom- general, bilingual, inclusive, or special education. The developmental sequence follows a school year calendar. Assessment activities evaluate language and listening skills, and the assessment forms can be photocopied for frequent use with large groups of children. (2 copies)", "The authors explain why it's important to weave informational text into the primary curriculum.", "This book is a practical, concise resource that shows how to explore with students what nonfiction writing looks like.", "The author gets to the heart of what effective reading instruction is all about and puts the fun back into teaching and learning. (2 copies)", "This is an anthology of the \"why\" of reading instruction.", "Debbie leads the reader through the course of a year in her classroom where her students learn to become thoughtful, independent, and strategic readers. Through explicit instruction, modeling classroom discussion, and most important, by gradually releasing responsibility to her students, Debbie provides a model for creating a climate and culture of thinking and learning.", "Teaching comprehension with informational texts is a critical component of any reading program and one that many children struggle with as they progress through their schooling.", "The authors explore the research on reading, providing a comprehensive overview of the five core instructional areas and how each affects student achievement.", "For helping kindergartners and first graders who are having difficulty with their early literacy skills try this 11-week program for teaching phonemic awareness and letter sound correspondence.", "This book will provide you with teaching strategies and materials to determine and address your students' literacy education needs. (2 copies)", "After reading this book, you'll amp up the power of your charts with tips on design and language instructional use, and self-assessment. You'll discover strategies that deepen engagement, strengthen retention, and increase independence--all by involving students in chart making.", "Different ideas and teaching strategies that help the teacher help the struggling reader are found in this book. (2 copies)", "A comprehension sourcebook for K-8 covering the what, the why, the when, and the how of teaching reading. Includes research-based information as well as practical hands-on teaching models for all aspects of explicit reading instruction.", "How have you changed? Things change as time passes. Then and Now shows how some things are different than they were before.", "Volume 2 expands on the use of picture storybooks in language arts programs at all grade levels, using newer works and selected classics.", "Addresses tell where places can be found. This book helps readers learn the addresses of many famous places around the world.", "This book presents a highly practical approach to assessing children's spelling and word knowledge abilities and offering effective, appropriate instruction."]], "pageTitle": "Reading in Primary Grades - Northeastern Nevada Professional Development Program", "title": "", "url": "https://sites.google.com/site/nvnnrpdp/library/books/reading-in-primary-grades", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00281-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 887783019, "recordOffset": 887770089, "tableOrientation": "HORIZONTAL", "lastModified": "Tue, 28 Jul 2015 08:17:14 GMT", "textBeforeTable": "  Sort    Sort    Sort  Description Author Title 47 items Showing here to search the entire library including DVD's. Click  Reading in Primary Grades Books‎ > ‎ Library‎ > ‎ 1290 Burns Road High Tech Center Room 119 Elko, NV  89801 775-753-3879 775-753-3961 (fax) Contact Us NNRPDP", "textAfterTable": "Showing 47 items Sign in|Recent Site Activity|Report Abuse|Print Page|Powered By Google Sites Ascending Descending Ascending Descending Ascending Descending", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}