{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Linus and Lucy", "Charlie Brown Theme", "Pebble Beach", "Linus Tells Charlie", "Frieda", "Christmas Time Is Here", "Getting Ready", "Blue Charlie Brown", "Red Baron", "Happiness"], ["Artist", "David Benoit", "David Benoit", "David Benoit", "David Benoit", "David Benoit", "David Benoit", "David Benoit", "David Benoit", "David Benoit", "David Benoit"], ["Time", "3:06", "4:18", "4:38", "4:30", "4:34", "5:17", "3:08", "4:05", "4:28", "3:47"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Here's to You, Charlie Brown!: 50 Great Years! by David Benoit", "title": "", "url": "https://itunes.apple.com/WebObjects/MZStore.woa/wa/viewAlbum?playListId=401630", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00291-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 879155163, "recordOffset": 879130809, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{22683=Born: August 18, 1953 in Bakersfield, CA, 122310=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 03:35:05 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist David Benoit Here's to You, Charlie Brown!: 50 Great Years! iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Here's to You, Charlie Brown!: 50 Great Years! by David Benoit, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon", "textAfterTable": "10 Songs Album Review An album of Peanuts-related music performed by David Benoit is a no-brainer, not only because of the retirement and death of Charles Schultz, who drew the comic strip, but also because Benoit has in recent years taken over writing the music for the ongoing series of shows, which were scored originally by Vince Guaraldi. Benoit emphasizes his predecessor by devoting seven of the album's ten tracks to Guaraldi compositions. Unfortunately, he begins with one of those exercises in necrophilia that is usually the province of the less-talented progeny of great singers, overdubbing a few of his own unnecessary noodlings on the original recording of \"Linus and Lucy.\" Fortunately, things improve after that, as the trio of Benoit, bassist Christian McBride, and drummer Peter Erskine is joined by a series of high-profile guest musicians: guitarist Marc Antoine on \"Pebble Beach\" and \"Red Baron\"; trumpeter Chris Botti on Benoit's \"Linus Tells Charlie\"; saxophonist Michael Brecker on \"Freda\"; and guitarist Russell Malone on \"Blue Charlie Brown.\" Despite the spring release date, the inclusion of the near-standard \"Christmas Time Is Here\" is inevitable, and here it's sung by Take 6. In an inspired move, the album closes with Al Jarreau's winsome take on \"Happiness,\" a song from the stage musical You're a Good Man, Charlie Brown. All in all, this", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}