{"relation": [["Subject", "Response From Deep Coins Or Ones On Edge", "Re: Response From Deep Coins Or Ones On Edge", "Re: Response From Deep Coins Or Ones On Edge"], ["Author", "Critterhunter", "Critterhunter", "Rick(ND)"], ["Views", "462", "91", "103"], ["Posted", "January 29, 2012 12:47PM", "January 30, 2012 11:18AM", "January 29, 2012 09:09PM"]], "pageTitle": "Response From Deep Coins Or Ones On Edge", "title": "", "url": "http://www.findmall.com/read.php?21,1628698", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00312-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 460951311, "recordOffset": 460943109, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Quote Reply Edited 1 time(s). Last edit at 01/29/2012 12:49PM by Critterhunter. mining members for own forum If anybody has any info on what kind of deep coin responses or ones on edge that you get please post it for others to share. Just thought I'd throw this out there for the kind of response to expect from deep coins or ones on edge. The climb is pretty steady and not as random as a piece of junk will do. Now I have noticed that really deep coins on the very fringe of detection depth might only be able to reach into the 150's or 160's in ID. These were coins I had buried so I knew what they were. These were coins at the very edge of the coil's magnetic field. I have read in the past from those with older Sovereigns that say a really deep coin will act a certain way when you sweep over it. The VDI number will climb as you do the Sovereign wiggle over it until it finally reaches 180. I've not seen this happen yet on my GT with deep coins so I don't know if the fact that the GT is a little more sensitive has changed that. But I", "textAfterTable": "Sorry, only registered users may post in this forum. Click here to login This forum is powered by Phorum.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}