{"relation": [["File Name", "AtlasQuest - Fan Update", "Atlas WorldEvents", "Atlas Transportation", "Atlas Cataclysm", "Atlas Mists of Pandaria", "Atlas Wrath of the Lich King", "Atlas Burning Crusade", "Atlas Classic WoW", "Atlas Battlegrounds", "Atlas Dungeon Locations", "Atlas Outdoor Raids", "Atlas Scenarios", "Atlas Arena", "AtlasWorld (Release)"], ["Version", "4.9.4", "v3.12", "v1.31.02", "v1.31.01", "v1.31.01", "v1.31.01", "v1.31.01", "v1.31.01", "v1.31.01", "v1.31.01", "v1.31.01", "v1.31.01", "1.5.06", "v4.2.0.29"], ["Size", "850kB", "5MB", "2MB", "3MB", "3MB", "4MB", "4MB", "3MB", "3MB", "626kB", "535kB", "2MB", "2MB", "3MB"], ["Author", "thandrenn", "arith", "arith", "arith", "arith", "arith", "arith", "arith", "arith", "arith", "arith", "arith", "arith", "Shadowkith"], ["Date", "07-13-15 10:16 PM", "03-01-15 10:23 AM", "03-01-15 04:00 AM", "03-01-15 03:57 AM", "03-01-15 03:57 AM", "03-01-15 03:56 AM", "03-01-15 03:55 AM", "03-01-15 03:55 AM", "03-01-15 03:54 AM", "03-01-15 03:53 AM", "03-01-15 03:53 AM", "03-01-15 03:52 AM", "03-01-15 02:56 AM", "08-18-11 12:36 PM"], ["Type", "Addon", "Addon", "Addon", "Addon", "Addon", "Addon", "Addon", "Addon", "Addon", "Addon", "Addon", "Addon", "Addon", "Addon"]], "pageTitle": "Atlas : Map, Coords, Compasses : World of Warcraft AddOns", "title": "", "url": "http://www.wowinterface.com/downloads/fileinfo.php?id=3896&so=&page=2", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00087-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 839558123, "recordOffset": 839526409, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{15624=Atlas, a World of Warcraft instance map browser Copyright 2005 - 2010 Dan Gilbert Copyright 2010 - Lothaer Copyright 2011 ~ 2014 - Arith, Atlas Team About Atlas Atlas is an addon for World of Warcraft that includes detailed maps for every instance in the game. Originally, Blizzard neglected to include maps for instances. However, after a number of years Blizzard began to include official maps for some instances. These official maps are in the same hand-drawn style as the built-in world maps. Conversely, the Atlas maps are based on data used by the minimap, which provides a more detailed, accurate, and colorful representation. You can think of this as the difference between a street map and a satellite image. The core of Atlas is basically an image viewer. However, it's the images that come with Atlas that make it worthwhile - a map for every instance in the game. Furthermore, while the built-in maps mark the locations of some major bosses, Atlas provides detailed and accurate information about all of the creatures, NPCs, objects, and events you'll encounter in each dungeon. General information about each zone is provided as well, including its location, level range, player limit, attenuation requirement, and associated faction. All entrances, exits, portals, and connections are labelled clearly. Because there are so many instances in the game, you can categorize them by type, level, number of players, continent, or expansion. With Atlas installed and enabled, you will be able to view the instance maps every where, even you are not inside the instance. After installing Atlas, you'll notice a new icon on the minimap that looks like part of a little globe (you can right-click the icon to drag it around the minimap's frame). Click this icon to open up the main Atlas window, which displays the maps and legend. You can alternatively use the slash-command \"/atlas\". The drop-downs at the top of the window enable you to navigate between the maps. You can also drag the Atlas window around the screen. Lock it in place with the little lock button in the upper-right corner. At the bottom of the legend is a small text-entry field as well as Search and Reset buttons. Type part of a word or name in the box and click the Search button, and the legend's entries are reduced to only those that match your text. Note that the search is performed only on the entries for the current map, not all the entries in the database. While not so useful for instances with only a few entries like Ragefire Chasm, the search comes in handy when there are a ton of entries, like for Blackrock Depths or the AtlasMajorCities plug-in. If you want to get the whole list back, just click Reset. Atlas also includes maps of scenarios, battlegrounds, dungeon locations, flight points, and outdoor raid bosses. Before Installing}", "textBeforeTable": "Optional Files (14) - Codes cleanup - Minor enhancemnet: - Fixed a bug which shown 1.22.01 update info every time - Bugs fixed: - ruRU (StingerSoft) - zhCN/zhTW (ananhaid) - deDE (Dynaletik) - Translation update - Siege of Orgrimmar - Map added: - TOC update to support WoW 5.4 ----------------------- v1.26.00 (Sep. 09, 2013) - Translation minor update to correct the description on how to drag the minimap button - Fix the issue while clicking the Option button the first time won't lead you to the Atlas option panel - Fix the issue that CheckModule will always through a warning window ----------------------- v1.26.01 (Sep. 12, 2013) - ruRU (StingerSoft) - zhCN/zhTW (ananhaid / Arith) - frFR (Khiria) - esES/esMX (maqjav) - deDE (Dynaletik) - Translation update - Siege of Orgrimmar - Map updated: minimum level the player's level - Enhance dungoen list to show difficulties based on the dungeon's recommended - Enhance Atlas_GetBossName() to lookup minibosses' name to other maps map, additional button will appear so that user", "textAfterTable": "Archived Files (16) File Name Version Size Author Date   Atlas v1.31.00 3MB arith 11-10-14 09:41 AM   Atlas v1.30.00 7MB arith 10-15-14 11:42 AM   Atlas v1.26.02 6MB arith 09-17-13 09:01 AM   Atlas v1.26.00 6MB arith 05-21-13 12:26 PM   Atlas v1.24.00 6MB arith", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}