{"relation": [["Title", "Into Thin Air", "The Snow Leopard", "Little Princes", "Arresting God in Kathmandu", "Dark Summit: The True Story of Everest's Most Controversial Season"], ["Author", "Jon Krakauer", "Peter Matthiessen", "Conor Grennan", "Samrat Upadhyay", "Nick Heil"]], "pageTitle": "Nepal Tours & Travel | Intrepid Travel", "title": "", "url": "http://www.intrepidtravel.com/nepal", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00287-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 520056511, "recordOffset": 519988350, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{88254=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 188178=Review submitted 06 Jul 2015, 89573=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan...}", "TableContextTimeStampAfterTable": "{82022=Photographer Remy Hoehener and his wife were there on the 25th of April when the quake struck. His images of Nepal might be the best we've ever seen., 122814=Nepal held its first elections in 1959, but with the king dissolving parliament and banning political parties soon after, Nepal's monarchy retained power. After decades of pro-democracy movements, Nepal was finally declared a democratic republic in 2008, with Nepal's monarchy being removed from power after ruling for more than 240 years. Nepal celebrated its Year of Tourism in 2011, with arrivals increasing year upon year since 2006 due to increased infrastructure, expansion of air travel and the enduring popularity of the Himalayas and mighty Mount Everest., 121786=Nepal has been inhabited by people for more than 2,500 years, with evidence suggesting tribes of mountain-dwelling people moved to the area from China and other Central Asian regions. Due to a lack of archaeological evidence, little is known about the early periods of history in Nepal, with legend and folklore providing the backdrop to this kingdom of mystery. Ruled early on by the Kirati Dynasty, Nepal continued to be ruled by a succession of dynasties until the Malla Dynasty emerged in the 12th century. During this time, the kingdom expanded rapidly and widely before evolving into small communities with local rule. By the 15th century many temples and palaces had been built in Nepal, some of which are still in existence either as functioning temples or UNESCO World Heritage sites. The kingdom of Nepal was unified by King Shah in 1768, and went on to sign commercial treaties with Britain in 1792 and 1816 after hostilities with the British East India Company., 111857=Nepal's climate is primarily temperate, with some tropical and alpine regions. From June until August the monsoon hits, making it too wet and humid for trekking. The post-monsoon period from September to November is rice-harvesting season and is characterised by lush vegetation, clean air and excellent mountain views. Days are warm and sunny, although nights become increasingly cool. This is the start of the trekking season, which runs until May. Winter (December to February) is dry and clear with temperatures dropping below freezing at high altitudes, although in Kathmandu, it can still sometimes reach a pleasant 25 C. Spring (March to May) is warmer and is a particularly beautiful time to visit as the rhododendrons and the orchids are in flower.}", "textBeforeTable": "Recommended reading Further reading To learn more or donate, go to: www.theintrepidfoundation.org The Kathmandu Environmental Education Project is a non-profit organisation that provides impartial information to ensure the ecological and cultural prosperity of Nepal. Training, workshops and other programs help locals to preserve their precious culture and environment. Image supplied by Niraj Shrestha. Kathmandu Environmental Education Project (KEEP) The children of female prisoners in Nepal are amongst the most vulnerable and socially excluded individuals. PA Nepal helps support the rehabilitation and integration of prisoners’ children, out of prisons and into the community after equipping them with self-sustaining life skills and education. Prisoners Assistance Nepal This relatively small non-government organisation targets disadvantaged children living in dangerous and vulnerable situations on the streets; living with their impoverished families and/or those required to work for a living. They help support access to appropriate educational opportunities, vocational training, and greater stability and security at home. Image supplied by Just One Just One In Nepal, the Intrepid", "textAfterTable": "Handy links www.lonelyplanet.com/nepal www.worldtravelguide.net/nepal www.visitnepal.com/ × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic Of", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}