{"relation": [["", "1", "2", "3", "4", "5"], ["Name", "Halleluy'all", "If I Didn't Love You So Much", "Canoe", "Cheater Cheater", "19 and Crazy (Remix)"], ["Artist", "Bomshel", "Bomshel", "Bomshel", "Bomshel", "Bomshel"], ["Time", "3:11", "3:11", "3:04", "2:47", "3:52"], ["Price", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Halleluy'all - EP by Bomshel", "title": "", "url": "https://itunes.apple.com/us/album/halleluyall-ep-ep/id538009279", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00040-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 878134939, "recordOffset": 878108035, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{112514=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 03:39:41 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Bomshel Halleluy'all - EP iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Halleluy'all - EP by Bomshel, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "5 Songs Customer Reviews Great New Stuff ( Halleluyall)           by Wyreba96 Love the new songs and changes in the old songs. Can't wait to hear what the new album will have on it. I do have my fav already but I'm up to hear more new stuff. :) Biography Formed: Nashville, TN Genre: Country Years Active: '00s, '10s Bomshel began as an ambitious Tuesday night ritual, where vocalist Buffy Lawson and fiddler Kristy O. would use Nashville's slowest bar night as their stepping stone into one of the most intimidating music scenes around. Soon, Tootsie's Orchid Lounge was filled with people, including some who would routinely make a lengthy drive to see Bomshel perform. Soon the women attracted major attention and were signed to Curb Records, where they were given their own label, Bombstop! Records. In 2009 the group... Full Bio Top Albums and Songs by Bomshel", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}