{"relation": [["Title", "Carthage Must Be Destroyed", "The Tremor of Forgery", "The Pillar of Salt", "Behind Closed Doors: Women's Oral Narratives in Tunis"], ["Author", "Richard Miles", "Patricia Highsmith", "Albert Memmi", "Monia Hejaiej"]], "pageTitle": "Tunisia Tours & Travel | Intrepid Travel AU", "title": "", "url": "http://www.intrepidtravel.com/au/tunisia", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00069-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 520937591, "recordOffset": 520886474, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{86278=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 188059=Review submitted 14 May 2015, 87597=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan...}", "TableContextTimeStampAfterTable": "{21501=Tunisia boasts a Mediterranean climate in the north and an arid, desert-like climate in the south. Tunisia typically receives most of its visitors in July and August, when the hot weather draws tourists to the beaches. The coldest and wettest months are January and February, although the rainfall average for this time is low and many interior Saharan regions of Tunisia do not see rainfall for years. March to May is a great time to travel as it is less crowded, the temperatures are cooler and the scenery is spectacular. November is considered the optimal time for trekking in the desert. Travelling during the holy month of Ramadan presents benefits and challenges as many restaurants close and business hours can be interrupted, although travelling during Ramadan often provides rare insight into a country and culture during this holy period.}", "textBeforeTable": "Recommended reading Further reading 11. Ramadan is the fasting month for all Muslims. During this month no food, drink or smoking is permitted during daylight hours. While non-Muslims visiting Tunisia aren't expected to fast, it's recommended to try to avoid eating, drinking or smoking in public during daylight hours. 10. When on community visits or homestays, refrain from giving gifts or money to locals. 9. Please ask and receive permission before taking photos of people, including children. 8. Refrain from supporting businesses that exploit or abuse endangered animals. 7. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 6. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 5. When bargaining at markets, stay calm, be reasonable and keep a smile on your face. It's meant to be fun! 4. Always dispose of litter thoughtfully, including cigarette butts. 3. For environmental reasons, try to avoid buying bottled water. Instead, fill a reusable water bottle or canteen with filtered water. 2. Dress modestly and respectfully. Shoulders to knees should be covered, especially when entering places of worship. 1. Be considerate of Tunisia’s customs, traditions, religion and culture. Top responsible travel tips for Tunisia", "textAfterTable": "Handy links www.lonelyplanet.com/tunisia www.worldtravelguide.net/tunisia www.cometotunisia.co.uk × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}