{"relation": [["Title", "The Bone People", "Whale Rider", "The Colour: A Novel", "Going West", "Dogside Story"], ["Author", "Keri Hulme", "Witi Ihimaera", "Rose Tremain", "Maurice Gee", "Patricia Grace"]], "pageTitle": "New Zealand Tours & Holidays | Intrepid Travel FR", "title": "", "url": "http://www.intrepidtravel.com/fr/new-zealand", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00081-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 519993295, "recordOffset": 519934862, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{87497=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 188024=Review submitted 27 Mar 2015, 86178=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o...}", "TableContextTimeStampAfterTable": "{61590=In 1852, New Zealand was granted the right to self-govern and in 1907, independence was granted (although the British monarchy remain as head of state). More recently, New Zealand voted in its first female prime minister in 1997. Jenny Shipley held office for two years, before handing over to another female leader - Helen Clarke, who continued to lead until 2008. In the last ten years, New Zealand has enjoyed a surge in tourism, partly due to the wealth of wineries, ski fields and nature reserves. The film industry has also been a great champion of New Zealand, with filmmakers enjoying the rugged terrain and relatively cheap costs associated with filming in New Zealand. The Lord of the Rings franchise is probably the most well known film to be shot in New Zealand, and has been largely responsible for putting New Zealand in the international spotlight. A devastating earthquake hit Christchurch in 2011, resulting in widespread loss of life and infrastructure. Although Christchurch is still rebuilding, visitors are encouraged to visit this spirited city., 49950=The most pleasant time for travelling throughout New Zealand is summer (December to February); however, this is also the busiest period, especially during school holidays (late December to late January). Winter can get very cold with frequent snowfall - but this is the perfect time to travel if you’re looking to ski or snowboard, particularly in the South Island., 71627=Hundreds of the world’s best buskers and street performers head to New Zealand each year to juggle, dance, mime, sing and contort in the streets and parks of Christchurch. After the devastating earthquake of 2011, Christchurch is in rebuilding mode - but the festival is still going ahead in 2012. The best thing about this festival? It’s free!, 60801=Maori tribes, descended from Polynesia, lived in New Zealand for centuries before the arrival of Europeans in the 18th century. Relying on fishing, hunting and foraging, these people were able to live off the land and develop a deep connection with the earth as a result of this. European settlers caused wide-scale disruption and land loss for the Maoris, which resulted in conflict and displacement in the early days of colonisation. The 1840 Treaty of Waitangi officially recognised Maori land ownership, of which the British and Maoris were signatories. This historic agreement is viewed as a pivotal moment in New Zealand’s history and the first important step towards reconciliation between the original inhabitants and settlers., 70544=This national public holiday celebrates the signing of the Treaty of Waitangi in 1840. Featuring Maori ceremonies, public entertainment and a diverse range of food, Waitangi Day is a celebration for all New Zealanders regardless of cultural background.}", "textBeforeTable": "Recommended reading Further reading 8. Refuse plastic and choose to bring your own reusable shopping bag. 7. When on community visits or homestays, refrain from giving gifts or money to locals. 6. Please ask and receive permission before taking photos of people, including children. 5. Refrain from supporting businesses that exploit or abuse endangered animals. 4. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 3. Always dispose of litter thoughtfully, including cigarette butts. 2. For environmental reasons, try to avoid buying bottled water. Fill a reusable water bottle or canteen with filtered water instead. 1. Be considerate of New Zealand’s customs, traditions, religion and culture. Top responsible travel tips for New Zealand Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this in mind while on holiday in New Zealand. New Zealand Travel Tips Responsible Travel also provides useful health information:", "textAfterTable": "Handy links www.lonelyplanet.com/new-zealand www.worldtravelguide.net/new-zealand www.newzealand.com/travel × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}