{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14"], ["Name", "Just In Case You Wonder", "I Wish You Would", "I Ain't Gonna Eat Out My Heart Anymore", "Gaslight", "My Little Red Book", "Hey Mama (Keep Your Big Mouth Shut)", "Nothin'", "10:30 Train", "I Need Your Love", "She Ain't Used to Me", "Rimb Nugget", "I Can Tell", "Epilogue", "I Know What to Say"], ["Artist", "The Ugly Ducklings", "The Ugly Ducklings", "The Ugly Ducklings", "The Ugly Ducklings", "The Ugly Ducklings", "The Ugly Ducklings", "The Ugly Ducklings", "The Ugly Ducklings", "The Ugly Ducklings", "The Ugly Ducklings", "The Ugly Ducklings", "The Ugly Ducklings", "The Ugly Ducklings", "The Ugly Ducklings"], ["Time", "2:28", "3:30", "3:02", "2:44", "3:09", "3:01", "2:29", "2:32", "5:49", "3:06", "4:16", "3:17", "2:37", "1:59"], ["Price", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - The Ugly Ducklings by The Ugly Ducklings", "title": "", "url": "https://itunes.apple.com/gb/album/rimb-nugget/id289282861?i=289284018", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00314-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 875960943, "recordOffset": 875929981, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{27130=Underground luminaries of garage rock, The Ugly Ducklings are considered a top-shelf Canadian rock ‘n’ roll band of the '60s. This eponymous 2005 reissue compiles the Toronto quintet’s sole 1966 album, Somewhere Outside, with previously unreleased songs, alternate takes, a few 45 singles, and B-sides. “Just in Case You Wonder” opens on a Pretty Things–inspired groove (perhaps why it was chosen to be part of Pebbles, Volume 10 back in 1980). The surf-infused R&B rave-up “Nothing’” was the band’s one breakthrough single. It came out in 1966, one year before The Ugly Ducklings released the bouncier 45 “Gaslight.” Although it shows more original songwriting, that single didn't do as well as “Nothin’.” But The Ugly Ducklings also proved to be talented at putting their own spin on the songs of others, as evidenced by their smoking take on “My Little Red Book” by Burt Bacharach and the late, great Hal David. Other gems include the driving “I Wish You Would” and the spitting and spiteful “Hey Mama (Keep Your Big Mouth Shut).”, 28324=Formed: 1965, 129228=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 08:30:41 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist The Ugly Ducklings The Ugly Ducklings iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from The Ugly Ducklings by The Ugly Ducklings, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes", "textAfterTable": "14 Songs Editors’ Notes Underground luminaries of garage rock, The Ugly Ducklings are considered a top-shelf Canadian rock ‘n’ roll band of the '60s. This eponymous 2005 reissue compiles the Toronto quintet’s sole 1966 album, Somewhere Outside, with previously unreleased songs, alternate takes, a few 45 singles, and B-sides. “Just in Case You Wonder” opens on a Pretty Things–inspired groove (perhaps why it was chosen to be part of Pebbles, Volume 10 back in 1980). The surf-infused R&B rave-up “Nothing’” was the band’s one breakthrough single. It came out in 1966, one year before The Ugly Ducklings released the bouncier 45 “Gaslight.” Although it shows more original songwriting, that single didn't do as well as “Nothin’.” But The Ugly Ducklings also proved to be talented at putting their own spin on the songs of others, as evidenced by their smoking take on “My Little Red Book” by Burt Bacharach and the late, great Hal David. Other gems include the driving “I Wish You Would” and the spitting and spiteful “Hey Mama (Keep Your Big Mouth Shut).” Biography Formed: 1965 Genre: Rock Years Active: '60s Along with the Haunted, the Ugly Ducklings were probably the best Canadian rock group of the mid-'60s. Like the Haunted,", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}