{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"], ["Name", "He Is", "Nature of a Man", "Fallin' for You", "I Wish I Wasn't", "Fulltime", "Like Ya Use To", "Always Been Your Girl", "Sunday", "Four Words from a Heartbreak", "Sista Girl", "Why Should I Cry", "If It Wasn't for Your Love"], ["Artist", "Heather Headley", "Heather Headley", "Heather Headley", "Heather Headley", "Heather Headley", "Heather Headley", "Heather Headley", "Heather Headley", "Heather Headley", "Heather Headley", "Heather Headley", "Heather Headley"], ["Time", "3:46", "3:24", "3:02", "4:15", "3:37", "4:05", "4:35", "3:27", "3:37", "4:29", "3:47", "3:54"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - This Is Who I Am by Heather Headley", "title": "", "url": "https://itunes.apple.com/bg/album/fallin-for-you/id299665361?i=299665388", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00191-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 871547503, "recordOffset": 871521815, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{24090=Born: 05 October 1974 in Barataria, Trinidad, 120528=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 08:55:14 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Heather Headley This Is Who I Am iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from This Is Who I Am by Heather Headley, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop.", "textAfterTable": "12 Songs Album Review Though she didn't come out of the R&B tradition, Heather Headley has plenty of soul on her debut, This Is Who I Am. Headley, a singer whose vocal strength isn't mere compensation for a lack of interpretive skills or lame songwriting, possesses a range that's surprising and welcome; she slips on dramatic personas continually here, quite ironic considering the title. The arrangements aren't exactly hooky, but the cast of producers — including Dallas Austin, Jimmy Jam and Terry Lewis, and D'Influence, use everything in their power — from a Hammond B-3 to synthesizers — to flesh out these songs. Occasionally, the songs don't reflect their age very well, as on the regrets of a stay-at-home girlfriend (\"I Wish I Wasn't\") or an increasingly angry housewife who's been neglected (\"Like Ya Used To\"). The opener, \"He Is\" (by songwriter/producer Joshua Nile), is very good though — an intriguing angle on female thoughts about the male side of love (or, just possibly, a look at the aspects of God). Headley sounds excellent throughout, her voice pure as crystal on the ballads, occasionally outré in similar fashion to Mariah Carey, but gritty and soulful when she's sorting out the responsibilities of a relationship in \"Fulltime.\" Biography Born: 05 October 1974", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}