{"relation": [["Title", "The Teeth May Smile but the Heart Does Not Forget", "Girl Soldier", "The Impenetrable Forest: My Gorilla Years in Uganda", "Abyssinian Chronicles", "The Last King of Scotland"], ["Author", "Andrew Rice", "Faith McDonnell and Grace Akallo", "Thor Hanson", "Moses Isegawa", "Giles Foden"]], "pageTitle": "Uganda | Intrepid Travel", "title": "", "url": "http://www.intrepidtravel.com/Uganda/culture-geography-history-show-me", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00128-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 524854403, "recordOffset": 524793229, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{138297=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 139616=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 239581=Review submitted 23 Jul 2015}", "TableContextTimeStampAfterTable": "{10007=Uganda came under colonial rule during the late 1800s, and was known as the Kingdom of Uganda under British rule. Colonial rule continued for many years until independence was granted in 1962. From 1971 to 1979, Uganda came under the rule of Idi Amin, hallmarked by a time of economic decline and human rights violations. By the time Amin had fled to Libya, many Ugandans were suffering from extreme economic hardship and social difficulties. Conflicts with neighbouring countries in the 80s and 90s created more turmoil and upheaval, although more recently, Ugandans have enjoyed a time of relative peace with an improved economy largely due to an increase in tourist numbers and agricultural export., 9493=Inhabited by hunter-gatherer tribes for centuries, it's thought that the Hamitic people from neighbouring countries arrived sometime before 1000 AD, bringing with them knowledge of animal husbandry and agriculture. Migration from neighbouring countries continued, with tribespeople from Kenya and Tanzania flowing into Uganda well into the 16th century, as well as Arab traders moving inland from the coast and Christian missionaries arriving during the 1800s., 928=For sunshine and hot weather, visit Uganda from late December to late February as this is the dry season. June to September is also a good time to travel as you can expect warm temperatures and little rain. The wet seasons run from March to May and October to November – during this time downpours are frequent and often create less accessibility on roads and within some national parks.}", "textBeforeTable": "Recommended reading Further reading 10. When on community visits or homestays, refrain from giving gifts or money to locals. 9. Please ask and receive permission before taking photos of people, including children. 8. Refrain from supporting businesses that exploit or abuse endangered animals. 7. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 6. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 5. When bargaining at markets, stay calm, be reasonable and keep a smile on your face. It's meant to be fun! 4. Always dispose of litter thoughtfully, including cigarette butts. 3. For environmental reasons, try to avoid buying bottled water. Fill a reusable water bottle or canteen with filtered water instead. 2. Dress modestly and respectfully. Shoulders to knees should be covered, especially when entering places of worship. 1. Be considerate of Uganda’s customs, traditions, religions and culture. Top responsible travel tips for Uganda", "textAfterTable": "Handy links www.lonelyplanet.com/uganda www.worldtravelguide.net/uganda www.visituganda.com × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}