{"relation": [["Title", "Atlas", "PCSXTrace", "PSXAddress", "TIMmay", "ScriptCrunch"], ["Author", "Klarth", "Klarth", "Klarth", "Klarth", "Klarth"], ["Description", "Atlas is a dedicated, extensible script insertion utility capable of dealing with scripts of advanced complexity.", "A PCSX-based code tracer that supports filtered, unfiltered, and mark-only type traces along with a multitude of options to hone in on the code you’re trying to decipher.", "Converts PSX addresses such as RAM, EXE, EPSXE savestates, and vice versa. Source code included.", "TIM file format PSX graphic ripper and reinserter. (Source included)", "ScriptCrunch provides 5 script size optimization algorithms (like DTE) and many features to crunch your oversized script for insertion."], ["Category", "Script Extraction / Insertion", "Debuggers / Special Emulators", "Miscellaneous", "Graphics Editors", "Script Extraction / Insertion"], ["Platform", "Multiple", "PSX", "PSX", "PSX", "Multiple"], ["Game", "N/A", "N/A", "N/A", "N/A", "N/A"], ["OS", "Win", "Win", "Win", "DOS", "DOS"], ["Ver", "1.11", "1.5b", "1.01", "0.3", "1.0"], ["Level", "Beg", "Int", "Int", "Int", "Int"], ["Date", "None", "None", "None", "None", "None"]], "pageTitle": "Romhacking.net - Utilities", "title": "(1 to 5) of 5 Results", "url": "http://www.romhacking.net/?page=utilities&author=341&order=Game", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00290-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 674763099, "recordOffset": 674747616, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Button Search Description Search Title Text Search Results Per Page None Selected 10 20 30 40 50 Level None Selected Advanced Beginner Intermediate OS None Selected BeOS DOS Indep Java Mac OS Mac OS X Unix Win Author None Selected Aether Knight (wraith) +daniel+ -=Fx3=- A7mad AamirM Aaron Jacobson Abe Abstract Crouton Productions Abyssonym AcidPhire acmlm ADnova Agemo AgentGeo Ajax Alcaro ALXR André Fachat Android 18 angel-team Anime_World AnusP AnyoneEB Archaemic Arcnor Atarius Maximus (Steve Engelhardt) Atrius AvatarofHonor Barubary Bas Steendijk bbitmaster Ben Beneficii Benjamin Cutler Benjamin Popp BigNailCow Black Rabite Blades blank blueMSX Bob Colbert Bob Rost bobmcjr Bongo` Boris Timofeev Borra Bouche BouKiChi Brandon Koopa breech Bregalad Brendon James Bruno Costa Bryan M.", "textAfterTable": "1 ﻿ Information ©2005-2014 RHDN 2.6.0 by Nightcrawler. All Rights Reserved. Execution time - 0.0108 sec. - Number of Queries: 2 About Us | RHDN Policy | XHTML | CSS", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}