{"relation": [["Type", "Post", "Post", "Post"], ["Term", "Standard", "Standard", "Standard"], ["Title", "Special Nia class", "Annual New Year's Day Jam at Equinox", "New Los Angeles Nia Site is Active!"], ["Author", "Jodie", "Miriam", "Jodie"], ["Replies", "", "1", "1"], ["Last Post", "03/20/2013 - 4:02pm", "12/23/2012 - 11:47am", "04/23/2012 - 7:10pm"]], "pageTitle": "Greater Los Angeles | Nia", "title": "Term: Standard", "url": "https://nianow.com/node/56809/by_subject/1776", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 8, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00244-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 880249707, "recordOffset": 880226821, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{42833=10:00-11:15 am, 91313=new class ~ starting Feb. 6th 2013, 39217=Large friendly classes of mixed ages & levels. Nia has been popular here since 1999.  }", "lastModified": "Fri, 31 Jul 2015 07:20:11 GMT", "textBeforeTable": "Greater Los Angeles By term View Greater Los Angeles Posts by term » Greater Los Angeles » Home »", "textAfterTable": "About Nia What is Nia? Nia is a sensory-based movement practice that draws from martial arts, dance arts and healing arts. It empowers people of all shapes and sizes by connecting the body, mind, emotions and spirit. Classes are taken barefoot to soul-stirring music in more than 45 countries. Trainings are designed for those seeking personal enrichment and professional development. Every experience can be adapted to individual needs and abilities. Step into your own joyful journey with Nia, and positively shape the way you feel, look, think and live. How does Nia work? Nia draws from Tai Chi, Tae Kwon Do, Aikido, jazz dance, modern dance, Duncan dance, yoga, Alexander Technique and Teachings of Moshe Feldenkrais. Every class offers a unique combination of 52 moves that correspond with the main areas of the body: the base, the core and the upper extremities. Stiff beginners and highly fit athletes alike can adapt Nia to meet their needs by choosing from three intensity levels. Consecutive trainings collectively explore 52 principles for personal enrichment and professional development. Read testimonials from people of all ages, backgrounds and locations. Why was Nia created? Nia’s purpose is to grow a worldwide community of healthy people who are empowered to do great things. We believe every person can discover, explore, unleash and enhance their individual potential to live a fulfilling and meaningful life – by engaging their senses and listening to their bodies. With the right tools and", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}