{"relation": [["Title", "Complete Pyramids, The (Solving the Ancient Mysteries)", "Pyramids of Ancient Egypt, The", "Treasures of the Pyramids, The"], ["Author", "Lehner, Mark", "Hawass, Zahi A.", "Hawass, Zahi"], ["Date", "1997", "1990", "2003"], ["Publisher", "Thames and Hudson, Ltd", "Carnegie Museum of Natural History, The", "American University in Cairo Press, The"], ["Reference Number", "ISBN 0-500-05084-8", "ISBN 0-911239-21-9", "ISBN 977 424 798 1"]], "pageTitle": "Great Pyramid Cores", "title": "", "url": "http://www.touregypt.net/featurestories/pyramidcore.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00200-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 786118255, "recordOffset": 786100950, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{24414=Copyright © 1996-2013 Tour Egypt. All Rights Reserved. Web Development & Design By AKN Solutions, 12746=Just as in the case of Khufu's's Pyramid, that of Khafre's core is made up of loose, irregular fill. There are seams and gaps in the stepped core blocks, and through these we can see limestone chips and rubble. Giovanni Belzoni, the \"strong man of Egyptology\", cleared out a robbers tunnel in 1818 that was dug through the center of the north side of the pyramid. However, he experienced problems because the core fabric of the pyramid kept collapsing. Vito Maragioglio and Celeste Rinaldi, who surveyed the pyramids between 1963 and 1975, wrote, \"... this was due without doubt to the incompactness of the internal masonry and the lack of mortar, so that the blocks are not always in contact at the sides, and cannot mutually support each other.}", "textBeforeTable": "Resources: Irregardless of the irregularity of their cores, the Giza Pyramids do have the most massive, large block masonry of all Egyptian pyramids. These classic pyramids of popular imagination were built in only three generations and yet, all of the other pyramids of kings (excluding queens and other satellite pyramids) contain only 54 percent of the total mass of the pyramids of Sneferu, his son Khufu, and grandson Khafre. Many of the characteristics of these pyramids are very precise, but while they are not as perfect as many might imagine, they nevertheless represent true landmarks in human achievement. However, in the eastern face of this cut, the courses are not regular, but there could be two crude steps of perhaps a large inner structure which is possibly a crude stepped core. A similar crude structure can be seen in the cores of the partially destroyed or unfinished queen's pyramids of Khufu and Menkaure, and in the gash in the north face of Menkaure's Pyramid. It appears likely that the cores of these pyramids are composed of great, rectangular blocks of crude masonry, a sort of \"chunk approach\" to assembling an inner step pyramid that lacks the beautifully finished faces and corners of Meidum. The gash that Howard Vyse made in Khufu's Pyramid, which extends some nine meters deep into its", "textAfterTable": "Archives Who are we? Tour Egypt aims to offer the ultimate Egyptian adventure and intimate knowledge about the country. We offer this unique experience in two ways, the first one is by organizing a tour and coming to Egypt for a visit, whether alone or in a group, and living it firsthand. The second way to experience Egypt is from the comfort of your own home: online. Popular Pages Egypt Pyramids Monuments & Ancient Sites Egyptian Kings Ancient Temples Pharaohs General Travel What to Take Destinations Egypt Travel Articles Budget Travel Fees to Monuments Shopping Guide Beach Vacations Interactive Pages Picture of the Day Reader Pictures Recipe of the Week Weekly Crossword Puzzle Send Postcard Hieroglyph Converter Egyptian Money Specific Activities Scuba Diving Therapy Golf Courses Fishing Lake Nasser Birding in Egypt Tour", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}