{"relation": [["Title", "Legend of Heroes: A Tear of Vermilion (PSP the Best)", "Legend of Heroes II: Prophecy of the Moonlight Witch (PSP the Best)", "Legend of Heroes III: Song of the Ocean (PSP the Best)", "Class of Heroes (PSP the Best)", "Muramasa The Demon Blade", "Home-Tutor Hitman REBORN! Fate of Heat II", "Pokémon Dungeon - Sky Explorers", "Nanatama: Chronicles of Dungeon Maker", "Daikoukai Jidai ONLINE: Cruz del Sur", "Tir nan Og - Perpetual Virtue", "Tir nan Og - Perpetual Virtue", "Persona", "Dungeons & Dam", "Dragonball Kai - Attack of the Saiyans"], ["Publisher", "Bandai-Namco", "Bandai-Namco", "Bandai-Namco", "Acquire", "Marvelous", "Takara-Tomy", "Nintendo", "Global A", "Kouei", "System Soft Alpha", "System Soft Alpha", "Atlus", "Acquire", "Bandai-Namco"], ["Release Date", "4/02/09", "4/02/09", "4/02/09", "4/09/09", "4/09/09", "4/16/09", "4/18/09", "4/23/09", "4/28/09", "4/29/09", "4/29/09", "4/29/09", "4/29/09", "4/29/09"], ["Platform", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]], "pageTitle": "RPGamer > Japandemonium (April 10th, 2009)", "title": "", "url": "http://rpgamer.com/news/japan/mb041009.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 11, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00289-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 208373581, "recordOffset": 208357187, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{2746=So, I'm looking things up on Dengeki, and I see Square's name pop up on one news item. Of course I click it. What I am not expecting is the other brand name that appears in the topic title -- MySpace. Square Enix now has its very own MySpace page, though whoever they had write up the obligatory blurb section needs to review his English grammar some more., 8646=Well, it's been a little more than a week since April 1st, so I guess it's time to come clean. As of the time of writing, the April Fools' poll has gotten 21 votes, plus one more to my email. The results are:, 3060=Anyway, I hope you all had an interesting and surprising April 1st. Now, on to the column!}", "TableContextTimeStampAfterTable": "{8545=\"According to local legend, it has been approximately 1000 years since a tribe of powerful and deadly Witches snuck out from the netherworld and invaded the relatively peaceful surface world. Wielding dangerous magic spells and potent incantations, the dark Witches proceeded to take over the surface world by force, leaving many surface dwellers fearing for their lives. When all else seemed lost, a mystical woman named Alice appeared, using her own brew of the enchantresses' dangerous magic against them to send them back to their own world. While all has been relatively peaceful since Alice sealed them all away, rumor has it that the Witch Queen still lurks beneath the surface world, waiting to take back the world that was almost hers. \"}", "textBeforeTable": "Recently the Dengeki site restructured several of their regular features, including the Top 50 weekly sales rankings. It's now the Top 20, and a few other alterations have made it much less easy to work with. So for a while I'm going with the Famitsu Top 30 sales list to see how it goes. Since Famitsu and Dengeki don't always get their numbers from the same sources or update for the same periods of time, the numbers will not match what was reported last week. Weekly Famitsu 3/23 ~ 3/29 S-E's Myspace Page Source: The point, however? S-E has produced their very own MySpace-based flash game featuring a character from Final Fantasy XII, Dive II Hunt -- The Adventures of Sorbet. Guide the little Moogle as she explores the ocean looking for rare fish to catch. So, I'm looking things up on Dengeki, and I see Square's name pop up on one news item. The following pictures may be in Japanese, but the application is also available in English. Poorly written English, but still understandable.", "textAfterTable": "Now presenting Queen's Blade - Spiral Chaos. I'm not sure why the PSP, or handhelds in general, should attract so many tactical titles, but here's one more to add to the list. So far, at least nine characters from various editions of the original game are known to be in this version, as well as two original characters, Cute and Jeanne. What strikes me as interesting is the actual combat sequence when two units engage. The game shows its roots here, as it goes into what looks like a fighting game mode, complete with health bar along the top. I'm not sure how far the fighting game style goes, however. That is something I'll have to look into. What I'd rather not look into is the nature of that pink goop splattered over one character on the first page of the scan. Some things are better left unknown. Source: Famitsu Weekly Witchy Woman We have news of A Witch's Tale! After a long, long wait, Hitmaker and NIS have finally released some information about the game. For those needing a recap of what's known about the game so far, here's an excerpt from last summer's impression, courtesy of Ilchymis: \"According to local legend, it has been", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}