{"relation": [["ISBN", "9780439755399", "9780545122771", "9780545057486", "9780545057479", "9780545214797", "9780545057516", "9780545057509"], ["TITLE", "THE FUNGUS THAT ATE MY SCHOOL (Bookshelf Edition)", "MAX SPANIEL: BEST IN SHOW", "MAX SPANIEL: DINOSAUR HUNT", "MAX SPANIEL: FUNNY LUNCH", "MONSTER MASH (hardcover)", "SCHOL RDR LVL 1: MAX SPANIEL #1: DINOSAUR HUNT", "SCHOL RDR LVL 1: MAX SPANIEL #2: FUNNY LUNCH"], ["YEAR", "2005", "2011", "2009", "2010", "2012", "2011", "2012"], ["PRICE", "6.99", "6.99", "6.99", "6.99", "16.99", "3.99", "3.99"], ["AUTHOR / ILLUSTRATOR", "Arthur Dorros, David Catrow", "David Catrow", "David Catrow", "David Catrow", "David Catrow", "David Catrow", "David Catrow"]], "pageTitle": "David Catrow Author Visit Kit | Scholastic.com", "title": "", "url": "http://www.scholastic.com/teachers/visitkit/david-catrow-author-visit-kit", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00209-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 700423287, "recordOffset": 700401810, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{13407=$1500/ day plus travel and expenses (no half days), 14913=2005, 15471=2011, 16543=2010, 15268=9780545122771, 17078=2012, 16008=2009}", "lastModified": "Mon, 03 Aug 2015 18:13:48 +0000", "textBeforeTable": "Book list   Schools and libraries may order books at a discounted rate by visiting the Scholastic Teacher Store or by calling 1-800-SCHOLASTIC. Ordering Books   Request a visit.   $1500/ day plus travel and expenses (no half days) Honorarium   The materials required are a pad of Post-It paper (the largest available) 23”x 29”, an easel and a laptop to project images contained on a flash-drive. A microphone is optional. David Catrow will bring his own drawing materials. AV Tech   Request a visit. Daily schedule permitting, David studio door is always open for a chat with a class or library group curious about his work and what inspires him. Generally, each session will run 30 minutes and in addition to the mandatory drawing lessons, visitors get an insiders peek into picture composition and how the artist finds niches in a text to sometimes create a completely parallel story. Virtual Visits   Request a visit. David Catrow is always happy to present to conferences and festivals; mostly because the experience for him is inspiring and energizing. It allows him the unique opportunity to converse with individuals who are up to the moment on books and all things relevant to books. Being with the reader essentially completes the circle David begins when, alone in his studio- he first picks up his pen to draw a dog or a dirigible. Presentations usually run 40-45 minutes and cover the exciting process of receiving that first spark of", "textAfterTable": "  Scholastic School to Home Reading Club (Book Clubs) Book Fairs Teacher Resources Book Lists Book Wizard Instructor Magazine Lesson Plans New Books New Teachers Scholastic News Online Strategies and Ideas Student Activities Daily Teacher Blogs Videos Whiteboard Resources", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}