{"relation": [["Artist", "Correatown", "Jenna Andrews", "Joshua Radin", "Matthew Perryman Jones", "V.V. Brown", "Walking Sleep"], ["Song Title", "Further", "Tumblin' Down", "You Got What I Need", "Until the Last Falling Star", "Refresh Me", "Don't Be Fooled"], ["Played When", "April Looks Terrified of Lexie, Closing Scenes", "Meredith Sets Down Medicine Bottle, Patient Smiles", "Cancer Patient Devastated, Then Dances for Doctors", "Teddy Talking to Avery in Locker Room", "Lunch Scene, Girls Talking About Meredith's Uterus", "Opening Scenes, Meredith's Roommates in Bathroom"]], "pageTitle": "Grey's Anatomy Season 7 Episode 4 - Can’t Fight Biology (7x4) - Watch Online - s7 e4 Spoilers", "title": "", "url": "http://www.tvrage.com/Greys_Anatomy/episodes/1064982894", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00244-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 801417063, "recordOffset": 801392620, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Music Trivia: The exterior of the firehouse apartment that Cristina and Hunt are shown by the Realtor is actually Fire Station 23 at 225 E. 5th Street in Los Angeles, California. Ratings: 12.11 Million Viewers Episode Notes Read the full recap Recap The show opened with the large house some of the doctors and nurses rented together looking very crowded, especially the big bathroom and kitchen. Owen decided to show Christina, his wife, a fixer-upper house that he had found. It was basically falling apart upstairs, plaster and lath hanging from the ceiling and walls, windows broken out and pigeons flying around inside. Christina looked very dubious, but didn't want to hurt Owen's feelings. She said she would like to give it some thought before making a final decision. They went to the hospital with both voicing doubts in their minds... Dr. Cristina Yang As Sandra Oh Dr. Mark Sloan As Eric Dane", "textAfterTable": "Episode Quotes Meredith ( opening voiceover): Biology determines much of the way we live. From the moment we're born we know how to breathe and eat. As we grow older new instincts kick in. We become territorial. We learn to compete. We seek shelter. Most important of all, we reproduce. Sometimes biology can turn on us though. Yeah, biology sucks sometimes. Cristina: Welcome home. It's ours. We bought it. Well, I bought it, but it's for the both of us. Owen: I don't know what to say. Cristina: Our house has a firepole in it. What else is there to say? Owen: You said this morning... Cristina: I don't care where we live, I really don't. But you do. You love this place and I love you. Alex: Post-ops are stable and I've ordered morning labs. Arizona: Hmm. Thanks. Alex: You know, Sloan risked his life to save mine, even when I was sleeping with his girl. That's not a guy without a soul. Maybe he's an ass who stares at boobs, but whatever. And your boobs? You have nice boobs, and maybe they're lesbian boobs and you don't like men staring at them... But men don't discrimate when it comes to jugs.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}