{"relation": [["", "1", "2", "3", "4", "5", "6", "7"], ["Name", "Walk Between the Lines", "If Crimson Was Your Colour", "Leva", "Hey Doctor", "Samaritan Burden", "Remembered", "The Alchemist"], ["Artist", "Witchcraft", "Witchcraft", "Witchcraft", "Witchcraft", "Witchcraft", "Witchcraft", "Witchcraft"], ["Time", "3:24", "3:47", "4:33", "5:12", "6:27", "5:14", "14:36"], ["Price", "€0.99", "€0.99", "€0.99", "€0.99", "€0.99", "€0.99", "Album Only"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - The Alchemist by Witchcraft", "title": "", "url": "https://itunes.apple.com/ie/album/the-alchemist/id262539129", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00218-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 872418135, "recordOffset": 872394589, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{13641=Black Sabbath is rightfully considered a trailblazer of the doom metal genre. But the next group in line to carry the doom torch was Pentagram, a U.S. band well versed in their Ozzy and Iommi-isms. While Pentagram never scaled the heights that the Sabs did, they certainly left their mark on countless subsequent bands throughout the world — especially Sweden's Witchcraft. On their third release overall, 2007's The Alchemist, the quartet continues attempting to turn the clock back to 1975 — Magnus Pelander's vocal delivery is an awful lot like Pentagram's Bobby Liebling, while the music would provide a fine soundtrack to a high school stoner's basement party — when the folks were out of town, the bong smoke was thick, and the black light posters were proudly on display. However, as with most doom metallists, quite a few bits have a certain familiarity to them — case in point, \"If Crimson Was Your Colour,\" which contains a riff reminiscent of Megadeth's \"Symphony of Destruction,\" while \"Hey Doctor\" contains the same drum breakdown in the middle of Sabbath's Vol. 4 obscurity \"Under the Sun/Every Day Comes and Goes.\" But the group also shows they aren't afraid of laying down a Wolfmother-esque groove from time to time, as evidenced by the opening of \"Samaritan Burden.\" Doom metal continues to thrive in the early 21st century, as evidenced by the emergence of Witchcraft., 113539=Shop at the Apple Online Store, call 1800 92 38 98 or find a retailer., 114397=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 04:53:40 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Witchcraft The Alchemist iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from The Alchemist by Witchcraft, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "7 Songs Album Review Black Sabbath is rightfully considered a trailblazer of the doom metal genre. But the next group in line to carry the doom torch was Pentagram, a U.S. band well versed in their Ozzy and Iommi-isms. While Pentagram never scaled the heights that the Sabs did, they certainly left their mark on countless subsequent bands throughout the world — especially Sweden's Witchcraft. On their third release overall, 2007's The Alchemist, the quartet continues attempting to turn the clock back to 1975 — Magnus Pelander's vocal delivery is an awful lot like Pentagram's Bobby Liebling, while the music would provide a fine soundtrack to a high school stoner's basement party — when the folks were out of town, the bong smoke was thick, and the black light posters were proudly on display. However, as with most doom metallists, quite a few bits have a certain familiarity to them — case in point, \"If Crimson Was Your Colour,\" which contains a riff reminiscent of Megadeth's \"Symphony of Destruction,\" while \"Hey Doctor\" contains the same drum breakdown in the middle of Sabbath's Vol. 4 obscurity \"Under the Sun/Every Day Comes and Goes.\" But the group also shows they aren't afraid of laying down a Wolfmother-esque groove from time to time, as evidenced by the opening of \"Samaritan Burden.\" Doom metal", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}