{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"], ["Name", "What Goes Boom", "Greens and Blues", "Indie Cindy", "Bagboy", "Magdalena 318", "Silver Snail", "Blue Eyed Hexe", "Ring the Bell", "Another Toe in the Ocean", "Andro Queen", "Snakes", "Jaime Bravo"], ["Artist", "Pixies", "Pixies", "Pixies", "Pixies", "Pixies", "Pixies", "Pixies", "Pixies", "Pixies", "Pixies", "Pixies", "Pixies"], ["Time", "3:32", "3:46", "4:41", "4:52", "3:26", "3:29", "3:11", "3:34", "3:46", "3:23", "3:45", "4:24"], ["Price", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Indie Cindy by Pixies", "title": "", "url": "https://itunes.apple.com/us/album/indie-cindy/id835636083?app=itunes", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00056-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 863959003, "recordOffset": 863937389, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{85819=Copyright © 2014 Apple Inc. All rights reserved., 27269=Formed: 1986 in Boston, MA}", "lastModified": "Fri, 31 Jul 2015 07:19:48 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Pixies Indie Cindy iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Indie Cindy by Pixies, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "12 Songs Editors’ Notes The Pixies and their fans are best off pretending this isn’t a big comeback for one of the most influential alt-rock bands of the late '80s but rather an exciting new group fronted by former Pixie leader Frank Black. Original bassist Kim Deal dropped out of the running, with session bassist Ding now handling her duties. So this technically isn’t the classic Pixies. But as far as Frank Black albums go, this is a strong entry. These songs first appeared in a series of EPs, a gentle way of coaxing listeners back to the fold that also let the group make last-minute tinkerings to their work. The songs themselves feel much more accessible. Black appears to understand where their sound turned the commercial corner. He still snarls and screams with the best of them, and the guitars are turned mean and nasty by longtime Pixies producer Gil Norton. “What Goes Boom” is an immediate battle between Black and lead guitarist Joey Santiago. “Greens and Blues” is more accommodating. “Bagboy” nods toward The Fall, an alternative band even more influential than The Pixies who’ve been shuffling lineups—and confounding expectations—for decades. Customer Reviews Deal or no deal    ", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}