{"relation": [["SONG", "1", "2", "3", "4", "5"], ["TITLE Composer/Lyricist", "DON’T HOLD ON Patricia Roe", "THE MOVIE SONG Karl Broderick", "HEARTBEAT Hazel Kaneswaran, Jonas Gladnikoff, Rasmus Palmgren & Patrizia Helander", "BE MINE Cormac Battle", "YOU DON’T REMEMBER ME Don Mescall & Lucie Silvas"], ["PERFORMER(S)", "Patricia Roe mentor: Valerie Roe", "Eoghan Quigg mentor: Mark Murphy", "Can-Linn (feat. Kasey Smith) mentor: Hazel Kaneswaran", "Andrew Mann mentor: Cormac Battle", "Laura O’Neill mentor: Billy McGuinness"]], "pageTitle": "Mooney, Thursday February 27th 2014 - Mooney Goes Wild - RTÉ Radio 1", "title": "", "url": "http://www.rte.ie/radio1/mooney/programmes/2014/0227/506943-mooney-thursday-february-27th-2014/?clipid=1427580", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00086-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 670345479, "recordOffset": 670311436, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{36644=Two Eurovision Song Contest semi-finals will take place – on Tuesday May 6th, and Thursday May 8th.  There are already six direct finalists – the 'Big Five' countries: United Kingdom, Spain, France, Germany, Italy, plus last year's winners Denmark, will proceed directly to the Eurovision 2014 Final on Saturday, May 10th.  The contest will take place in Copenhagen, the Danish capital, where the Contest has been hosted twice before, in 1964 at the Tivoli Concert Hall (won by 16-year-old Gigliola Cinquetti for Italy), and in 2001 in Parken Stadium (won by Estonia’s Tanel Padar, Dave Benton & 2XL).  The remaining 31 countries will compete in one of the semi-finals in order to win a place in the aforementioned Final.  Ireland will compete in the second semi-final on Thursday, May 8th.  Live coverage will be on RTÉ Two for the semi-finals, and on RTÉ 1 for the Eurovision 2014 Final, with commentary provided – as ever – by Marty Whelan., 86007=© RTÉ 2015-RTÉ Commercial Enterprises Ltd, Registration No: 155076, Donnybrook, Dublin 4, Ireland., 40120=8th place: twice – 1988, 2011, 40170=9th place: twice – 1975, 1998, 40794=2001 saw our entry Without Your Love finished third last, and put Ireland out of the 2002 contest.  Ten years ago, the You’re A Star format of selecting a Eurovision entry for Ireland was introduced, and Mickey Harte gave us a credible eleventh (joint) position in Riga in 2003.  Chris Doran (2004) and Donna & Joe McCaul (2005) were less successful – the latter performers did not even qualify for the final.  Brian Kennedy temporarily restored fortunes in Athens, 2006, when his own composition finished tenth in the Final.  In 2007, the trad band Dervish, however, gave us our first bottom placing!  Dustin won the national heat in Limerick in 2008, and went to Belgrade hoping to make it eight victories – it was not to be, especially as he didn’t make it past the semi-final stage.  2009 saw the girl band Sinéad Mulvey & Black Daisy narrowly miss a place in the final in Moscow with Et Cetera., 39701=1st place: 7 times – 1970, 1980, 1987, 1992, 1993, 1994, 1996 , 39896=4th place: 3 times – 1966, 1968, 1986, 59300=Hedgerows: It is an offence to 'cut, grub, burn or otherwise destroy hedgerows on uncultivated land during the nesting season from 1 March to 31 August, subject to certain exceptions'. For more information, click here., 39954=5th place: 3 times – 1978, 1979, 1981, 39789=2nd place: 4 times – 1967, 1984, 1990, 1997, 55929=Join Mooney in our Eurovision Green Room at the Bord Gáis Energy Theatre on Saturday, May 10th 2014. The party takes place in the Circle Club., 33420=All this week we’ve been listening to the tunes which are competing to represent Ireland in Copenhagen in May. Today, it's time to hear song number four, Andrew Mann's Be Mine. This is not Andrew's first foray into Eurosong: he entered in 2012 with Here I Am. Andrew came second to Jedward, who went onto represent Ireland with Waterline in Baku., 39853=3rd place: once – 1977, 59684=To contact your local wildlife ranger, click here for contact details. To read the Wildlife (Amendment) Act 2000, click here., 39612=Since Ireland’s first participation in 1965, we have finished as follows:, 37816=Dubliner Andrew Mann immersed himself in his beloved music as an antidote to school, which he hated. He spent hours in his room teaching himself to play the guitar and by the age of 15, he was already writing his own songs. In 2007 a serious accident nearly cost him his life when he fell from a 3-storey building. His recovery involved a long stay in hospital and months more in a wheelchair, uncertain whether he would ever walk again. Despite this, Andrew looks back on this period as a gift: it imbued in him a renewed zest for life and following his complete recovery he took to gigging six-nights a week, all over Ireland, and in London's '100 Club' and 'Ronnie Scott's'.  In 2010, he wrote and recorded his first album, Hidden In Plain Sight, in 2010. He is currently recording his second album for release this summer.  Andrew is known to many people from his appearance on The Voice Of Ireland in 2013, when he got to the quarter-finals of the live shows. This is not Andrew's first foray into Eurosong: he entered in 2012 with the song Here I Am, and came a close second to Jedward's Waterline., 39540=IRELAND’S EUROVISION RECORD 1965 – 2013, 20319=From Sunday, July 26th, for five weeks, Mooney Goes Wild will be broadcast live between 10am and 11am. A new five-part series, Mooney Goes Wild - Habitats, will be broadcast on Sunday nights from 10pm-11pm., 40680=The best placing was at the start, in 2000, when Millennium Of Love, finished sixth., 41792=Now we’re in the 2010s, and former winner Niamh Kavanagh went to Oslo with a strong ballad, It’s For You, but finished way down the field.  Former The X Factor contestants from Lucan, John & Edward Grimes, aka Jedward, won the national selections in 2011 and 2012 – mainly due to the huge under-16 female vote.  The first of their entries, Lipstick, gave us a worthy eighth place in Düsseldorf two years ago.  And the following year in Baku, Azerbaijan, the twins fared even worse, when Waterline plunged to nineteenth place on the night.  As for 2013 in Malmö, Ryan Dolan plunged to last place in the Final with Only Love Survives., 40012=6th place: 3 times – 1965, 1985, 2000, 36366=The Late Late Show Eurosong Special will be broadcast on Friday, February 28th and hosted by Ryan Tubridy, with the winner being announced at the end of the show after the national televote results and the verdicts of the five regional juries., 40285=Note that all of Ireland’s Top Five placings occurred between 1966 and 1997., 40070=7th place: twice – 1969, 1974, 40220=10th place: 4 times – 1973, 1976, 1991, 2006, 60242=If you find an injured animal or bird, please contact the National Parks & Wildlife Service on 1890 20 20 21, or BirdWatch Ireland, on 01 281-9878, or visit www.irishwildlifematters.ie}", "lastModified": "Fri, 31 Jul 2015 07:26:00 GMT", "textBeforeTable": "--> Google RTE.ie Feedback Century Ireland RTÉ Archives TRTÉ RTÉjr Shop About Jobs Lotto Performing Groups RTÉ Mobile RTÉ Digital Blog Homes Travel Motors Food Fashion Weather RTÉ Apps RTÉ Aertel RTÉ Radio Player RTÉ News Now RTÉ Live More Orchestras Radio Television RTÉ Player Life & Style Business Entertainment Sport News RTÉ.ie", "textAfterTable": "RTÉ Radio One RTÉ 2fm RTÉ Lyric fm RTÉ RnaG RTÉ Pulse RTÉ 2XM RTÉ Rtejr RTÉ Gold RTÉ Extra RTÉ Radio 1 Home Find a Show Listen Live Schedules Podcasts Playlist Close [X]", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}