{"relation": [["", "226", "227", "228", "229", "230", "231", "232", "233", "234", "235", "236", "237", "238", "239", "240", "241", "242", "243", "244", "245", "246", "247", "248", "249", "250"], ["Name", "Lust auf Leben", "Wir haben noch lange nicht genug", "Fussije Mädche'", "Dat Spell", "Pros' Mädche'", "Demm Rievkoochebuudebesitzersingfrauihre-Blues", "Ich bin immer noch Jungfrau", "Alles dreht sich im Kreis", "Wer zoletz' laach...", "Solang' du deine Füsse...", "Die allerletzte Naach", "Marie - Marie", "Du", "Zwei Zimmer, Küche, Diele, Bad", "Hausgeburt", "Mona Lisa", "Leever en Mösch en dr Hand ...", "Komm bei mich Baby!", "Picco - Bello", "Ejal von wat wir pleite jehn!", "Hey Kölle du bes e Jeföhl", "Nemm mich su wie ich ben", "Animatör", "Hey Johannes", "Wenn der Herrjott ruft ..."], ["Album", "Made in Kölle", "6:0", "Made in Kölle", "6:0", "Made in Kölle", "6:0", "Made in Kölle", "6:0", "Made in Kölle", "Made in Kölle", "Made in Kölle", "Aktuell", "Aktuell", "Aktuell", "Aktuell", "Aktuell", "Aktuell", "Aktuell", "Aktuell", "Aktuell", "Aktuell", "Aktuell", "Aktuell", "Aktuell", "Aktuell"], ["Time", "3:32", "2:50", "3:39", "3:33", "3:34", "3:32", "4:27", "3:42", "2:47", "3:31", "3:19", "3:40", "3:59", "3:19", "3:19", "3:40", "3:44", "3:27", "3:25", "3:33", "4:14", "3:08", "3:11", "2:51", "2:58"], ["Price", "0,99 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Höhner", "title": "", "url": "https://itunes.apple.com/gr/artist/hohner/id15034302?trackPage=10", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00184-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 861446491, "recordOffset": 861425509, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{39857=Die Höhner championed the traditions of German folk and karnevalsmusik into the 21st century, even singing in the local dialect of their native Köln. Peter Werner, Walter Pelzer, Rolf Lessenich, and Janus Fröhlich founded the group — originally dubbed Höhnerhoff (i.e., \"Chickenyard\") — in 1972. Per their tongue-in-cheek moniker, the quartet played its earliest gigs in chicken costumes, decorating the stage like a barnyard and dumping feathers into the audience. With 1973's \"Höhnerhoff-Rock,\" the band scored its first hit, followed a year later by the beloved \"Scheiss Ejal, ob Do Hohn Bes Oder Hahn.\" In 1975 Höhnerhoff abbreviated its name to Die Höhner, that same year headlining the cast of the stage farce Drei Dag ahl Kölle. In 1976, the group mounted its first nationwide tour, playing to its biggest audience to date at the Lachende Münsterhalle. Despite their burgeoning success, Rolf Lessenich exited in 1977, and with new frontman Peter Horn, Die Höhner recorded \"Unsre Bock Ess Meister\" in tribute to football club 1. FC Köln. Team supporters embraced the song with such fervor that the band is now inseparable from the 1. FC Köln culture. Pelzer was the next to exit, and after adding Franz Martin Willizil, Die Höhner expanded to a five-piece with the 1979 introduction of Günter Steinig. After scoring a hit with 1980's \"Ich Ben Clown,\" inevitably accompanied by live performances in clown costumes, the group signed with major label EMI to release the album Ich Bin Ne Räuber, which ascended to number three on the German pop charts., 38148=Successive albums including Schlawiner and Op Jöck further bolstered Die Höhner's fan base, and the group racked up a progression of industry awards and honors, culminating in the 1985 Rote-Funken-Orden for \"Echte Fründe.\" After close to a decade of service, Horn resigned from the lineup in 1986, prompting the addition of new lead singer Henning Krautmacher. Both contributed vocals to 10 Jahre Stimmung Us Kölle. After permanently mothballing the clown costumes, the group also abbreviated its name yet again, this time to simply \"Höhner,\" with the 1987 release of Für Dich. Two years later they issued \"Nase Vorn,\" donating all revenues to UNICEF. Steinig was the next to turn in his resignation, with Hannes Schöner — who contributed backing vocals on the three previous Höhner albums — named as his replacement. In 1992 the band launched Zwei Zimmer, Küche, Diele, Bad, the first in a series of performance art productions they dubbed \"comcertos\" (i.e., half comedy, half concerto). Conversely, they also emphasized their serious side, teaming with the anti-racism initiative Arsch Huh AG. So great was Höhner's popularity that in 1993 an automobile, the Rosenmontagszug, was designed in their honor. That same year they introduced their second comcerto, Wartesaal der Träume. The group next contributed the theme music to the television series Die Weltings vom Bahnhof, additionally appearing in several episodes. In 1995, they debuted a third comcerto, Hanhnewaldklinik, and earned the esteemed Goldene Musikbox award for the LP Classic., 36478=After releasing its first Christmas album with 1996's Doheim un Üvverall, Höhner celebrated its silver anniversary with the concert series Zeitreise: 25 Jahre Höhner, additionally releasing the double album Fünfundzwanzig Jahre Kult. Health problems forced the exit of Franz Martin Willizil following the release of the chart smash \"Die Karawane Zieht Weiter.\" With new member Peter Bauchwitz, Höhner mounted a new comcerto, Club Sultano. With Köln's famed Circus Roncalli, the group next mounted 2000's Höhner Rockin' Roncalli Show, which generated both CD and DVD releases. Höhner celebrated its 30th anniversary with a gala concerto at the Köln Arena. After a relatively brief five-year tenure, Bauchwitz left the group in 2003, resulting in the addition of Jens Streifling. A pair of new Höhner Rockin' Roncalli Show productions followed in 2004. That same year, the group also returned to the German pop charts with the single \"Alles Was Ich Will.\" After receiving the 2006 Die Goldene Krone, awarded to the most popular carnival act, Höhner continued its commercial renaissance with the chart entries \"Ohne Dich Geht Es Nicht\" and \"Dä Kölsche Pass.\" A year later, their \"Wenn Nicht Jetzt, Wann Dann?\" was named the official theme of the Handball-Weltmeisterschaft 2007 event, and the resulting exposure was enough to earn Höhner its first-ever German number one hit.}", "TableContextTimeStampAfterTable": "{55539=1972 in Cologne, Germany, 58892=Copyright © 2014 Apple Inc. Με επιφύλαξη παντός δικαιώματος.}", "lastModified": "Fri, 31 Jul 2015 08:09:23 GMT", "textBeforeTable": "Top Songs 3 2 1 View In iTunes Viva Colonia (5 Jahre Jubiläums Edition) 20. View In iTunes Mir Kumme Mit Allemann Vorbei - EP 19. View In iTunes Nase vorn (Inkl. Karaoke) 18.", "textAfterTable": "Previous 5 6 7 8 9 10 11 12 13 14 Next Top Music Videos 1. Schade Schokolade (Video) View In iTunes Born: 1972 in Cologne, Germany Genre German Pop Years Active: '70s, '80s, '90s, '00s, '10s Contemporaries Rabaue Bernd Stelter Brings Bläck Fööss Die Kolibris Oliver Pocher Color Wolfgang Petry Peter Maffay Marianne Rosenberg Αρχική σελίδα iTunes iTunes Κατέβασε το iTunes Λειτουργίες Κορυφαία του iTunes Περισσότερα για το iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}