{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13"], ["Name", "Real Fine Place to Start", "Everyday Angel", "Again", "Sure Feels Right", "Disappointing You", "I Got What You Need", "Tired of Pretending", "What It Is That You Do", "Scary Old World", "Love Had Something to Say About It", "What Are We Doing Here Tonight", "Just Sit Still", "Another Way to Go"], ["Artist", "Radney Foster", "Radney Foster", "Radney Foster", "Radney Foster", "Radney Foster", "Radney Foster", "Radney Foster", "Radney Foster", "Radney Foster & Chely Wright", "Radney Foster", "Radney Foster", "Radney Foster", "Radney Foster"], ["Time", "3:45", "4:29", "3:28", "3:42", "4:20", "4:09", "4:01", "3:14", "3:59", "3:46", "3:36", "4:18", "4:17"], ["Price", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Another Way to Go by Radney Foster", "title": "", "url": "https://itunes.apple.com/lt/album/tired-of-pretending/id3915606?i=3915588", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00051-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 874420391, "recordOffset": 874392751, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{123284=© „Apple Inc.“, 2014. Visos teisės saugomos., 26902=Born: 20 July 1959 in Del Rio, TX, 25085=Backed by a band of Nashville stalwarts, Foster ends a four-year studio layoff with this set. There's nearly as much R&B as country here, with echoes of Van Morrison in the full organ chords, soulful guitar licks, and idiomatic chord progressions; all this, along with certain aspects of Foster's timbre, nods toward Moondance on \"Again\" and \"Sure Feels Right,\" and especially in the sax harmonies of \"What It Is That You Do.\" References to the Twin Towers disaster were practically mandatory in 2002, and Foster delivers his on \"Everyday Angel,\" though by restricting it to the last verse he emphasizes that goodness needn't wait for tragedy to come knocking. Less-specific references to timely terrors crop up in \"Scary Old World,\" whose rugged eloquence betrays the influence of co-writer Harlan Howard. The rest of the album generally shuffles through the heartbreak deck and comes up with a good but less-than-unbeatable hand. (\"If love is what you want, I got what you need,\" Foster declaims on \"I Got What You Need,\" as if this line could actually get results.) Three tracks do break from the norm: \"Tired of Pretending,\" which argues that pretense is bad; \"What Are We Doing Here Tonight,\" whose rhetorical structure follows a similar theme in a more thoughtful way (at least until the anticlimactic admission, \"I guess what I'm saying is, I really like your style\"); and \"Just Sit Still,\" a rumination on the virtues of slowing down, taking a deep breath, and not getting upset over money, traffic jams, pop album reviews, and other nitpickeries. ~ Robert L. Doerschuk, Rovi}", "lastModified": "Fri, 31 Jul 2015 07:29:56 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Radney Foster Another Way to Go iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Another Way to Go by Radney Foster, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes", "textAfterTable": "13 Songs Album Review Backed by a band of Nashville stalwarts, Foster ends a four-year studio layoff with this set. There's nearly as much R&B as country here, with echoes of Van Morrison in the full organ chords, soulful guitar licks, and idiomatic chord progressions; all this, along with certain aspects of Foster's timbre, nods toward Moondance on \"Again\" and \"Sure Feels Right,\" and especially in the sax harmonies of \"What It Is That You Do.\" References to the Twin Towers disaster were practically mandatory in 2002, and Foster delivers his on \"Everyday Angel,\" though by restricting it to the last verse he emphasizes that goodness needn't wait for tragedy to come knocking. Less-specific references to timely terrors crop up in \"Scary Old World,\" whose rugged eloquence betrays the influence of co-writer Harlan Howard. The rest of the album generally shuffles through the heartbreak deck and comes up with a good but less-than-unbeatable hand. (\"If love is what you want, I got what you need,\" Foster declaims on \"I Got What You Need,\" as if this line could actually get results.) Three tracks do break from the norm: \"Tired of Pretending,\" which argues that pretense is bad; \"What Are We Doing Here Tonight,\" whose rhetorical structure follows a similar theme in a more thoughtful way (at least until the anticlimactic", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}