{"relation": [["File Name", "Dbm Settings", "Arp UI WTF"], ["Version", "1.1", "1.0"], ["Size", "2kB", "64kB"], ["Author", "Tobbe8716", "Tobbe8716"], ["Date", "07-09-11 09:21 AM", "05-06-11 12:46 PM"], ["Type", "Patch", "Patch"]], "pageTitle": "Arp UI : Generic Compilations : World of Warcraft AddOns", "title": "", "url": "http://www.wowinterface.com/downloads/info15593-ArpUI.html/report.php?action=reportcmnt&commentid=367218", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00317-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 838306983, "recordOffset": 838275087, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{15308=Arp UI THERE WILL BE NO MORE UPDATES BECOUSE I HAVE QUIT THE GAME But this will probably work for this expansion and maybe the next to. If someone is interested in continuing the work PM. DONT UPDATE BUTTONFACE, SCREWS UP SBF(BUFF FRAMES) ATM. Preview (Youtube) Small walkthrough of the UI Supports * 1920x1080 (Main), 1600x900, 1360x768, 1280x768 and 1280x720 * 1680x1050, 1440x900 and 1280x800 * This will work with the resolution above and probly some more but small resolutions my cause the UI to become to small. Notes * Tracking and Calendar While hovering the minimap * Left Click: Ping * Right Click: Calendar * Middle Mouse Click: Tracking * Settings Graphics and Sound setting are set to standard values. You might want to increase them. * Extra Bars There is 2 extra bars in bartender (/bar). If you need more bars enable bar 3 and/or bar 5. * Config Alot of options in oUF_Arp like castbars all UFs and some more, open Arp_config.lua. You can edit and save your changes via Wordpad, Notepad or something similar. More info oUF Arp * SBF I've configured 2 bars that works like classtimer. I have added some of my own. You can choose one of my profile by /sbf options and clicking on the tab \"Profiles\" or if your playing a class/specc I dont have you can make you own. /SBF and make a new profile. Copy from \"Arp\". Go to the \"Spells\" tab. Choose \"Player Buffs\" for tracking buffs/procc, just check the spells you want to track from the list (you need to have use the spell once before it appears in the tab). Choose \"Target\" for tracking debuffs on target, check \"List debuffs\" for debuffs to appear in the list.}", "textBeforeTable": "Optional Files (2) Added Affliction Warlock profile to SBF Added Perror As i thought i missed to config some stuff so i did that now 0.91 Removed Suf. Added Ouf viv. Additional Configs. Update 1.0 Added Recount. Moved Minimap, Omen and DXE. Built frames for Omen and Recount. Changed font for oUF_viv 1.1 Finishing touches on kgpanels. Changed the bars on omen. Added 14 buffslots on the target frame. Shrunk debuffs on target frame to 7 / row total 21. 1.11 Added support for 1680 x 1050 1.12 Forgot to rewrite title and added pet frames for party aswell 1.13 Removed ecb. Added Castbars. Small adjustments to dxe and some other stuff. Target buff max 7 changed spacing, Target debuffs max 15 5/row changed spacing. Update prat and dxe 1.14 Removed Castbars. Added Ecb again due to castbars bugged on boss casts. 1.15 Removed Sstat, added stText. Update 1.16 WTF folder was mixed up with the names. 1.17 Moved TotemBar. 1.18", "textAfterTable": "Comment Options Page 1 of 29 1 2 3 11 > Last » 02-15-12, 02:56 PM   Eyatrian A Kobold Labourer Forum posts: 0 File comments: 8 Uploads: 0", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}