{"relation": [["Position", "9", "12", "13", "23", "25", "31", "34", "36", "42", "47"], ["Title", "Mushiking: Battle of the Beetles", "Super Robot Wars J", "Rhapsodia", "Kingdom Hearts Final Mix (Ultimate Hits)", "Final Fantasy X (Ultimate Hits)", "Pokémon Emerald", "Tales of Legendia", "Pokémon XD: Gale of Darkness", "Naruto RPG 2", "Princess Crown"], ["Publisher", "Sega", "Banpresto", "Konami", "Square Enix", "Square Enix", "Nintendo", "Namco", "Nintendo", "Tomy", "Atlus"], ["Platform", "", "", "", "", "", "", "", "", "", ""]], "pageTitle": "RPGamer > Japandemonium > October 18, 2005", "title": "", "url": "http://rpgamer.com/news/japan/jj101805.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 11, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00001-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 203593356, "recordOffset": 203577391, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{41700=The game went live on October 13 along with mobile version of the classic platformer Megaman II for a one-shot download fee of 210 yen each., 16026=But enough of that. Continuing that train of thought tends to make me sad, something I don't like to be. To counter that, I will now mention the OTHER thing I thought about while looking at the calendar; I have been working for RPGamer for over one year now. According to my bio, I was hired on October 16, 2004. My first year working for this site has been a highly enjoyable one. I've written a fair number of columns, a few news stories, and I've made a lot of friends. I find the fact that I was hired to do a news column to be a little strange. I was hired somewhat sight unseen because I didn't have to send any sample stories in my application. In fact, I didn't even apply for Japandemonium; I was aiming for our lovely in-house translator Adrienne Beck's job. Had I been given that job, I would have surely been fired. I'm far too slow at translating, and Adrienne's knowledge of kanji far surpasses mine. But I found a home here at RPGamer nonetheless, and I have no intentions on leaving it any time soon.}", "textBeforeTable": "The chart is almost a rehash and reshuffle of last week's chart. Only three new titles to make the top 50, and one of them is Dragon Ball Z: Sparking, a game that dethroned Mario Bros. 20th Anniversary Edition from its unusual stranglehold of the top of the chart. I'm still surprised that it is selling well enough to best newer games. I'm all for nostalgia, but give me Super Mario All Stars any day. It has made me curious how long it will hang around the chart. One also has to wonder how much money it has made Nintendo. The cost to port it was probably almost none, so it's nothing but pure profit, even if it is only 15 to 20 bucks a pop. Not bad for a game that's almost as old as I am. In RPG news, the trend towards smaller numbers continues this week. No new games hit the chart, and one fell off with two more looking unstable. Only time will tell, but for now, let's see those numbers!  Dengeki Rankings", "textAfterTable": "Source: Dengeki Online  Special Report: Niihama's Autumn Festival It has been a while since my last special report, but I've not been able to go out and take any interesting pictures recently. Right now is the Niihama Taikodai Festival, one of the regional autumn festivals that involves carrying wooden structures that weigh between 3000 and 5000 pounds. As for a taikodai, it is essentially a wooden frame surrounding a large taiko drum that is supported by four long wooden poles. There are some really beautiful embellishments on the side, and there is a colored canopy on top to match the hapi (festival outfits) of those carrying it. It's one of the most exciting times of the year, and I really enjoy it, but it does come with its downside. I", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}