{"relation": [["Author", "Moira", "YasminM", "Kemayo", "YasminM", "Kemayo", "spiralred", "Kemayo", "JesusKetchum31", "TamerTerra", "SunTyger"], ["Message", "About multi-posting again...hello all. i'm, er, one of those people supremely guilty of multi-posting (here and ff.net and mediaminer--sorry!), but i got hooked onto ficwad because most--practically all, in fact--of the stories i read here are really, really good, plot-wise, character-wise, grammar- and spelling-wise, and samwise. (HAH! STUPID JOKE!) ahem. anyway, the first fanfic site i've encountered is actually ff.net, and i thought it was okay. it served its purpose, at least. i'm a bit dense; i was just wondering what was wrong with it, or shall we say, what were those flaws that ff.net that ficwad has overcome? ^_^ (anyway, i'm bailing out of mediaminer.org. sorry, but i like that site much less than ff.net.) Posted at 2005-08-07 22:59", "Disclaimer: I generally don't read original fiction online, so everything I say in this post is based on my experience in fandom and fanfic. I don't like FF.Net because of its content restrictions, mostly. I'd been archiving my fics there since before they removed NC-17 stories (hell, even before they moved original fiction to another archive) -- while I understand the reasons behind the policy change, it does nothing to move fanfic out of a legal grey area or make it more \"respectable\". I also dislike the management of FF.net, at how accounts and stories can be deleted without prior warning, the seemingly arbitrary way complaints and rules violations are handled. Someone I know had her story removed because it was allegedly a list, but... it wasn't. (If you'd like to see it, the story is lazulisong's Wake, in the Tsubasa/xxxHolic category.) On a more technical level, I found the upload interface at FF.Net to be clunky and confusing. Quite honestly, I don't need many of the features they offer, and I did not appreciate having slashes and various characters disappear into thin air. It's as if the entire thing was designed without any acknowledgement of fandom conventions, such as the use of the forward slash to denote a romantic or sexual pairing. I personally don't see any problem with people multi-posting to various archives -- FicWad has its weaknesses too, the main one being its relatively small size. I like the rating system at FicWad and the way it encourages constructive feedback, but I know that some people complain that they might miss out on stories that have been rated -1. However, all registered users get 5 rating points per week to begin with, and they can rate any story as they see fit. The meta-rating feature is a double-edged sword, I think. On one hand, users who leave fair ratings generally also receive fair meta-ratings. On the other, there is a possibility that groupies of less-than-well-written fanfic will use it as a way to \"punish\" users who rate that story negatively. That said, I view it as an encouragement to rate a wide variety of fanfic from various fandoms. I don't mind losing a rating point by rating fairly when I can get two points to make up for it elsewhere, and in any case turning the rating system into a political game is just silly. Posted at 2005-08-08 15:22", "\"I did not appreciate having slashes and various characters disappear into thin air\" We do that as well, to a small extent. If you're using some of the fancy quotes and dashes that MS Word auto-inserts, we swap them out for the plainer equivalent. Mainly because if you're using the wrong character encoding, they get really messed up. (We do try not to lose the sense of it, though. If there was a dash there before, there'll be a dash there afterwards.) \"On the other, there is a possibility that groupies of less-than-well-written fanfic will use it as a way to 'punish' users who rate that story negatively.\" Our theory here is that it should take a fair amount of metarating to really impact your karma, and each person can only metarate each rating once. As you said, people who rate fairly should be getting enough positive metarating that any cliques can't game the system. (Note to self: Forum needs a quoting system.) Posted at 2005-08-09 8:21", "At least you didn't take away the forward slash. Which genius though THAT up? XD (It never occurred to me that people would still be copying and pasting straight from MS Word without converting it into plain text, or at least turning off smart quotes from the get-go. Though I write my fics on NoteTab Light, where I can add HTML tags as I write and not have to bother with MS Word's auto-inserts.) Posted at 2005-08-09 10:37", "Yeah, it's something of a foreign concept to us as well. We likeses our text editors. But many people do it. So far as we can tell, more people upload by copy-paste from Word than by save-as-HTML. I assume that they're removing the forward-slash for database safety reasons... although I don't recall that slash having any special meanings in SQL. Still, it's the only thing that makes any sense at all. (We escape \\, which does have special meaning. The escaping takes the form of putting another \\ in front of any \\ in text you submit that goes into the database, which turns it from a special character into a regular old backslash.) Posted at 2005-08-09 12:44", "With the automatic breaks in your upload sytem, I find it easier to cut and paste. My Appleworks program converts the html without preserving the returns so it's a hassle to go in and add all the spacing in the text-editor after uploading. It is nice to be able to type a / ,_ .- , or a * without having them dissapear though. Also ff.net must be recieving a lot of complaints about their restrictions. When C2s were first introduced they only went to the PG13 rating, but recently they've dropped the restriction to recieve 'K-M' ratings. Fanfiction is an independent thing, there was not reason for them to sensor it and now new sites with continue to arise and draw away whatever talented writers continue to post there. Posted at 2005-08-10 22:21", "If you forward a copy of the html Appleworks generates to admin@ficwad.com we can try to improve how our HTML parser handles it. (I added some tweaks to the parser last night, which might already have helped.) FF.Net has certainly acquired a reputation. Which has helped us at FicWad; we launched, quite unknowingly, right at the start of the FF.Net song lyrics purge, which stimulated lots of discussion about alternate archives. Posted at 2005-08-11 8:40", "Heh!The song lyrics purge is precisely the reason I moved main operations to Ficwad! Virtually all of my fanfics involve music in some way, either through quotes, titles, or flat out songfic. And with Sonic the Hedgehog, my current primary fandom, music is so strongly tied into the series that NOT using music would be a shame and a dishonor. Hence so many of my fanfics having titles and chapter titles taken from Sonic songs. That said, if a story did well here and I wanted it to get more attention, I might put it on FFNet... but so far, I've gotten more notice here than I have at FFNet. I mean, yeah, my Pokemon fanfics get more attention at FFNet, but comapred to the other pokemon fics they get virtually none. At least here I know the reviews matter. I'd be tempted to put my Sonic fanfics up there, but the music thing about kills that notion. And as the others have said, pasting is just easier. Once I tried to submit an HTML fic and it gave me a blank document. As I was not comfortable enough with the site to try to develop a relationship with tech support at that point, I just began pasting from word. I don't even remember what fic it was, to be honest. Plus, I save all my fics as .doc or .rtf, and I wasn't sure if they were supported. I might try out direct uploads iwth my next fic, though, now that I feel at home here ^^* Sorry. Posted at 2005-08-11 13:50", "(It never occurred to me that people would still be copying and pasting straight from MS Word without converting it into plain text, or at least turning off smart quotes from the get-go. Though I write my fics on NoteTab Light, where I can add HTML tags as I write and not have to bother with MS Word's auto-inserts.) Heh, I just typed mine in Livejournal's HTML editor, posted, and copyed and pasted to both here and a Word document. ^_^ Posted at 2005-08-13 7:19", "Probably my biggest problem with ff.net is the lack of communication: their tendency to make huge sweeping changes to their policies, deleting stories and accounts without telling anyone why. Also, I'm not just a fanficcer--I wanted to have one archive that could house all my stories, which ff.net just doesn't offer. And basically, I agree with everything Yasmin said. :-P Posted at 2005-08-14 1:30"]], "pageTitle": "FicWad: fresh-picked original and fan fiction", "title": "", "url": "http://ficwad.com/forum/topic/125", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00052-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 92982691, "recordOffset": 92974489, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{11368=Site design Copyright 2005, K&D Lynch. All stories contained in this archive are the property of their respective authors, and the owners of this site claim no responsibility for their contents.}", "textBeforeTable": "» 2 1 « Home > The Melting Pot > About multi-posting again... Lost password Register Log in Remember me Log in ▼ Sign up to adjust the filter You won't see stories with a lower score when you browse or search. Filter Filter: 0 Help Forum Search Browse FicWad", "textAfterTable": "« 1 2 » Site design Copyright 2005, K&D Lynch. All stories contained in this archive are the property of their respective authors, and the owners of this site claim no responsibility for their contents. Page created in 0.0291 seconds", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}