{"relation": [["Song", "This Is Christmas", "To Know That You're Alive", "Run", "Even If", "Heart of the Innocent", "Mary Did You Know", "The Feeling", "Everything I Need", "Down", "Redeemer", "Saved", "Strong Tower", "You", "God Of Wonders", "Hungry", "All ALone", "It Is Well", "I Do Not Belong", "Loud", "What Faith Can Do", "Better For You", "All Of The Words", "Dying To Become", "Complete (Radio Version)", "Grace And Love", "In Me", "Ready For You", "Arms Of Love", "Troubled Heart", "Word Of God Speak", "It's Like Me", "Jesus Lord Of Heaven", "Kutless - Vow", "Take Me In", "Let You In", "Passion", "The Rescue", "Not What You See", "Need", "All Who Are Thirsty", "The Disease & The Cure", "Vow", "Tonight", "Promise You", "We Fall Down", "Remember Me", "Your Touch", "Sea Of Faces", "All The Words", "Guiding Me Home"], ["Album", "O Come All Ye Faithful", "To Know That You're Alive", "Kutless", "Believer", "Livr From Portland", "X Christmas", "To Know That You're Alive", "It Is Well", "Kutless", "It Is Well", "Kutless", "Strong Tower", "To Know That You're Alive", "It Is Well", "It Is Well", "Sea Of Faces", "It Is Well", "To Know That You're Alive", "To Know That You're Alive", "What Faith Can Do (Single)", "Sea Of Faces", "Strong Tower", "To Know That You're Alive", "Complete (Radio Version) (Single)", "Kutless", "Kutless", "Strong Tower", "Strong Tower", "Sea Of Faces", "Strong Tower", "Sea Of Faces", "Strong Tower", "Kutless", "Strong Tower", "Sea Of Faces", "Sea Of Faces", "To Know That You're Alive", "Sea Of Faces", "Believer", "Strong Tower", "To Know That You're Alive", "Kutless", "Kutless", "To Know That You're Alive", "Strong Tower", "It Is Well", "Kutless", "Sea Of Faces", "Sea Of Faces", "To Know That You're Alive"], ["Released", "2010", "2008", "2002", "2012", "", "2008", "2008", "2009", "2002", "2009", "2002", "2005", "2008", "2009", "2009", "2004", "2009", "2008", "2008", "2009", "2004", "2005", "2008", "2008", "2002", "2002", "2005", "2005", "2004", "2005", "2004", "2005", "", "2005", "2004", "2004", "2008", "2004", "2012", "2005", "2008", "2002", "2002", "2008", "2005", "2009", "2002", "2004", "2004", "2008"], ["Listen", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]], "pageTitle": "Download Kutless Music for FREE!", "title": "", "url": "http://www.imesh.com/artistdir/artists/Kutless", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00103-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 508459129, "recordOffset": 508450927, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{18572=The band takes its name from a Bible reference. In Romans 6:23 says \"For the wages of sin is death, but the free gift of God is eternal life in Christ Jesus our Lord”. The band says that Jesus took the our cuts for us and therefore leaving us “Kutless” The band started with resounding success, their fist single “You’re Touch” has created a history on the R&R charts by the being the longest charting single history., 19832=The band went into an intense recording phase for their follow-up album. The album “Hearts of the Innocent” was released in March 2006. The album received great response and was critically hailed as their best work till date. Melodic hard rock with deep rooted songwriting that conjured up raw emotions towards religious beliefs, Kutless had grown leaps and bounds. The fist thumping evangelistic view point was subtle and the bands guitar power chords were well directed., 22104=In 2004, the band were scheduled to play at the Summer Olympics in Greece but did not make it due to the flights being cancelled, 21195=In 2009 they released their fourth album “It is Well” which was again a worship album. The album again got fabulous reviews from critics and the new direction towards modern rock fitted well within the bands trademark sound. The band is currently on own a headlining tour across North America. They have also been roped in to make a headlining appearance at the “Ultimate Event” Christian concert at the Alton Towers theme park in England, 18007=The roots of the band can be traced to group called Call Box in the year 2000. The band have gone through several line-up changes, following are current band members Jon Micah Sumrall, James Mead, Jeffrey Gilbert, Dave Luetkenhoelter, 19051=The band released their second album in 2004 titled “Sea of Faces” to glorious reviews. The song “Treason” appeared at No.1 on the ChristianRock.net Online Radio. They toured all across America after the release of the album. The band chose to deeper into the path of righting more Christian songs and therefore released their first ever worship album titled “Strong Tower”. The album marked a distinctive change in their approach to music and songwriting. They were focusing on classic hymns, spiritual music praise with guitar drivel rockers. The music is deeply moving and passionately personal. The band went on a Strong Tower which was well received, 20692=In 2007, long time guitarist Ryan Shrout decided to leave the band to focus on family like. His new born daughter had an eye problem which prompted Shrout to stay home with the family. The band decided to continue recording and added Nick De Partee as a replacement for the departed Shrout. Partee had been involved with the band as their guitar tech and everyone felt comfortable in him joining the band}", "textBeforeTable": "Kutless Songs List: Read more... Kutless from Portland, are one of the finest Christian rock bands in the last decade. The band has toured all over the US and Europe. Their music is more direct and they do not hide about the message they want to spread in the world. This is about putting God into everything you do. Genres: Alternative/Indie,Seasonal,Christian/Gospel,Rock Kutless All Artists > Home >", "textAfterTable": "Next > Kutless – Oregon Rockers For Christianity The Rock Crusaders Kutless from Portland, are one of the finest Christian rock bands in the last decade. The band has toured all over the US and Europe. Their music is more direct and they do not hide about the message they want to spread in the world. This is about putting God into everything you do. The band plays its music with a lot of passion and sense of purpose when it comes to their live shows. The band has released 4 full length albums which have sold 1.2 million copies in the US. The Name and the Formation The roots of the band can be traced to group called Call Box in the year 2000. The band have gone through several line-up changes, following are current band members Jon Micah Sumrall, James Mead, Jeffrey Gilbert, Dave Luetkenhoelter and Nick De Partee. After touring and jamming for a few years they released their first three EPs with the Christina rock record label BEC Records. Prior to the release of the EPs the band decided to change their name, also prompted by the record label. The band takes its name from a Bible reference. In Romans 6:23 says \"For the wages of sin", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}