{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9"], ["Name", "Strollin'", "You Took Advantage of Me", "Yesterdays", "Shaw'nuff", "You've Changed", "Scrapple from the Apple", "A Sleepin' Bee", "Intro - Smoke Gets In Your Eyes", "Stella By Starlight"], ["Artist", "Keith Jarrett, Gary Peacock & Jack Dejohnette", "Keith Jarrett, Gary Peacock & Jack Dejohnette", "Keith Jarrett, Gary Peacock & Jack Dejohnette", "Keith Jarrett, Gary Peacock & Jack Dejohnette", "Keith Jarrett, Gary Peacock & Jack Dejohnette", "Keith Jarrett, Gary Peacock & Jack Dejohnette", "Keith Jarrett, Gary Peacock & Jack Dejohnette", "Keith Jarrett, Gary Peacock & Jack Dejohnette", "Keith Jarrett, Gary Peacock & Jack Dejohnette"], ["Time", "8:12", "10:12", "8:55", "6:10", "7:55", "9:01", "8:17", "8:47", "8:04"], ["Price", "9,00 kr", "Album Only", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr", "9,00 kr"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Yesterdays by Keith Jarrett, Gary Peacock & Jack DeJohnette", "title": "", "url": "https://itunes.apple.com/no/album/yesterdays/id303752166?i=303752169", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00330-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 867862431, "recordOffset": 867835805, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{18361=Yesterdays is the third title ECM has released by Keith Jarrett, Gary Peacock, and Jack DeJohnette (dubbed \"the standards trio\"). The first two — The Out-of-Towners released in 2004 and My Foolish Heart issued in 2007 — were actually recorded later than this live date recorded in Tokyo in April of 2001. This also marks a first in the pianist's career: the George Gershwin tune \"You Took Advantage of Me\" appeared on My Foolish Heart in a very different arrangement, making this the first time Jarrett has ever employed a single track on two consecutive albums. On My Foolish Heart Jarrett used a full-on ragtime intro to the tune. Here, he employs a denser harmonic construction based on its changes and melodic frame. When the band enters, the pop and swing in the tune become pronounced, standing in the same universe as ragtime (which is more than likely the reason Jarrett employed it before) but also much more sophisticated and harmonically complex. Other standouts on this fine set include the bop burners \"Scrapple from the Apple\" and \"Shaw'nuff,\" the glorious ballads \"Smoke Gets in Your Eyes\" and \"You've Changed,\" and a deeply moving rendition of \"Stella by Starlight.\" What is most remarkable about this band is its sense of balance between eloquence, interplay, improvisational communication, and swing. This group is not only a solid link to the tradition Jarrett, Peacock, and DeJohnette all came up with, but it is a solid teaching pointer as to how to employ standards for the music in the future., 20068=Born: 08 May 1945 in Allentown, PA, 122698=Copyright © 2014 Apple Inc. Alle rettigheter forbeholdes.}", "lastModified": "Sat, 01 Aug 2015 04:41:36 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Keith Jarrett, Gary Peacock & Jack DeJohnette Yesterdays iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Yesterdays by Keith Jarrett, Gary Peacock & Jack DeJohnette, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on", "textAfterTable": "9 Songs Album Review Yesterdays is the third title ECM has released by Keith Jarrett, Gary Peacock, and Jack DeJohnette (dubbed \"the standards trio\"). The first two — The Out-of-Towners released in 2004 and My Foolish Heart issued in 2007 — were actually recorded later than this live date recorded in Tokyo in April of 2001. This also marks a first in the pianist's career: the George Gershwin tune \"You Took Advantage of Me\" appeared on My Foolish Heart in a very different arrangement, making this the first time Jarrett has ever employed a single track on two consecutive albums. On My Foolish Heart Jarrett used a full-on ragtime intro to the tune. Here, he employs a denser harmonic construction based on its changes and melodic frame. When the band enters, the pop and swing in the tune become pronounced, standing in the same universe as ragtime (which is more than likely the reason Jarrett employed it before) but also much more sophisticated and harmonically complex. Other standouts on this fine set include the bop burners \"Scrapple from the Apple\" and \"Shaw'nuff,\" the glorious ballads \"Smoke Gets in Your Eyes\" and \"You've Changed,\" and a deeply moving rendition of \"Stella by Starlight.\" What is most remarkable about this band is its sense of balance between eloquence, interplay, improvisational communication, and", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}