{"relation": [["Data", "2030 needs", "Needs update (2035)", "Long-range planning", "Estimated Construction and Maintenance Needs map", "Revenue projections", "Texas Population Growth chart, 1970-2030"], ["Author", "2030 Committee", "2030 Committee", "TxDOT Transportation Planning and Programming Division", "TxDOT Transportation Planning and Programming Division", "Association of Texas Metropolitan Planning Organizations", "Center for Demographic and Socioeconomic Research and Education"], ["Source", "Texas Transportation Needs Report, February 2009", "Texas Transportation Needs Report, \"It’s About Time: Investing in Transportation to Keep Texas Economically Competitive,\" March 2011", "Statewide Long-Range Transportation Plan, 2010 Report", "Referenced in the Texas Statewide Long-Range Transportation Plan 2035 - Executive Summary, November 2010", "Presentation to the Texas Transportation Commission, May 28, 2009", "The Texas Challenge in the Twenty-First Century: Implications of Population Change for the Future of Texas, December 2002"]], "pageTitle": "Funding Needs and Potential Sources", "title": "", "url": "http://MediaRelations@txdot.gov/inside-txdot/division/finance/funding-sources.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00195-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 1657167, "recordOffset": 1632728, "tableOrientation": "HORIZONTAL", "lastModified": "Sat, 01 Aug 2015 01:39:21 GMT", "textBeforeTable": "Transportation Needs and Costs TxDOT has developed a Statewide Funding Brochure that outlines the needs of highway and road funding in the state in order to kick-start the discussion. The tables below list the source material for data found in the brochure.  A healthy and reliable transportation system is critical for Texas, now and in the future. However, solving the state's current funding problems will require a multi-level approach, with all Texans involved in the planning process. The Texas transportation system faces challenges like never before. Demand on the system is outpacing available revenue, and factors like inflation, a growing population, an aging infrastructure and more fuel-efficient vehicles are pushing current funding sources to their limits. Finance Divisions > Inside TxDOT > Home > Funding Needs and Potential Sources -->", "textAfterTable": "The Challenges Data Author Source Fuel efficiency The White House The White House, Office of the Press Secretary, July 29, 2011 Inflation TxDOT Finance Division TxDOT 2014-2015 Legislative Appropriations Request, Aug. 30, 2012 Federal funding issues Congressional Budget Office CBO Report, \"The Budget and Economic Outlook: Fiscal Years 2012 to 2022,\" July 2013 Purchasing power of state fuel tax (chart) State Legislative Affairs State Fuel Tax Deposits to the State Highway Fund, Fiscal Years 1993-2012 The Discussion Data Author Source Vehicle registration fees Texas Department of Motor Vehicles Information provided by the Texas Dept. of Motor Vehicles to the Texas House Appropriations Subcommittee on Articles VI, VII and VIII and the Subcommittee on Funding, July 9, 2012 Funding options TxDOT Testimony to the Select Committee on Transportation Funding Legislator Requests", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}