{"relation": [["Author", "ozwalled", "ozwalled", "ozwalled", "ozwalled", "ozwalled"], ["Title", "Spiteful Crow", "Mr. Squeak", "Cool dress!", "Maxwell and Tony", "Lucas vs. Hade Hebi"], ["Description", "I bring you cookies!", "I decided to make him a little less suave and Elvis and more sleazy and greaseball-looking.", "I don't know either.", "I drew Maxwell, here, everything else (in other words, Tony and the Autumn background) was by someone that goes by \"TokyoMewMew-Girl\"... I'm not sure if she has a starmen account. I was trying (but not succeeding very well) in imitating her style to go along with what she was already drawing.", "I forget the entire story behind this, but basically it's based on ideas and small tidbits of information gleaned from old Mother 3 (Nintendo 64 version) teaser images and articles. There's some image that's forest or jungle-like that showed a snake-like thing, and there was text somewhere I read about some snake boss creature called Hade Hebi, so that's where that part of things comes from. As for Lucas's gaudy outfit, that's something I sort of made based on one of the old screenshots as well. SOURCES: http://starmen.net/eb64/images/scans/npscan2.png (contains \"Lucas\" in that outfit as well as what I figured may be Hade Hebi. http://starmen.net/eb64/images/characters/lucas.jpg (The Lucas Outfit)"], ["Date", "5/14/05", "6/6/07", "6/6/07", "6/10/10", "4/12/09"], ["Rank", "0.00", "9.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=15502&stuff=DescASC&stuffFirstLetter=I", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00114-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 220014907, "recordOffset": 220006705, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> Z Y W U T S R P O N M L K J I H G F E D C B A 8 7 < Other Submissions by ozwalled It ain't easy bein' green. This image has been resized for your convenience. Click on it to view the full size version. Tenda Tenda - by ozwalled  Mother2 Go Back!", "textAfterTable": "1 2 3 4 5 6 7 8 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day. Activities:", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}