{"relation": [["Subject", "[gentoo-doc] Re: Handbook restructuring proposal", "Re: [gentoo-doc] Handbook restructuring proposal"], ["Author", "Duncan <1i5t5.duncan@×××.net>", "Sven Vermeulen"]], "pageTitle": "[gentoo-doc] Handbook restructuring proposal - gentoo-doc - Gentoo Mailing List Archives", "title": "", "url": "https://archives.gentoo.org/gentoo-doc/message/386ee8ad1a79c056aa8ce118989d097a", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00164-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 846714265, "recordOffset": 846706063, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Replies application/pgp-signature signature.asc MIME type File name Attachments Thoughts? :) etc. handbook/2009.0-nonet/ handbook/2009.0-net/ handbook/2008.1-nonet/ handbook/2008.1-net/ To sum up: same dir. Again, this will help when it comes time to archive them. need different includes, so it makes sense to keep them all in their Plus, it's conceivable that the networked or networkless handbooks might handbook/included.xml, this could be bad. handbooks need static content; if we were to keep them pointing to $RELEASE-net/ and one for $RELEASE-nonet/. This is because old archived would probably have to put the included content in each dir, one for handbook/$RELEASE/ point one level up, to handbook/included.xml. We Included files are another matter. Right now, files in various directories anyway. proposed new structure, we still keep it in that TLD. It just points to Speaking of index, right now index.xml is in handbook/ . With the $RELEASE-foo/ in the index. and add one to the previous handbooks, making sure to now link the appropriate TOC, and you're done. At release time remove the disclaimer $RELEASE-net/ or -nonet/ directory. Add a single draft disclaimer to the directory. When it's time for a new release, copy the stuff to the new 3. No more copying stuff back and forth from draft/ to any other the old media is still available. 2. Now we can archive the networked handbook, which is appropriate as 1. It's obvious which handbook is for what, and it", "textAfterTable": "Report Message Find on GMANE Find on MARC All times displayed are UTC (GMT+0). Contents reflect the opinion of the author, not the Gentoo project or the Gentoo Foundation. Questions or comments? Please feel free to contact us. © 2001–2015 Gentoo Foundation, Inc. Gentoo is a trademark of the Gentoo Foundation, Inc. The contents of this document, unless otherwise expressly stated, are licensed under the CC-BY-SA-3.0 license. The Gentoo Name and Logo Usage Guidelines apply.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}