{"relation": [["Title", "Kurt Gödel and the Foundations of Mathematics", "Primer of Genetic Analysis", "Classic Ideas and Current Issues in American Government", "The Church Confronts Modernity: Catholic Intellectuals and the Progressive Era", "Public Management", "Law and Language", "Holt Elements of Literature, Perspectives in Multicultural Literature", "Software Receiver Design: Build Your Own Digital Communications System in Five Easy Steps", "Thin Description: Ethnography and the African Hebrew Israelites of Jerusalem", "The Beaches are Moving: The Drowning of America's Shoreline", "Reason and Democracy", "Ending The U.s. War In Iraq", "Contraception: A History of Its Treatment by the Catholic Theologians and Canonists", "Collected Papers on Monetary Theory", "Declaring His Genius: Oscar Wilde in North America", "Alexander Wilson: The Scot Who Founded American Ornithology", "The Spirit of the Hive", "Leaving It at the Office: A Guide to Psychotherapist Self-Care", "Supreme Court Confirmation Hearings and Constitutional Change", "Psalms", "Everything Matters!", "Defenders of the Faith", "God Is Dead", "Get Rich, Stay Rich, Pass it On", "Narrative of the Life of Frederick Douglass, an American Slave"], ["Author", "Christos H. Papadimitriou Jr. Matthias Baaz Hilary W. Putnam Dana S. Scott Charles L. Harper", "Jr. James N. Thompson Jr. Jenna J. Hellack Gerald Braver David S. Durica Jenna J. Hellack Gerald Braver", "Jr. John J. Diiulio Meena Bose", "Jr. Woods Thomas E.", "Jr. Laurence J. O'Toole Kenneth J. Meier", "Jr. John Witte Harold J. Berman", "Amy Tan Sandra Cisneros Martin Luther King Jr.", "Jr. C. Richard Johnson William A. Sethares Andrew G. Klein", "Jr. John L. Jackson", "Jr. Orrin H. Pilkey Wallace Kaufman", "Jr. Thomas A. Spragens", "Jr. Ben Connable Terrence K. Kelly Charles P. Ries Stephanie Young K. Scott Mcmahon Richard R. Brennan Michael J. Mcnerney Larry Hanauer Jason Campbell", "John T. Noonan Jr.", "Jr. Robert E. Lucas", "Jr. Roy Morris", "Jr. Edward H. Burtt William E. Davis", "Jr. Robert E. Page", "John C. Norcross Jr. James D. Guy", "Jr. Paul M. Collins Lori A. Ringhand", "Walter Brueggemann Jr. William H. Bellinger", "Jr. Ron Currie", "James Jr. Reston", "Jr. Ron Currie", "Jr. Catherine S. Mcbreen George H. Walper", "Jr. Houston A. Baker"], ["Copyright", "2011", "1958", "2007", "2004", "2011", "2013", "1987", "2011", "2013", "1983", "1990", "2013", "1986", "2013", "2013", "2013", "2013", "2007", "2013", "2009", "2009", "2009", "2007", "2007", "1982"], ["Date Added", "05/23/13", "06/11/13", "06/14/13", "07/14/13", "07/23/13", "08/08/13", "09/10/13", "10/01/13", "10/22/13", "11/01/13", "11/01/13", "11/08/13", "11/15/13", "11/16/13", "11/16/13", "11/16/13", "11/16/13", "12/11/13", "01/15/14", "02/05/14", "04/23/14", "04/23/14", "04/24/14", "04/25/14", "04/29/14"], ["Action", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]], "pageTitle": "Author - Bookshare - Accessible Books for Individuals with Print Disabilities", "title": "", "url": "https://www.bookshare.org/browse/author?resultsView=TABLE&key=Jr.&sortOrder=PUBLICATION_DATE&direction=ASC&offset=0", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00079-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 892357771, "recordOffset": 892344053, "tableOrientation": "HORIZONTAL", "textBeforeTable": "2550100 Results Per Page: By TitleBy AuthorBy Copyright DateBy Date Added Sort Order: 3   2 1   Page: Showing 1 through 25 of 65 results Jr. Author Browse List View Table View Browse Results You are using an outdated browser. Please upgrade your browser to improve your experience. My Bookshare Training and Resources", "textAfterTable": "Showing 1 through 25 of 65 results   Page: 1 2 3   Help Select your format based upon: 1) how you want to read your book, and 2) compatibility with your reading tool. To learn more about using Bookshare with your device, visit the \"Using Bookshare\" page in the Help Center. Here is an overview of the specialized formats that Bookshare offers its members with links that go to the Help Center for more information. Bookshare Web Reader - a customized reading tool for Bookshare members offering all the features of DAISY with a single click of the \"Read Now\" link. DAISY (Digital Accessible Information System) - a digital book file format. DAISY books from Bookshare are DAISY 3.0 text files that work with just about every type of access technology that reads text. Books that contain images will have the download option of ‘DAISY Text with Images’. BRF (Braille Refreshable Format) - digital Braille for use with refreshable Braille devices and Braille embossers. MP3 (Mpeg audio layer 3) - Provides audio only with no text. These books are created with a text-to-speech engine and spoken by Kendra, a high quality synthetic voice from Ivona. Any device that supports MP3 playback is compatible. DAISY Audio", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}