{"relation": [["Author", "isophoren", "aerosmith14", "aerosmith14", "nobones", "grenouille", "molly183", "Richardc269", "fourtwenty420", "Circaea", "Richardc269"], ["Message", "Great site, temporary problems (?)Uploaded a story day before yesterday, hope it eventually shows up. It's important because, while based on true events, no other site will take it. God Bless the First Amendment (sigh). Hope everything comes around. Great site, never let it die. Posted at 2010-07-15 15:28", "UghWell, it seems like the owner is ignoring this site again. Great... Posted at 2010-08-22 4:03", "Just fucking great... Posted at 2010-09-12 20:37", "HelloIt's about damn time. Welcome back, Kemayo. Posted at 2010-09-17 14:02", "Broken again alreadyWhereas we're all glad you're back, Kemayp, could you please, please, please fix some things? The hit counters have died now, in addition to the on-going chapter-posting nightmares. I'm beginning to think that it would have been kinder to let FicWad die... Posted at 2010-11-20 21:18", "i love ficwad...I love Ficwad. Seriously, I can't even count how many websites I've used to read and post fanfics, but of the ones I've stuck with, Ficwad is my favorite. The posting system is so easy for writers, and the organization system is great too. Ficwad has more variety of fics than almost any other site (since many cater towards one type of fic) and I love getting reviews and such. But it makes me sad that the site is basically dead now. I wish there was something I could do to fix it, Ficwad helped me so much as a writer. Posted at 2010-12-21 9:00", "Wow...only fixing the e-mail alerts...big accomplishment. HOW ABOUT FIXING THE BROKEN FUCKING SEARCH ENGINE, TOO! This is total bullshit. Now once again he's ignoring the website. I hope someone else takes over, because obviously this guy doesn't care about his own website. Nice going, bub. I'm surprised no one's been bitching about it like they should. Fix everything else, you ass-hat! Posted at 2011-03-29 10:29", "Help?Really disappeared with the slow death that this sight seems to be dieing, would anyone happen to know of any other simillar sites that are useful? I do frequen FF.net quite often but it seems to be filling up with authors who don't update often or take months to update a single 2k long chapter, any suggestions would be appreciated Posted at 2011-04-02 16:52", "archiveofourown.com seems to be the next closest equivalent, at least in terms of content type. I'd like to point out that many people who know what their alternatives are still choose Ficwad. Threatened with death each year when the admin forgets to renew the domain, lacking features people would like to have, limited userbase -- Ficwad when broken is still better than the alternatives in many respects. I think the almost-trolling above is misplaced, even taking out the trolling parts. Posted at 2011-04-03 14:22", "And get rid of these bullshit spam-bots, too! Posted at 2011-04-07 11:18"]], "pageTitle": "FicWad: fresh-picked original and fan fiction", "title": "", "url": "http://ficwad.com/forum/topic/1847/3", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00129-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 85137701, "recordOffset": 85129499, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{5638=Site design Copyright 2005, K&D Lynch. All stories contained in this archive are the property of their respective authors, and the owners of this site claim no responsibility for their contents.}", "textBeforeTable": "» 5 4 3 2 1 « Home > Announcements > So Lost password Register Log in Remember me Log in ▼ Sign up to adjust the filter You won't see stories with a lower score when you browse or search. Filter Filter: 0 Help Forum Search Browse FicWad", "textAfterTable": "« 1 2 3 4 5 » Site design Copyright 2005, K&D Lynch. All stories contained in this archive are the property of their respective authors, and the owners of this site claim no responsibility for their contents. Page created in 0.0464 seconds", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}