{"relation": [["File Name", "Ara Broker Reputations (fixed)", "Ara Broker Reputations Alts"], ["Version", "r12", "r2"], ["Size", "223kB", "2kB"], ["Author", "altelulex", "Aranarth"], ["Date", "01-22-13 12:06 PM", "07-13-11 09:43 AM"], ["Type", "Patch", "Addon"]], "pageTitle": "Ara Broker Reputations : Data Broker : World of Warcraft AddOns", "title": "", "url": "http://wowinterface.com/downloads/fileinfo.php?id=14263&so=&page=6", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00324-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 264780995, "recordOffset": 264757588, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{14999=This data broker plugin keeps track of your watched faction and displays a Blizzard-like faction list: colored bars in tree view mode that show standing (ie: Honored) and switch to raw numbers (ie: 2400/12000) when mouse hovered. You can access the config menu by right-clicking the block. It does pretty much what Broker Factions does with the following additions: - Can represent the watched faction with an ASCII bar. - Can sort by reputation level (thx to Neorgia) - Can watch hidden factions. - Colors are editable. It has been designed with efficiency in mind: fast and lightweight, yet feature full. Click a header (white entry) to expand or collapse. Click a faction to \"watch\" it. (Alliance Vaguard and Horde Expedition are special cases and require a shift+click to be watched.) Middle-Click a faction to move it to actives/inactives. Right-Click a faction to copy its info in chatbox. Collapsed headers are saved across session (with the exception of inactive factions that are automatically collapsed by Blizzard at login). This plugin supports AddonLoader (delayed loading), Skinner and SharedMedia (limited). Credits: Broker Factions (Tristanian) for options and color coding ideas.}", "textBeforeTable": "Optional Files (2) Initial release. r1 - Fixed block icon for some display. - Changed block text color: percentage and raw numbers are now colored in standing color if standing is not displayed. - Added limited support to SharedMedia (Armory, BantoBar, Blizzard, Glaze, LiteStep, Minimalist, Otravi, Smooth). r2 - Middle-Click a faction to move to active/inactive (was undocumented). - Right-Click a faction to copy informations to chatbox. - Added support for SharedMedia's Smooth v2. - Fixed negative session gain. - Added hints and an option to show/hide. - Added an option to show session gain on the block. - Added an option to auto switch watched faction on reputation gain. r3 - \"Spill over\" reputation is now handled. - Added an option for tooltip bars to use ASCII colors instead of Blizzard's. - Added an option to show \"reputation to go\" on the block. - Fixed an error that was occuring with exalted watched factions. - Fixed \"Auto switch on reputation gain\" to ignore negative reputations. r4 - Removed unnecessary Skinner and SharedMedia optional dependencies, it", "textAfterTable": "Archived Files (17) File Name Version Size Author Date   Ara Broker Reputations r17 14kB Aranarth 10-04-13 12:07 PM   Ara Broker Reputations r16 14kB Aranarth 09-24-13 01:07 PM   Ara Broker Reputations r15 14kB Aranarth 09-11-13 12:13 AM   Ara Broker Reputations r14 14kB Aranarth 05-22-13 02:09 AM   Ara Broker Reputations r13", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}