{"relation": [["Rank", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Title", "Bioshock Infinite", "Tomb Raider 2013", "Gears of War: Judgement", "God of War: Ascension", "Call of Duty: Black Ops II", "Luigi's Mansion: Dark Moon", "MLB 13: The Show", "NBA 2K13", "The Walking Dead: Survival Instinct", "Naruto Shippuden: Ultimate Ninja Storm 3"], ["Publisher", "Take 2 Interactive", "Square Enix Inc", "Microsoft", "Sony", "Activision Blizzard", "Nintendo", "Sony", "Take 2 Interactive", "Activision Blizzard", "Namco Bandai Games"]], "pageTitle": "Bioshock Infinite tops charts in another slumping sales month | Plugged In - Yahoo Games", "title": "", "url": "https://games.yahoo.com/blogs/plugged-in/bioshock-infinite-tops-charts-another-slumping-sales-month-000212305.html?soc_src=mediacontentstory", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00106-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 872061532, "recordOffset": 872012754, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{33080=The silver lining? Brick and mortar software sales (console, portable and PC) were up a modest 2% over March 2012., 33856=Hardware sales were down significantly once again, falling 32 percent as consumers continue to hold off on console purchases with the looming launch of new systems from Sony and Microsoft. Microsoft's Xbox 360 once again led the way with 261,000 units sold, though numbers for Sony's PS3 and Nintendo's Wii U have yet to be revealed. Nintendo did have a nice month with its 3DS handheld, however, with an 8 percent increase in sales compared to last March., 34328=Here's a look at the top selling games of March 2013:, 32685=Overall, sales were down 10 percent compared to last year to $992.5 million. This is the first time in at least five years that the video game industry has failed to top $1 billion in physical retail sales in March, traditionally a month of big releases. It's important to note, however, that these numbers still don't include digital sales via services like Steam and Xbox Live.}", "textBeforeTable": "Here's a look at the top selling games of March 2013: Hardware sales were down significantly once again, falling 32 percent as consumers continue to hold off on console purchases with the looming launch of new systems from Sony and Microsoft. Microsoft's Xbox 360 once again led the way with 261,000 units sold, though numbers for Sony's PS3 and Nintendo's Wii U have yet to be revealed. Nintendo did have a nice month with its 3DS handheld, however, with an 8 percent increase in sales compared to last March. The most surprising title on the month’s bestseller list, though, was The Walking Dead: Survival Instinct, a first-person shooter from Activision based on the AMC series that was absolutely eviscerated by critics. To no one's surprise, BioShock Infinite was the month's top game, while the reboot of Tomb Raider took the number two spot. And they didn't just squeak by: according to NPD's Liam Callahan, the two games enjoyed \"the highest first month sales for games in these franchises.\" The silver lining? Brick and mortar software sales (console, portable and PC) were up a modest 2% over March 2012. Overall, sales were down 10 percent compared to last year to $992.5 million. This is the first time in at least five years that the video game industry has failed to top $1 billion in physical retail sales in March, traditionally a month of big releases. It's important to note, however, that these numbers still don't include digital sales via", "textAfterTable": "For game news, free codes and more, Like us on Facebook and follow @yahoogames on Twitter! Arts & Entertainment Video Games Bioshock Infinite retail sales Click to view comments  View Comments (9) Share this     Featured Galleries View Horizon Zero Dawn", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}