{"relation": [["Composer", "Johann Christian Bach", "Johann Christian Bach", "Johann Christian Bach", "Johann Christian Bach", "Johann Christian Bach", "Johann Christian Bach"], ["Title", "Viola Concerto c moll - I mov,", "Viola Concerto c moll - II mov", "Viola Concerto c moll - III mov", "Viola Concerto c moll", "Sonata in D major, Op. 5, No. 2", "Sinfonia in D major, Op. 18, No. 4"], ["Date", "03/27/2011", "03/27/2011", "03/27/2011", "04/15/2011", "09/28/2014", "09/28/2014"], ["Action", "", "", "", "", "", ""]], "pageTitle": "Johann Christian Bach, classical music composer", "title": "", "url": "http://www.classicalconnect.com/composer/Johann-Christian-Bach", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00247-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 362044932, "recordOffset": 362036730, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{6364=Johann Christian enjoyed a successful career in London, easily outshining his father in terms of popularity. He became a leading composer of the Galant style, a reactionary style to the intricate counterpoint of the Baroque, which focused on the dominance of melody, balanced phrases and unobtrusive accompaniments. Johann Christian's operas eventually fell out of favor, but in 1765, he partnered with the famed viola da gambe player, Carl Friedrich Abel. The two began a successful concert series in London, which continued to run through 1782., 17769=Copyright 2008-2014 Classical Connect, LLC, 6966=By the late 1770s, Johann Christian's fortunes began to decline. His music was falling out of style, supplanted by the matured Classical style and a renewed interest, spearheaded by Joseph Haydn, in counterpoint. His health declined and his money was embezzled. On January 1, 1782, he passed away with a looming debt. Queen Charlotte, however, met his expenses and established a pension for his widow., 4449=The youngest of Johann Sebastian Bach's children, Johann Christian was born on September 5, 1735 when his father was already fifty years of age and served as Cantor in Leipzig. For the first fifteen years of his life, he grew up under the tutelage of his eminent father until the elder Bach's death in 1750. Though Johann Christian undoubtedly learned much from his father, the disparity between their ages and the relatively brief time he learned from him, compared to his siblings, his music consequently was markedly different from the contrapuntally infused work of his father. Following his father's death, Johann Christian was sent to Berlin to work with his elder brother, Carl Philipp Emanuel, who had already established himself as the most gifted of Bach's sons., 5255=At the age of nineteen and against the advice of his brother, Johann Christian left Berlin for Italy to pursue his dream of composing operas. He studied with Padre Martini in Bologna and after some time of composing church music, received his first commission to compose an opera. Three successful operas in Italy brought Johann Christian an invitation from the British capital to compose operas for the King's Theater, and his English debut work, Orioine, premiered on February 19, 1763, won him praise and support of the British crown, particularly Queen Charlotte. The young 20-year-old wife of King George III was from Germany herself and was quick to hire Johann Christian as a musician and teacher for herself and her children. Under the patronage of Queen Charlotte, he met a young Wolfgang Amadeus Mozart when the Mozart family visited England in 1764. He would become a powerful influence on the young lad, particularly in regards to concerto style. Later, Mozart would pay homage to Johann Christian by arranging three of his keyboard sonatas as concertos.}", "lastModified": "Fri, 31 Jul 2015 07:19:12 GMT", "textBeforeTable": "-->", "textAfterTable": "Contact | Press Releases | Privacy | Terms of Use | Interesting Links Copyright 2008-2014 Classical Connect, LLC", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}