{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Bark at the Moon", "You're No Different", "Now You See It (Now You Don't)", "Rock 'n' Roll Rebel", "Centre of Eternity", "So Tired", "Slow Down", "Waiting for Darkness", "Spiders", "One Up the \"B\" Side"], ["Artist", "Ozzy Osbourne", "Ozzy Osbourne", "Ozzy Osbourne", "Ozzy Osbourne", "Ozzy Osbourne", "Ozzy Osbourne", "Ozzy Osbourne", "Ozzy Osbourne", "Ozzy Osbourne", "Ozzy Osbourne"], ["Time", "4:17", "5:02", "5:05", "5:28", "5:24", "3:59", "4:19", "5:17", "4:25", "3:24"], ["Price", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Bark at the Moon by Ozzy Osbourne", "title": "", "url": "https://itunes.apple.com/fi/album/bark-at-the-moon/id192826907", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00149-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 883632679, "recordOffset": 883602093, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{20254=Born: 03 December 1948 in Birmingham, England, 122704=Copyright © 2014 Apple Inc. Kaikki oikeudet pidätetään.}", "lastModified": "Fri, 31 Jul 2015 08:35:30 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Ozzy Osbourne Bark at the Moon iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Bark at the Moon by Ozzy Osbourne, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes", "textAfterTable": "10 Songs Album Review Ozzy Osbourne finds a permanent replacement for Randy Rhoads in Jake E. Lee, a more standard metal guitarist without Rhoads' neo-classical compositional ability or stylistic flair. Still, Osbourne and his band turn in a competent, workmanlike set of heavy metal featuring the crunching title track, whose video (featuring Osbourne dressed as a werewolf) became popular on MTV. Unfortunately, substance abuse problems would prevent Osbourne from releasing another record up to the standards of Bark at the Moon for nearly the rest of the decade. Biography Born: 03 December 1948 in Birmingham, England Genre: Rock Years Active: '60s, '70s, '80s, '90s, '00s, '10s Though many bands have succeeded in earning the hatred of parents and media worldwide throughout the past few decades, arguably only such acts as Alice Cooper, Judas Priest, and Marilyn Manson have tied the controversial record of Ozzy Osbourne. The former Black Sabbath frontman has been highly criticized over his career, mostly due to rumors denouncing him as a psychopath and Satanist. Despite his reputation, no one could deny that Osbourne has had an immeasurable effect on heavy metal. While he... Full bio", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}