{"relation": [["Year", "2001", "2001", "2002", "2003", "2003", "2004", "2005", "2006", "2007", "2008", "2008", "2009", "2009", "2009", "2010 (Long)", "2010 (Short)", "2010 (Student)", "2011", "2012 (Long)", "2012 (Student)", "2013"], ["Author", "Eugene Charniak", "Ulrich Germann, Michael Jahr, Kevin Knight, Daniel Marcu, and Kenji Yamada", "Franz Och and Hermann Ney", "Dan Klein and Chris Manning", "Yukiko Nakano, Gabe Reinstein, Tom Stocky, and Justine Cassell", "Diana McCarthy, Rob Koeling, Julie Weeds, and John Carroll", "David Chiang", "Rion Snow, Dan Jurafsky, and Andrew Y. Ng", "Y. W. Wong and R. J. Mooney", "Liang Huang", "Libin Shen, Jinxi Xu and Ralph Weischedel", "Andre Martins, Noah Smith and Eric Xing", "S.R.K. Branavan, Harr Chen, Luke Zettlemoyer and Regina Barzilay", "Adam Pauls and Dan Klein", "Matthew Gerber and Joyce Chai", "Michael Lamar, Yariv Maron, Mark Johnson and Elie Bienenstock", "David Elson, Nicholas Dames and Kathleen McKeown", "Dipanjan Das and Slav Petrov", "Hiroyuki Shindo, Yusuke Miyao, Akinori Fujino and Masaaki Nagata", "Fan Bu, Hang Li and Xiaoyan Zhu", "Haonan Yu and Jeffrey Mark Siskind"], ["Paper Title", "Immediate-head parsing for language modeling", "Fast Decoding and Optimal Decoding for Machine Translation", "Discriminative Traing and Maximum Entropy Models for Statistical Machine Translation", "Accurate Unlexicalized Parsing", "Towards a Model of Face-to-Face Grounding", "Finding Predominant Word Senses in Untagged Text", "A hierarchical phrase-based model for statistical machine translation", "Semantic taxonomy induction from heterogenous evidence", "Learning synchronous grammars for semantic parsing with lambda calculus", "Forest Reranking: Discriminative Parsing with Non-Local Features", "A New String-to-Dependency Machine Translation Algorithm with a Target Dependency Language Model", "Concise Integer Linear Programming Formulations for Dependency Parsing", "Reinforcement Learning for Mapping Instructions to Actions", "K-Best A* Parsing", "Beyond NomBank: A Study of Implicit Arguments for Nominal Predicates", "SVD and Clustering for Unsupervised POS Tagging", "Extracting Social Networks from Literary Fiction", "Unsupervised Part-of-Speech Tagging with Bilingual Graph-Based Projections", "Bayesian Symbol-Refined Tree Substitution Grammars for Syntactic Parsing", "String Re-writing Kernel", "Grounded Language Learning from Video Described with Sentences"]], "pageTitle": "Difference between revisions of \"Best paper awards\" - ACL Wiki", "title": "", "url": "http://aclweb.org/aclwiki/index.php?title=Best_paper_awards&diff=10577&oldid=9402", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00323-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 2940879, "recordOffset": 2926974, "tableOrientation": "HORIZONTAL", "textBeforeTable": "A few items are still missing. Please help complete this table and link papers to PDFs in the ACL anthology. ACL 4 IJCNLP 3 EMNLP 2 NAACL 1 ACL Contents Revision as of 17:39, 7 March 2014 [[Category:Awards]]   [[Category:Awards]]   |}   |}   |- +   |[http://aclweb.org/anthology/I/I13/I13-1031.pdf SuMT: A Framework of Summarization and MT] +   |Houda Bouamor, Behrang Mohit and Kemal Oflazer +   |2013 +   |- +   ] [http://aclweb.org/anthology/I/I11/I11-1079.pdf Dynamic and Static Prototype Vectors for Semantic Composition | + |Dynamic and Static Prototype Vectors for Semantic Composition − |Siva Reddy, Ioannis Klapaftis, Diana McCarthy and Suresh Manandhar   |Siva Reddy, Ioannis Klapaftis, Diana McCarthy and", "textAfterTable": "NAACL Year Author Paper Title 2004 Regina Barzilay, MIT, and Lillian Lee, Cornell Catching the Drift: Probabilistic Content Models, with Applications to Generation and Summarization 2006 Mehryar Mohri and Brian Roark Probabilistic Context-Free Grammar Induction Based on Structural Zeros 2006 Aria Haghighi and Dan Klein Prototype-Driven Learning for Sequence Models 2007 Antti-Veikko Rosti, Bing Xiang, Spyros Matsoukas, Richard Schwartz, Necip Fazil Ayan and Bonnie Dorr Combining Outputs from Multiple Machine Translation Systems 2009 Hoifung Poon, Colin Cherry and Kristina Toutanova Unsupervised Morphological Segmentation with Log-Linear Models 2009 David Chiang, Kevin Knight and Wei Wang 11,001 New Features for Statistical Machine Translation 2010 (long) Aria Haghighi and Dan Klein Coreference Resolution in a Modular, Entity-Centered Model 2010 (short) Jennifer Foster “cba to check the spelling”: Investigating Parser Performance on Discussion Forum Posts 2012 (full) Alexander Rush and Slav Petrov Vine Pruning for Efficient Multi-Pass Dependency Parsing 2012 (short) Jacob Devlin and Spyros Matsoukas Trait-Based Hypothesis Selection for Machine Translation 2012 (student) Oscar Taeckstroem, Ryan McDonald and Jakob Uszkoreit Cross-lingual Word Clusters for Direct Transfer of Linguistic Structure 2013 (full) no award", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}