{"relation": [["#", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Title", "Unmanned", "Cycles", "One Small Step", "Safeword", "Ring of Truth", "Girl on Girl", "Paper Dolls", "Kimono Dragons", "Motherland", "Whys and Wherefores"], ["Material collected", "Y: The Last Man #01-05", "Y: The Last Man #06-10", "Y: The Last Man #11-17", "Y: The Last Man #18-23", "Y: The Last Man #24-31", "Y: The Last Man #32-36", "Y: The Last Man #37-42", "Y: The Last Man #43-48", "Y: The Last Man #49-54", "Y: The Last Man #55-60"], ["Publication date", "January 2, 2003", "September 1, 2003", "April 1, 2004", "December 1, 2004", "August 1, 2005", "November 23, 2005", "May 1, 2006", "November 22, 2006", "May 2, 2007", "December 1, 2008"], ["ISBN", "978-1563899805", "978-1401200763", "978-1401202019", "978-1401202323", "978-1401204877", "978-1401205010", "978-1401210090", "978-1401210106", "978-1401213510", "978-1401218133"]], "pageTitle": "Y: The Last Man - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/Y_The_Last_Man", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00203-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 879500471, "recordOffset": 879474909, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{6484=Y: The Last Man is a dystopian science fiction comic book series by Brian K. Vaughan and Pia Guerra published by Vertigo beginning in 2002. The series is about the seemingly only man who survives the apparent simultaneous death of all other male mammals on Earth except the man's pet monkey. The series was published in sixty issues by Vertigo and collected in a series of ten paperback volumes (and later a series of five hardcover \"Deluxe\" volumes). The series's covers were primarily by J. G. Jones and Massimo Carnevale. The series received five Eisner Awards., 25796=The film rights to the series were acquired by New Line Cinema (a sister company to Vertigo), and as of July 24, 2007 screenwriter Carl Ellsworth and director D. J. Caruso, the team behind Disturbia, were attached to the project with David S. Goyer as a producer.[5], 31691=In January 2013, it was announced that Dan Trachtenberg will direct the film.[16] In June 2013, producer David Goyer announced having \"a script that’s as close as it’s ever been,\" and suggested the film could go into production in 2014.[17] However, in January 2014, Brian K. Vaughan stated \"It's my understanding that the rights to Y: The Last Man will revert back to co-creator Pia Guerra and me for the first time in a decade if the planned New Line adaptation doesn't start shooting in the next few months.\"[18] On September 24, Trachtenberg confirmed via Twitter the film was \"Not happening. But it's in trusted hands (the creators).\"[19] In a subsequent interview he noted that in fact, \"The rights reverted back to Brian quite a few months ago.\"[20], 26522=Caruso intended on finishing the script in the summer and filming during the fall of 2008. The script would be a rewrite of the original draft written by Jeff Vintar. Although Vintar's draft was faithful to the original comic book and considered by many to be a success, the higher-ups at New Line Cinema seemed unable to fully embrace the material. A subsequent draft by Vaughan himself, which departed from his own comic considerably, was even less successful in convincing the studio to proceed.[6], 30716=In March 2012, former Jericho writers Matthew Federman and Stephen Scaia entered final negotiations to write New Line's adaptation of the series, following in the footsteps of Vintar, Vaughan, and Ellsworth. J.C. Spink, Chris Bender and David Goyer were attached to produce; Mason Novick and Jake Weiner are executive producers.[14] Reports in September 2012 suggested New Line was enthusiastic about the draft screenplay produced by Federman and Scaia, and had begun the process of meeting potential directors to hire for the project.[15], 38765=In 2014, the first Absolute Edition was announced, a specialty over-sized slipcovered edition., 11962=On July 17, 2002, all living mammals with a Y chromosome — including embryos and sperm simultaneously die, with the exception of a young amateur escape artist named Yorick Brown and his Capuchin monkey, Ampersand. Many women die from disasters caused by the men's deaths, such as plane crashes. Society is plunged into chaos as infrastructures collapse, and the surviving women everywhere try to cope with the loss of the men, and the belief that, barring a rapid, major scientific breakthrough or other extraordinary happening, humanity is doomed to extinction., 39748=Y: The Last Man, Volume 10: Whys and Wherefores was nominated for the first Hugo Award for Best Graphic Story. In 2008, Y: The Last Man won the Eisner Award for Best Continuing Series.[21]}", "lastModified": "Thu, 30 Jul 2015 17:57:51 GMT", "textBeforeTable": "The series is collected in trade paperbacks. Collected editions[edit] In January 2013, it was announced that Dan Trachtenberg will direct the film.[16] In June 2013, producer David Goyer announced having \"a script that’s as close as it’s ever been,\" and suggested the film could go into production in 2014.[17] However, in January 2014, Brian K. Vaughan stated \"It's my understanding that the rights to Y: The Last Man will revert back to co-creator Pia Guerra and me for the first time in a decade if the planned New Line adaptation doesn't start shooting in the next few months.\"[18] On September 24, Trachtenberg confirmed via Twitter the film was \"Not happening. But it's in trusted hands (the creators).\"[19] In a subsequent interview he noted that in fact, \"The rights reverted back to Brian quite a few months ago.\"[20] In March 2012, former Jericho writers Matthew Federman and Stephen Scaia entered final negotiations to write New Line's adaptation of the series, following in the footsteps of Vintar, Vaughan, and Ellsworth. J.C. Spink, Chris Bender and David Goyer were attached to produce; Mason Novick and Jake Weiner are executive producers.[14] Reports in September 2012 suggested", "textAfterTable": "After the finale, the series was re-released, in parts, as oversized hardcovers with alternative cover art. # Title Material collected Publication date ISBN 1 Deluxe Edition Book One Y: The Last Man #01-10 October 28, 2008 978-1401219215 2 Deluxe Edition Book Two Y: The Last Man #11-23 May 12, 2009 978-1401222352 3 Deluxe Edition Book Three Y: The Last Man #24-36 April 27, 2010 978-1401225780 4 Deluxe Edition Book Four Y: The Last Man #37-48 October 26, 2010 978-1401228880 5 Deluxe Edition Book Five Y: The Last Man #49-60 May 3, 2011 978-1401230517 In 2014, the first Absolute Edition was announced, a specialty over-sized slipcovered edition. # Title Material collected Publication date ISBN 1 Absolute Y: the Last Man Vol. 1 Y: The Last Man #01-20 July 07, 2015 978-1401254292 Awards and honors[edit] Y: The Last Man, Volume 10: Whys and Wherefores was nominated for the first Hugo Award for Best Graphic Story. In 2008, Y: The Last Man won the Eisner Award for Best Continuing Series.[21] See also[edit] Mary Shelley's novel,", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}