{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", ""], ["Name", "ExplicitJust Begun", "Explicit64' Impala", "ExplicitReina de Barrio (Ghetto Queen) [feat. Adrian]", "ExplicitStone Cold", "ExplicitYellow Tape (feat. Krondon)", "ExplicitPeace Treaty", "ExplicitAnd It Goes", "ExplicitSlash Gordan", "ExplicitHeartbreaks & Handcuffs", "ExplicitThis Generation (feat. Adrian)", "ExplicitFuture Love", "ExplicitThe Other Side", "BookletDigital Booklet - This Generation"], ["Artist", "Murs & Fashawn", "Murs & Fashawn", "Murs & Fashawn", "Murs & Fashawn", "Murs & Fashawn", "Murs & Fashawn", "Murs & Fashawn", "Murs & Fashawn", "Murs & Fashawn", "Murs & Fashawn", "Murs & Fashawn", "Murs & Fashawn", "Murs & Fashawn"], ["Time", "3:27", "4:05", "3:16", "3:14", "2:50", "3:41", "3:24", "3:11", "3:16", "3:25", "3:15", "8:00", "--"], ["Price", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "Album Only"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - This Generation by Murs & Fashawn", "title": "", "url": "https://itunes.apple.com/us/album/this-generation/id552228544", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00205-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 890027939, "recordOffset": 889999647, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{25666=A certified indie-rap mogul, L.A. veteran Murs has been putting out higher-level hip-hop since the early '90s. Down with Living Legends, 3 Melancholy Gypsies, and Felt, he also organizes the hugely popular Paid Dues tour every year and has dropped a steady stream of great solo albums, including Murs Rules the World, The End of the Beginning, and Murs for President. Fashawn is a younger cat from Fresno; he's been bombarding the scene with a gang of mixtapes and released his first true album, Boy Meets World in 2009. On This Generation, they join forces for an excellent collabo project. It's entirely produced by Beatnick and K-Salaam, who provide a compelling backdrop of neckbending future funk. From the radio-ready title track to the Cali-pride jam \"64 Impala\" and the \"can't we all get along?\" gangster anthem \"Peace Treaty,\" every song on here is undeniably catchy and inherently smart. It's proof positive that so-called backpack rap doesn't have to be hyper-abstract, and strong hooks aren't always corny; there's truly something for everybody here. Other highlights include \"Slash Gordan\" (propelled by guitar and steel drums) and the Neptunes-esque \"Future Love.\", 30618=Born: March 16, 1978 in Los Angeles, CA, 132782=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 03:35:54 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Murs & Fashawn This Generation iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from This Generation by Murs & Fashawn, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "13 Items Editors’ Notes A certified indie-rap mogul, L.A. veteran Murs has been putting out higher-level hip-hop since the early '90s. Down with Living Legends, 3 Melancholy Gypsies, and Felt, he also organizes the hugely popular Paid Dues tour every year and has dropped a steady stream of great solo albums, including Murs Rules the World, The End of the Beginning, and Murs for President. Fashawn is a younger cat from Fresno; he's been bombarding the scene with a gang of mixtapes and released his first true album, Boy Meets World in 2009. On This Generation, they join forces for an excellent collabo project. It's entirely produced by Beatnick and K-Salaam, who provide a compelling backdrop of neckbending future funk. From the radio-ready title track to the Cali-pride jam \"64 Impala\" and the \"can't we all get along?\" gangster anthem \"Peace Treaty,\" every song on here is undeniably catchy and inherently smart. It's proof positive that so-called backpack rap doesn't have to be hyper-abstract, and strong hooks aren't always corny; there's truly something for everybody here. Other highlights include \"Slash Gordan\" (propelled by guitar and steel drums) and the Neptunes-esque \"Future Love.\" Customer Reviews Yeah.        ", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}