{"relation": [["Title", "01) Richard Bolitho, Midshipman", "02) Midshipman Bolitho and the Avenger", "03) Band of Brothers", "04) Stand into Danger", "05) In Gallant Company", "06) Sloop of War", "07) To Glory We Steer[3]", "08) Command a King's Ship", "09) Passage To Mutiny", "10) With All Despatch", "11) Form Line of Battle", "12) Enemy in Sight!", "13) Flag Captain", "14) Signal – Close Action!", "15) The Inshore Squadron", "16) A Tradition of Victory", "17) Success to the Brave", "18) Colours Aloft!", "19) Honour This Day", "20) The Only Victor", "21) Beyond The Reef", "22) The Darkening Sea", "23) For My Country's Freedom", "24) Cross of St. George", "25) Sword of Honour", "26) Second to None", "27) Relentless Pursuit", "28) Man of War", "29) Heart of Oak", "30) In the King's Name"], ["Publication date", "1975", "1978", "2006", "1980", "1977", "1972", "1968", "1973", "1976", "1988", "1969", "1970", "1971", "1974", "1978", "1981", "1983", "1986", "1987", "1990", "1992", "1993", "1995", "1996", "1998", "1999", "2001", "2003", "2007", "2011"], ["ISBN", "ISBN 0-399-61004-9", "ISBN 0-399-20652-3", "ISBN 0-434-01010-3", "ISBN 0-09-925380-1", "ISBN 0-09-916970-3", "ISBN 0-09-908820-7", "ISBN 978-0-09-952786-2", "ISBN 978-0-09-954985-7", "ISBN 978-0-09-126330-0", "ISBN 978-0-09-949388-4", "ISBN 978-0-09-908850-9", "ISBN 0-09-905520-1", "ISBN 0-09-907180-0", "ISBN 0-09-912940-X", "ISBN 0-09-134580-4", "ISBN 978-0-09-949767-7", "ISBN 0-09-936370-4", "ISBN 978-0-09-954339-8", "ISBN 978-0-09-954341-1", "ISBN 0-330-31840-3", "ISBN 0-330-31957-4", "ISBN 0-330-32917-0", "ISBN 0-330-34474-9", "ISBN 978-0-09-949773-8", "ISBN 0-09-942168-2", "ISBN 0-09-928059-0", "ISBN 978-0-434-00884-1", "ISBN 978-0-434-01008-0", "ISBN 978-0-434-01351-7", "ISBN 978-1-84605-543-0"], ["Internal chronology", "1772", "1773", "1774", "1774", "1777", "1778", "1782", "1784", "1789", "1792", "1793", "1794", "1797", "1798", "1800", "1801", "1802", "1803", "1804", "1806", "1808", "1809", "1811", "1813", "1814", "1815", "1815", "1817", "1818", "1819"]], "pageTitle": "The Bolitho novels - Wikipedia, the free encyclopedia", "title": "Novels of the series", "url": "https://en.wikipedia.org/wiki/Richard_Bolitho", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00153-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 864615677, "recordOffset": 864600019, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1253=In Enemy in Sight, Richard Bolitho is joined by his nephew Adam Pascoe, who is later renamed Adam Bolitho when he becomes Richard's heir. Adam, the only son of Richard's disgraced older brother Hugh, was born in 1780 in Penzance, Cornwall, shortly after his father joined the revolution in America. Having been sent to Richard at the age of 14 by his dying mother, he joined the Royal Navy, rising through the ranks to establish himself as a daring and resourceful frigate captain, as his uncle had once done., 6810=Richard Bolitho is a fictional Royal Navy officer who is the main character in a series of novels written by Douglas Reeman (using the pseudonym Alexander Kent). Bolitho was born in 1756 in Falmouth, Cornwall, in Great Britain, the second son of a prestigious naval family. He joined the navy in 1768. He served in the wars against France and the United States. He was promoted to lieutenant in 1774, captain in 1782, and admiral in 1812. He died in action against the French in 1815. He played a significant role in driving the Americans back to Brooklyn Heights in 1776, helping to secure a decisive British victory in the largest battle of the entire American Revolution.}", "lastModified": "Sat, 25 Jul 2015 20:44:06 GMT", "textBeforeTable": "Books in the Series[edit] Adam's role in the series steadily increases as Richard ages and achieves high rank. After Richard's death, he becomes the principal character in the series. In Enemy in Sight, Richard Bolitho is joined by his nephew Adam Pascoe, who is later renamed Adam Bolitho when he becomes Richard's heir. Adam, the only son of Richard's disgraced older brother Hugh, was born in 1780 in Penzance, Cornwall, shortly after his father joined the revolution in America. Having been sent to Richard at the age of 14 by his dying mother, he joined the Royal Navy, rising through the ranks to establish himself as a daring and resourceful frigate captain, as his uncle had once done. Adam Bolitho is a fictional Royal Navy officer who is the main character in a series of novels written by Douglas Reeman (using the pseudonym Alexander Kent), succeeding the previous main character Richard Bolitho. Adam Bolitho[edit] Reeman's own Royal Navy career and lifelong interest in sailing inform his seafaring novels. He saw active service with the Royal Navy during the Second World War, serving in the North Sea, Arctic, Atlantic and Mediterranean campaigns. Starting as a midshipman in destroyers he later transferred to motor torpedo boats, where he was twice mentioned in dispatches.", "textAfterTable": "There were also some omnibus editions which collected several books from the series into one volume Anthologies of the series Title Publication date ISBN Volumes included Midshipman Bolitho ISBN 0-09-986350-2 Richard Bolitho, Midshipman Midshipman Bolitho and the 'Avenger' Captain Richard Bolitho, RN 1978 ISBN 978-0-09-134130-5 Sloop of War To Glory We Steer Command a King's Ship Bolitho Colours Aloft Honour This Day The Only Victor The Bolitho Omnibus 1991 ISBN 0-09-175118-7 Stand into Danger In Gallant Company Sloop of War Bolitho 1993 ISBN 0-434-00024-8 With All Despatch Honour This Day The Only Victor The Complete Midshipman Bolitho 2006 ISBN 978-1-59013-127-5 Richard Bolitho, Midshipman Midshipman Bolitho and the 'Avenger' Band of Brothers Ships in which Bolitho serves[edit] Ships served in by Richard Bolitho Book Ship Guns Class Captain Rank Year HMS Manxman 80 Third-rate ship of the line Captain Sir Henry Langford Midshipman 1768–1772 Richard Bolitho, Midshipman HMS Gorgon 74 Third-rate ship of the", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}