{"relation": [["Author", "Aangie", "Aangie", "Aangie", "Aangie", "Aangie"], ["Title", "Disney-Inspired", "Dragon Boy", "Earthbound Enemy doodles", "EARTHBOUND iPod Case", "Five Can Launch!"], ["Description", "I was in Disney World where the imagination of it rubbed off on me a bit...", "Inspired by both Avatar: The Last Airbender, and Spirited Away's 'Dragon Boy' track.", "Yeah, title says all, basically", "Made from tape, cardboard, and colored with prisma markers/pencils. :) Usable for Gen 3 iPod Nanos.", "There's a bit of a story behind this entry, so be patient with me! :) This may not be as weird and slightly creepy as Draca's entry (Which is so amazing, by the way! XD) but it is a bit... unusual. I guess? So over the past week I visited the Kennedy Space Center in Florida for the first time. Now, before you jump to conclusions, I was completely facinated and it really was a treat and I live at the tip of the East Coast so I never get to see awesome stuff like this. While looking in some of the exhibits, I noticed the massive Saturn V (Five) Rocket, which had the power to bring things to orbit, and was the rocket used to launch all of the Apollo missions as well as the Space Shuttle missions. Being a MOTHER nerd, I thought of the 'Five can Ladder' quote, and kind of connected it to the Saturn Five rocket. I had a notebook in my paper, so over lunch, I sketched this out and went back to the exhibit in in EarthBound's honor, I took my drawing's photo next to a display of the rocket. :) So look at it this way, there was a MOTHER fan being a MOTHER fan in a space center! I also recreated a Space Shuttle and went even more EarthBoundy on it and renamed it 'Melody' and put 'Eagleland' in place of the 'United States' logo. I also mixed up the American flag a little and let's just say it's the Eagleland flag. I tried to make each Saturn look a little different as well! I used colored pencil on the shuttle, the Saturns, the plume of flame, and the planet as well. The background was done with markers. HERE IS THE PHOTO!: http://i52.tinypic.com/2mn2ko0.jpg"], ["Date", "8/30/10", "5/23/10", "8/30/10", "5/23/10", "1/22/11"], ["Rank", "0.00", "0.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=27280&stuffPageNumber=5", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00326-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 225274615, "recordOffset": 225266413, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> Y W U T S R P O N M L K I H G F E D C B A 1 < Other Submissions by Aangie Mr. Patch? Of Pigs - #16 This image has been resized for your convenience. Click on it to view the full size version. OPM- Adventure!- Patching Up a Bad Situation OPM- Adventure!- Patching Up a Bad Situation - by Aangie  Mother3 Go Back!", "textAfterTable": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}