{"relation": [["Title", "GraphiX 3", "MegaMan FX-3"], ["Author", "ElixirNova", "Elixernova"], ["Description", "This program expands the MegaMan X3 ROM in a not so efficient manner and allows you to easily import/export compressed graphics and it takes care of the rest! So now all the graphics in MegaMan X 3 can be edited! This specific program will probably b….", "A Mega Man X3 editor. It is not complete. The source was lost so no more progress will be made on this editor."], ["Category", "Miscellaneous Graphics Tools", "Level Editors"], ["Platform", "SNES", "SNES"], ["Game", "Mega Man X3", "Mega Man X3"], ["OS", "Win", "Win"], ["Ver", "0.8", "0.1"], ["Level", "Int", "Beg"], ["Date", "None", "None"]], "pageTitle": "Romhacking.net - Utilities", "title": "(1 to 2) of 2 Results", "url": "http://www.romhacking.net/?page=utilities&game=784&order=Title", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00199-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 686307307, "recordOffset": 686290352, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Button Search Description Search Title Text Search Results Per Page None Selected 10 20 30 40 50 Level None Selected Advanced Beginner Intermediate OS None Selected BeOS DOS Indep Java Mac OS Mac OS X Unix Win Author None Selected Aether Knight (wraith) +daniel+ -=Fx3=- A7mad AamirM Aaron Jacobson Abe Abstract Crouton Productions Abyssonym AcidPhire acmlm ADnova Agemo AgentGeo Ajax Alcaro ALXR André Fachat Android 18 angel-team Anime_World AnusP AnyoneEB Archaemic Arcnor Atarius Maximus (Steve Engelhardt) Atrius AvatarofHonor Barubary Bas Steendijk bbitmaster Ben Beneficii Benjamin Cutler Benjamin Popp BigNailCow Black Rabite Blades blank blueMSX Bob Colbert Bob Rost bobmcjr Bongo` Boris Timofeev Borra Bouche BouKiChi Brandon Koopa breech Bregalad Brendon James Bruno Costa Bryan M.", "textAfterTable": "1 ﻿ Information ©2005-2014 RHDN 2.6.0 by Nightcrawler. All Rights Reserved. Execution time - 0.0259 sec. - Number of Queries: 2 About Us | RHDN Policy | XHTML | CSS", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}