{"relation": [["Title", "Waking Up in Iceland", "The Tricking of Freya", "Viking Age Iceland", "Jar City", "The Far Traveler: Voyages of a Viking Woman"], ["Author", "Paul Sullivan", "Christina Sunley", "Jesse L Bycock", "Arnaldur Indridason", "Nancy Marie Brown"]], "pageTitle": "Iceland | Intrepid Travel", "title": "", "url": "http://www.intrepidtravel.com/iceland/subscriptions", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00093-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 527869999, "recordOffset": 527814989, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{252644=Review submitted 26 Jul 2015, 151402=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 152721=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan...}", "TableContextTimeStampAfterTable": "{952=Spring and summer are considered optimal times to visit Iceland. The early spring months bring warmer days, while summer offers long daylight hours with only brief nights. In the summer season, July and August are the warmest months and are the busiest tourist seasons. In September, tourism tends to slow down as the weather becomes unpredictable and the countryside is usually less accessible. However, there are plenty of attractions for the off-peak traveller, including the beauty of autumn colours and the awe-inspiring Northern Lights. As to be expected, winters in Iceland can be challenging. During late December there's about four and a half hours of daylight and it's usually cloudy. In January, there are on average three sunny days in Reykjavík, with temperatures hovering around freezing point, often accompanied by chilling winds., 6006=The Northern Hemisphere's Aurora Borealis has captivated and intrigued people for eons. This stunning, natural light display that runs along magnetic fields brings hypnotic green, yellow and red shades to the night sky in Iceland from September to March. As one of nature's most magnificent triumphs, this is one unforgettable spectacle.}", "textBeforeTable": "Recommended reading Further reading 7. Please ask and receive permission before taking photos of people, including children. 6. Refrain from supporting businesses that exploit or abuse endangered animals. 5. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 4. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 3. Always dispose of litter thoughtfully, including cigarette butts. 2. For environmental reasons, try to avoid buying bottled water. Instead, fill a reusable water bottle or canteen with filtered water. 1. Be considerate of Iceland’s customs, traditions, religion and culture. Top responsible travel tips for Iceland Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this in mind while travelling. Iceland Travel Tips Responsible Travel also provides useful health information: Go to: http://www.who.int/en/ The World Health Organisation Go to: http://www.fco.gov.uk/en/ From UK? Go to: http://travel.state.gov/ From US? Go to:", "textAfterTable": "Handy links www.lonelyplanet.com/iceland www.worldtravelguide.net/iceland www.visiticeland.com × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}