{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Nome", "Rock In the Western World", "Stranger Than Paradise", "I Don't Want to Live Without You", "Damned If We, Damned If We Don't", "Heroes Die Young", "We Do Rock 'n Roll", "ExplicitStranger Than Paradise", "Bring Out the Rebel", "Screwed Blued 'n Tatooed", "The Long Goodbye"], ["Album", "Screwed, Blued & Tatooed", "Screwed, Blued & Tatooed", "Powertool", "Screwed, Blued & Tatooed", "Screwed, Blued & Tatooed", "Screwed, Blued & Tatooed", "Stranger Than Paradise - EP", "Powertool", "Screwed, Blued & Tatooed", "Insanity Beach"], ["Durata", "3:29", "4:04", "4:45", "3:47", "4:27", "3:19", "4:04", "4:39", "3:38", "5:32"], ["Prezzo", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "Vedi in iTunes", "Vedi in iTunes", "Vedi in iTunes", "Vedi in iTunes", "Vedi in iTunes", "Vedi in iTunes", "Vedi in iTunes", "Vedi in iTunes", "Vedi in iTunes", "Vedi in iTunes"]], "pageTitle": "iTunes - Musica - Screwed, Blued & Tatooed di Sleeze Beez", "title": "", "url": "https://itunes.apple.com/it/album/rock-in-the-western-world/id129586005?i=129586007", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00038-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 865961999, "recordOffset": 865936331, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{23371=Formato(a): 1988, 122357=Copyright © 2014 Apple Inc. Tutti i diritti riservati., 21552=The majority of Sleeze Beez fans would agree that Screwed Blued & Tattooed, the band's first album for Atlantic and second album overall, is their best release. It is also their best-known release; when this album (which was recorded in 1988) came out in early 1990, pop-metal and hair bands were still huge. One thing Screwed Blued & Tattooed won't be accused of is being the most original album in the world. The Dutch headbangers' approach — basically Mötley Crüe meets Quiet Riot with traces of Van Halen — wasn't going to win them any awards for innovation. Tracks like \"Girls Girls Nasty Nasty\" and \"Rock in the Western World\" are full of the usual sex/party clichés that hair bands thrived on. Nonetheless, this is a fun party album, and even though the material is far from groundbreaking, it is likable and infectious. When this CD came out at the dawn of the '90s, Sleeze Beez had no idea that a few years later, the rock world would be taken over by grunge and alternative rock — and that in 1992 and 1993, pop-metal and hair bands would be taking a commercial nose-dive. In a perfect world, grunge and pop-metal would have been able to coexist — although the rise of Nirvana and Pearl Jam was most certainly a good thing, it is regrettable that much of the music industry decided to throw the baby out with the bathwater and turn its back on pop-metal. But change is inevitable, and at least Sleeze Beez had their 15 minutes of fame. Although not in a class with Mötley Crüe's Girls, Girls, Girls or Quiet Riot's Metal Health, Screwed Blued & Tattooed is a decent, if derivative, footnote in the history of pop-metal/hard rock.}", "lastModified": "Fri, 31 Jul 2015 09:01:17 GMT", "textBeforeTable": "Vedi in iTunes Sleeze Beez: Live In Tokyo 5. Vedi in iTunes Look Like Hell 4. Vedi in iTunes Insanity Beach 3. Vedi in", "textAfterTable": "Altri hanno acquistato Eatin' Ain't Cheatin' Sweet Cheater Vedi in iTunes Take It Sleezy Dirty Penny Vedi in iTunes Can't Get Enough Miss Crazy Vedi in iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}