{"relation": [["", "1", "2", "3", "4", "5", "6"], ["Name", "Big Brother Is Watching You", "Take Me to Your Leader's Daughter", "Walking In the Park", "The Queen of Bad Intentions", "Sweaty Betty", "Easy to Lie"], ["Artist", "Skin Alley", "Skin Alley", "Skin Alley", "Skin Alley", "Skin Alley", "Skin Alley"], ["Time", "6:53", "8:55", "6:49", "6:53", "8:11", "5:21"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - To Pagham and Beyond by Skin Alley", "title": "", "url": "https://itunes.apple.com/lt/album/take-me-to-your-leaders-daughter/id341310337?i=341310498", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00112-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 885526127, "recordOffset": 885499328, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{102646=© „Apple Inc.“, 2014. Visos teisės saugomos., 11965=Skin Alley boldly announced their arrival with their eponymous debut in March 1970. Three months after it hit the shops, the group was back in the studio working on its follow-up. It was at this point that bandmember Thomas Crimble departed for Hawkwind, with ex-Atomic Rooster bassist/flutist Nick Graham taking his place. This shake-up in the lineup led to an equally momentous shift in sound, as the new-look band now moved toward a more improvisational style. Still, their influences hadn't changed, and their love of American blues was if anything even more evident on their second album, To Pagham & Beyond, than their first. The point was driven home on the opening track, \"Big Brother Is Watching You,\" with its focus on the riff and wailing harmonica. This was a blues that fed into R&B and then rock & roll; \"Easy to Lie,\" in contrast, exquisitely illustrated the links between the blues and jazz, the stripped-back blues suddenly exploding into inspired improvised jazz passages before fading back into minimalistic blues. \"Sweaty Betty\" takes the opposite approach, its pure jazz agilely slipping into revved-up R&B-flavored rock. As for R&B itself, \"Walking in the Park\" is not just a tribute to Stax, but a perfect rendition of its style, and explains just how the band landed on that label later in its career (the first white group to garner such an honor). Yet this was only one of Alley's angles; elsewhere in the set they travel into Canterbury territory, albeit in a tough fashion far removed from that scene's comparatively laid-back sound. And then there's the epic \"Take Me to Your Leader's Daughter,\" the set's most inspired number, combining Arab-flavored passages, tribal drumming, and jazzy turns with stunning flute, piano, and brass solos. Amazingly, this inspired album elicited little notice at the time; it remains, however, a classic of the age, and sounds just as fresh today as when first released.}", "lastModified": "Sat, 01 Aug 2015 04:01:17 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Skin Alley To Pagham and Beyond iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from To Pagham and Beyond by Skin Alley, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes", "textAfterTable": "6 Songs Album Review Skin Alley boldly announced their arrival with their eponymous debut in March 1970. Three months after it hit the shops, the group was back in the studio working on its follow-up. It was at this point that bandmember Thomas Crimble departed for Hawkwind, with ex-Atomic Rooster bassist/flutist Nick Graham taking his place. This shake-up in the lineup led to an equally momentous shift in sound, as the new-look band now moved toward a more improvisational style. Still, their influences hadn't changed, and their love of American blues was if anything even more evident on their second album, To Pagham & Beyond, than their first. The point was driven home on the opening track, \"Big Brother Is Watching You,\" with its focus on the riff and wailing harmonica. This was a blues that fed into R&B and then rock & roll; \"Easy to Lie,\" in contrast, exquisitely illustrated the links between the blues and jazz, the stripped-back blues suddenly exploding into inspired improvised jazz passages before fading back into minimalistic blues. \"Sweaty Betty\" takes the opposite approach, its pure jazz agilely slipping into revved-up R&B-flavored rock. As for R&B itself, \"Walking in the Park\" is not just a tribute to Stax, but a perfect rendition of its style, and explains just how the band landed on that", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}