{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13"], ["Name", "What Makes You Beautiful", "Gotta Be You", "One Thing", "More Than This", "Up All Night", "I Wish", "Tell Me a Lie", "Taken", "I Want", "Everything About You", "Same Mistakes", "Save You Tonight", "Stole My Heart"], ["Artist", "One Direction", "One Direction", "One Direction", "One Direction", "One Direction", "One Direction", "One Direction", "One Direction", "One Direction", "One Direction", "One Direction", "One Direction", "One Direction"], ["Time", "3:18", "4:04", "3:17", "3:48", "3:12", "3:35", "3:15", "3:55", "2:51", "3:35", "3:37", "3:24", "3:25"], ["Price", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Up All Night by One Direction", "title": "", "url": "https://itunes.apple.com/gb/album/one-thing/id471262185?i=471262188&affToken=Capital_Miscellaneous&ign-mpt=uo%3D4", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00318-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 875971395, "recordOffset": 875942349, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{28045=Formed: 2010 in London, England, 27484=I'm absolutely in love with this album; although I would recommend buying the yearbook edition as it has more tracks! These are some of the best songs I've ever heard, and didn't disappoint me after waiting for over a year! Can't wait to see them on tour in January, especially with a first album like this. Well done boys! :') twitter:LucaRuthStylesX, 130980=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 04:05:21 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist One Direction Up All Night iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Up All Night by One Direction, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "13 Songs Editors’ Notes With boyish looks reminiscent of The Osmonds and pop-hooks delivered in heavy doses of tween-friendly flirtations, a boy band like One Direction couldn’t have happened without mentorship from Simon Cowell, everyone’s favorite critic. Zayn Malik, Harry Styles, Niall Horan, Louis Tomlinson, and Liam Payne auditioned for England’s popular talent show The X Factor as individual contestants, but Cowell suggested they form a five-piece vocal group. One Direction's debut album, Up All Night, opens with “What Makes You Beautiful”, a flirty pop hit with flawless harmonies and grappling hooks. The group moves closer to the dance floor with the pulsing “Tell Me a Lie”, a Kelly Clarkson–penned song that contrasts uplifting melodies with lovelorn lyrics of burning adolescent urgency. The singers prove their prowess as balladeers with “Gotta Be You”, an elegantly produced number backed by lush string arrangements and soaring, congruent vocal magic coming together to make one voice. The lads are also adept at belting out arena-sized anthems, as evidenced by the epic “One Thing” “Stole My Heart” closes with vintage house production. Customer Reviews Terrible.           by Mudijsjjdkdkdc", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}