{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"], ["Name", "Drinkin' Bone", "You Feel Good", "How'd I Wind Up In Jamaica", "Tiny Town", "The Truth About Men", "Making Memories of Us", "That's What Keeps Her Getting By", "When You Go", "Baby Put Your Clothes On", "Somewhere I Wanna Go", "Ten Rounds With Jose Cuervo (Live)"], ["Artist", "Tracy Byrd", "Tracy Byrd", "Tracy Byrd", "Tracy Byrd", "Tracy Byrd", "Tracy Byrd", "Tracy Byrd", "Tracy Byrd", "Tracy Byrd", "Tracy Byrd", "Tracy Byrd"], ["Time", "2:11", "3:26", "3:14", "3:25", "2:58", "3:44", "3:45", "3:21", "3:10", "3:58", "3:40"], ["Price", "$1.29", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$1.29"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - The Truth About Men by Tracy Byrd", "title": "", "url": "https://itunes.apple.com/us/album/the-truth-about-men/id298391932", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00220-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 857142559, "recordOffset": 857114957, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{20612=Tracy Byrd is a bit of a goofball, which is a compliment. Unlike his second wave new traditionalist brethren, he realizes that a good part of country music is having a good time, and he refuses to take things too seriously. Add to that a good taste in songwriters — something that can be particularly difficult for his peers, especially in terms of ballads — and you have somebody who's a reliable record maker, somebody who always has a good joke and a good ballad at hand. Since he's so consistent, he's easy to underrate, because he makes it all seem easy and he does it with a smile. A smash hit like \"Ten Rounds With Jose Cuervo\" can provide an opportunity to reassess an artist, or at least to take stock of what he has to offer, and that happened with Byrd's 2001 album, Ten Rounds, yet another solid record that stood out from the pack due to that great song. For his follow-up, 2003's The Truth About Men, Byrd could have used that big hit to try something else, but he doesn't. He sticks to his tried and true neo-honky tonk and contemporary country ballad formula. But if a formula works, why try to change it? And The Truth About Men proves that the formula does work, offering smiles and slow dances in equal measure, all delivered with an offhand, guy-next-door charm from Byrd. Sometimes the slow tunes get a little too slow, sometimes the uptempo numbers are a little too silly (the title track has a good premise but some of the jibes don't quite work, not least because the Die Hard 4 mentioned in the second verse as a film preference doesn't even exist), but these are minor quibbles since this is a fun record. It has good-time party songs like the cheerful \"Drinkin' Bone\" (which is connected to the \"party bone,\" after all) and \"How'd I Wind Up in Jamaica,\" which does Jimmy Buffett better than \"It's Five O'Clock Somewhere,\" Buffett's duet with Alan Jackson that was a smash hit the summer The Truth About Men was released, as well as good ballads like Rodney Crowell's \"Making Memories of Us.\" By the time the record closes with a live version of \"Ten Rounds With Jose Cuervo,\" you're beyond wondering why it's here and just enjoying the ride. True, this album doesn't offer much different than other Byrd records, but song for song, it's one of his finest efforts and a hell of a lot of fun., 25316=Born: December 18, 1966 in Beaumont, TX, 124033=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 08:48:44 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Tracy Byrd The Truth About Men iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from The Truth About Men by Tracy Byrd, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "11 Songs Album Review Tracy Byrd is a bit of a goofball, which is a compliment. Unlike his second wave new traditionalist brethren, he realizes that a good part of country music is having a good time, and he refuses to take things too seriously. Add to that a good taste in songwriters — something that can be particularly difficult for his peers, especially in terms of ballads — and you have somebody who's a reliable record maker, somebody who always has a good joke and a good ballad at hand. Since he's so consistent, he's easy to underrate, because he makes it all seem easy and he does it with a smile. A smash hit like \"Ten Rounds With Jose Cuervo\" can provide an opportunity to reassess an artist, or at least to take stock of what he has to offer, and that happened with Byrd's 2001 album, Ten Rounds, yet another solid record that stood out from the pack due to that great song. For his follow-up, 2003's The Truth About Men, Byrd could have used that big hit to try something else, but he doesn't. He sticks to his tried and true neo-honky tonk and contemporary country ballad formula. But if a formula works, why try to change it? And The Truth About Men proves that the", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}