{"relation": [["Title", "What is Electronic Writing?", "Understanding Video Games: the Essential Introduction", "The Oulipo: Constraints and Collaboration", "The New Media Reader", "The Language of New Media", "The Definition of Hypertext and its History as a Concept", "Prehistoric Digital Poetry: An Archaeology of Forms, 1959-1995", "New Media Poetics: As We May Think/How to Write", "How to Construct the Genre of Digital Poetry: A User Manual", "Holopoetry, Biopoetry and Digital Literature: Close Reading and Terminological Debates", "Cybertext: Perspectives on Ergodic Literature", "Computers, Cut-ups and Combinatory Volvelles: An Archaeology of Text-generating Mechanisms", "Beyond Taxonomy: Digital Poetics and the Problem of Reading"], ["Author", "Brian Kim Stefans", "Simon Egenfeldt-Nielsen, Jonas Heide Smith, Susana Pajares Tosca", "William Gillespie", "", "Lev Manovich", "George P. Landow", "Chris Funkhouser", "Adalaide Morris", "Friedrich W. Block", "Roberto Simanowski", "Espen Aarseth", "Whitney Anne Trettien", "Talan Memmott"], ["Year", "2006", "2008", "2000", "2003", "2002", "1992", "2007", "2006", "2010", "2007", "1997", "2009", "2006"]], "pageTitle": "Digital Genres: Digital Art, Electronic Literature, and Computer Games (DIKULT 103, Spring 2011) | ELMCIP", "title": "", "url": "http://www.elmcip.net/teaching-resource/digital-genres-digital-art-electronic-literature-and-computer-games-dikult-103?order=title&sort=desc", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00177-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 427693178, "recordOffset": 427684976, "tableOrientation": "HORIZONTAL", "lastModified": "Fri, 31 Jul 2015 07:19:10 GMT", "textBeforeTable": "Creative works referenced A introductory level BA course taught in the Digital Culture program at the University of Bergen. For each genre section, the course provides three-week introductions to genres of cultural artifacts particular to the network and the computer, specifically computer and network art, electronic literature, and computer games. Students in the course will learn to analyze contemporary digital artifacts on a textual and structural basis, within the general framework of genre studies. antecedents genre games electronic literature digital art Tags:  Not yet reviewed Record Status:  2011 Year:  Digital Genres: Digital Art, Electronic Literature, and Computer Games Web:  University of Bergen, Program in Digital Culture Organization:  Rita Raley", "textAfterTable": "afternoon, a story Michael Joyce After Parthenope Scott Rettberg Critical writing referenced Title Author Year What is Electronic Writing? Brian Kim Stefans 2006 Understanding Video Games: the Essential Introduction Simon Egenfeldt-Nielsen, Jonas Heide Smith, Susana Pajares Tosca 2008 The Oulipo: Constraints and Collaboration William Gillespie 2000 The New Media Reader 2003 The Language of New Media Lev Manovich 2002 The Definition of Hypertext and its History as a Concept George P. Landow", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}