{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13"], ["Name", "About Cell Block #9", "Honey I Been Thinking About You", "Sweet Somewhere Bound", "A Thing Called Rain", "Alice On the Rooftop", "Seven Jealous Sisters", "Emily's In Heaven", "Miss Madeline (3 Ways to Love Her)", "I Don't Care About My Baby", "Write a Letter Home", "Sad to Say Goodbye", "Everything to Me", "Don't Mind Me, I'm Only Dying Slow"], ["Artist", "Jackie Greene", "Jackie Greene", "Jackie Greene", "Jackie Greene", "Jackie Greene", "Jackie Greene", "Jackie Greene", "Jackie Greene", "Jackie Greene", "Jackie Greene", "Jackie Greene", "Jackie Greene", "Jackie Greene"], ["Time", "3:44", "4:45", "4:59", "4:35", "4:51", "4:12", "5:24", "5:39", "4:05", "4:47", "4:55", "6:03", "7:56"], ["Price", "$0.99", "$1.29", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Sweet Somewhere Bound by Jackie Greene", "title": "", "url": "https://itunes.apple.com/ca/album/sweet-somewhere-bound/id63395651?i=63395661&ign-mpt=uo%3D4", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00160-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 887819935, "recordOffset": 887795004, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{126517=Copyright © 2014 Apple Inc. All rights reserved., 26700=Born: November 27, 1980 in Monterey, CA}", "lastModified": "Sat, 01 Aug 2015 05:00:30 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Jackie Greene Sweet Somewhere Bound iTunes for Mac + PC Already have iTunes? Click I have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Sweet Somewhere Bound by Jackie Greene, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store…", "textAfterTable": "13 Songs Album Review Jackie Greene continued to expand his base as one of the more interesting new roots-based singer/songwriters of the early 2000s on Sweet Somewhere Bound, although the compositions were of varying quality. Certainly the best of them were satisfying, and had a wider range than many similar artists working in similar territory. His vocals had a lived-in earthiness, and his arrangements blended folk, roots rock, country, Americana, and bit of the blues without particularly favoring any certain combination. The lyrical themes do tread on some of the same areas common to singer/songwriters of the style: restless urges to escape the mundane grind he sees his community settling into, story-songs and character sketches about troubled souls, and a lament for a death of someone close to him (\"Emily's in Heaven\"). The Bob Dylan comparisons that have come up in some coverage of his work are still here, particularly in his spontaneous yet accomplished harmonica work, but not so overwhelmingly that Greene's own persona is subsumed. He really whoops it up in the jovial prison song \"About Cell Block #9\" — one of the set's highlights — but for the most part it's a more contemplative record, concerned about the state of things but not quite discouraged. Some of those songs skirt the more routine clichés of weary-gazing roots", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}