{"relation": [["Artist", "The Daylights", "Ed Sheeran", "The Heavy", "Hurts", "Mates Of State", "Mathclub", "She Wants Revenge", "Sugar + The Hi-lows", "Trent Dabbs"], ["Song Title", "Weapons", "Give Me Love", "Short Change Hero", "Devotion", "At Least I Have You", "Brand New", "Up in Flames", "Stubborn Lover", "Wrap My Mind Around You"], ["Played When", "Elena talks to Elijah in the hallway at the party.", "Elena and Damon dance, Elena and Stefan dance.", "The Originals talk to Klaus about getting daggered", "Elena arrives at the ball.", "Caroline and Elena at the Mystic Grille.", "Rebekah tells Kol she'll to kill Matt outside.", "Rebekah gets rejected by Matt at the bar.", "Kol and Rebekah plan to kill Matt.", "Klaus sees Caroline arrive at the ball."]], "pageTitle": "The Vampire Diaries Season 3 Episode 14 - Dangerous Liaisons (3x14) - Watch Online - s3 e14 Spoilers", "title": "", "url": "http://www.tvrage.com/The_Vampire_Diaries/episodes/1065137065", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00117-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 800244414, "recordOffset": 800228462, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Music Trivia: Executive producer Julie Plec described this episode as \"Salvatores in tuxedos.\" Casting: Main cast members Matt Davis (Alaric Saltzman), Steven R. McQueen (Jeremy Gilbert), Michael Trevino (Tyler Lockwood), and Kat Graham (Bonnie Bennett) do not appear in this episode. Ratings: 3.08 Million Viewers Episode Notes Read the full recap Recap The scene opens with Elena and Matt at the hospital. They are leaving, when she lets on she has changed her lock at home, and he appreciates Caroline’s ability to cope up with the loss of her dad – given the closeness she shared with him. And another update is Bonnie and her mother are safe. After they see each other off, Elena gets into her car, but something strange happens. The car won’t move after a couple of yards – as though it was being tugged from behind. When Elena steps out to find out what’s wrong in a nervous manner, she doesn’t find anything, but soon Rebecca appears and is about to kill her. However, Elena gets saved when Elija turns up grabbing Rebecca by the neck. Before long, he is laying into her – is she challenging him? Rebecca leaves spouting hatred", "textAfterTable": "Episode Quotes Damon: Can we go back in time to the old Stefan who cared if Elena lived or died? Stefan: What for? That's your job now. Caroline: Is that why you collect hybrids? A little servant army to take you places and bring you things? Klaus: You're making assumptions. Caroline: Then why do you need Tyler? Stop controlling him. Give him his life back. Klaus: You know, this has been a fun evening, but I think it's time for you to leave. Caroline: I get it. Your father didn't love you, so you assume that no one else will, either. And that's why you compel people or you sire them or you try to buy them off, but that's not how it works. You don't connect with people, because you don't even try to understand them. Elena: What are you doing here? I know your mom's rules. No hurting the locals. Rebekah: Get over yourself, Elena. It's not all about you. Stefan: What, you think I want to be this person? I hurt you, Elena. I bit you. I hate myself for what I did to you. Elena: Then show it. Do something. Stefan,", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}