{"relation": [["", "", "", "", "", "", ">>", ""], ["", "1.", "2.", "3.", "4.", "5.", "6.", "7."], ["Date", "Apr 12, 13:34", "Apr 12, 16:31", "Apr 12, 17:10", "Apr 12, 18:40", "Apr 12, 21:54", "Apr 13, 08:42", "Apr 13, 09:42"], ["Subject", "Re: Ships Ahoy - Men of War: Condemned Heroes", "Re: Ships Ahoy - Men of War: Condemned Heroes", "Re: Ships Ahoy - Men of War: Condemned Heroes", "Re: Ships Ahoy - Men of War: Condemned Heroes", "Re: Ships Ahoy - Men of War: Condemned Heroes", "Re: Ships Ahoy - Men of War: Condemned Heroes", "Re: Ships Ahoy - Men of War: Condemned Heroes"], ["Author", "SpectralMeat", "Numinar", "KilrathiAce", "SpectralMeat", "bfg9000", "KilrathiAce", "SpectralMeat"]], "pageTitle": "Ships Ahoy - Men of War: Condemned Heroes - Blue's News Comments", "title": "", "url": "http://www.bluesnews.com/cgi-bin/board.pl?action=viewthread&boardid=1&threadid=131522&id=751913&view=threads", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 21, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00109-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 328206279, "recordOffset": 328189885, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{36949=News CGI copyright © 1999-2015 James \"furn\" Furness & Blue's News. All rights reserved., 37152=Chatbear v1.4.0/blue++: Page generated 31 July 2015, 03:53. Chatbear Announcements., 16631=Men of War: Condemned Heroes is the newest installment in the best-selling Men of War series which fuses tactical thinking with the action-packed direct control mode. Men of War: Condemned Heroes tells the story of one of the infamous Soviet penal battalions during the WWII. These battalions are famous for being formed under Stalin’s “No step back!” order #227. They consisted of court-martialed officers that were given a chance to redeem their crimes, or incompetence, in blood by serving as the lowest enlisted rank in a battalion that was assigned the most dangerous tasks. These battalions’ images are surrounded by many myths, and this game tells the truth about these regiments based on real evidence from their former members. Take command of one of these notorious companies and lead it to victory against all odds through most of the war on the Eastern front. Fight from desperate battles in 1942 in the area of Volyn in the Ukraine, to the massive operation “Bagration” in the Brest area, Magnush bridgehead and Warsaw area in Poland and finally to attacks on the German Altdam and Stettin near the end of the war., 35034=Copyright © 1996-2015 Stephen Heaslip. All rights reserved. All trademarks are properties of their respective owners.}", "textBeforeTable": "Men of War: Condemned Heroes is the newest installment in the best-selling Men of War series which fuses tactical thinking with the action-packed direct control mode. Men of War: Condemned Heroes tells the story of one of the infamous Soviet penal battalions during the WWII. These battalions are famous for being formed under Stalin’s “No step back!” order #227. They consisted of court-martialed officers that were given a chance to redeem their crimes, or incompetence, in blood by serving as the lowest enlisted rank in a battalion that was assigned the most dangerous tasks. These battalions’ images are surrounded by many myths, and this game tells the truth about these regiments based on real evidence from their former members. Take command of one of these notorious companies and lead it to victory against all odds through most of the war on the Eastern front. Fight from desperate battles in 1942 in the area of Volyn in the Ukraine, to the massive operation “Bagration” in the Brest area, Magnush bridgehead and Warsaw area in Poland and finally to attacks on the German Altdam and Stettin near the end of the war. store section has a list of digital distributors who are carrying the game. Here's a bit on the game: Men of War: Condemned Heroes, the latest installment in their ongoing series of World War II action/strategy games.", "textAfterTable": "bfg9000 wrote on Apr 12, 2012, 21:54: So it goes like this. MoW1>Assault Squad>Red Tide>Condemned?>Vietnam Vietnam did so much damage to a great franchise, while AS teased us with its optimisation while at the same time yanking away the single player campaign. Red Tide was way before Assault Squad as far as tech and when it was released.     \"On 2646.215 I myself attacked & destroyed TCS Tiger's Claw in my Jalthi heavy fighter\" Bakhtosh Redclaw Nar Kiranka", "hasKeyColumn": true, "keyColumnIndex": 3, "headerRowIndex": 0}