{"relation": [["Title", "Castlevania", "Castlevania", "Akumajou Dracula"], ["Publisher", "Konami Digital Entertainment", "Konami Digital Entertainment", "Konami Digital Entertainment"], ["Region", "Europe", "North America", "Japan"], ["Date", "23rd March 2007", "30th April 2007", "17th July 2007"], ["Distribution", "Retail", "Retail", "Retail"]], "pageTitle": "Castlevania (Wii) - Sales, Wiki, Cheats, Walkthrough, Release Date, Gameplay, ROM on VGChartz", "title": "", "url": "http://www.vgchartz.com/game/17682/castlevania/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00020-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 813474374, "recordOffset": 813466172, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{3265=Castlevania, known in Japan as Akumajo Dracula, is an action-platformer that was developed and published by Konami. Initially, it was released for the Famicom Disk System in Japan in September of 1986, but was later ported to the Nintendo Entertainment System in North America in May of 1987 and then in Europe in 1988., 15427=About Us | Terms of Use | Privacy Policy | Advertise | Staff | Contact © 2006-2015 VGChartz Ltd. All rights reserved. US}", "textBeforeTable": "Release History Comments Summary Genre: Platform Developer: Konami Digital Entertainment Also on: Nintendo 64, Nintendo Entertainment System, Microsoft Windows Platform: Wii N/A Global Total as of 27th Jun 2015 (units): Castlevania //--> document.write('');", "textAfterTable": "Game Overview Castlevania, known in Japan as Akumajo Dracula, is an action-platformer that was developed and published by Konami. Initially, it was released for the Famicom Disk System in Japan in September of 1986, but was later ported to the Nintendo Entertainment System in North America in May of 1987 and then in Europe in 1988. The game is the very first one released in the Castlevania series of games, which usually focuses on hunting down Dracula. It has been ported to a variety of different platforms, including but not limited to the Commodore 64, Game Boy Advance, Wii's Virtual Console, as well as the Nintendo 3DS's Virtual Console. Castlevania has been highly rated by numerous publications, including being rated as the 22nd best game made on a Nintendo system by Nintendo Power. Castlevania Wiki on Gamewise Overview Release Dates Credits Walkthrough Achievements Cheats Discussion", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}