{"relation": [["Artist", "Uncle Dave Macon", "Morrison Twin Brothers String Band", "Ashley's Melody Men", "A.E. Ward & HIs Plowboys", "Bascom Lamar Lunsford", "Frank Jenkins", "Stoneman's Blue Ridge Corn Shuckers", "Grayson & Whitter", "Dempson & Denmon Lewis", "Ola Belle Reed", "Stefan Grossman", "National Fraternity Chorus", "The Quartones", "Oscar Brand", "Michael Cooney", "Dave Bromberg & John Hartford", "Bruce Phillips", "Bill Thomas", "Jocelyn Pettit", "Dave Van Ronk", "Steve Goodman"], ["Title", "Rock About My Saro Jane", "Dry & Dusty", "Bath House Blues", "I'm Going To Leave Old Arkansas", "Little Turtle Dove", "Home Sweet Home", "Serenade In the Mountains", "I've Always Been A Rambler", "Bull At The Wagon", "Over Yonder In The Graveyard", "Louis Collins", "The Whiffenpoof Song", "The Rhyme of the Chivalrous Shark", "Good Peanuts / I Don't Want No More Of Army Life", "Be Kind To Your Parents", "The Holdup", "Children's Liberation Song", "The Longest Train", "Niel Gow's Lament", "Green Rocky Road", "Chicago Bust Rag"], ["Album", "Early Recordings", "Echoes of the Ozarks", "Echoes of the Ozarks", "Echoes of the Ozarks", "Mountain Banjo", "Mountain Banjo", "A Day In The Mountains", "Recordings of Grayson & Whitter", "Texas Farewell", "Ola Belle Reed & Family", "Finger-Pickinng Guitar", "Required Singing", "Required Singing", "Everybody Sing!", "A Place To Be", "A Place To Be", "You Got Magic", "Folk & Music", "", "Philadelphia Folk Festival", "Gathering At Earl of Old Town"], ["Label", "County 521", "County 518", "County 518", "County 519", "County 515", "County 515", "County 512", "County 513", "County 517", "Rounder 0077", "Kicking Mule 112", "Epic", "Epic", "Riverside", "Biograph", "Biograph", "Biograph", "Channing Murray", "", "Flying Fish", "Mountain Railroad"]], "pageTitle": "KBOO | Community Radio for Portland and beyond", "title": "", "url": "http://kboo.org/playlists/8421?page=532", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00300-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 139767771, "recordOffset": 139738793, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{6947=Portland Story Theater was launched in 2004 to bring the urban community together for a unique performance experience, telling tales that stimulate the mind and rouse the heart. We are a grass-roots operation, building awareness and appreciation for narrative. In late 2009, we established ourselves as a not-for-profit business. PST uses a unique collaborative approach to produce shows of people performing stories drawn from real-life experiences. We also offer workshops and one-on-one coaching for people who want to learn how to tell stories. Portland Story Theater has been recognized by The Oregonian for our groundbreaking work that \"keeps audiences entranced from start to finish.\" <?xml:namespace prefix = o />}", "TableContextTimeStampAfterTable": "{120130=Audio for this broadcast can be found at: http://laruletaradio.wordpress.com/2010/12/21/mask-enciso-briseno-stockh..., 134838=Copyright © 2012 KBOO Community Radio | Copyright Policy | Community Guidelines | Website Illustration & Design by: KMF ILLUSTRATION, 111297=Regulations –  In 1945, 28808=Recording of this show can be found at: http://laruletaradio.files.wordpress.com/2010/12/01-a-diffrent-nature-3_..., 54681=Storyteller, monologist, narrative artist ... whatever you want to call it, Lynne Duddy tells stories. She's a self-described cross between Laurie Anderson and Linda Barry. Lynne co-founded PST in 2004 to give adults a chance to have a sense of connection through stories. She recently participated in the First National Story Slam in Chicago and is now on her way to LA to the National Storytelling Network Fringe Festival to share her new piece, \"There's No Place Like Home.\"  Lynne is the producer of Singlehandedly, Portland's Solo Performance Festival and she's an ordained minister of the Church of Sexual Healing. She's native to Portland, is learning to play the mbira, and enjoys hanging out with her dog in the garden. She currently lives in Portland, Oregon., 126415=Latest newsletter: May 2015, 56939=His very first poetry reading of his own work was held on September 25, 2009 at the Manhattan Café in Portland, Oregon. The proprietor of the café Angela Snow was so enthralled by emmett’s poetry that she opened her cafe for an evening of poetry called “The Poetry of Emmett Wheatfall: Imagine with Me.” It was a wonderful evening, with a full house of friends and guests who were inspired by his poetic artistry. Subsequent to that time emmett has written numerous poems as well as recorded two CD’s. The first CD is entitled “When I Was Young” and the second “I Speak.” His first CD release concert was called “The Toast of the Town” and performed to a standing room only audience on January 27, 2010 at Portland's premier jazz club Jimmy Mak’s. The musicians who recorded the album with him and performed at the CD release concert were Gordon Lee, pianist, Andre St. James, Upright bass, Ed Coleman III, drums, Noah Peterson, alto and soprano saxophone. At this time emmett continues to read, write, study, and perform poetry., 58581=Friday, July 2nd at TaborSpace 5441 SE Belmont Portland, OR 97215}", "lastModified": "Fri, 31 Jul 2015 07:50:44 +0000", "textBeforeTable": "07/03/2010 Air date:  Country Categories: A Categorized Program Not playlist for 07/03/2010 view full schedule All Black Everything 3:00am-5:30am The Sacred Circle \"TEMENOS\" Mobile Support Archives Listen Schedule Programs   Audio Options Listen Now! Events", "textAfterTable": "Dr. Zomb's Stereo Obscura playlist for 07/02/2010 Program name:  Dr. Zomb's Stereo Obscura Air date:  07/02/2010 The Bran Flakes - Praise The Lord - Hey, Won't Someone Come And Play? The Bran Flakes - Hi! - I Have Hands The Bran Flakes - Butterfly Rodeo - I Have Hands The Bran Flakes - KLAM - I Have Hands The Bran Flakes - Howdy Folks - Porky Pig EP The Bran Flakes - The Only Word He Knew Was Barbeque - Porky Pig EP Bran Flakes Interview part I* The Bran Flakes - Dgg Dgg Dgg Dgg - Porky Pig EP The Bran Flakes - The Bowler's Lament - Porky Pig EP The Bran Flakes - Can't You Dig The Sunshine - Porky Pig EP The Bran Flakes - Oil Filters - Porky Pig EP Bran Flakes Interview part II The Bran Flakes - Turn The Channel, It's Another Commercial - Commercial Ad Hoc Comp. The Bran Flakes - What It's All About - I Have Hands The Bran Flakes - Dance Of The Sugarsnap", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}