{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15"], ["Name", "Rio After Dark", "Alagoas", "Meditation", "Viola Fora de Moda", "Summer Days", "La Cumbia", "Anos Dourados", "Renovacao", "Rainbow", "O Que Vier Eu Traco", "Sem Legenda", "Forever", "O Tempo e O Lugar", "Serrado", "You've Got a Friend"], ["Artist", "Ana Caram", "Ana Caram", "Ana Caram", "Ana Caram", "Ana Caram", "Ana Caram", "Ana Caram", "Ana Caram", "Ana Caram", "Ana Caram", "Ana Caram", "Ana Caram", "Ana Caram", "Ana Caram", "Ana Caram"], ["Time", "3:55", "4:04", "3:37", "6:06", "4:49", "4:45", "4:05", "3:16", "4:20", "2:11", "2:56", "3:23", "4:22", "2:35", "4:17"], ["Price", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Rio After Dark by Ana Caram", "title": "", "url": "https://itunes.apple.com/gb/album/rio-after-dark/id256078859", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00196-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 875778683, "recordOffset": 875757794, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{95492=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 08:37:28 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Ana Caram Rio After Dark iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Rio After Dark by Ana Caram, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "15 Songs Album Review In stylistic terms, large portions of Ana Caram's first U.S. album could easily have been recorded in 1962; it's as if time had stood perfectly still since \"Desafinado\" became a hit. Yet this is all for the good for this Antonio Carlos Jobim protegé, who can comfortably give material by the more contemporary writer Djavan, and even Carole King's \"You've Got a Friend,\" the bossa nova treatment. Like most seductive Brazilian female singers, Caram is just a bit off-pitch and gets away with it. She also plays guitar skillfully in the Joao Gilberto rhythmic manner, and occasionally writes her own tunes (\"Renovacao,\" \"Rainbow\") in an attractive classic bossa nova idiom. The revered Jobim sits in on piano and contributes a few vocal harmonies on two of his songs (\"Meditation,\" \"Anos Dourados\"); the Chesky recording also diligently picks up his groaning. Paquito D'Rivera chirps on clarinet in the tongue-twisting \"O Que Vier Eu Traco\" and turns up on alto sax on Paulo Jobim's first-rate \"La Cumbia,\" phrasing in the lilting Getz manner though he can't help but slip in a bop run or two. Steve Sacks plays low-key, moaning alto flute on several tracks, and Carlos Alberto de Oliveira and Café handle the delicate percussion. The production is typical low-key, spare-textured, painstakingly recorded Chesky fare — and", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}