{"relation": [["7.5' Quadrangle Name", "Banner", "Edgehill", "Ironton", "Johnson Mountain", "Johnson Shut-Ins"], ["Precent Completed", "40", "30", "20", "20", "100"], ["Author", "Berry, A. W., Jr. (C)", "Berry, A. W., Jr. (C)", "Berry, A. W., Jr. (C)", "Berry, A. W., Jr. (C)", "Berry, A. W., Jr. (C)"], ["Publication", "RI-61", "RI-61", "RI-61", "RI-61", "RI-61"], ["Date", "1976", "1976", "1976", "1976", "1976"], ["Theme", "Bedrock Geology", "Bedrock Geology", "Bedrock Geology", "Bedrock Geology", "Bedrock Geology"], ["Scale", "90000", "90000", "90000", "90000", "90000"], ["Counties", "Iron; Washington", "Iron; Reynolds", "Iron", "Iron; Washington", "Iron; Reynolds"]], "pageTitle": "Rolla Quandrangle Map RO7603- DNR", "title": "", "url": "http://dnr.mo.gov/geology/statemap/rolla/ro7603.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00055-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 78895670, "recordOffset": 78887468, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{433=The name on the map may differ from that in the USGS data base. When ordering a geologic map, whether it is a single or multiple quad, use the above Publication Order Number. Entries below refer to all quads included on this map. This image is a low resolution display; however, the actual map you would receive will be of a much higher quality. For best viewing, adjust your computer monitor to display at 1024 by 768.}", "TableContextTimeStampAfterTable": "{4626=Geological Survey Program 111 Fairgrounds Road PO Box 250 Rolla, MO 65402-0250 800-361-4827 573-368-2100 Contact Us}", "textBeforeTable": "The name on the map may differ from that in the USGS data base. When ordering a geologic map, whether it is a single or multiple quad, use the above Publication Order Number. Entries below refer to all quads included on this map. This image is a low resolution display; however, the actual map you would receive will be of a much higher quality. For best viewing, adjust your computer monitor to display at 1024 by 768. Rolla 2 Degree Quad Index Maps and Publications Order Form  |  Missouri Geologic Map Index  |  USGS National Geologic Map Data Base Publication Order Number - RO7603 - Price $5.00 Calendar of Events Online Services Laws and Regulations Publications Forms and Permits Water Resources Center Water Protection Program State Historic Preservation Office Solid Waste Management Program Soil and Water Conservation Program Regional Offices Missouri State Parks Missouri Geological Survey Land Reclamation Program Human Resources - Jobs Hazardous Waste Program Geological Survey Program Environmental Services Program Division of Environmental Quality Air Pollution Control Program Programs", "textAfterTable": "Although all data in this data set have been compiled by the Missouri Department of Natural Resources, no warranty, expressed or implied, is made by the department as to the accuracy of the data and related materials. The act of distribution shall not constitute any such warranty, and no responsibility is assumed by the department in the use of these data or related materials. This image is meant to serve only as a representation of the actual map you would receive when placing your order with our publications desk or by submitting the on line order form. Missouri Geological Survey Home Page Education Environmental Assistance Unit Environmental Geology Section Forms Geological Survey Program Geologic Map Index Geologic Resources Section GeoSTRAT Land Reclamation Program Missouri Geology Store Missouri Mine Maps Oil and Gas Wells Rock Core Library and Research Center Water Resources Center Water Tracing Waste Water and Spill Site Investigations Water, Heat Pump & Monitoring Wells Wellhead Online Services Contact Information Geological Survey Program 111 Fairgrounds Road PO Box", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}