{"relation": [["Resource", "PARC Polarity Lexicon", "Gazetteer from TREC", "DFKI Geographic Ontology (to be released)", "Geo", "Regex", "Syntactic rule base (to be released)", "Polarity rule base (to be released)", "Lexical-Syntactic rule base", "OPENU Collection", "Abbr", "UAIC Negation_list", "DLSIUAES Negation_list", "UAIC Quantifier_list", "FBKirst StopWord list", "IKOMA Dictionary of Named Entities Acronyms and Synonyms"], ["Type", "Lexical DB", "Gazetteer", "Ontology", "Collection of Entailment Rules", "Collection of Entailment rules", "Collection of Entailment Rules", "Collection of Entailment Rules", "Collection of Entailment Rules", "Collection of Entailment Rules and Patterns", "Collection of rules for abbreviation", "Negation rules", "List of negative terms", "List of quantifiers", "List of frequent words", "Dictionary of Named Entities Acronyms and Synonyms"], ["Author", "PARC - Palo Alto Research Center", "NIST - National Institute of Standards and Technology", "DFKI - German Research Center for Artificial Intelligence", "Bar-Ilan University; Tel-Aviv University", "Bar-Ilan University; Tel-Aviv University", "Bar-Ilan University; Tel-Aviv University", "Bar-Ilan University; Tel-Aviv University", "Bar-Ilan University; Tel-Aviv University", "Open University", "Bar-Ilan University; Tel-Aviv University", "„Al. I. Cuza“ University, Iasi, Romania", "University of Alicante", "„Al. I. Cuza“ University, Iasi, Romania", "FBK-Irst; University of Trento - Italy", "IKOMA; NEC Corporation, Takayama, Ikoma, Nara, Japan"], ["Brief description", "Verbs classification with respect to semantic polarity", "Cities and other geographical names", "Ontology containing geographic terms and two kinds of relations: the directional part-of relation, and the equal relation for synonyms and abbreviations of the same geographic area (e.g the United Kingdom, the UK, Great Britain, etc.)", "Meronymy entailment rules, based on TREC’s TIPSTER gazetteer.", "Small set of entailment rules based on regular expressions, intended to address lexical variability involving temporal phrases", "A manually-composed collection of entailment rules which define parse tree transformations. The rules cover generic syntactic phenomena such as appositions, conjunctions, passive, relative clause, etc. (Bar-Haim et al., AAAI-07)", "A manually-composed collection of entailment rules which detect predicates whose polarity is negative (e.g. didn't dance) or unknown (e.g. plans to dance). The rules capture diverse phenomena that affect polarity, e.g. verbal negation, modal verbs, conditionals, and certain verbs that induce negative or \"unknown\" polarity context. The latter were taken mainly from VerbNet. Extends a resource described in (Bar-Haim et al., AAAI-07)", "Extract lexical-syntactic entailment rules for predicates (verbal and nominal), including argument mapping. The resource is based on WordNet, Nomlex-Plus and Unary DIRT (Szpektor and Dagan, Coling 08)", "Collections of rules, patterns etc. for RTE purpose, extracted from Reuter corpus parsed using Minipar.", "2000 Abbreviation rules, extracted from BADC and Acronym Guide", "List of negative terms and words (verbs, adjectives, nouns) affecting modality or factuality of a infinitive verb preceded by the particle \"to\" (e.g. \"believe\",\"necessary\", \"attempt\")", "Basic list of negative terms.", "List of quantifiers affecting entailment judgment. The quantifiers are taken from a list which contains expressions like “more than”, “less than”, or words such as “over”, “under”, etc.", "A list of the 572 most frequent English words.", "Acronym dictionary constructed automatically from the corpus and a synonym dictionary that contains geographical terms."], ["PAST Users", "0", "1", "0", "0", "0", "0", "0", "0", "1", "0", "0", "0", "0", "0", "0"], ["RTE4 Users", "1", "0", "1", "0", "0", "1", "1", "1", "0", "0", "0", "0", "0", "0", "0"], ["RTE5 Users", "0", "0", "0", "1", "1", "1", "0", "0", "0", "1", "1", "1", "1", "1", "0"], ["RTE6 Users", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "0", "1"], ["Usage info", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users", "Users"]], "pageTitle": "Difference between revisions of \"RTE Knowledge Resources\" - ACL Wiki", "title": "", "url": "http://aclweb.org/aclwiki/index.php?title=RTE_Knowledge_Resources&diff=9545&oldid=8776", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00194-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 2555547, "recordOffset": 2540123, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Publicly available Resources RTE7 - Ablation Tests RTE6 - Ablation Tests RTE5 - Ablation Tests An ablation test consists of removing one module at a time from a system, and rerunning the system on the test set with the other modules, except the one tested. Ablation test are meant to help better understand the relevance of the knowledge resources used by RTE systems, and evaluate the contribution of each of them to the systems' performances. In fact, comparing the results achieved in the ablation tests to those obtained by the systems as a whole allows assessing the contribution given by each single resource. Ablation Tests RTE7 - Call for Resources RTE6 - Call for Resources In order to help the research, all the participants are invited to contribute, sharing their own resources with the RTE community. Making the resources available to be used by other systems has several advantages. On the one hand, it helps improve the TE technology; on the other hand, it offers an opportunity to further test and evaluate the resource. Call for Resources 5 Footnotes", "textAfterTable": "DBpedia Ontology Open community project DBpedia is a community effort to extract structured information from Wikipedia and to make this information available on the Web. The DBpedia knowledge base currently describes more than 2.9 million things in 91 different languages and consists of 479 million pieces of information. 0 0 1 0 Users DIRT Paraphrase Collection Collection of paraphrases University of Alberta DIRT (Discovery of Inference Rules from Text) is both an algorithm and a resulting knowledge collection. The DIRT knowledge collection is the output of the DIRT algorithm over a 1GB set of newspaper text. 2 4 3 4 Users TEASE Collection Collection of Entailment Rules Bar-Ilan University Output of the TEASE algorithm 0 0 0 0 Users BADC Acronym and Abbreviation List Word List BADC (British Atmospheric Data Centre) Acronym and", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}