{"relation": [["Author", "RaSeb", "RaSeb", "RaSeb", "RaSeb", "RaSeb"], ["Title", "eb_from_a_to_c", "Dalaama Poo", "Electro Specter", "Burning Ness", "Evil"], ["Description", "Poem/Song", "Poo completing his Mu Training.", "The Electro Specter.", "Did Ness' house catch on fire? SOMEONE SAVE THE PHOTO ALBUM!", "A new take on Giygas."], ["Date", "1/7/05", "2/9/05", "2/9/05", "2/9/05", "2/9/05"], ["Rank", "0.00", "0.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=14561&stuff=DateASC", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00128-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 230581617, "recordOffset": 230573415, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> 1 < Other Submissions by RaSeb In conclusion, I want to say that this is only my opinion. Perhaps there will be some people who will disagree with the content of this article. If so, That’s a good thing because it will be an occasion to expand my theory of what a good article is. The first factor is style. Writing very short sentences like ?I like my dog. My name is Skip. Skip likes peanut butter.? is good for school essays if you don’t want to make too many mistakes? Here, you’re allowed to be a bit more risky and test your abilities to make longer and more stylistic sentences. Of course, if your article is FULL of mistakes (about one per line), There’s a good chance that people won’t like your article very much. The second factor is originality. You don’t need to have the most original subject to make an original article. You can write about a subject as overused as ?who is Ness? dad?? If you can bring the subject in a different way than everybody else, it might be a pretty good article. If you have an original subject, its even better! There’s also one more", "textAfterTable": "1 2 3 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day. Activities:", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}