{"relation": [["Title", "Mario Kart 64", "Mario Kart 64", "Mario Kart 64"], ["Publisher", "Nintendo", "Nintendo", "Nintendo"], ["Region", "Japan", "North America", "Europe"], ["Date", "14th December 1996", "10th February 1997", "24th June 1997"], ["Distribution", "Retail", "Retail", "Retail"]], "pageTitle": "Mario Kart 64 (Nintendo 64) - Sales, Wiki, Cheats, Walkthrough, Release Date, Gameplay, ROM on VGChartz", "title": "", "url": "http://www.vgchartz.com/game/1253/mario-kart-64/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00326-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 824507283, "recordOffset": 824492710, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{17052=About Us | Terms of Use | Privacy Policy | Advertise | Staff | Contact © 2006-2015 VGChartz Ltd. All rights reserved. US, 4225=Mario Kart 64 is a racing game developed and published by Nintendo EAD for the Nintendo 64. It is the second installment in the Mario Kart series. It was released in 1996 in Japan and in 1997 in North America and Europe. In January 2007, Mario Kart 64 was released on Nintendo's Virtual Console service for the Wii.}", "textBeforeTable": "Release History 9.87m = Global 1.5% 0.15m + Rest of the World: 22.6% 2.23m + Japan: 19.6% 1.94m + Europe: 56.2% 5.55m North America: Total Units Comments Japan Summary Genre: Racing Developer: Nintendo EAD Also on: Wii Platform: Nintendo 64 9.87m Global Total as of 27th Jun 2015 (units): Mario Kart 64 //--> document.write('');", "textAfterTable": "Game Overview Mario Kart 64 is a racing game developed and published by Nintendo EAD for the Nintendo 64. It is the second installment in the Mario Kart series. It was released in 1996 in Japan and in 1997 in North America and Europe. In January 2007, Mario Kart 64 was released on Nintendo's Virtual Console service for the Wii. Mario Kart 64 is the sequel to Super Mario Kart for the Super Nintendo Entertainment System. Changes from the original include the move to 3D graphics and the inclusion of four-player support. Players take control of characters from the Mario universe, who race around a variety of tracks with items that can either harm opponents or aid the user. The move to three-dimensional graphics allowed for track features not possible with the original game's Mode 7 graphics, such as changes in elevation, bridges, walls, and pits. However, the characters and items remained 2D pre-rendered sprites. Mario Kart 64 Wiki on Gamewise Overview Release Dates Credits Race Courses Battle Power-ups Test Page", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}