{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9"], ["Name", "So Much for Sleep", "You Know Me", "The Devil", "Swing Hard", "Cataract", "Like an Earthquake", "All I See", "Old Wizard", "Pendulum"], ["Artist", "Dawnbringer", "Dawnbringer", "Dawnbringer", "Dawnbringer", "Dawnbringer", "Dawnbringer", "Dawnbringer", "Dawnbringer", "Dawnbringer"], ["Time", "5:59", "2:50", "6:00", "3:27", "3:07", "5:19", "2:52", "5:17", "6:04"], ["Price", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Nucleus by Dawnbringer", "title": "", "url": "https://itunes.apple.com/au/album/nucleus/id393065932", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00166-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 878737019, "recordOffset": 878709844, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{114659=Copyright © 2014 Apple Inc. All rights reserved., 19555=Formed: 1995 in Malvern, PA}", "lastModified": "Sat, 01 Aug 2015 04:33:44 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Dawnbringer Nucleus iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Nucleus by Dawnbringer, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "9 Songs Album Review Dawnbringer's fourth full-length release over the course of a 15-year career, 2010's Nucleus, served as a coming-out party of sorts for this long-obscure traditional metal ensemble led by Nachtmystium, Pharaoh, and Superchrist collaborator Chris Black. Not only was the album named among the year's best in many top heavy metal publications, but Black's increasing approachability helped put his vision into better context for would-be fans, and then of course the music vindicated everything because its essentially classicist approach didn't equate with dull revisionism or lack of sonic variety. Ready for the roll call? Here we go: opening number \"So Much for Sleep\" charges across the blasted plains on galloping Iron Maiden riffs embellished by serpentine lead guitars à la Isen Torr (courtesy of Black's six-string pal Matt Johnsen); \"You Know Me\" violently pounds its stakes into the ground with the inexorable force and consistency of a steam hammer; \"The Devil\" threatens to speed off into thrash metal territory before geeking out on a jumble of riffs, Slough Feg style; \"Swing Hard\" and \"Cataract\" behave like Siamese sisters representing Dawnbringer's more gentle and melodious qualities, exposing Black's limited vocal prowess somewhat, but arguably overcoming them with his guests' elegiac electric and acoustic guitar work; \"Like an Earthquake\" offsets seismic punctuations with driving down-strums and surprisingly singable lyrics;", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}