{"relation": [["", "101", "102", "103", "104", "105", "106", "107", "108", "109", "110", "111", "112", "113", "114", "115", "116", "117", "118", "119", "120", "121", "122", "123", "124", "125"], ["Name", "Hot Again", "Auction Block", "Sliding", "Sweet Life", "No Threat", "Israel's King", "Rough Inna Town (feat. Luciano)", "There's No Hope", "Rastaman", "Repatriation", "Hurry Up & Come", "Bruck Loose", "One Bright Day", "Morning Ah Come", "Namibia", "Mr. Neck Tie Man", "Who Jump the Gun", "The Weed", "A Business", "I Can't Help", "Love Rain", "No Faith", "How Do You Do", "One Way", "Burn Satan"], ["Album", "Feel the Power", "Feel the Power", "Feel the Power", "Strictly the Best, Vol. 28", "Little Sound Boy", "Israel's King", "Israel's King", "Israel's King", "Israel's King", "Israel's King", "Israel's King", "Israel's King", "Israel's King", "Israel's King", "Israel's King", "One Way", "One Way", "One Way", "One Way", "One Way", "One Way", "One Way", "One Way", "One Way", "One Way"], ["Time", "4:16", "3:45", "3:51", "3:47", "2:56", "3:54", "3:56", "4:03", "4:03", "4:15", "3:48", "3:48", "3:58", "4:02", "4:03", "4:04", "3:39", "3:44", "4:16", "3:57", "4:03", "3:59", "4:13", "3:59", "4:10"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Cocoa Tea", "title": "", "url": "https://itunes.apple.com/cy/artist/cocoa-tea/id184526155?trackPage=5", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00246-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 881692911, "recordOffset": 881669064, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{37521=Cocoa Tea was one of the few early dancehall stars to carve out a consistent, productive career as the genre evolved over the years. His cool-toned, laid-back vocals were perfect for sweet, smooth lovers rock, and gave him a distinct identity amid his more aggressive peers. Still, he was also capable of toughening up his sound on his cultural protest material, which was often sharply perceptive. Tea was born Calvin Scott on September 3, 1959, in Rocky Point, a small town in Jamaica's Clarendon parish. He sang in his church and school choirs as a youth, and made his first recordings for producer Willie Francis in 1974 at the mere age of 14; one single, \"Searching in the Hills,\" was released under his given name, but went nowhere. He spent the next few years working as a racehorse jockey, then as a fisherman; during the latter occupation, he began to rediscover his musical ambitions, performing with the traveling sound systems that passed through local dancehalls., 35525=In 1989, a supergroup featuring Tea, Shabba Ranks, and Home T recorded together under the auspices of both King Jammy and Gussie Clarke. The resulting album, Holding On, was a major hit in Jamaica, as were the singles \"Pirates Anthem\" and \"Who She Love.\" Still an extremely viable solo artist, Tea recorded the biggest socially conscious hit of his career to date, \"Riker's Island,\" in 1991, and supported it with an album of the same name. His strident anti-Gulf War commentaries \"Oil Ting\" and \"No Blood for Oil\" were banned on radio in Jamaica and the U.K.; the latter was included on a second supergroup album, Another One for the Road, for which Cutty Ranks replaced Shabba. Tea's next major solo hit was the lovers rock tune \"Good Life,\" produced by Philip \"Fatis\" Burrell. He was able to maintain a steady, solid level of popularity into the late '90s, with hits for Burrell (1996's \"Israel King,\" 1997's King Sporty cover \"I'm Not a King\") and Bobby \"Digital\" Dixon (1995's \"Holy Mount Zion\"), plus a collaboration with Cutty Ranks on the 1997 Bob Marley cover \"Waiting in Vain.\" Much of his mid-'90s material was collected on Holy Mount Zion, which was released in 1997 by the legendary Motown label. Further albums included 1998's One Way and 2001's Feel the Power., 36505=In 1983, he moved to Kingston and adopted the performing name Cocoa Tea, after the Jamaican term for hot chocolate (later alternate spellings would include Coco Tea and Coco T). He soon met top dancehall producer Henry \"Junjo\" Lawes, and recorded a series of hit singles that included \"Rocking Dolly,\" \"I Lost My Sonia,\" \"Informer,\" and \"Can't Stop Cocoa Tea.\" His first album, Weh Dem a Go Do...Can't Stop Coco Tea, was released in 1985 and compiled many of his previous successes (a slightly different version, Rocking Dolly, was later issued in the U.S.). Lawes moved his operation to New York, and King Jammy became Tea's primary producer just as he was beginning to expand his focus to Rastafarian lyrical themes. The results included two albums, 1986's The Marshall and 1987's Come Again, and hit singles in those two title tracks, \"Tune In,\" and \"Settle Down,\" among others.}", "TableContextTimeStampAfterTable": "{51461=09 March 1959 in Kingston, Jamaica, 59495=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 04:53:56 GMT", "textBeforeTable": "Top Songs 3 2 1 View In iTunes Yes We Can 20. View In iTunes Reggae Anthology: The Sweet Sound of Cocoa Tea 19. View In iTunes Woman - Single 18.", "textAfterTable": "Previous 1 2 3 4 5 6 7 8 9 10 Next Birth Name: Calvin George Scott Born: 09 March 1959 in Kingston, Jamaica Genre Reggae Years Active: '70s, '80s, '90s, '00s Influencers Dennis Brown Contemporaries Gregory Isaacs Anthony B Bob Marley Macka B Eek-A-Mouse Maxi Priest Yellowman Beres Hammond Frankie Paul Josey Wales Discover and share new apps. Follow us on @AppStore. Discover and share new music, films, TV, books and more. Follow us @iTunes and discover the music we love.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}