{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16"], ["Name", "That's My Home (Take 2)", "Medley of Armstrong Hits, Pt. 1", "I've Got the World On a String", "I Gotta Right to Sing the Blues", "High Sóciety", "Basin Street Blues", "Mahogany Hall Stomp", "St. Louis Blues", "Blue Yodel No. 9", "Long, Long Journey", "Back O' Town Blues", "Sugar", "Do You Know What It Means to Miss New Orleans?", "Ain't Misbehavin'", "Rockin' Chair", "Jack-Armstrong Blues"], ["Artist", "Louis Armstrong", "Louis Armstrong", "Louis Armstrong", "Louis Armstrong", "Louis Armstrong and His Orchestra", "Louis Armstrong", "Louis Armstrong", "Louis Armstrong", "Louis Armstrong", "Louis Armstrong", "Louis Armstrong and His Orchestra", "Louis Armstrong & Louis Armstrong & His Hot Seven", "Louis Armstrong", "Louis Armstrong", "Louis Armstrong", "Louis Armstrong"], ["Time", "3:12", "4:25", "3:15", "3:01", "3:24", "3:25", "2:35", "2:41", "2:38", "4:30", "3:15", "3:24", "2:59", "3:55", "5:14", "2:59"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,69 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Louis Armstrong: The Best of the Complete RCA Victor Recordings (1996 Remaster) by Louis Armstrong", "title": "", "url": "https://itunes.apple.com/be/album/louis-armstrong-best-complete/id258652656", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00024-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 864602279, "recordOffset": 864576512, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{2207=We are unable to find iTunes on your computer. To preview and buy music from Louis Armstrong: The Best of the Complete RCA Victor Recordings (1996 Remaster) by Louis Armstrong, download iTunes now.}", "TableContextTimeStampAfterTable": "{91209=Copyright © 2014 Apple Inc. Tous droits réservés., 31232=This 16-track collection distills a four-disc set down to one, spotlighting this generally unsung period of Armstrong's career. This period, basically 1932-1947, finds him moving from fronting a big band to forming the first versions of the smaller All-Star groups that would carry him the rest of his career. If the bands are a bit stodgy and not up to his standards of brilliance on these sides, you certainly can't fault Armstrong's performances; he's simply at the peak of his powers, blowing with an invention that didn't surface in later years. As a singer, his vocals are effusive and full of spark. Although not as well known as his early and later material, these RCA sides capture some important Armstrong, and here's a nice distillation of a peak period., 32118=Born: 04 August 1901 in New Orleans, LA}", "lastModified": "Fri, 31 Jul 2015 07:32:57 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Louis Armstrong Louis Armstrong: The Best of the Complete RCA Victor Recordings (1996 Remaster) iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Louis Armstrong: The Best of the Complete RCA Victor Recordings (1996 Remaster) by Louis Armstrong, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store.", "textAfterTable": "16 Songs Album Review This 16-track collection distills a four-disc set down to one, spotlighting this generally unsung period of Armstrong's career. This period, basically 1932-1947, finds him moving from fronting a big band to forming the first versions of the smaller All-Star groups that would carry him the rest of his career. If the bands are a bit stodgy and not up to his standards of brilliance on these sides, you certainly can't fault Armstrong's performances; he's simply at the peak of his powers, blowing with an invention that didn't surface in later years. As a singer, his vocals are effusive and full of spark. Although not as well known as his early and later material, these RCA sides capture some important Armstrong, and here's a nice distillation of a peak period. Biography Born: 04 August 1901 in New Orleans, LA Genre: Jazz Years Active: '20s, '30s, '40s, '50s, '60s, '70s Louis Armstrong was the first important soloist to emerge in jazz, and he became the most influential musician in the music's history. As a trumpet virtuoso, his playing, beginning with the 1920s studio recordings made with his Hot Five and Hot Seven ensembles, charted a future for jazz in highly imaginative, emotionally", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}