{"relation": [["Track", "You Know What To Do", "No Reply", "Mr. Moonlight", "Leave My Kitten Alone", "No Reply", "Eight Days A Week", "Eight Days A Week", "Kansas City/Hey-Hey-Hey-Hey"], ["Composer", "Harrison", "Lennon-McCartney", "Johnson", "John-Turner-McDougal", "Lennon-McCartney", "Lennon-McCartney", "Lennon-McCartney", "Leiber-Stoller-Penniman"], ["Recording Information", "3rd June 1964 - Demo version without Ringo. Ringo had been taken ill, and after John, Paul and George practised their stage set with temporary replacement Jimmy Nicol, they stayed on at Abbey Road and laid down three songs. These are NOT mentioned in Lewisohn's \"Complete Recording Sessions\", as the tape of this session had been mis-filed and lay un-discovered until 1993 when it was found by engineer Allan Rouse ! This first song is the only recording made of George's second composition, and was therefore unheard until this release.", "3rd June 1964 - Demo version without Ringo. See previous track for the background. Another unheard demo recording.", "14th August 1964 - Takes 1 & 4 combined. The song was re-made two months later on 18th October, these original takes were not used.", "14th August 1964 - Take 5. Unreleased song recorded in 5 takes, which was left off of \"Beatles For Sale\".", "30th September 1964 - Take 2. The master version was take 8.", "6th October 1964 - Takes 1, 2, and 4 combined. The master version is take 13. These takes here demonstrate the different approaches to the intro.", "6th October 1964 - Takes 5. The master version is take 13, but here is a complete earlier take.", "18th October 1964 - Take 2. The master version was take 1. The version here could not compete with another classic Beatles one-take performance, and was unissued."], ["Time", "1:57", "1:45", "2:46", "2:52", "2:27", "1:25", "2:47", "2:44"]], "pageTitle": "Anthology 1", "title": "", "url": "http://www.jpgr.co.uk/pcsp727.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 8, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00078-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 538684720, "recordOffset": 538676518, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{2340=This Anthology set follows the Beatles chronologically from the birth of the Quarrymen, through to the end of 1964 ... except that it begins with \"Free As A Bird\". It contains previously unreleased versions by the Beatles (mostly in mono) from the archives of E.M.I., Polydor and Decca. Plus some live material from radio and T.V. broadcasts. It is augmented with a couple of interview segments that discuss the relevant times., 2845=From 22nd May 1995 George Martin with occasional assistance from Paul, George and Ringo began to re-listen, and mix tracks intended for The Beatles Anthology albums. George Martin said, \"I am trying to tell the story of the Beatles lives in music, from the moment they met to the moment they split up in 1970. I have listened to everything we ever recorded together. Every take of every song. every track of every song, virtually everything that was ever committed to tape and labelled \"Beatles\". I have heard about 600 items in all\", 21049=\"Twist & Shout\" has 0:27 of the house band theme following it (total track time 3:05)}", "lastModified": "Fri, 10 Aug 2012 09:33:00 GMT", "textBeforeTable": "Side 1 At last, after years of shoddy repackaging of previously available material, and years of ignoring the fans pleas for the release of unreleased material ... here it is, The Beatles first official bootleg ! This Anthology set follows the Beatles chronologically from the birth of the Quarrymen, through to the end of 1964 ... except that it begins with \"Free As A Bird\". It contains previously unreleased versions by the Beatles (mostly in mono) from the archives of E.M.I., Polydor and Decca. Plus some live material from radio and T.V. broadcasts. It is augmented with a couple of interview segments that discuss the relevant times. The producer and project leader was George Martin. From 22nd May 1995 George Martin with occasional assistance from Paul, George and Ringo began to re-listen, and mix tracks intended for The Beatles Anthology albums. George Martin said, \"I am trying to tell the story of the Beatles lives in music, from the moment they met to the moment they split up in 1970. I have listened to everything we ever recorded together. Every take of every song. every track of every song, virtually everything that was ever committed to tape and labelled \"Beatles\". I have heard about 600 items in all\" Additional research was by Mark Lewisohn, a local man from Essex who is responsible for the two most essential books about the Beatles ... \"The Complete Beatles Recording Sessions\", and \"The", "textAfterTable": "0:16 My Bonnie Trad. arr. Sheridan 22 June 1961 - Recording session with Tony Sheridan on Lead vocal. George on lead guitar, Paul on bass and backing vocals, John rhythm guitar, Pete Best on drums. This and the next two recordings are the least exciting tracks on this package, as they have been regularly released since 1964. 2:38 Ain't She Sweet Ager-Yellen 22 June 1961 - Recording session with Tony Sheridan, but this time John on lead vocal. George on lead guitar, Paul on bass and backing vocals, John rhythm guitar, Pete Best on drums. 2:12 Cry For A Shadow Harrison-Lennon 22 June 1961 - Recording session with Tony Sheridan, Beatles only instrumental. George on lead guitar, Paul on bass and backing vocals, John rhythm guitar, Pete Best on drums. 2:22 Side 2 Track Composer Recording Information Time \"Brian was a beautiful guy\" (Speech) 25th October 1971 - John talking to David Wigg of the Daily Express and Radio 1. This interview was broadcast during November on \"Scene And heard\". 0:10", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}