{"relation": [["Author", "shiira_megumi", "RenoTurk", "LoveSnape", "Clandestine"], ["Message", "Hi, everyone!I was surfing the net for any new fics on my fave J-rock band Glay when I came across FicWad. I felt so happy when I found out I can again have a venue for my fics. I used to have my fics up on FanFiction.net but when they reformatted and I do not know where I can have my works be hosted online again, I totally stopped writing. I had lost the motiviation to write. Friends who have met me because of my works noticed that, too. With FicWad, I regained my inspiration to write. I hope to upload my previous works here, and add some more. Thank you very much, FicWad. Shiira Megumi Posted at 2006-10-21 5:55", "Hi I like it here loads. I hope you have a good time. Posted at 2006-10-25 23:05", "hey Shiira Megumi, would you PM me wen you get ur fics up?? that way ill be sure to check out ur stuff! peace and love, Saffron Posted at 2006-11-01 18:22", "Nice to hear that you are back writing again! Posted at 2006-11-01 18:35"]], "pageTitle": "FicWad: fresh-picked original and fan fiction", "title": "", "url": "http://ficwad.com/forum/topic/622", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00052-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 87234457, "recordOffset": 87226255, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{1944=Site design Copyright 2005, K&D Lynch. All stories contained in this archive are the property of their respective authors, and the owners of this site claim no responsibility for their contents.}", "textBeforeTable": "Home > Introductions > Hi, everyone! Lost password Register Log in Remember me Log in ▼ Sign up to adjust the filter You won't see stories with a lower score when you browse or search. Filter Filter: 0 Help Forum Search Browse FicWad", "textAfterTable": "Site design Copyright 2005, K&D Lynch. All stories contained in this archive are the property of their respective authors, and the owners of this site claim no responsibility for their contents. Page created in 0.032 seconds", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}