{"relation": [["Title", "The Greatest Flash Stories Ever Told", "The Flash: The Greatest Stories Ever Told"], ["Material collected", "Flash Comics #1, 66, 86 Comic Cavalcade #24 Showcase #4 The Flash #107, 113, 119, 124, 125, 137, 143, 148, 179 Five-Star Super-Hero Spectacular Flash vol. 2, #2", "Flash Comics #86, 104 The Flash #123, 155, 165, 179 Flash vol. 2, #91 DC Special Series #11"], ["Publication date", "February 1991 April 1992", "August 2007"], ["ISBN", "HC: 978-0930289812 SC: 978-0930289843", "978-1401213725"]], "pageTitle": "Wally West - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/Wally_West", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00339-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 875829375, "recordOffset": 875792347, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{39260=Wally has developed a very extensive supporting cast over the duration of his comic series that began in 1987. It should be noted that a few of them are former villains and adversaries, such as Pied Piper, Speed Demon, and Chunk., 4572=On May 6, 2011, IGN ranked Wally West #8 on their list of the \"Top 100 Super Heroes of All Time\", stating that \"Wally West is one of the DCU’s greatest heroes, even if he doesn’t rank as the original Scarlet Speedster\".[2], 45407=In John Byrne's graphic novel Superman & Batman: Generations 2, characters from the DC Universe are shown to age in real time. In this series, Wally appears as Kid Flash in 1964,[34] which is the year he first appeared as a founding member of the Teen Titans (though in this version, he is a founding member of the Justice League). By 1986, Wally has retired and been replaced by the fourth Flash (Carrie Allen, the daughter of Barry Allen).[35] Wally's son, Jai West, in turn, replaces Carrie in 2008 to become the fifth Flash.[36], 16710=The 1990s also saw further modifications to the look of the character, with a modified uniform appearing in 1991.[8] This modified costume altered the visual appearance of the traditional Flash costume, with a belt made of two connecting lightning bolts meeting in a \"V\" at the front (where Allen's costume had a single bolt in a horizontal band), removal of the wings from the top of his boots, a change in the material of his costume, and opaque lenses added to the eyes of his cowl. This modified design utilized elements of the costume designed by artist Dave Stevens for the live action television series The Flash., 13141=During the 1985-86 miniseries Crisis on Infinite Earths, Barry gave his life to save the Earth when destroying the antimatter cannon that was aimed at Earth.[3] Initially unaware of this, Wally was coaxed by Jay Garrick into assisting the heroes against the Anti-Monitor's forces. During the final battle with the Anti-Monitor, Wally was struck by a blast of anti-matter energy, which put his disease into remission. In the aftermath of the conflict, Wally took on his fallen mentor's costume and identity.[4], 22439=The character next appeared in All Flash #1 (2007), seeking vengeance on those who had killed Bart Allen. This was followed by The Flash vol. 2, which resumed publication after the long hiatus with issue #231 (October 2007). The series found the character struggling with trying to raise his two super-powered twins, plagued by accelerated growth and their inexperience in the heroic game, a task made more difficult by Wally's unemployment, his inability to keep a steady job, and the mistrust of the League for his decision to bring two children into the fold. The series was canceled with issue #247 (February 2009)., 46876=Flash Annual #7 (1994, one of a series of Elseworlds annuals) shows a Flash who has become a superstar celebrity and film director. He was apparently left disabled by an attempt by the Weather Wizard to create a new ice age, which in this reality also resulted in the death of Barry Allen. Wally's film is repeatedly interrupted by the Weather Wizard's insistence that Wally's version is a lie (claiming he had benevolent intentions and that Barry's death was a tragic accident) - much to Wally's horror the Weather Wizard is given the authority to make changes to the film. During a confrontation in the carpark, the Weather Wizard's demonisation of Barry Allen is ended when he is killed by a lightning bolt (which Wally suspects may be divine intervention)., 27301=Following the events of Flashpoint storyline, all DC titles, including The Flash, were cancelled and relaunched as part of its The New 52 publishing event. In the new continuity, Barry Allen is the only Flash; he has never been married to Iris West, and Wally is not alluded to. When asked about Wally's whereabouts, DC creators have had no comment, and Dan DiDio has stated that Wally is currently benched. Iris's ex-con brother Daniel West does feature however,[15][16] in his capacity as the Reverse-Flash.[17] In January 2014, it was reported that Wally would make his debut in The New 52 in The Flash Annual #3, set for release in April 2014.[18] Wally appears in The Flash #30 five years later from the current timeline with a bi-racial look and new backstory. Wally is shown to be dead five years into the future from a fatal car crash. Later on in #30 we seen Barry twenty years into the future much older, and now wearing a blue Flash costume, promising to never be late again while looking at a news article about a funeral being held for Wally.[19] Although speculated that Daniel was the father of Wally since he is shown to be Iris's only other sibling, writer Robert Venditti has since confirmed Iris has another brother who has yet to be seen but is indeed the father of Wally, and Wally himself is now African-American on his mother's side.[20], 15789=Those changes were quickly followed up and 1987 saw the publication of a new Flash comic, initially written by Mike Baron. These stories focused not only on the Flash's superhero exploits, but the state of Wally's wealth. West won a lottery,[6] bought a large mansion,[7] and became something of a playboy. The character's finances and luck continued to ebb and wane until Flash vol. 2, #62, when his playboy ways ended and his fortunes stabilized.}", "lastModified": "Sun, 26 Jul 2015 23:36:16 GMT", "textBeforeTable": "Wally West's stories from The Flash vol. 2 have been reprinted in several trade paperbacks. Collected editions[edit] Flash Vol. 2 #1-247, 0, 1/2, Annual #1-13 (there was also Flash #1,000,000 which was part of the DC One Million crossover storyline in 1998) Flash Flash #110-112, 114, 116, 118, 122, 125, 127, 130, 133, 138, 144, 149, 156, 159, 164, 167, 173, 202, 204, 207, 209, 211, 216, 220-221, 229, 239, 265-266, 269, 325 Kid Flash Spotlight Bibliography[edit] In Flash Vol 4 #35, Wally arrives to see the Future Flash fight the present Flash. Wally is badly injured when he shields the younger Flash from high-speed rocks that the Future Flash flung. Wally absorbs the excess Speed Force energy that is tearing apart the present Flash and tells him to not give up and that he only learned to be a hero because of him. Wally dies and releases a blast of Speed Force energy that closes the rupture but unintentionally traps the present Flash in the Speed Force. In The Flash: Futures End #1, the Flash from 20 Years in the Future is able to prevent Wally's death by killing Daniel West. After the Future Flash cripples his younger self in their fight and disappears into the past, Barry finds that Wally", "textAfterTable": "Impulse: Reckless Youth Flash vol. 2, #92–94 Impulse #1–6 April 1997 978-1563892769 The Flash: Terminal Velocity Flash vol. 2, #0, 95–100 September 1995 978-1563892493 The Flash: Dead Heat The Flash vol. 2, #108–111 Impulse #10–11 August 2000 978-1563896231 The Flash: Race Against Time The Flash vol. 2, #112–118 July 2001 978-1563897214 The Flash: Emergency Stop The Flash vol. 2, #130–135 January 2009 978-1401221775 The Flash: The Human Race The Flash vol. 2, #136–141 \"Flash of Two Worlds\" from Secret Origins #50 June 2009 978-1401222390 The Flash: Wonderland The Flash vol. 2, #164–169 October 2007 978-1401214890 The Flash: Blood Will Run The Flash vol. 2, #170–176 The Flash Secret Files #3 June 2002 978-1563898792 The Flash: Blood Will Run (2nd ed.) The Flash vol. 2, #170–176 The Flash Secret Files #3 The Flash: Iron Heights February 2008 978-1401216474 The Flash: Rogues The Flash vol. 2, #177–182 February 2003 978-1563899508 The Flash: Crossfire The Flash vol. 2, #183–191 March 2004 978-1401201951 The Flash: Blitz The Flash vol. 2, #192–200 August 2004 978-1401203351 The Flash: Ignition The Flash vol. 2, #201–206 March 2005 978-1401204631 The Flash: The Secret of Barry Allen The Flash vol. 2,", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}