{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Top songs", "My Girl", "Just My Imagination (Running Away With Me) (Single Version / Mono)", "Ain't Too Proud To Beg", "I Wish It Would Rain", "Papa Was A Rolling Stone", "Silent Night", "Get Ready", "The Way You Do The Things You Do", "Papa Was A Rollin' Stone (Single Version)", "This Is My Promise"], ["", "", "", "", "", "", "", "", "", "", ""], ["Album", "The Definitive Collection", "The Definitive Collection", "The Definitive Collection", "The Definitive Collection", "Live As It Gets", "Best Of/20th Century - Christmas", "The Definitive Collection", "The Definitive Collection", "The Definitive Collection", "Phoenix Rising"], ["", "2:44", "3:48", "2:33", "2:47", "7:12", "6:07", "2:39", "2:41", "6:59", "7:20"], ["", "1 $1.29", "1 $1.29", "1 $1.29", "1 $1.29", "1 $0.99", "1 $1.29", "1 $1.29", "1 $1.29", "1 $1.29", "1 $1.29"]], "pageTitle": "The Temptations - Music on Google Play", "title": "", "url": "https://play.google.com/store/music/artist/The_Temptations?id=A6wyqzji2akgtzdmob3fbjkftae", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00272-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 887085019, "recordOffset": 887051194, "tableOrientation": "HORIZONTAL", "textBeforeTable": "The Temptations image courtesy of michael ochs-getty images Description provided by Wikipedia under Creative Commons Attribution CC-BY-SA 4.0 Featuring five male vocalists and dancers, the group formed in 1960 in Detroit, Michigan under the name \"The Elgins\". The original founding members were originally members of two rival Detroit vocal groups: Otis Williams, Elbridge \"Al\" Bryant, and Melvin Franklin of Otis Williams & the Distants, and Eddie Kendricks and Paul Williams of the Primes. In 1964, Bryant was replaced by David Ruffin, who was the lead vocalist on a number of the group's biggest hits, including \"My Girl\", \"Ain't Too Proud to Beg\", and \"I Wish It Would Rain\". Ruffin was replaced in 1968 by Dennis Edwards, with whom the group continued to record hit records such as \"Cloud Nine\" and \"Ball of Confusion\". The Temptations are an American vocal group known for their success with Motown Records during the 1960s and 1970s. Known for their choreography, distinct harmonies, and flashy wardrobe, the group was highly influential to the evolution of R&B and soul music. Having sold tens of millions of albums, the Temptations are one of the most successful groups in music history. As of 2015, the Temptations continue to perform with one living original member, Otis Williams, still in the lineup. About the artist", "textAfterTable": "Albums Pre-ordered Back To Front The Temptations 1 $5.99 Back to Front is the sixty-first Temptations album and was released on 23 October 2007. It contains mostly covers of songs that were hits for Stax Records artists, as well as other non-Motown artis... 1", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}