{"relation": [["", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35", "36", "37", "38", "39", "40", "41", "42", "43", "44", "45", "46", "47", "48", "49", "50"], ["Name", "Soul School", "Something Makes You Feel Like Feat. Soko (Bonus Track)", "Chamchu", "The Mighty Quinn", "Judy Sucks A Lemon For Breakfast", "Soul School", "Who Fingered Rock'n'Roll", "England's Dreaming", "Brimful of Asha (The Norman Cook Remix)", "U47’s", "Brimful of Asha (The Norman Cook Remix) [Single Version]", "Brimful of Asha", "Sleep On the Left Side (Ashley Beedle’s Right Hand Extended Mix)", "Sleep On the Left Side (Les Rythmes Digitales’ Living By Numbers Mix)", "Sleep On the Left Side (Ashley Beedle’s Right Hand Radio Edit)", "Sleep On the Left Side (Radio Edit)", "Funky Days Are Back Again (Extended Beats Mix)", "Funky Days Are Back Again", "Intro / Good Ships", "Good Ships", "Brimful of Asha (Norman Cook Remix)", "Born Disco; Died Heavy Metal", "Brimful of Asha (Mucho Macho Bolan Boogie Mix)", "Counteraction", "Easy Winners (Pt. 2)"], ["Album", "The School Of Soul E.P.", "Judy Sucks A Lemon For Breakfast (Special Edition)", "Judy Sucks A Lemon For Breakfast (Special Edition)", "Judy Sucks A Lemon For Breakfast (Special Edition)", "Judy Sucks A Lemon For Breakfast (Special Edition)", "Judy Sucks A Lemon For Breakfast (Special Edition)", "Judy Sucks A Lemon For Breakfast (Special Edition)", "Lock Stock & Double-Barrel - EP", "Brimful of Asha - EP", "Brimful of Asha - EP", "Brimful of Asha - EP", "Brimful of Asha - EP", "Sleep On the Left Side - EP", "Sleep On the Left Side - EP", "Sleep On the Left Side - EP", "Sleep On the Left Side - EP", "Good Ships - EP", "Good Ships - EP", "Good Ships - EP", "Good Ships - EP", "The Love Guru (Music from the Motion Picture)", "Born Disco; Died Heavy Metal - EP", "Brimful of Asha - EP", "Brimful of Asha - EP", "Brimful of Asha - EP"], ["Time", "3:31", "4:31", "3:24", "3:31", "5:15", "3:31", "3:47", "3:38", "7:35", "1:47", "4:03", "4:07", "5:39", "4:44", "4:06", "3:37", "5:31", "3:43", "4:55", "4:38", "3:59", "3:36", "6:48", "2:46", "5:58"], ["Price", "€0.99", "€0.99", "€0.99", "€0.99", "€0.99", "€0.99", "€0.99", "€1.29", "€1.29", "€1.29", "€1.29", "€1.29", "€1.29", "€1.29", "€1.29", "€1.29", "€1.29", "€1.29", "€1.29", "€1.29", "Album Only", "€1.29", "€1.29", "€1.29", "€1.29"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Cornershop", "title": "", "url": "https://itunes.apple.com/ie/artist/cornershop/id156106?trackPage=2", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00010-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 876119647, "recordOffset": 876089280, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{37694=Through all the controversy, the group kept honing its sound, adding sitarist Anthony Saffery (who also played keyboards and harmonium) and guitarist Wallis Healey for its 1994 debut album, Hold on It Hurts. Chambers and Avtar Singh both left the group in 1995 and the new, reshuffled lineup brought on drummer Nick Simms and percussionist Pete Hall. The same year, David Byrne's worldbeat-oriented Luaka Bop label signed Cornershop to a deal and released Woman's Gotta Have It, the group's first widely accessible album. Singh's playful humor and English/Punjabi lyrics spoke to the inclusiveness of the band's vision, and hypnotic tracks like \"6am Jullandar Shere\" attracted positive word of mouth from critics and luminaries like Brian Eno, helping land the group on the second stage of that year's Lollapalooza. Healey and Hall both left following the record's release, however, and percussionist Peter Bengry took the latter's place., 35904=In the wake of this success, Singh and Ayres put the group on temporary hiatus and returned to their more dance-oriented side project, Clinton, which had released a couple of singles in 1995-1996. The debut Clinton full-length, Disco and the Halfway to Discontent, was released in the U.K. in 1999 and picked up for American distribution by Astralwerks the following year. The long silence from Cornershop gave rise to rumors that Singh had broken up the band, but he and Ayres finally returned (with Bengry, Saffery, and Simms in tow) in early 2002 with Handcream for a Generation., 38652=Cornershop issued two EPs over the course of 1993 (In the Days of Ford Cortina and Lock Stock & Double-Barrel, later collected as Elvis Sex-Change), but attracted more attention for their strong anti-racist politics — specifically, their public denunciation of indie icon Morrissey. In response to Morrissey's flirtation with skinhead imagery, the group blasted him in the press and took to burning pictures of him in concerts, at press conferences, and even outside the offices of his record label. The backlash in the British music media suggested that Cornershop were nothing but publicity hounds, pointing to the amateurish, messy qualities of the band's music as evidence (indeed, the group members even took a certain pride in their lack of technical know-how during their early days, although they would later become much more accomplished). Fairly or not, Cornershop were, for the most part, dismissed as incompetent., 35292=After Handcream for a Generation, Cornershop entered a quiet period, surfacing briefly in 2006 with a single called \"Wop the Groove,\" but their real comeback came three years later when they released Judy Sucks a Lemon for Breakfast, their first album in seven years. It was also their first album to be released by their new label Ample Play, which the band would continue to run for years, putting out their own music and lots of interesting neo-psych artists as well. The band quickly followed that with a collaboration with Punjabi singer Bubbley Kaur called Cornershop and the Double-O Groove Of, and their eighth record, Urban Turban, arrived in the summer of 2012. Running their well-regarded label seemed to take over the band's time until the release in 2015 of Hold on It's Easy, an easy listening meets big band reimagining of Hold on It Hurts, with music provided by the Elastic Big Band., 36717=The reception afforded Woman's Gotta Have It set the stage for the breakthrough of When I Was Born for the 7th Time. Released to hugely positive reviews in 1997, the album mixed pop songs with hypnotic, hip-hop-flavored instrumentals and featured guest spots from Allen Ginsberg and Tarnation's Paula Frazer, plus production contributions from Dan the Automator. The catchy single \"Brimful of Asha,\" a tribute to the prolific Indian film singer Asha Bhosle, became a genuine hit in the U.K. after a remix by Norman Cook (aka Fatboy Slim) and actually hit number one on some charts in early 1998 — a far cry from several years before. The success led to an opening slot on Oasis' American tour, and Spin magazine named When I Was Born for the 7th Time its Album of the Year., 39511=It may have taken Cornershop a few years to perfect their innovative hybrid of Indian music, British indie rock, and contemporary dance, but with the release of a third full-length album, When I Was Born for the 7th Time, the group's multicultural fusions made it an instant critics' darling. Taking their name from a common stereotype of Indians in England — that they all own small, corner grocery shops — Cornershop were formed by singer/songwriter, guitarist, and dholki player Tjinder Singh and guitarist, keyboardist, and tamboura player Ben Ayres after the 1991 breakup of a previous group, General Havoc. The remainder of their initial lineup featured Singh's brother Avtar on guitar and former Dandelion Adventure drummer David Chambers. Following their first gig in Harlow, they signed with the small indie label WIIIJA.}", "TableContextTimeStampAfterTable": "{75778=Copyright © 2014 Apple Inc. All rights reserved., 68181=1992 in London, England, 74920=Shop at the Apple Online Store, call 1800 92 38 98 or find a retailer.}", "lastModified": "Sat, 01 Aug 2015 04:24:53 GMT", "textBeforeTable": "Top Songs 2 1 View In iTunes Don't Shake It (Let It Free) - Single 20. View In iTunes Milkin' It (feat. In Light of Aquarius) - Single 19. View In iTunes Who's Gonna Lite It Up? (feat. Izzy Lindqwister) - Single 18.", "textAfterTable": "Previous 1 2 3 4 5 6 7 8 Next Top Music Videos 1. Brimful of Asha View In iTunes 2. Sleep On the Left Side View In iTunes 3. Soul School", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}