{"relation": [["Author", "Alberto Iria", "Alfredo Mendes de Gouveia", "Américo Pires de Lima", "Berta Leite", "Damião Peres", "Eduardo Dias", "Fernando da Silva Correia", "Hernani Cidade", "Luís de Pina Manique", "Luís Silveira", "Luísa da Fonseca", "Manuel Lopes de Almeida", "Maria Izabel de Albuquerque", "Serafim Leite", "Torquato Soares de Sousa"], ["Section", "1st 1st", "6th", "4th 4th 4th", "1st 1st 1stª 6th 6th 8th 8th 9th 9th", "4th", "1st 8th", "4th", "8th", "2nd", "4th", "8th", "1st 5th", "1st 6th", "8th 8th", "4th"], ["Title of Paper presented", "Bahia in the Arquivo Histórico Colonial de Lisboa (A Bahia no Arquivo Histórico Colonial de Lisboa) The foundation of the General Government (A fundação do Governo Geral e o Arquivo Histórico Colonial de Lisboa)", "The official papers of the Brazilian brotherhoods, confraternities and voluntary hospitals to be found in the Arquivo Histórico Colonial de Lisboa (Relação dos compromissos de irmandades, confrarias e misericórdias do Brasil, existentes no Arquivo Histórico Colonial de Lisboa)", "A note on some Bahian epidemics in the 17th century (Nota sobre algumas epidemias na Bahia (séc. XVII) The illnesses in the voluntary hospital of Bahia in the 18th century (Atribulações da misericórdia na Bahia (séc. XVIII) Notes on the `Assembly of the Abandoned’ of Bahia in the 18th century (Notas sobre a Roda dos Enjeitados na Bahia -- séc. XVIII)", "Our History: inedited correspondence of Francisco Xavier de Mendonça Furtado (História Nossa: correspondência inédita de Francisco Xavier de Mendonça Furtado) Brazil in the Index of Papal Bulls (O Brasil no Índice do Bulário Romano) Salvador Correia de Sá e Benevides D. Pedro Fernandes Sardinha The ecclesiastic history of Brazil (História eclesiástica do Brasil) José Bonifácio de Andrada e Silva Bartolomeu de Gusmão in the documentation to be found in Lisbon (Bartolomeu de Gusmão na documentação de Lisboa) São João de Brito Chancellery of Dom João III (Chancelaria de D. João III)", "Historical antecedents to the legislation concerning Brazilian gold (Antecedentes históricos da legislação concernente ao ouro no Brasil)", "The Land of the True Cross (A Terra de Vera Cruz) The inspections of Captain and Sergeant Major Diogo de Campos Moreno and the fortunes of brazil-wood in Ilhéus (Inspeções do capitão e sargento-mór Diogo de Campos Moreno e aventuras do pau brasil em Ilhéus)", "Some hypotheses concerning the origin of the Assistency in American and Brazil (Algumas teses sobre as origens da assistência na América e no Brasil)", "Some notes concerning Antonio Teles da Silva (Algumas notas acerca de Antonio Teles da Silva)", "The Luso-Brazilian convention of 1867 concerning Portuguese cartography (O Convênio luso-brasileiro de 1867 sobre cartografia portuguesa)", "An episode in luso-brazilian commerce: the foundation of the Companhia da Ilha de Corisco (Um episódio do comércio luso-brasileiro: a fundação da Companhia da Ilha de Corisco)", "Biographical information on Brazilian university graduates (Bacharéis brasileiros – elementos biográficos)", "An account of the Pernambucan uprising of 1710 (Relação do levante pernambucano de 1710) A document regarding the expedition of Duclerc to Rio de Janeiro (Um documento sobre a expedição de Duclerc no Rio de Janeiro)", "Four documents from the Arquivo Colonial de Lisboa (Quatro documentos do Arquivo Colonial de Lisboa) The Convento do Desterro in Bahia (O Convento do Desterro da Bahia)", "Bibliography of D. Fernão Cardim on the 4th centenary of his birth (Bibliografia de D. Fernão Cardim (no 4o centenário do seu nascimento 1549/1949) Bibliography of Padre Manuel da Nóbrega on the 4th centenary of the Jesuit arrival in Brazil, inaugurating public education and missionization of the Indians (Bibliografia do Padre Manuel da Nóbrega (no 4o centenário da chegada dos jesuítas no Brasil, inaugurando o ensino público e a catequese dos índios)", "The land-seizing bandeirantes (Presores bandeirantes)"]], "pageTitle": "Echoes of the 'politics of the spirit' at the Brazilian Historical and Geographical Institute", "title": "", "url": "http://www.brown.edu/Departments/Portuguese_Brazilian_Studies/ejph/html/issue8/html/lguimaraes_main.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00002-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 341000431, "recordOffset": 340975440, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{12767=Brazil was invited to participate in the Centenary Commemorations in its capacity as a sister nation. It should be remembered that, since the celebratory festivities organized in honor of Prince Henry the Navigator in 1894, the Portuguese leaders had made every effort to incorporate the ex-colony in the celebrations of its great events. From a symbolic point of view, Brazil’s continued presence in those commemorations served as an antidote to the criticism levied against Portuguese colonization, and as a kind of posthumous proof of our civilizing virtues, to use the words of Fernando Catroga.17 In their turn, the Brazilian authorities tended to respond positively to the wishes of the old metropolis. Brazil saw itself as the favorite child of the Portuguese overseas diaspora, as Luís Reis Torgal18 suggests. In this regard, the statement proffered by Afrânio Peixoto, on his visit to the Lisbon Colonial Archives in 1937, is highly representative: (...) My country, a fully grown child, cannot have any awareness of itself without finding the documentation here about its adolescence and age of minority. This will teach it to love even more this glorious Portugal which made it great, from its very first days, and trusted in Brazil, making possible its magnificent future.19 Another indication of this stance can be understood from the care with which Brazil’s inclusion in the solemn commemorations of the Golden Age was handled, both under the scope of the Historical Institute, through the reading of the correspondence exchanged between Max Fleiüss and Júlio Dantas20, and in the upper echelons of the government of Getúlio Vargas. It is sufficient to say that even in his Diário, Vargas left a record of the preparations being made to take part in the Historical Exhibition of the Portuguese World.21 The end of Vargas’ dictatorship, in 1945, did not alter the climate of cordiality that had characterized the policy of cultural relations between the governments of Rio de Janeiro and Lisbon. The same can be said about the exchanges taking place between the Historical Institute and the Portuguese Academy of History.22 So much so that one of the first measures taken by the leadership of the Institute, on issuing invitations to the 4th Congress, was to address the following invitation to the Prime Minister of Portugal, Dr. António de Oliveira Salazar:, 4032=In order to celebrate the four hundredth anniversary of the foundation of the city of Salvador and the setting up of the General Government in Portuguese America, the Brazilian Historical and Geographical Institute (Instituto Histórico e Geográfico Brasileiro – IHGB) organized the 4th National History Congress, held in April 1949, henceforth referred to simply as the 4th Congress. The event’s organizers sought to encourage the participation of foreign historians, particularly Portuguese specialists, since the academic conference was intended to examine the beginnings of nationhood, which, in the final analysis, meant paying special attention to the history of the colonial period.3 The idea of bringing together scholars from both sides of the Atlantic to discuss themes of common interest had long been entertained by the Historical Institute. In 1908, under the management of the Baron of Rio Branco, a conference was planned, similar to the one that was to take place in 1949, to coincide with the announced visit to Brazil of the king Dom Carlos. It is also known that Rio Branco had already prepared the academic program for the conference when the news of the king’s assassination reached Rio de Janeiro, rendering the planned project unviable.4 The Institute based in Rio de Janeiro had maintained constant exchanges with its counterparts in Lisbon since its foundation in 1838. Over the years, various Portuguese scholars had joined its ranks either as honorary members or as correspondents. Some of these members were frequently in touch with their Brazilian colleagues, as, for example, the historian João Lúcio de Azevedo, who used to exchange correspondence with Capistrano de Abreu and Max Fleiüss, the permanent secretary of IHGB. Such contacts intensified even further with the resurgence of the Portuguese Academy of History, in May 1936.5 The effective membership of that organization, fixed at forty professors, had ten seats allocated to Brazilian academics.6 By 1937, all these vacancies were occupied, with all the nominations having been given to members of the Historical Institute, namely: the Count of Afonso Celso, Max Fleiüss, Afonso d’Escragnole Taunay, Arthur Guimarães de Araújo Jorge, Francisco José de Oliveira Vianna, Gustavo Barroso, Júlio Afrânio Peixoto, Manuel Cícero Peregrino da Silva, Pedro Calmon and Rodolfo Garcia.7 But, at that time, other factors would certainly have contributed to closer ties between the IHGB and the Academy, especially when it is known that Brazil and Portugal were experiencing similar political and ideological contexts. The authoritarian governments set up in the two countries by Getúlio Vargas and Oliveira Salazar, respectively, presented themselves as legitimate agents of modernization. It was not by chance that the two regimes had given themselves the title of a New State. Furthermore, they both developed public policies designed to enhance the importance of nationality, based on certain conceptions of history that sought to legitimate the present through past glories. In Brazil, the privileged place for such historiographical production was the veteran Historical Institute, the guardian of the national memory. Although it was not a body that formed part of the government apparatus, it enjoyed the patronage of Vargas,8 who besides affording it great prestige and visiting it periodically, set great store by the recommendations and advice proffered by the Brazilian temple of citizenship.9The Institute was led between 1913 and 1938 by the Count of Afonso Celso, the author of Porque me ufano do meu país,10 and what was developed there was a nationalist-style historiography, geared towards the formation of civic feelings and based on the cult of the nation’s traditions and its most notable figures, converting history into a vast repertoire of different experiences to be apprehended by the present in order to avoid the repetition of past errors.11 A similar role to the one played by the Institute in Brazil was enjoyed in Lisbon by the Portuguese Academy of History, re-founded, as has already been said, in 1936, (...) under the auspices of the Head of State. The Academy’s stated aim was to bring together scholars engaged in research in order to promote the (...) critical reconstruction of the past, its prime objectives being to stimulate and coordinate the revisionist efforts needed to reintroduce historical truth and to enrich the documentation of Portugal’s inalienable rights.12 The Academy represented one of the nationalist spaces established by Salazar’s government in the 1930s with the aim of promoting a re-interpretation of the past, in accordance with the values of the regime. In this sense, it played a prominent part in the organization of the festivities of the so-called double centenary, which were held between 2 June and 2 December 1940 to mark the eight hundredth anniversary of the foundation of the Portuguese kingdom and the three hundredth anniversary of Portugal’s Restoration from Spanish rule. It is not within the scope of this paper to discuss here the political and ideological motivations that led the Salazarist State to promote such celebrations, aimed at the development of the so-called politics of the spirit, idealized by António Ferro, and put into practice by the National Propaganda Office (Secretariado de Propaganda Nacional – SPN).13 Nor is it possible to consider here the succession of festive events that took place in 1940, designed to exalt the greatness of the Portuguese nation. Nonetheless, it should be stressed that the cultural policy developed by Ferro sought to lift the spirits of the Portuguese people, underlining not only their value as an ethnic group, but also the importance of their culture, their productive force, their civilizing capacity and their independent unity within the concert of nations. The successful achievement of this policy was based on three pillars: the use of culture as a symbol of nationality and a means of propaganda, in order to dignify the work of Salazar’s government; the attempt to reconcile ancient Portuguese traditions and values with the modernity symbolized by the advent of the New State; and the establishment of a popular national culture based on the roots and ideals forged by the Salazarist regime14. It is also worth adding that the efforts made to present Portugal as a culturally rich and prosperous nation were not limited to internal propaganda. Symptomatically, as is clearly noted by the historian Fernando Catroga, the intention of the general plan for the Centenary Commemorations was to glorify the present (...) in the light of an uningenuous diachronic interpretation of Portugal’s destiny, by means of a (...) direct exaltation of what it was most important to remember: the Discoveries, (...) the foundation and re-foundation of the Nation should be symbolized as formative and preparatory moments in the construction of the Empire.15 In the “Chronicle” that he published in the Anais das Bibliotecas e Arquivos, in 1939, Júlio Dantas, the president of the National Commission for the Centenary Commemorations, emphasized the importance of such events, which he considered should be the central core of the commemorative program:, 81451=Copyright 2006, ISSN 1645-6432 e-JPH, Vol.4, number 2, Winter 2006, 16302=Attached to the document, signed by the president of the Historical Institute, the ex-chancellor and ambassador José Carlos de Macedo Soares24, were the list of themes for study and the Rules for the academic conference. The event was structured around eight areas of specific study, which respectively contemplated the following fields of knowledge: general history; historical geography and cartography; ethnography; economic and social history; military and diplomatic history; religion, science, art and humanities; political and legal institutions, and bio-bibliography. For each of these areas, there would be a rapporteur, entrusted with the task of preparing the list of subjects for discussion, as well as summarizing the results achieved during the ordinary meetings. The time frame fixed by the organizers gave special privilege to the period from 1500 to 1763. The first date naturally referred to the arrival of the fleet led by Pedro Álvares Cabral to the south of Bahia, whilst the second corresponded to the transfer of the seat of the general government from Salvador to Rio de Janeiro. Broadly speaking, the detailed list of themes proposed for study corresponded to a major review of the historical knowledge available about the colonial period, with special emphasis being given to the so-called baiano cycle. The Rules of the 4th Congress were based on the guidelines used at similar events organized by the Institute in 1914, 1931 and 193825. Participation was open to historians, geographers, sociologists, men of letters and essayists. Within the limits of the themes offered in the program, those who so wished could write papers and submit them to the IHGB by 31 December 1948. They were, however, requested to present previously unpublished texts, which would then be submitted to the prior assessment of a scientific committee, given the task of emitting an opinion as to the merit and convenience of their publication in the Proceedings. At the end of the academic activities, those participating in the congress would be able to enjoy a cultural program, with visits to the National Library, the Casa Rui Barbosa, the National Archives, the Brazilian Institute of Geography and Statistics, the National History Museum and the National Historical and Artistic Heritage Services. The program ended with a trip to the city of Petrópolis, where participants would visit the recently inaugurated Imperial Museum.26 Roughly a hundred and fifty scholars replied to the invitation issued by the Historical Institute, eighty-nine of whom enrolled for the presentation of papers, including twenty foreigners. In this latter group, except for Professors Charles Boxer (University of London – King’s College), Robert C. Smith (University of Pennsylvania) and Ronald Hilton (University of Stanford), all the rest were Portuguese scholars., 65896=Source: Table drawn up from the contributions published in Anais do IV Congresso de História Nacional, Rio de Janeiro: IHGB/ Imprensa Nacional, 1950-1951, 13v., 1198=This article discusses the participation of the Portuguese delegates at the Fourth National History Congress promoted by the Brazilian Historical and Geographical Institute, in 1949, to celebrate the four hundredth anniversary of the foundation of the city of Salvador. It seeks to demonstrate how the official delegation, appointed by António de Oliveira Salazar and led by Júlio Dantas, tried to convert the congress into a continuation of Portugal’s Centenary Commemorations (1940), when the idea was put forward to bring together intellectuals from both countries, with the aim of developing a Portuguese-Brazilian historiographical project based on a unified interpretation., 11931=As is already publicly known, through the dissemination of the general program, the second period, or the imperial period of the national festivities of 1940, is centered around three main pieces: the Portuguese World Exhibition, which will be held in Belém, in the square in front of the Jerónimos Monastery; the parade of the Portuguese World, a stunning procession of eight centuries of history; and the Congress of the Portuguese World, at which the origins, activities, institutions, development and expansion of Portugal and its Empire will be studied. Grouped around this triptych – doctrine, documentation and apotheosis – are all the other realizations of the Golden Age (our emphasis).16, 66386=1A preliminary summarized version of this work was presented at the Real Gabinete Português de Leitura, to the 2nd Conference of the Research Centre into Portuguese-Brazilian Relations (Pólo de Pesquisa sobre Relações Luso-Brasileiras – PPRLB), held in Rio de Janeiro, from 26 to 28 April, 2004. The research was supported by the National Council for Scientific and Technological Development (CNPq - Conselho Nacional de Desenvolvimento Científico e Tecnológico). 2Ph.D. in History from the University of São Paulo. Full Professor and Member of the Prociência Research Program at UERJ. Scholarship Holder from CNPq and Principal Researcher of CEO/PRONEX/CNPq-FAPERJ. 3IHGB’s Organizing Committee consisted of the following members: Augusto Tavares de Lira, Alfredo Valadão, Pedro Calmon, Wanderley Pinho, Virgílio Corrêa Filho, Afonso d’Escragnole Taunay, Rodolfo Garcia, Braz do Amaral, Cláudio Ganns, Carlos da Silveira Carneiro, Henrique Carneiro Leão Teixeira Filho, Artur Cesar Ferreira Reis, Francisco Radler de Aquino, Afonso Costa and José Pedro Leite Cordeiro. IHGB, Anais do IV Congresso de História Nacional. Rio de Janeiro: Imprensa Nacional, 1950, v. 1, pp. 5-6. 4Lucia Maria Paschoal Guimarães, Instituto Histórico e Geográfico Brasileiro: da Escola Palatina ao Silogeu (1889-1938). Full Professor’s Thesis. Rio de Janeiro: UERJ, 1999, p. 27. (mimeo). 5The Portuguese Academy of History (Academia Portuguesa de História) was recreated on 19 May, 1936, by Decree-Law No. 26611. Its plenary sessions, however, only began again in April 1938. Its origin dates back to the Royal Academy of Portuguese History (Academia Real de História Portuguesa), established in Lisbon, through a decree issued by Dom João V, on 8 December, 1720, with the motto Restituet omnia. Located in the palace of the Dukes of Bragança, its membership consisted of 50 academics, who were given the task of writing the ecclesiastical, military and civil history of the realm. See Isabel Ferreira da Mora, A Academia Portuguesa de História. Os intelectuais, o poder cultural e o poder monárquico no século XVIII. Coimbra: Edições Minerva, 2003 (Coleção Minerva-História No. 22). 6Brazilian intellectuals were also allowed to join the ranks of supernumerary academics. 7Boletim da Academia Portuguesa de História, Lisbon: APH, 1st and 2nd years, 1937-1938. 8See, for example, Getúlio Vargas, Diário, presented by Celina Vargas do Amaral Peixoto; published by Leda Soares. São Paulo: Siciliano; Rio de Janeiro: Fundação Getúlio Vargas, 1999, v.1, p. 143. 9Lucia Maria Paschoal Guimarães, Instituto Histórico e Geográfico Brasileiro: da Escola Palatina ao Silogeu, op. cit. p. 256. 10According to Nanci Leonzo, Afonso Celso’s book provided the inspiration for the work O que todo português deve saber de Portugal, published in 1938 by Albino Forjaz de Sampaio from the Lisbon Academy of Sciences. 11Cf. Reinhart Koselleck, “Historia magistra viate”. In: _______, Le futur passé: contribution à la sémantique des temps historiques. Paris: Éd. de l’École des hautes études en sciences sociales, 1990, p. 37. 12Boletim da Academia Portuguesa de História, Lisbon: Academia Portuguesa de História, 1st and 2nd years, 1937-1938, p. 53. 13Luís Reis Torgal., História e ideologia. Coimbra: Livraria Minerva, 1989, p. 194. (Coleção Minerva - História nº 3). See also Yves Leonard, Salazarismo e Fascismo. Translation by Catarina Horta Salgueiro. Lisbon: Editorial Inquérito, 1998, pp. 95-96. 14See Fernando Rosas, O Estado Novo nos anos trinta: 1928-1938. Lisbon: Editorial Estampa, 1986. _____, “Salazar e o Salazarismo: Um caso de longevidade”. In: Salazar e o Salazarismo. Lisbon: Publicações D. Quixote, 1989. 15Fernando Catroga, “Ritualizações da história”. In: TORGAL, MENDES & CATROGA, História da História em Portugal – Da historiografia à memória histórica. Lisbon: Temas e Debates, 1998, pp. 268-269. 16Júlio Dantas, “Crônica”. Anais das Bibliotecas e Arquivos, Lisbon, vol. XIV, 1939, p. 7. 17Fernando Catroga, op. cit., p. 241. 18Luís Reis Torgal, História e ideologia, op. cit., p. 189. 19Afrânio Peixoto, apud Alberto Iria, Anais do IV Congresso de História Nacional. Rio de Janeiro: Imprensa Nacional, 1950, v. 2, p. 15. 20See, amongst other documents, the correspondence exchanged between Júlio Dantas and Max Fleiüss. Coleção Max Fleiüss, Arquivo IHGB, Lata 587. Pasta 48. 21The Brazilian presence was to be noted above all in the symposiums that formed an integral part of what has conventionally come to be known as the Congress of the Portuguese World and at the Historical Exhibition of the Portuguese World. At this latter event, Brazil was the only foreign country to be represented, also occupying its own pavilion. In Getúlio Vargas’ Diário, for example, in the notes relating to 31 January 1940, it is stated that the dictator received the director of the National History Museum, Dr. Gustavo Barroso, one of the delegates to the event, in order to give him official orders and special instructions. Cf.Getúlio Vargas, Diário. Presented by Celina Vargas do Amaral Peixoto; published by Leda Soares. São Paulo: Siciliano; Rio de Janeiro: Fundação Getúlio Vargas, 1999, p. 241. 22Boletim da Academia Portuguesa de História, Lisbon: APH, 13th year, 1949, p. 111. 23IHGB, Anais do IV Congresso de História Nacional. Rio de Janeiro: IHGB/Imprensa Nacional, 1950, v. 1, pp. 7-8. 24The president of the IHGB, the ambassador José Carlos de Macedo Soares, was Minister of Foreign Relations in the first government formed by Getúlio Vargas. 25See Lucia Maria Paschoal Guimarães, Instituto Histórico e Geográfico Brasileiro: da Escola Palatina ao Silogeu. Passim. 26The Imperial Museum was created by Getúlio Vargas and inaugurated on 16 March 1943, in the rooms of the former summer residence of the emperor Dom Pedro II, in the city of Petrópolis. 27With regard to this subject, see Nanci Leonzo, “Jaime Cortesão: Um condestável em terras brasileiras”. Revista da Cátedra Jaime Cortesão, Instituto de Estudos Avançados, USP, São Paulo, 1 (1): 35-43, July 1997. See also Lucia Maria P. Guimarães, “Jaime Cortesão”. Convergência Lusíada. Rio de Janeiro: 22: 317-322, 2006. 28Luís Reis Torgal, História e ideologia, op. cit, p. 194. See also Yves Leonard, op. cit., pp. 69-70. 29 _____, “Ensino da história”. In: TORGAL, MENDES & CATROGA, História da História em Portugal – Da historiografia à memória histórica. Lisbon: Temas e Debates. 1998, pp. 134-135. 30Cf. Fernando Catroga, op. cit., p. 357. 31Damião Perez and Serafim Leite were appointed to act as representatives of the Portuguese Academy of History at the IHGB’s event at the Academy’s Ordinary General Meeting, on 6 April 1949. Boletim da Academia Portuguesa de História, Lisbon: APH, 13th year, 1949, p. 111. 32The National Commission for the Centenary Commemorations was composed of Júlio Dantas (president), Antônio Ferro (general secretary) and Augusto de Castro (general curator of the Historical Exhibition of the Portuguese World). 33Júlio Dantas, “Discurso”. Anais das Bibliotecas e Arquivos. Lisbon, v. XV, 1940, p. 17. 34Silogeu Brasileiro was the name given to the building where the Brazilian Historical and Geographical Institute was located. The name was chosen in 1906, at the suggestion of Ramiz Galvão, to indicate its use by societies dedicated to the letters and the arts. 35IHGB, Anais do IV Congresso de História Nacional, op. cit., v.1, p. 8. 36Júlio Dantas, Anais do IV Congresso de História Nacional. Idem, pp. 48-49. 37Idem, p. 48. 38Luís Reis Torgal, História e ideologia, op. cit., p. 188. See also Yves Leonard, op. cit., p. 77. 39Idem, p. 49. 40The first edition of the História Geral do Brasil (General History of Brazil) dated from Madrid, 1854. In the present work, we used the 5th complete edition. Cf. Francisco Adolfo de Varnhagen, História geral do Brasil, antes da sua independência e separação de Portugal. 5th complete edition – 6th of volume I, revised and with notes by Rodolfo Garcia. São Paulo: Melhoramentos. 1956, p. 106. 41Jaime Cortesão arrived in Brazil at the end of 1940 and took up residence in Rio de Janeiro, where he remained until 1957, when he returned to his motherland. He was in charge of the map library at the Ministry of Foreign Relations. In 1945, he joined the recently created Rio Branco Institute. He taught a number of courses and undertook important research at the Itamaraty Historical Archives, such as the one that gave rise to the nine volumes of the work Alexandre de Gusmão e o Tratado de Madrid. He also worked as a researcher at the National Library. In 1954, he was the curator of the Exhibition of the 400th Anniversary of São Paulo. Cf., Lucia Maria P. Guimarães, “Jaime Cortesão”, op. cit., 321-322. 42Júlio Dantas, Anais do IV Congresso de História Nacional, op. cit. p. 49. 43Vitorino Magalhães Godinho. Ensaios III – Sobre teoria da história e historiografia. 1st edition. Lisbon: Livraria Sá da Costa Editora, 1977, pp. 311-312. 44The paper put an end to an old dispute between Portuguese-Brazilian and Spanish-American historiography about the political scope of Pedro Teixeira’s expedition. In the opinion of Jaime Cortesão, this represented the first attempt to establish the limits of Portuguese sovereignty in the Amazon. Cf. Jaime Cortesão, “O significado da expedição de Pedro Teixeira à luz de novos documentos”. IHGB, Anais do IV Congresso de História Naciona, op. cit., v. 3, pp. 169-204. 45Júlio Dantas, “Crônica”. Anais das Bibliotecas e Arquivos, op. cit., p. 7. 46Berta Leite, “José Bonifácio de Andrada e Silva”. Anais do IV Congresso de História Nacional, op. cit., p. 268. 47 Alberto Iria, “A Bahia no Arquivo Histórico Colonial de Lisboa”. Idem, v.2, pp. 15-110. 48Dr. Américo Pires de Lima presented the following papers: “Nota sobre algumas epidemias na Bahia (séc. XVII)”; “Atribulações da misericórdia na Bahia (séc. XVIII)” and “Notas sobre a Roda dos Enjeitados na Bahia (séc. XVIII)”. In regard to the motion, see Anais do IV Congresso de História Nacional, op. cit. v.1, pp. 85-86. 49Damião Perez, “Antecedentes históricos da legislação concernente ao ouro no Brasil”. Idem, op. cit. v. 5, p. 587. 50To a certain extent, the motion marked a return to the work of uncovering the sources that had been undertaken by the IHGB in the 19th century in the various European archives. Amongst other members of the Institute, some of the participants in these research missions had been: Varnhagen, Gonçalves Dias, João Francisco Lisboa and Joaquim Caetano dos Santos. See Lucia Maria Paschoal Guimarães, “Debaixo da imediata proteção de Sua Majestade Imperial: o Instituto Histórico de Geográfico Brasileiro (1838-1889)”. Revista do IHGB. Rio de Janeiro, 156 (388): 459-613. 51The Larragoiti Prize was set up at the Lisbon Academy of Sciences at the initiative of the entrepreneur Antônio Sanchez Larragoiti Júnior, one of the owners of the Grupo Sul América de Seguros (an Insurance Group). It was intended, every two years, to reward the best work by a Portuguese writer on a theme of Portuguese-Brazilian interest, and it was awarded on a competitive basis. 52Eduardo Dias, Anais do IV Congresso de História Nacional, op. cit., v 1, p. 94. 53See Fernando Catroga, op. cit., p. 280. 54Eduardo Dias, op. cit, p. 97., 32264=(...) A History Congress is substantially an act of revision. A revision of the facts, so often clarified in the light of new documents or new interpretations, a revision, above all, of the judgments made about facts, frequently distorted by political passion and by the inevitable imperfections of human nature (...) “L´histoire est une science; mais elle est aussi une justice,” said the Marquis of Vogué. (...) A History Congress has, at the same time, the opulence of a university cloister and the majesty of a supreme court. It is not limited to creating science; it judges men and peoples; it reviews unfair judgments and rectifies erroneous ones. This was what we did at the Congress of the Portuguese World held in Lisbon in 1940, which I had the honor to preside over (...) Because I know in advance that this meeting will be setting out to perform a similar work of clarification and justice in relation to the men, ideas and events that constitute the historical heritage of our two nations (...)36., 25901=Except for the historian Jaime Cortesão, who had been living in exile in Brazil since the end of 194027 and was a dissident of the Salazarist regime, all the other names on the list, whose institutional links are stated in the Proceedings of the 4th Congress, belonged to public bodies. This is a clear sign that the invitation addressed to the Portuguese Prime Minister had been warmly received. In fact, it constituted considerably more than this. Considering the number of Portuguese delegates and the high costs of transatlantic travel at that time, it can be seen that the opportunity offered by the Institute had been taken advantage of by Salazar to give some continuity to the policy of forging even closer links between Portugal and Brazil, a policy that had been stepped up at the time of the Centenary Commemorations. Table 1 clearly shows that the largest contingent of official representatives was formed by specialists from the Lisbon Colonial Archives, a body that had been founded in 1931 and was later to be renamed the Overseas Archives. It also strongly suggests that the appointments had been screened by António Ferro, the director of the National Office for Information regarding Popular Culture and Tourism (Secretariado Nacional da Informação da Cultura Popular e do Turismo – SNI).28 Alongside the recognized archivists and librarians, of the standing of Alberto Iria, Luís Silveira, Luísa da Fonseca and Maria Izabel de Albuquerque, there were such important personalities as the medical doctor Américo Pires de Lima, a Professor from the University of Porto and a recognized intellectual of the New State, who was an apologist for the teaching of a patriotic form of history in Portuguese high schools.29 The same can be said about Luís de Pina Manique, one of the authors of the collective work Portugal. Breviário da pátria para portugueses ausentes, published at the initiative of António Ferro in 1946, and also about Manuel Lopes de Almeida, a Professor from the University of Coimbra and a historian who was closely linked to the regime.30 In contrast, other participants at the conference - Hernani Cidade, Damião Perez and Padre Serafim Leite - were familiar figures in Brazilian scholarly circles. The last two had been nominated by the Portuguese Academy of History.31 This is not to mention Júlio Dantas, who was, at that time, the president of the Lisbon Academy of Sciences. The appointment of such an important and eminent figure to represent Marshal Oscar Carmona, the head of the Portuguese State, at the event organized by the Historical Institute, deserves a separate comment of its own. The celebrated politician, diplomat and intellectual Júlio Dantas represented one of the main Portuguese literary references. Highly regarded in Brazil, which he had already visited on various occasions, he had been honored with the title of honorary citizen of Rio de Janeiro in 1923, amongst other tributes. As has already been said, besides these credentials, the author of A Ceia dos Cardeais and A Severa played a leading role in the Centenary Commemorations, where he was president of the National Commission responsible for the organization of those celebrations.32 It should further be added that, when officially opening the business of the Congress of the Portuguese World, Júlio Dantas had announced the intention of developing a Portuguese-Brazilian historiographical project, (...) in which, through the close cooperation between Portuguese and Brazilian researchers and historiographers, an attempt will be made to clarify and unify the interpretation of the facts that are important for the first three centuries of the glorious history of Brazil, our common heritage (our emphasis)33. We shall return to this question later on. Opened on 21 April 1949, by the President of the Republic Eurico Gaspar Dutra, in the main hall of the Silogeu Brasileiro,34 the inaugural session of the 4th Congress attracted leading personalities from the upper echelons of government, from the ecclesiastical authorities and members of the diplomatic corps. It should also be mentioned in passing that the leaders of the IHGB were not particularly clever in choosing the day of the ceremony. This conference of studies on Portuguese America, attended by official delegates from the mother country, began precisely on the national holiday dedicated to the anniversary of the hanging of Tiradentes, an emblematic figure in the Conjuração Mineira (the Minas Conspiracy), the greatest representative of colonial resistance to the oppression from the metropolis. Certainly, the hosts must have realized the inconvenience of this, for they remained silent about the date and its symbolic content. They even dispensed with the reading of the Efemérides Brasileiras (Important Brazilian Dates), by the Baron of Rio Branco, a traditional practice that is still used today as an introduction to the formal sessions at the Casa da Memória Nacional. The president of the Historical Institute limited himself to making a brief statement, highlighting the importance of the academic initiative, which provided a continuation of the first three national history congresses promoted by the organisation (1914, 1931 and 1938). After paying the customary tribute to the patron of the Casa, the Emperor Dom Pedro II, he made a brief welcome to the conference participants and guests, addressing himself in particular to Júlio Dantas, the ambassador extraordinary from Portugal.36 The reply of the plenipotentiary from Lisbon, however, expanded upon the customary demonstrations of appreciation in keeping with protocol. When solemnly presenting the insignia of the Military Order of St. James of the Sword to the IHGB, His Excellency gave a lengthy speech, preceded by the following reflections:, 38621=Lisbon’s special envoy sought refuge in traditional interpretations, which, as it happens, had been given great importance and had been widely disseminated by the Salazarists during the festivities in 1940, attributing the epic period of the Discoveries to mental and religious motivations. It therefore invalidated the discussion begun by Cortesão, in his recent works, about the importance of economic and geographical factors in the overseas expansion undertaken by the Portuguese.43 Indeed, it is opportune here to make a brief parenthetical comment to explain that the dissident historian did not respond to the provocation delivered by his compatriot. He limited himself to participating assiduously, but discreetly, in the various sessions of the conference, although the research that he presented – “The significance of Pedro Teixeira’s expedition in the light of new documents” – had received enthusiastic praise from the scientific committee of the Historical Institute.44 Basically, Júlio Dantas had stolen the show at the opening ceremony of the 4th Congress. He had transformed the Historical Institute’s conference hall into a stage and had begun to direct the performance. To this end, he used the same strategy that he had formulated to direct the organization of the Centenary Commemorations, basing himself on the triptych of doctrine-documentation-apotheosis45. The doctrine part had already been made explicit by reading between the lines of the welcoming speech given by the plenipotentiary ambassador: in the history of the former colony, it was the metropolis that was called upon to perform the main role. He still had to develop the other two fundamental elements of that triad, or, in other words, documentation and apotheosis. As far as documentation was concerned, the cast directed by Dantas set about their task with great mastery and coherence in the course of the ordinary sessions, sometimes bringing to light previously unpublished sources from the Colonial Historical Archives, and on other occasions presenting papers founded on copious empirical material. It is true that most of the authors chose to present papers on themes in which it would be hard to find anything that could be criticized at the level of historiography, in order not to allow room for possible controversies. In particular, they preferred to produce bio-bibliographical essays, or descriptions of travelers, as well as reports about epidemics, religious institutions and charitable organizations. Certain participants in the congress did, however, renounce this posture of apparent scientific neutrality. There were some who went beyond the cultural origins in Portugal, even disregarding the time span and the themes proposed by the IHGB. Such a fact makes it possible to suspect that the Institute’s scientific committee, always jealously guarding its specific duties, showed a certain complaisance in regard to some of the guests invited from overseas. Take, for example, the text entitled José Bonifácio de Andrada e Silva, written by Berta Leite. The author sought to discover what were the motivations that might have led an individual of Bonifácio’s moral and intellectual worth (...) to cease to be Portuguese, becoming involved in the process for the political emancipation of the former colony. She concluded that (...) only one truth might rehabilitate him in our Portuguese eyes: that perhaps José Bonifácio had seen in the independence of Brazil the only possibility for the continuity of the Race.46 Berta Leite’s controversial reflections, however, passed almost completely unnoticed in the face of the great wealth of sources that she added to her paper as an appendix: previously unpublished testimonies to the performance of  Bonifácio de Andrada e Silva in the Portuguese realm, including his involvement in the battalion known as the Restorers of the Nation, during the French invasions. As far as the specific work on documentation is concerned, some isolated papers should be highlighted, beginning with the one presented by Alberto Iria, a genuine lesson in heuristics and archivology, which disclosed the collections of sources originating from the captainship of Bahia and the establishment of the General Government, deposited at the Colonial Historical Archives.47 In fact, the patrimony of that institution was discussed by another two highly regarded specialists, Maria Izabel de Albuquerque and Alfredo Mendes de Gouveia, the latter being the author of an extensive compilation covering eighty-six agreements of Brotherhoods, Confraternities and Charitable Institutions, situated between Maranhão and Rio Grande do Sul, documents that belonged to the notary’s office of the former Overseas Council. In turn, besides being visited by various scholars, the collection of documents at the Torre do Tombo (the National Archives) served as a basis for the contents drawn up by Luísa da Fonseca, with notes regarding the presence of Brazilian holders of bachelor’s degrees in Portugal. As far as the actual historiographical production itself was concerned, although this was marked by a heavy dose of empiricism, the originality of certain themes should be noted, which until then had been underexplored by Brazilian historiography, partly due to the difficulty of gaining access to the Portuguese collections of documents. A good example of this is to be found in the contribution made by Dr. Fernando Silva Correia, Some theses about the origins of welfare in America and Brazil. A recognized scholar of the Misericórdias (Charitable Institutions), Silva Correia noted the importance of those institutions in everyday life in the first centuries of colonization. Also, following a similar line of research, were the three texts written by Dr. Américo Pires de Lima. The paper that he presented on the epidemics that ravaged the city of Salvador in the 17th century prompted a suggestion that the Ministry of Education should introduce into the curriculum of medical courses a discipline dedicated to the study of the history of medicine in Brazil.48 Similarly distinguishing themselves through their erudition and methodological rigor in the treatment of the sources were the works written by Padre Serafim Leite and Damião Perez, two names from Portuguese historiography that were frequently quoted in Brazil. The priest stuck to his already well-known studies on the Society of Jesus, dedicating bibliographical essays to the works of Fernão Cardim and Manoel da Nóbrega, respectively. Damião Perez commented on the presuppositions developed by Pandiá Calógeras in the book As minas do Brasil e a sua legislação, based on the rules, laws and acts enacted by the kings of Portugal and gathered together in the Lisbon archives. The critical discussion in this paper revealed great objectivity, but its conclusion left something to be desired, since Perez could not resist the temptation and slipped into doctrine, heaping praise upon the performance of the mother country: (...) In relation to mining, as in so many other sectors of the political, economic and cultural life of this nascent nationality, Portugal modeled it to its own image with the proud tenderness of a creator.…49 The strategy used by the Lisbon delegation achieved the expected results. The dissemination of such a voluminous and diversified body of documents left the Brazilian scholars fascinated. This succeeded to such an extent that the plenary session of the 4th Congress approved two motions, indicating that the IHGB should persevere with the President of the Republic for the establishment of an official body encharged with the task of extracting copies of documents regarding the history of Brazil from the Portuguese archives.50 As it happened, this exhaustive and systematic survey was only to be completed in the 1990s, with the development of the so-called Rescue Project, under the scope of the commemorations being organized to mark the 500th anniversary of the discovery of Brazil. Whatever the case, the performance directed by Júlio Dantas was not yet complete. The apotheosis was still to come. The grand finale came in the farewell address of the Portuguese delegation at the closing ceremony. On this formal occasion, Dantas gave the word to the historian Eduardo Dias, who was entrusted with the task of presenting the Historical Institute with a bronze plaque to commemorate the event. The choice of speaker was apparently motivated by academic reasons, since Dias had begun to appear in Lisbon as a promising specialist in the history of Brazil, having been awarded the Larragoiti Prize by the Lisbon Academy of Sciences in 1947 for his book Memórias de Forasteiros: Brasil, séculos XVI a XIX.51 Meanwhile, Eduardo Dias returned to the question of the importance of the Portuguese origins in the formation of the Brazilian nationality. He stressed it in the very foundation of the Historical Institute, referring to two emblematic figures from the Casa da Memória Nacional: the first was Marshal Cunha Matos – Portuguese by birth and one of the founders of the IHGB; the second was the patron of the Casa, the Emperor Dom Pedro II, (...) the son of a Portuguese man, who, exactly like the intrepid field marshal Raimundo Matos, served Brazil with self-sacrifice and sincerity (...) In this way, in the foundations of the Institute, as well as in the formation of the nationality itself, we have the indelible and efficient presence of Portuguese people.52 The omission of the name of the father of Dom Pedro II is highly significant. It should not be forgotten that the Brazilian monarch Dom Pedro I, who was Dom Pedro IV of Portugal, always gave rise to contradictory opinions in Portuguese historiography, leaving room for some conjectures. Did the silence that had built up around the figure who had proclaimed Brazil’s independence still reflect some remaining traces of metropolitan resentment over having lost the jewel of its colonies? Or, what seems most likely, the liberal excesses of the Duke of Bragança in the Old World were not favorably regarded by the historians connected to Salazar’s regime, such as, for example, João Ameal, who explicitly defended Dom Miguel and the Vilafrancada, in his action against Jacobins, liberals and masons.53 But it was not sufficient just to revive the past, stressing the Portuguese-Brazilian origin of the Casa da Memória Nacional. It was essential to reaffirm this in the present time in order to consolidate it in the future. In other words, this meant putting into practice the project announced by Júlio Dantas in the Centenary Commemorations, more specifically at the Congress of the Portuguese World, of bringing together specialists from both countries in order to produce a single and coherent historiography, narrating the feats of the three hundred years of Portugal’s civilizing mission in the New World. Even if, it might also be said, in order to achieve such an aim, it were to prove necessary to expunge the name of Dom Pedro from the Portuguese-Brazilian memory. Or (who knows?) to rehabilitate José Bonifácio in the eyes of his fellow countrymen, just as Berta Leite wished. There is no doubt that Eduardo Dias attempted to clearly define the role that the Historical Institute would play in such a project:, 33949=(...) I venture to claim that due justice has yet to be rendered, especially in Portugal, to the outstanding work of organization represented by Tomé de Sousa’s fleet. In the holds of its three ships (...) there not only came colonists and men of the sea (...) there also came material to begin the building of Brazil’s first city; there came the whole structure of the future Brazilian State, its first political constitution was none other than the Rules signed by Dom João III in Almeirim, on 17 December 1548... (...) In so far as the historical circumstances made this possible, Portugal fulfilled its duty as a colonizing power (...).37, 25659=Source: Table compiled from information contained in Anais do IV Congresso de História Nacional. Rio de Janeiro: IHGB/ Imprensa Nacional, 1950-52, 13v.}", "textBeforeTable": "APPENDIX Table  2  List of the official delegates from Portugal and their respective papers     Whether or not consideration was in fact given at the Historical Institute to pressing ahead with the mission entrusted to it by Eduardo Dias is a theme for future research. Everything suggests that the person who best performed those tasks was Gilberto Freyre. The Institute always insisted on the importance of the Portuguese origin in the formation of Brazilian national identity. However, the projected Portuguese-Brazilian cooperation did not in any way interfere with the commitment to write a common history based on the unity of interpretation, aspired to by Júlio Dantas. Nor even did it interfere with the aim of developing a historiographical project directed by the court of intellectuals gravitating around Salazar. (...) To fervently examine the Portuguese archives in search of still unknown elements; to piously honor the tomb of the admiral of the discovering fleet; to disseminate precious manuscripts; to review the chronicles and old documents in the national archives in order to clarify the historical truth – all this represents the marvelous task of the Historical Institute, all this is basically serving Portugal! (...) Serving Portugal undoubtedly means taking care not to attribute its glories to outsiders, and preventing the measures and initiatives, the efforts and sacrifices of the former metropolis from being distorted", "textAfterTable": "Source: Table drawn up from the contributions published in Anais do IV Congresso de História Nacional, Rio de Janeiro: IHGB/ Imprensa Nacional, 1950-1951, 13v.     Notes 1A preliminary summarized version of this work was presented at the Real Gabinete Português de Leitura, to the 2nd Conference of the Research Centre into Portuguese-Brazilian Relations (Pólo de Pesquisa sobre Relações Luso-Brasileiras – PPRLB), held in Rio de Janeiro, from 26 to 28 April, 2004. The research was supported by the National Council for Scientific and Technological Development (CNPq - Conselho Nacional de Desenvolvimento Científico e Tecnológico). 2Ph.D. in History from the University of São Paulo. Full Professor and Member of the Prociência Research Program at UERJ. Scholarship Holder from CNPq and Principal Researcher of CEO/PRONEX/CNPq-FAPERJ. 3IHGB’s Organizing Committee consisted of the following members: Augusto Tavares de Lira, Alfredo Valadão, Pedro Calmon, Wanderley Pinho, Virgílio Corrêa Filho, Afonso d’Escragnole Taunay, Rodolfo Garcia, Braz do Amaral, Cláudio Ganns, Carlos da Silveira Carneiro, Henrique Carneiro Leão Teixeira Filho, Artur Cesar Ferreira Reis, Francisco Radler de Aquino, Afonso Costa and José Pedro Leite Cordeiro. IHGB, Anais do IV Congresso de História Nacional. Rio de Janeiro: Imprensa Nacional, 1950, v. 1, pp. 5-6. 4Lucia Maria Paschoal Guimarães, Instituto Histórico e Geográfico Brasileiro: da Escola Palatina ao Silogeu (1889-1938). Full Professor’s Thesis.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}