{"relation": [["Author", "John Edward", "James Van Praagh", "Sylvia Browne", "Shmuley Boteach w/ Deepak Chopra"], ["Books Published by Penguin Putnam", "One Last Time (2000)", "Talking to Heaven (1998)", "", ""], ["Books Published by Signet", "", "Reaching to Heaven (2000)", "The Other Side and Back (2000)", ""], ["Books Published by Hay House", "What If God Were The Sun? (2001)", "", "Adventures of a Psychic (1998), God, Creation, and Tools for Life (2000)", "Integrating The Masculine And Feminine In The Spiritual Traditions Of Judaism And Vedanta (2001)"]], "pageTitle": "Talking to Heaven Through Television - CSI", "title": "", "url": "http://www.csicop.org/specialarticles/show/talking_to_heaven_through_television", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00198-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 379865635, "recordOffset": 379848711, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{12595=While a trend among the general American public is difficult to assess because of an absence of relevant polling data gathered since 1996, some observe that spirit mediumship has captured the fascination of the trendy urban elite. “Quite a lot of people in the fashion world are paying visits to people they have lost,” Nadine Johnson, a New York publicist, told the New York Times. “ I wouldn’t call it booming, but it’s harder to get appointments with mediums these days, so you know the business has increased tremendously. To hear it from the people I know, mediums are a hotter commodity than the Prada bowling bag” (La Ferla 2000)., 15572=In July 2000, The Sci Fi Channel premiered Crossing Over with John Edward. The typical format for the half-hour program features fast-talking Edward in a darkened amphitheater, surrounded by risers packed with audience members. As various investigators have observed, Edward walks around the enclosure, pointing his attention to different sections of 20 or so audience members at a time, throwing out fast successions of general and random statements like “I’m getting something about a George over here. I don’t know what this means. George could be someone who passed over, he could be someone here, he could be someone that you know,” and then turning to focus on individuals that respond to Edward’s guesswork by nodding their heads, breaking out in tears, or raising their hands in excitement (Shermer 2001)., 2646=With Jaroff’s article appearing in Time magazine, the stage was set for the March 6 edition of CNN’s Larry King Live. Host Larry King has long been a promoter of psychic mediums, in recent years providing hour-long platforms for both James Van Praagh and Sylvia Browne. (For a review of Van Praagh’s 1999 appearance on Larry King Live, see the CSICOP web article by Joe Nickell)., 7901=Figure 1 indicates that a spike in Edward’s media profile over the past year precedes each of One Last Time’s sales jumps. For example, after an increase in both print and television attention in July 2000, One Last Time appeared on the New York Times bestseller list for the first time. Later, after a major media blitz during the month of November, including appearances by Edward on NBC’s Today Show, CBS’ This Morning, and NBC Dateline, One Last Time jumped for the month of December to its highest best-seller position to date. The pattern of increased media attention preceding a jump on the best-seller list occurred again for the months January to February 2001., 18459=Forbes columnist Steven Salzberg and author-investigator Joe Nickell will each be awarded the 2012 Robert P. Balles Prize in Critical Thinking, to be presented by the Committee for Skeptical Inquiry at the CFI Summit in October., 14246=Part of Edward’s current success may be attributable to an apparent increase in public fascination with spirit communication over the past several years. A Gallup survey conducted in 1996 indicated that 20% of Americans believe that it is possible to communicate with the dead, while another 23% are unsure about the possibility. There is a significant gender difference on the topic, with 24% of women indicating belief in comparison to 16% of men. There are also differences across religious affiliations, as 27% of Catholics believe in spirit communication in comparison to 16% of Protestants and 9% of Jews (Gallup 1996)., 1477=The line-up of guests and the ultimate format for the March Larry King Live program was subtly stacked against criticism of Edward. In his Los Angeles studio, King sat at his desk with Van Praagh and Browne, while Edward was interviewed via satellite hook-up from the CNN studio in New York City. Jaroff appeared via satellite from Boca Raton, while CSICOP chair and philosopher Paul Kurtz was interviewed via feed originating from Buffalo, New York. On satellite from London, England, the panel also included Rabbi Shmuley Boteach, author of various self-help books including Kosher Sex : A Recipe for Passion and Intimacy, and the forthcoming The Psychic and the Rabbi: A Remarkable Correspondence , co-authored with psychic Uri Geller and spiritual guru Deepak Chopra., 13609=\"Without a doubt, visiting spirit mediums is becoming amazingly popular,” author Cathy Cash Spellman told the New York Times last October (La Ferla 2000). Spellman’s novel Bless the Child, about a girl with psychic abilities, was released as a film with the same title by Paramount this past fall. Panned by critics, the film grossed a disappointing $30 million. Bless the Child, however, was the second major film featuring psychic mediums over the past two years. Walt Disney’s Sixth Sense, starring Bruce Willis as a child psychologist who administers to a boy traumatized by visions of dead people, grossed an extraordinary $300 million in 1999., 18499=June 14, 2013, 5421=Jaroff is one of America’ senior science journalists. Named Time magazine’s chief science reporter in 1969, Jaroff has won numerous awards for coverage ranging from space exploration to anthropology. In 1980, Jaroff became the founding managing editor of Discover magazine, and like many science writers of his generation, he exhibits in his reporting a strong enthusiasm and appreciation for the scientific paradigm. A long time fellow of CSICOP and friend of magician James Randi, Jaroff has reported on several controversies related to the paranormal and the pseudoscientific, including Randi’s efforts to expose psychic Uri Geller., 20498=The May/June 2015 Skeptical Inquirer, 19227=December 5, 2014, 6094=Enter veteran science writer Leon Jaroff. “Clairvoyants who claim to communicate with the dead—and warnings not to listen to them—go back at least as far as the Old Testament, yet psychics continue to flourish in back parlors and storefronts across America,” wrote Jaroff in his lead to a March 6 Time magazine feature. “None today is better known or more listened to than John Edward, a fast-talking former ballroom-dancing instructor who is cleaning up on his proclaimed ability ‘to connect with energies of people who have crossed over.’ Died, that is” (Jaroff 2001)., 18900=July 3, 2013}", "TableContextTimeStampAfterTable": "{15937=Matthew C. Nisbet, Ph.D, is a professor in the School of Communication at American University. From 1997 to 1999, he worked as public relations director for CSICOP and Skeptical Inquirer.}", "lastModified": "Thu, 30 Jul 2015 04:05:13 GMT", "textBeforeTable": "Table 1. Shared publishers among Edward, Van Praagh, Browne, and Boteach. Boteach appeared on the program supposedly to present criticism from the perspective of a traditional religious leader, while Van Praagh and Browne were framed by King as an unbiased jury of Edward’s “psychic” peers, able to objectively attest to the legitimacy of Edward’s abilities. In reality, however, all three individuals have economic ties to Edward’s success, as they all share a book publisher with Edward. Table 1 outlines the publishing links between Edward, Van Praagh, Browne, and Boteach. The line-up of guests and the ultimate format for the March Larry King Live program was subtly stacked against criticism of Edward. In his Los Angeles studio, King sat at his desk with Van Praagh and Browne, while Edward was interviewed via satellite hook-up from the CNN studio in New York City. Jaroff appeared via satellite from Boca Raton, while CSICOP chair and philosopher Paul Kurtz was interviewed via feed originating from Buffalo, New York. On satellite from London, England, the panel also included Rabbi Shmuley Boteach, author of various self-help books including Kosher Sex : A Recipe for Passion and Intimacy, and the forthcoming The Psychic and the Rabbi: A Remarkable Correspondence , co-authored with psychic Uri Geller and spiritual guru Deepak Chopra. Besides Larry King’s preference for all things psychic, other factors likely contributed to the decision to air a special program on Edward. Jaroff’s article provided an opportune moment for parent company AOL/Time Warner", "textAfterTable": "Source: Amazon Books. Making a cameo appearance on the program was physicist Dale Graff, author of two books recounting his version of the CIA’s attempt to use psychic “remote viewing” for spy purposes. Also appearing in a cameo role was Cliff Van Sant, a former FBI profiler able to offer first-hand familiarity with Bureau and police agency use of psychics to assist in crime solving. Throughout the hour-long program, the in-studio, “stage center” presence of Browne and Van Praagh allowed the duo to dominate the program’s dialogue. Both psychics took turns interrupting other guest’s comments or reframing responses. Van Praagh appeared well-coached and practiced in his comments, while Browne, with a seat next to King, was able to maintain a visible screen presence throughout the program, often lowering her head as if in meditation, or frequently closing her eyes, cultivating a persona of mysticism for the studio cameras. Larry King played the role of stage master, carefully controlling and managing commentary from Kurtz, Jaroff, and Boteach. If Van Praagh and Browne were stage center on Larry King Live, the other guests, including Edward, were side stage shows only to be revealed when King directed questions their way. In order to measure the “talk time” allocated each guest, I analyzed the full text of the transcript of the television program using CATPAC, a software package developed by communication researchers at the State University of New York at Buffalo for use in quantitative content analysis. As an indicator of", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}