{"relation": [["Artist", "Johnny Clegg & Savuka", "Juluka", "Manu Dibango & Ladysmith Black Mambazo", "Mandoza", "Afrida Marimba Band", "Oliver Mtukudzi", "Thomas Mapfumo", "Oliver Mtukudzi", "Boom Shaka", "Hugh Masekela", "Hugh Masekela", "El Hadj N'diaye", "Issa Bagayogo", "Tinariwen", "Konono No 1", "Bassekou Kouyate", "Naka", "Zao", "Magic System"], ["Title", "Asimbonanga", "Soweto", "Wimoweh", "Godoba", "I Africa", "Mkuru Mkuru", "Marevanhando", "The Third World Cries Everyday", "Nkosi Sikelela", "Mayibuye", "Ngena", "Xel", "Sebero", "Chatna", "Zey Isa Langa", "I Speak Fula", "Tchon Tchoma", "Ancien Combattant", "Papitou S'amise"], ["Album", "Planete Afrique 2", "Ubuhle Bemvelo", "Planete Afrique 2", "All the Hits Vol. 3", "Buyele Ekhaya", "Paivepo", "Chimurenga Rebel", "Wonai", "South African Hiphop - Kwaito", "Tomorrow", "Beating Around", "Xel", "Mali Koura", "Amassakoul", "LIVE at Couleur Cafe", "I Speak Fula", "Planete Afrique 2", "Planete Afrique 2", "1er Gaou"]], "pageTitle": "KBOO | Community Radio for Portland and beyond", "title": "", "url": "http://kboo.org/playlists/sites/default/files/googleanalytics/%3A48?page=538", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00141-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 132247383, "recordOffset": 132213973, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{8362=Grateful Dead - 6.12.80 - Portland, OR - Memorial Coliseum, 7529=http://www.archive.org/details/ymsb2004-06-26.ADKTLsblumlein.flac16, 7995=Great American Taxi - 3.13.10 - Hopmonk Tavern - Sebastopol, CA, 7836=http://www.archive.org/details/gat2010-03-13.flac16, 7628=Yonder Mountain String Band - 6.26.04 - Horning's Hideout - North Plains, OR, 7078=http://www.archive.org/details/moe2008-06-16.tlm170.early.balcony.split.flac16, 7154=Moe - 6.16.08 - Highline Ballroom - New York City, NY, 4718=PLAYLIST: Movin' On June 11, 2010, Friday, 12 noon to 1:30 pm KBOO Portland, OR: 90.7 Corvallis/Albany, OR: 100.7 Hood River/Columbia Gorge: 91.9 Host: Don Jacobson Posted to: Folkdj-l, www.kboo.fm Webcast on  http://www.kboo.fm (VA) = Various Artists.  All media are CDs unless otherwise stated. Artist: \"Selection\" ALBUM TITLE [Label] (VA) Will Geer: Excerpt from This Land Is Your Land \"I Hate A Song That ...\" A TRIBUTE TO WOODY GUTHRIE [Warner Bros.] ((Intro)) Sandy Rothman/Steve Pottier: \"In the Pines\" BLUEGRASS GUITAR DUETS [Sierra] ((Music Bed)) ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Laurie Lewis: \"How Can I Keep From Singing?\" BLOSSOM [Spruce & Maple] Evie Ladin: \"Going Across the Sea\" FLOAT DOWNSTREAM [Evil Diane] Jane Rothfield/Alan Carr: \"Falls of Richmond/Tater Patch\" THERE AND BACK [Temple LP] ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Lisa Ornstein/Dan Compton Live in the KBOO air room! ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Carolyn Cruso: \"Carolyn's Welcome\" BOUNDLESS [Blue Heron] Grainne Murphy: \"Monaghan Jig/The Kilmovee/The Misbegotten Grandchild\" SHORT STORIES [Self] ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Si Kahn: \"Ireland Of My Dreams\" COURAGE [Strictly Country] Atwater Donnelly: \"These Woods\" WHERE THE WILD BIRDS DO WHISTLE [Self[ Jeni & Billy: \"While I Stay Home and Weep\" LONGING FOR HEAVEN [Jewell Ridge] Atwater Donnelly: \"Red Rocking Chair\" WHERE THE WILD BIRDS DO WHISTLE [Self] The Haints Stringband: \"Riley the Furniture Man\" SHOUT MONAH [Self] ((Taken from Sing Out! v.53, #3)) ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Fourtold: \"Four Rode By\" FOURTOLD [Appleseed] Red Molly: \"You'll Never Harlan Alive\" JAMES [Self] John Hartford String Band: \"Half Past Four\" MEMORIES OF JOHN [Compass] ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ ((Outro)) Questions & comments are welcome., 8281=http://www.archive.org/details/gd80-06-12.aud.willy.11361.sbeok.shnf}", "TableContextTimeStampAfterTable": "{103475=All the music from tonight’s show was taken from the PDX Pop Now! compilations. The first one was released in 2004. The newest one was released this past week and is available at stores such as Everyday Music and Music Millenium. If you are seeking greater knowledge of the local music scene, these comps are a great way to take it in. I highly recommend it., 127821=Copyright © 2012 KBOO Community Radio | Copyright Policy | Community Guidelines | Website Illustration & Design by: KMF ILLUSTRATION, 104367=Ms. Su’ad – Sweat The Design – PDX Pop Now! 2006 Tope & Epp (featuring Immaculate) – The Basics – PDX Pop Now! 2010 Braille – The IV – PDX Pop Now! 2008 Libretto (featuring Lifesavas) – Volume – PDX Pop Now! 2004, 106796=The Decemberists – Here I Dreamt I Was An Architect – PDX Pop Now! 2004 Blue Cranes – Broken Windmills – PDX Pop Now! 2009 Bodhi – Nadine – PDX Pop Now! 2008, 98491=Playlist: (Artist/Track/Album) Jeb and Cousin Easy - Emag Flog Eht - 7\" Slim Gaillard - Arabian Boogie - Best of comp. Blaine L. Reininger - Glossolalia - Glossolalia Richard Hayman - Incantations Sigur Rós - Svefn-g-englar - Ágætis byrjun The Kipper Kids - Bim Bam Boom - Forbidden Zone OST Mike Patton - Porno Holocaust - Adult Themes for Voice Magma - Hortz Fur Dëhn Stekëhn West - Mekanïk Destruktïw Kommandöh    Magma - Ïma Sürï Dondaï - Mekanïk Destruktïw Kommandöh Magma - Kobaïa Is De Hündïn - Mekanïk Destruktïw Kommandöh    The Ruins - Bliezaning Motts - Symphonica Can - Oh Yeah - Tago Mago Anna Homler - B'Sha Ko'la Kee'ya - House of Hands Slim Gaillard - Soony Roony (Song of Yxabat) - Best of Comp. Diamanda Galas - | - Schrei X Christian Bok - Ubuhubub - Ubuweb Christian Bok - Valuvëula - Ubuweb Christian Bok - Ursonate - Ubuweb  Marie Osmond - Karawane - Lipstick Traces LP Elizabeth Claire Prophet - Invocation for the judgement against and destruction of rock music - Sounds of American Doomsday Cults, vol.14 Pink Floyd - Several Small Furry Animals... - Ummagumma The Residents - The Big Bubble - The Big Bubble Alberta Casey - Flugadi (Volare) - San Diego Volkas Alberta Casey - Ponto Trans Akvo Storma (Bridge Over Troubled Water) - San Diego Volkas JoMo - Al la Barikadoj - JoMo kaj Liberecanoj JoMo Friponas - Esperanto! - JoMo kaj Liberecanoj Johnson Mac Low - 38th and 39th - Open Secrets Anna Homler - Eje Wob-co - House of Hands Walt Kelley - Go Go Pogo - Songs of the Pogo Cathy Berberian - Stripsody - Magnificathy, 105328=HOUR TWO: The Mint Chicks – Hot On Your Heels – PDX Pop Now! 2009 Sunset Valley – Mr. Extreme Jeans – PDX Pop Now! 2004 Meth Teeth – Unemployment Forever – PDX Pop Now! 2007 paper/upper/cuts – El Ranchero Tejano – PDX Pop Now! 2010 The Sensualists – You Are Love – PDX Pop Now! 2004 The Great Mundane – Pulling Weeds – PDX Pop Now! 2010, 107271=____________________________________________________________ shows mentioned: July 30 – August 1 PDX POP NOW! Festival (at Rotture) ____________________________________________________________ some stats (songs played by year): 2004: 7 2005: 3 2006: 6 2007: 6 2008: 6 2009: 6 2010: 12, 106989=The I’s – Soul’s Corruption – Herbivore Blues (Shut Up And Scream, 2009) The Shaky Hands – The Sleepless – PDX Pop Now! 2006 New Bloods – Oh, Deadly Nightshade – PDX Pop Now! 2008, 106387=HOUR THREE: Explode Into Colors – Paper (Hot Sax Version) – PDX Pop Now! 2009 Jonnyx & The Groadies – The Upheaval On Titan – PDX Pop Now! 2010 Viva Voce – Alive With Pleasure – PDX Pop Now! 2005 Tara Jane O’Neil – Famous Yellow Belly – PDX Pop Now! 2004 Alela Diane – Up North – PDX Pop Now! 2007 A Weather – Spiders, Snakes – PDX Pop Now! 2008, 105260=Sweater! – Mediterranean – PDX Pop Now! 2007, 105724=Andy Combs & The Moth – Let’s Ride – PDX Pop Now! 2008 Shicky Gnarowitz & The Transparent Wings Of Joy – Freilechs Von Der Chuppe – PDX Pop Now! 2005 ioa – Boxcar Children – PDX Pop Now! 2010 Ocean Age – Dalvik Tide – PDX Pop Now! 2010 Laura Veirs – Wide-Eyed, Legless – PDX Pop Now! 2010, 104625=Menomena – Five Little Rooms – PDX Pop Now! 2010 Talkdemonic – Mutiny Sunshine – PDX Pop Now! 2004 Mirah – Generosity – PDX Pop Now! 2009 Pink Martini – Hey Eugene – PDX Pop Now! 2008 Laura Gibson – Hands In Pockets – PDX Pop Now! 2006, 106068=The Planet The – Toledo Vader – PDX Pop Now! 2004 Nucular Animals – Oooh Kill Oooh – PDX Pop Now! 2010 March Fourth Marching Band – Space Hole – PDX Pop Now! 2006 Breakfast Mountain – Tramm – PDX Pop Now! 2010, 107204=Grouper – Rising Height – PDX Pop Now! 2009, 119398=Latest newsletter: May 2015, 51023=Well, Suprise, Suprise! Here I am again filling in for Matt Smith's Rolling Thunder Review!! Today (June 5th) is his Daughter Kelly's 9th Birthday! Happy Birthday Kelly! We began the festivities with some material from the 2-26-90 show from Oakland Coliseum Arena. A hilarious \"We Want Phil\" episode with Mr. Lesh delivering the goods with Tom Thumb Blues, followed by Music Never Stopped > Don't Ease Me In. We continued this very special day by fulfilling a promise made on my last show to complete the 7-18-76 Orpheum Theater show Set 2. We heard Sugar Magnolia, and the encore Johnny B. Good. It should be noted that J.B.Goode is omited from many of the F.M. broadcasts in circulation these days, so that makes the encore a rarity! At this point we began a nice set 2 sbd from Grateful Dead's East Coast hangout, Madison Square Garden on 9-9-91. By this time we were joined by my Friend, and Cohort Tom Chiles. Always a pleasure to have Tom in the room! We started set two, and made it all the way to Drums > Space before running out of time. We then turned the chair over to Rasheed. Matt will be in the chair on June 26th in place of me, and Alicia Olson and I will be anchoring the Portland Waterfront Blues Festival on July 4th one week later. Commander Cody will be headlining that day before the fireworks! We'll see you on the fourth!, 104908=Nice Boys – Johnny Guitar – PDX Pop Now! 2007 Mean Jeans – Steve Don’t Party No More – PDX Pop Now! 2010 The Thermals – Product Placement – PDX Pop Now! 2006 Cootie Platoon – Divided – PDX Pop Now! 2006 Junkface – ATAMAKATAHIZAASHI – PDX Pop Now! 2007 Kristin Hersh – Blackstone – PDX Pop Now! 2007, 106319=The Minders – I’m So Low – PDX Pop Now! 2005, 104284=HOUR ONE: Lightheaded – Hard Rock – PDX Pop Now! 2009}", "lastModified": "Sat, 01 Aug 2015 04:41:47 +0000", "textBeforeTable": "06/10/2010 Air date:  Ital Vibes Program name:  Reggae - Caribbean Categories: Ital Vibes playlist for 06/10/2010 Login or register to post comments PLAYLIST: Movin' On June 11, 2010, Friday, 12 noon to 1:30 pm KBOO Portland, OR: 90.7 Corvallis/Albany, OR: 100.7 Hood River/Columbia Gorge: 91.9 Host: Don Jacobson Posted to: Folkdj-l, www.kboo.fm Webcast on  http://www.kboo.fm (VA) = Various Artists.  All media are CDs unless otherwise stated. Artist: \"Selection\" ALBUM TITLE [Label] (VA) Will Geer: Excerpt from This Land Is Your Land \"I Hate A Song That ...\" A TRIBUTE TO WOODY GUTHRIE [Warner Bros.] ((Intro)) Sandy Rothman/Steve Pottier: \"In the Pines\" BLUEGRASS GUITAR DUETS [Sierra] ((Music Bed)) ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Laurie Lewis: \"How Can I Keep From Singing?\" BLOSSOM [Spruce & Maple] Evie Ladin: \"Going", "textAfterTable": "Parables VP Records Prince Alla & Phillip Fraser Black Rose 12 Inch Single Freedom Dennis Brown Easy Take It Easy 7 Inch Single Studio One Dennis Brown & Big Youth In His Own Way 12 Inch Single Gussie 76 Dennis Brown Promise Land 12 Inch Single Simba Nas & Damian Marley ft Dennis Brown Land Of Promise Distant Relatives Universal Republic Nas & Damian Marley Nah Mean Distant Relatives Universal Republic Timberlee/Ward 21 Top Dweller Instrumental Ward 21 Timberlee I Wanna Be On Top Ward 21 Birchill Get Fresh Riddim Instrumental Get Fresh Riddim Birchill Cecile Working Get Fresh Riddim Birchill Assassin Girls Dem Get Fresh Riddim Birchill Elephant Man Ever Fresh Get Fresh Riddim Birchill Ward 21 Cosa Nostra Riddim Instrumental Cosa Nostra Riddim Ward 21 Leftside Want Yu Body Keep Left Equinoxx Infantry Riddim Instrumental Infantry Riddim Equinoxx Nas & Damian Marley ft K'Naan Tribes At War Distant Relatives Universal Republic Nas & Damian Marley Count Your Blessings Distant Relatives Universal Republic Wayne Marshall My Heart Baby G/Yard Vybz", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}