{"relation": [["Title", "Sesame salad dressing", "Authentic paella?", "IMPORTANT: If you have a blog on JustBento...", "Shiso - uses for this herb", "Fuki (Japanese Butterbur) Tsukemono Recipes"], ["Author", "Supertaster", "maki", "maki", "Loretta", "kumo"], ["Answers", "9", "10", "2", "0", "5"], ["Last Post", "1 year 47 weeks ago", "1 year 48 weeks ago", "1 year 51 weeks ago", "2 years 6 days ago", "2 years 1 week ago"]], "pageTitle": "Hey, the Just Bento Cookbook is AVAILABLE NOW? | Just Bento Community Forum", "title": "", "url": "http://www.justbento.com/forum/hey-just-bento-cookbook-available-now", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00284-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 524548438, "recordOffset": 524532044, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{18856=However, since I was placing an order when I found The Just Gorgeous ... er, Just Bento Cookbook on Bento&Co, I took the chance to have it now rather than wait; for the roughly US$6-10.00 difference in price, which I can make up by skipping a few subway rides at US$2.50 a pop, I paid for what otherwise would be months of waiting. I'm really thrilled to have in my hands and read through several times in the past couple of days a cookbook that will help me in lots of ways now when I need it most, and besides has given hours of pleasure already. :-} I also decided to say no more of it on the forum once I learned of the Amazon arrangement, but changed my mind when I saw your reply and thought others might care to hear my reasoning on the subject., 14599=The Book Depository's price is £10.49 (12.62 Euro, US$16.45), delivery in November, with FREE shipping worldwide (and their parcels get to me right on the other side of the world in a week). Amazon has it for US$13.46 plus shipping., 31125=I believe that not being able to ship within Japan is just because the company is not set up for it - but I'm not certain. I guess we could ask Thomas of Bento&co about that ^_^ (I met him in Kyoto back in March, he's a great guy who has totally embraced life in Japan. His command of Japanese is amazing for someone who's only been there for a few years!) Anyway, I do agree that perhaps ordering the book by itself from them is not the cheapest, but rather combining it with another order. Or for the super-impatient who Must Have It Now!, 27789=Edit: No, that doesn't explain it. The rrp in England works out to only 1900 yen, and in the US to 1724 yen. So they're cheaper even before the discounting., 23265=For what it's worth, what Bento & co is charging is what they are allowed to charge as a company operating from Japan - in Japan, a retailer is not allowed to discount a new book (I think France, Germany, Switzerland and some other countries have the same law). So they are charging the fixed retail price of 2100 yen. Personally I think that if you're going to ordering something else from B&co anyway, it's not a bad deal to get the book too (cough) ^_^; Casabento.com should also have it in stock shortly I hear.}", "lastModified": "Fri, 31 Jul 2015 07:22:20 GMT", "textBeforeTable": "New forum activity since your last visit More information about formatting options Web page addresses and e-mail addresses turn into links automatically. Each email address will be obfuscated in a human readble fashion or (if JavaScript is enabled) replaced with a spamproof clickable link. You may quote other posts using [quote] tags. Allowed HTML tags: <h3> <h4> <h5> <h6> <object> <a> <em> <strong> <p> <br> <i> <b> <cite> <code> <ul> <ol> <li> <dl> <dt> <dd> <img> You can use Markdown syntax to format and style the text. Markdown Lines and paragraphs break automatically. You may quote other posts using [quote] tags. Each email address will be obfuscated in a human readble fashion or (if JavaScript is enabled) replaced with a spamproof clickable link. Web page addresses and e-mail addresses turn into links automatically. Allowed HTML tags: <h3> <h4> <h5> <h6> <object> <a> <em> <strong> <p> <br> <b> <i> <blockquote> <cite> <code> <ul> <ol> <li> <dl> <dt> <dd> <img> Filtered HTML Input format", "textAfterTable": "    » See more activity Join the Just Bento flickr pool Join the Bento Gear flickr pool Recently commented articles Tuna tofu miso mini burgers (42 comments) Stewed hijiki seaweed with carrots and fried tofu", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}