{"relation": [["Artist", "The All-American Rejects", "Josh Kelly"], ["Song Title", "Dirty Little Secret", "Almost Honest"], ["Played When", "", ""]], "pageTitle": "Smallville Season 5 Episode 16 - Hypnotic (5x16) - Watch Online - s5 e16 Spoilers", "title": "", "url": "http://www.tvrage.com/Smallville/episodes/313785", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00085-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 788396327, "recordOffset": 788380367, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Music James Marsters is billed as Special Guest Star. here. \"In Memory of Dana Reeve (1961-2006)\"dedication along with the website for the Christopher Reeve Foundation. Which can be found At the end of the episode during its first airing, there was a Lionel does not appear in this episode. Episode Notes Click here to add a recap for Hypnotic Next Episode --> <-- Previous Episode Recap Clark Kent / Kal-El As Tom Welling Main Cast Simone As Nichole Hiltz Recurring Milton Fine As James Marsters Guest Stars", "textAfterTable": "Episode Quotes Lois: (to Simone) I suggest you turn your boy toy back to normal before I reach over and rip out those pearly white teeth of yours. Clark: I don't know of any other way to say it. The truth is... my feelings for you have changed. Lana: Clark, I want you to look me in the eye and tell me you don't love me. Clark: I don't love you. Lana: I have been so stupid. Lex: You're not stupid. You just put your trust in the wrong person. Lois: Maybe I can talk to her about my nail-biting issue? Chloe: I'm afraid it's a little late for that. Milton Fine: I'm not sure you understand me, Mr. Luthor. If we don't work together, there may not be a Luthor Corp or a government left. Think about that on your flight home. Clark: I'm asking you nicely - step aside. Lois: Look, I didn't want to have to do this but if necessary, I'm gonna have to take you down! Clark: You're crossing a line here, Chloe. And I have", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}