{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Alfie", "The Man That Got Away (from the movie \"A Star is Born\")", "Trouble Is a Man", "Happiness Is Just a Thing Called Joe", "For Every Man There Is a Woman", "I Got a Man Crazy for Me (He's Funny That Way)", "My Man (Mon Homme)", "I'm Just Wild About Harry", "Jim", "Danny Boy"], ["Artist", "Sarah Vaughan", "Sarah Vaughan", "Sarah Vaughan", "Sarah Vaughan", "Sarah Vaughan", "Sarah Vaughan", "Sarah Vaughan", "Sarah Vaughan", "Sarah Vaughan", "Sarah Vaughan"], ["Time", "3:33", "4:28", "3:43", "3:50", "3:23", "3:31", "3:52", "2:39", "3:42", "4:35"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - It's a Man's World by Sarah Vaughan", "title": "", "url": "https://itunes.apple.com/cy/album/danny-boy/id13107171?i=13107173", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00188-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 867929803, "recordOffset": 867905918, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{123889=Copyright © 2014 Apple Inc. All rights reserved., 19261=Sarah Vaughan is heard in a series of ballads that are often heard in a jazz setting, but the somewhat heavy-handed arrangements by Hal Mooney, Bob James (long before smooth jazz existed as a genre), and Bob Freedman lean more toward easy listening, with frequently stiff rhythm accompaniment and often overbearing strings. The singer's lovely voice, which is in great form, is full of the adventurous spirit, as is the sole improviser on the date, stretching the boundaries of ten strong compositions, including oldies like \"Danny Boy\" and \"I'm Just Wild About Harry,\" to pop songs of the day such as the huge hit \"Alfie.\" There are also several gems by songwriters who were still active at the time, including Alec Wilder's \"Trouble Is a Man,\" as well as a trio of timeless standards by Harold Arlen. The sound on this 24-bit limited-edition CD reissue, which is available only until May 2005, is impeccable, with a perfect mix between the singer and the orchestra, so anyone who enjoys Sarah Vaughan's vocals should pick up this CD., 20457=Born: 27 March 1924 in Newark, NJ}", "lastModified": "Fri, 31 Jul 2015 08:31:29 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Sarah Vaughan It's a Man's World iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from It's a Man's World by Sarah Vaughan, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes", "textAfterTable": "10 Songs Album Review Sarah Vaughan is heard in a series of ballads that are often heard in a jazz setting, but the somewhat heavy-handed arrangements by Hal Mooney, Bob James (long before smooth jazz existed as a genre), and Bob Freedman lean more toward easy listening, with frequently stiff rhythm accompaniment and often overbearing strings. The singer's lovely voice, which is in great form, is full of the adventurous spirit, as is the sole improviser on the date, stretching the boundaries of ten strong compositions, including oldies like \"Danny Boy\" and \"I'm Just Wild About Harry,\" to pop songs of the day such as the huge hit \"Alfie.\" There are also several gems by songwriters who were still active at the time, including Alec Wilder's \"Trouble Is a Man,\" as well as a trio of timeless standards by Harold Arlen. The sound on this 24-bit limited-edition CD reissue, which is available only until May 2005, is impeccable, with a perfect mix between the singer and the orchestra, so anyone who enjoys Sarah Vaughan's vocals should pick up this CD. Biography Born: 27 March 1924 in Newark, NJ Genre: Jazz Years Active: '40s, '50s, '60s, '70s, '80s Possessor of one of the most wondrous", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}