{"relation": [["Title", "101 \"Answers\" for New Teachers and Their Mentors", "Exceptional Teacher's Handbook", "First Days of School", "First-Year Teacher’s Survival Kit", "It's Your First Year Teaching, But You Don't Have to Act Like It", "Letters to a New Teacher, A Month-by-Month Guide to the Year Ahead", "New Elementary Teacher’s Handbook, Flourishing in Your First Year"], ["Author", "Annette L. Breaux", "Carla F. Shelton and Alice B. Pollingue", "Harry Wong and Rosemary Wong", "Julia G. Thompson", "Bob Kitchen", "Jim Burke with Joy Krajicek", "Kathleen Feeney Jonson"], ["Description", "This book generates instant impact on teaching and learning, provides a collection of \"thought provokers\" and teaching tips for new teachers, stimulates and organizes interactive sessions between new teachers and their mentors, supports and sustains master classroom teachers who need help mastering their roles as mentors, and offers common sense strategies for any teacher seeking to be more effective.", "Designed to assist the first year special education teacher by offering checklists, forms, management approaches, and much more.", "This book is the best selling advice from the well known author, Harry Wong. It contains five units. The first is Basic Understandings; a successful teacher must know and practice the three characteristics of an effective teacher. The first characteristic, positive expectations, the second characteristic, classroom management, and the third characteristic, lesson mastery. The last unit is Future Understandings, the professional; the teacher who constantly learns and grows becomes a professional educator.", "This kit offers ready to use strategies, tools and activities for meeting the challenges of each school day. Here is a sample of what you can expect from this book; how to become a valuable team player, how to connect with your students, how to design and deliver effective instruction, how to evaluate your students' progress, and much more.", "This book includes sections on how to find and prepare for a job, what to do and say on your first day, and how to handle various discipline situations that could arise the first year. Any prospective teacher who reads this book will reap immediate benefits. Whether during your job search, planning stage, first day in the classroom, or first year as a whole, Kitchen offers practical, humorous, and motivational advice that new teachers can use to survive their first year.", "Every new teacher needs a mentor; someone smart, experienced, compassionate, and reliable to give advice, share strategies, and lend a supportive ear. Letters to a New Teacher is the chance of a professional lifetime, an opportunity to read the letters and emails Jim Burke exchanged with novice teacher Joy Krajicek--letters in which Jim opens his practice, his mind and his heard to guide Joy through her first year in the classroom. Jim fields the whole gamut of questions--from typical classroom-management matters to challenging instructional situations to sensitive topics like the boundaries of student-teacher relationships.", "This second edition provides desperately needed, yet often unavailable, practical advice. This easy-to-read, jargon-free guide empowers new teachers with the tools necessary to feel prepared, confident, and comfortable, but also to succeed, maintain enthusiasm, and remain committed to the profession. It is teeming with helpful hints, red flags to watch for, examples of best practices, and timesaving solutions to some of the most common questions and concerns all teachers face."]], "pageTitle": "Novice Teachers - Northeastern Nevada Professional Development Program", "title": "", "url": "https://sites.google.com/site/nvnnrpdp/library/books/novice-teachers", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00198-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 875948604, "recordOffset": 875932210, "tableOrientation": "HORIZONTAL", "lastModified": "Tue, 28 Jul 2015 08:17:14 GMT", "textBeforeTable": "  Sort    Sort    Sort  Description Author Title 7 items Showing here to search the entire library including DVD's. Click  Novice Teachers Books‎ > ‎ Library‎ > ‎ 1290 Burns Road High Tech Center Room 119 Elko, NV  89801 775-753-3879 775-753-3961 (fax) Contact Us NNRPDP", "textAfterTable": "Showing 7 items Sign in|Recent Site Activity|Report Abuse|Print Page|Powered By Google Sites Ascending Descending Ascending Descending Ascending Descending", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}