{"relation": [["Monograph Number", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28"], ["Author", "David Dungworth", "Christopher A. Snyder", "Phil Perkins", "Caroline Wickham-Jones and Magnar Dalland", "Dominic Powlesland", "Michael Walker et al.", "Kurt Hunter-Mann et al.", "Martin Millett et al.", "Julian D. Richards", "Damian Steptoe and W.B. Wood", "Peter H.W. Bristow", "Jeremy Haslam", "Karen Hardy and Paul Sillitoe", "Steven Willis", "Penelope M. Allison et al.", "Gail Falkingham", "George Geddes", "Michael Given et al.", "A. Clarke et al.", "J.S. Carrión et al.", "Julian D. Richards et al.", "Tim Williams", "John Creighton et al.", "Dominic Powlesland and Keith May", "Derek Hurst et al.", "Katherine Baker et al.", "Nicola Terrenato et al.", "Emma Durham"], ["Title", "Iron Age and Roman copper alloys from northern Britain", "A gazetteer of Sub-Roman Britain (AD 400-600): The British sites", "Etruscan pottery from the Albegna Valley/Ager Cosanus Survey", "A small mesolithic site at Fife Ness, Fife, Scotland", "The West Heslerton Assessment", "Two SE Spanish Middle Palaeolithic Sites with Neanderthal Remains: Sima de las Palomas del Cabezo Gordo and Cueva Negra del Estrecho del Río Quípar (Murcia province)", "Excavations on a Roman Extra-Mural Site at Brough-on-Humber, East Riding of Yorkshire, UK", "The Ave Valley, northern Portugal: an archaeological survey of Iron Age and Roman settlement", "Anglian and Anglo-Scandinavian Cottam: linking digital publication and archive", "The Human Remains from HMS Pandora", "Behaviour and belief in mortuary ritual: attitudes to the disposal of the dead in southern Britain 3500 BC-AD 43", "Excavations at Cricklade, Wiltshire, 1975", "Material Perspectives: Stone Tool Use and Material Culture in Papua New Guinea", "Samian Pottery, a Resource for the Study of Roman Britain and Beyond: the results of the English Heritage funded Samian Project. An e-monograph", "Extracting the social relevance of artefact distribution in Roman military forts", "A Whiter Shade of Grey: A new approach to archaeological grey literature using the XML version of the TEI Guidelines", "Vernacular Buildings of the Outer Hebrides 300 BC-AD 1930: Temporal comparison using archaeological analysis", "Joining the Dots: Continuous Survey, Routine Practice and the Interpretation of a Cypriot Landscape", "Silchester Roman Town Insula IX: The Development of an Urban Property c. AD 40-50 - c. AD 250", "Quaternary pollen analysis in the Iberian Peninsula: the value of negative results", "Anglo-Saxon Landscape and Economy: using portable antiquities to study Anglo-Saxon and Viking Age England", "The landscapes of Islamic Merv, Turkmenistan: Where to draw the line?", "Becoming Roman in southern Burgundy: A field survey between Autun and Bibracte in the Arroux Valley (Saône-et-Loire), 2000-2003", "DigIT: Archaeological Summary Report and Experiments in Digital Recording in the Field", "Iron Age Settlement at Blackstone, Worcestershire: Excavations 1972, 1973 and 1977", "Archaeological Investigations at the Upper Chapel, Norfolk Street, Sheffield, UK", "The S. Omobono Sanctuary in Rome: Assessing eighty years of fieldwork and exploring perspectives for the future", "Depicting the gods: metal figurines in Roman Britain"]], "pageTitle": "Internet Archaeol. E-Monograph Series.", "title": "", "url": "http://intarch.ac.uk/emonograph.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00188-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 124533420, "recordOffset": 124525218, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Some Internet Archaeology articles are more like monographs. Unlike 'conventional' journal articles, they may contain 100s of images or link to or integrate large sets of data. All such articles already published in Internet Archaeology have been brought together in one place to form an E-Monograph series. This is not a separate digital publication (all remain listed as articles in their respective issues) but our aim is to showcase and highlight these particularly large bodies of work and to remind potential authors of the publishing opportunities available via Internet Archaeology. Internet Archaeology E-Monograph Series", "textAfterTable": "Have you got an idea for an e-monograph? Visit our Guidelines for Authors for more information on how to submit a proposal. only search Internet Archaeology  HOME   ABOUT   FOR AUTHORS  Except where otherwise noted, content from this work may be used under the terms of the Creative Commons Attribution 3.0 Unported licence. Any further distribution of this work must maintain attribution to the author(s), the title of the work, the Internet Archaeology journal and the relevant URL/DOI. University of York legal statements | Terms and Conditions | Citing IA", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}