{"relation": [["Title", "NES ROM Hacking", "ZSNES Savestate SPC Format", "SNES Memory Mapping", "ZSNES Savestate Format", "Rob Norther Compression Format", "PsyQ SNES Development Manual", "NESDEV Tutorial", "Turbografx-16 CD Syscard BIOS Functions - Bank 0", "zdawg's NES ROM Hacking Document", "Reading Data Through a Table", "Capcom MMC3 Sound Engine Information", "How NES Graphics work", "NES Documentation", "SNES Doc", "Xcalibur's Pointer Document", "6502 Palette Changing Tutorial", "Programming the 65816", "Programming the 65816", "SNES Multiplication/Division Registers", "The Art of ROMhacking"], ["Author", "§N¥ÅP§ÎD¤", "_Demo_", "]SiMKiN[", "ZsKnight", "Zoinkity", "zeug", "Zerosoul", "Zeograd", "ZackMan", "ZackMan", "za909", "yarbles", "y0shi", "y0shi", "Xcalibur", "windwalker101", "William Labiak", "Western Design Center", "Vic Ricker", "Vagla"], ["Description", "An easy to follow guide to NES romhacking.", "This is a detailed look at the SPC portion of the ZSNES savestate. This is invaluable information for anybody trying to learn some SPC700 hacking skills. The companion general ZSNES savestate format document can also be found right here at….", "Brief description of SNES LoROM and HiROM memory maps. Nice as a quick graphical type reference, but not as complete as some other sources on the subject such as open source emulator source code.", "Straight from the creator himself, this is the ZSNES save state format documentation. This is a must have for serious save state hackers!", "Description of the Rob Northern Compression format. Includes a breakdown of the standard compressed file, indexed mode, and archive mode headers, as well as the related method used by Acclaim for multipart files. Encryption and locking are ….", "This is a scanned version of the custom Software Development Kit Psygnosis created to code SNES games with a kind of high level assembly toolchain (supporting C-like control statements like if then else, etc). Commercial games like the platformer ….", "This is a 6502 NES programming tutorial that explains many things such as opcodes, addressing modes, NES memory structure, making your first demo. This tutorial also gives examples explaining all of the above and more.", "The first bank of BIOS functions from the Turbografx-16 CD’s Syscard disassembled and commented. While the commenting is very extensive, the general flow of the functions can be surmised; not all functions are commented, however.", "Covers several different aspects of ROM hacking.", "A document with included sample code describing how to support table files in your programs.", "Here is some information regarding MMC3 Sound channels", "A narative on how the NES displays graphics.", "Comprehensive documentation covering details of several areas of the NES.", "The greatest Super Nintendo documentation in its day, but newer docs have more information.", "A nice condensed document aimed at those wishing to master the art of SNES pointers.", "This is a straightforward tutorial on how to change the palette on screen using 6502 assembly.", "This is a book that teaches you how to assembly program on the 65816 microprocessor. It teaches you many things, starting from number systems, boolean math. Including the technical details about the 65816 microprocessor.", "Official programming guide to the 65816 microprocessor. Also includes documentation on the 6502, 65C02 and 65802 microprocessors. 469 pages covering basic assembly language concepts, microprocessor architecture, instruction sets, simple and complex….", "This is an in-depth documentation on the SNES’s special multiplication/division registers.", "A beginner to intermediate guide on hacking for the NES. Although targeted at the NES, many principles taught can be used on any system. Information includes hex editing, palette editing, level editing in hex, finding data, and dealing with simple co…."], ["Category", "Text Hacking", "Save State Hacking", "Hardware Info.", "Save State Hacking", "File Formats", "Assembly", "Assembly", "Source Code", "Text Hacking", "Source Code", "Audio Hacking", "Hardware Info.", "Hardware Info.", "Hardware Info.", "Pointer Hacking", "Graphics Hacking", "Assembly", "Assembly", "Hardware Info.", "Miscellaneous"], ["Platform", "NES", "SNES", "SNES", "SNES", "Multiple", "SNES", "NES", "TGCD", "NES", "NA", "NES", "NES", "NES", "SNES", "SNES", "NES", "Multiple", "SNES", "SNES", "NES"], ["Game", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A", "N/A"], ["Ver", "1.0", "Unknown", "3.5", "Unknown", "1.0", "1.0", "1.0", "1.0", "0.65", "1.0", "1.0", "1.0", "2.0", "2.30", "1.1", "1.0", "1.0", "1.0", "1.0", "1.0"], ["Level", "Beg", "Int", "Int", "Beg", "Int", "Adv", "Adv", "Int", "Beg", "Beg", "Adv", "Beg", "Beg", "Beg", "Int", "Adv", "Int", "Int", "Adv", "Beg"], ["Date", "None", "None", "23 Mar 1998", "None", "28 Nov 2012", "None", "30 Jul 2001", "None", "None", "None", "27 May 2015", "None", "None", "None", "None", "None", "None", "None", "26 Dec 1993", "None"]], "pageTitle": "Romhacking.net - Documents", "title": "(1 to 20) of 305 Results", "url": "http://www.romhacking.net/?page=documents&game=704&dir=1&order=Author", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00265-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 676206112, "recordOffset": 676190167, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Button Search Description Search Title Level None Selected Advanced Beginner Intermediate Results Per Page None Selected 10 20 30 40 50 Author None Selected AC2k Adam Clayton Adam Trionfo AlphaBeta ambyra anarko Andreas Naive Andrew Davie Andrew Towers Anomie AntiTrack AnusP AP aStROcReEp 2000 Barry Leitch Bart Trzynadlowski Bastard Son bbitmaster Beneficii Benjamin Cutler Benzene Bisqwit Blargg Blazer BMF54123 Bob Polaro Bongo` Brad Taylor Bregalad Brett Tabke Butcha byuu Catalyst Cellar Dweller Charles MacDonald Chickenlump Chippy2000 Chris Covell Chris Shrigley Cless coldIced Color Dreams Commando125 Coolboyman Crazy Child creaothceann CricketNE Cyber Warrior X Czar Dragon D d0nut Dacicus DahrkDaiz Daniel Lawton Dark Force Dark X DarKnight13 Dave Augusta Dave Shadoff David Galloway David Timko David Tucker David Woodford Demiforce Dennis Debro DevSter Dienyddiwr", "textAfterTable": "1 2 3 4 5 ... 16 Next ﻿ Information ©2005-2014 RHDN 2.6.0 by Nightcrawler. All Rights Reserved. Execution time - 0.6878 sec. - Number of Queries: 2 About Us | RHDN Policy | XHTML | CSS", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}