{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"], ["Name", "Soft As Snow (But Warm Inside)", "Lose My Breath", "Cupid Come", "(When You Wake) You're Still In a Dream", "No More Sorry", "All I Need", "Feed Me With Your Kiss", "Suesfine", "Several Girls Galore", "You Never Should", "Nothing Much to Loose", "I Can See It (But I Can't Feel It)"], ["Artist", "My Bloody Valentine", "My Bloody Valentine", "My Bloody Valentine", "My Bloody Valentine", "My Bloody Valentine", "My Bloody Valentine", "My Bloody Valentine", "My Bloody Valentine", "My Bloody Valentine", "My Bloody Valentine", "My Bloody Valentine", "My Bloody Valentine"], ["Time", "2:22", "3:38", "4:29", "3:18", "2:47", "3:05", "3:54", "2:12", "2:21", "3:23", "3:17", "3:14"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Isn't Anything (Remastered) by My Bloody Valentine", "title": "", "url": "https://itunes.apple.com/bg/album/when-you-wake-youre-still/id510386179?i=510386254", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00265-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 869918231, "recordOffset": 869889587, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{25168=Formed: 1984 in Dublin, Ireland, 125280=Copyright © 2014 Apple Inc. All rights reserved., 23115=Though it's often seen as just a precursor to their magnum opus Loveless, in its own way My Bloody Valentine's Isn't Anything is nearly as groundbreaking as their 1991 masterpiece. Not only was it the most lucid, expansive articulation yet of the group's sound, it virtually created the shoegazing scene and spawned legions of followers. The album's tightly structured songs still bore traces of My Bloody Valentine's previous incarnation as jangly indie popsters, but Kevin Shields and company crafted wide-ranging experiments within those confines. \"Feed Me with Your Kiss\"'s mix of bruising guitars, drums, and sensual boy-girl vocals define My Bloody Valentine's signature sound, while \"All I Need\"'s weightless guitars and vocal melodies melt into a heady haze. Shields' unique tunings, tremolo, and miking techniques stand out on \"You Never Should\" and \"Nothing Much to Lose,\" but Deb Googe's surprisingly funky bassline on \"Soft as Snow (But Warm Inside)\" reaffirms that all of the Valentines contributed to their innovative sound. Indeed, many of Isn't Anything's disturbingly beautiful highlights come from Bilinda Butcher. On the wrenching \"No More Sorry,\" she sings abstractly pained lyrics like \"Your septic heart and deadly hand/Loved me black and blue,\" barely audible over a swarm of fragile yet menacing guitars, while on \"Several Girls Galore\" she's sexy, yet dazed and distant; it sounds like she's whispering in your ear outside of a blaring nightclub. The Valentines' dark side is especially prominent on the album, particularly on \"Sueisfine,\" where the chorus slyly morphs from \"Sue is fine\" to \"Suicide.\" Isn't Anything captures My Bloody Valentine's revolutionary style in its infancy and points the way to Loveless, but it's far more than just a dress rehearsal for the band's moment of greatness.}", "lastModified": "Fri, 31 Jul 2015 07:42:39 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist My Bloody Valentine Isn't Anything (Remastered) iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Isn't Anything (Remastered) by My Bloody Valentine, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes", "textAfterTable": "12 Songs Album Review Though it's often seen as just a precursor to their magnum opus Loveless, in its own way My Bloody Valentine's Isn't Anything is nearly as groundbreaking as their 1991 masterpiece. Not only was it the most lucid, expansive articulation yet of the group's sound, it virtually created the shoegazing scene and spawned legions of followers. The album's tightly structured songs still bore traces of My Bloody Valentine's previous incarnation as jangly indie popsters, but Kevin Shields and company crafted wide-ranging experiments within those confines. \"Feed Me with Your Kiss\"'s mix of bruising guitars, drums, and sensual boy-girl vocals define My Bloody Valentine's signature sound, while \"All I Need\"'s weightless guitars and vocal melodies melt into a heady haze. Shields' unique tunings, tremolo, and miking techniques stand out on \"You Never Should\" and \"Nothing Much to Lose,\" but Deb Googe's surprisingly funky bassline on \"Soft as Snow (But Warm Inside)\" reaffirms that all of the Valentines contributed to their innovative sound. Indeed, many of Isn't Anything's disturbingly beautiful highlights come from Bilinda Butcher. On the wrenching \"No More Sorry,\" she sings abstractly pained lyrics like \"Your septic heart and deadly hand/Loved me black and blue,\" barely audible over a swarm of fragile yet menacing guitars, while on \"Several Girls Galore\" she's sexy, yet dazed and distant; it", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}