{"relation": [["Current Position", "4", "7", "11", "14", "15", "29", "33", "45", "Off-list", "Off-list", "Off-list", "Off-list", "Off-list"], ["Last Week", "5", "9", "11", "16", "14", "35", "44", "26", "31", "47", "49", "Off-List", "Off-list"], ["Before New Year's", "3", "8", "N/A", "1", "5", "24", "47", "33", "27", "56", "49", "Off-list", "Off-list"], ["Before Christmas", "2", "5", "N/A", "N/A", "N/A", "32", "64", "14", "18", "41", "26", "29", "31"], ["Title", "Final Fantasy IV", "Dragon Quest IV", "Rune Factory 2", "Super Robot Taisen OG Gaiden", "Star Ocean 1 - First Departure", "Tales of Innocence", "Yuusha no kuseni namaikita", "Pokemon Dungeon - Explorers of Time", "Pokemon Dungeon - Explorers of Darkness", "Pokemon Diamond", "Dinosaur King - The Seven Fragments", "Mega Man Star Force 2 - Berserk x Dinosaur", "Mega Man Star Force 2 - Berserk x Shinobi"], ["Publisher", "Square Enix", "Square Enix", "Marvelous", "Capcom", "Capcom", "Bandai Namco", "SCE", "Nintendo", "Nintendo", "Nintendo", "Sega", "Capcom", "Capcom"], ["Platform", "", "", "", "", "", "", "", "", "", "", "", "", ""]], "pageTitle": "RPGamer > Japandemonium (January 18th, 2007)", "title": "", "url": "http://www.rpgamer.com/news/japan/mb011808.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00038-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 675927055, "recordOffset": 675913115, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1653=Wow. That was short. I'd have thought that the new RPGs for the Wii and XBox 360 would have more staying power in the sales world, but the DS dominates the board when it came to RPGs before, during, and after the winter holiday. There was a strong showing during the pre-Christmas shopping season, topped by -- surprise, surprise -- the newly reborn Final Fantasy IV for the DS, which sold 300,000 units in a very short time (Dec. 20th to Dec. 23rd). As well, rising from the ashes of the Lower 50 was Pokemon Diamond, after an absence of several weeks. The top-ranking game overall prior to Christmas, however, was Mario Party DS, with 318,000 units moved.}", "TableContextTimeStampAfterTable": "{12152=According to a PDF released by the company last month, Virtual World should be available to a wider audience starting mid-2008, and has the following system requirements:, 15349=The gameplay seems to be solid tactical RPG, all the way, with the addition of some nice, helpful map and stat windows in the upper screen of the DS. We'll see how it looks come April, when it's released in Japan. Until then, I can only wonder at the fact that Banpresto managed to shoehorn a two-disc PlayStation game into a single DS cartridge. Moore's Law applies doubly to video game storage capacity, it would seem.}", "textBeforeTable": "My apologies for the odd formating this week, but the Dengeki ratings were left un-updated for almost three weeks after Christmas. Since most businesses in Japan simply shut down for the New Year's holiday, that's not so surprising. If something is listed as \"Off-list,\" that means that the game has at some point dropped off the Top 50, and not risen back up. If the game hits the Top 50 again, I can see where they were on the Lower 50 previously. This Christmas season was a good one for Nintendo, especially. According to Dengeki, the company managed to take in 69.5% of all retail hardware sales (DS - 39.6%, Wii - 29.9%) and 79.3% of all retail software sales (DS - 56.8%, Wii - 22.5%) for the week leading up to Christmas, which is just as big a sales season in Japan as it is in America. Wow. That was short. I'd have thought that the new RPGs for the Wii and XBox 360 would have more staying power in the sales world, but the DS dominates the board when it came to RPGs before, during, and after the winter holiday. There was a strong showing during the pre-Christmas shopping season, topped by -- surprise, surprise -- the newly reborn Final Fantasy IV for the DS, which sold 300,000 units in a very short time (Dec. 20th to Dec. 23rd). As well, rising from the ashes of the Lower 50 was Pokemon Diamond, after an absence of", "textAfterTable": "Source: Dengeki Online GOOOOAAAAAL!! Over the years, I have seen and played some games that did interesting things with the RPG formula. Card-game RPGs, board-game RPGs, shooters and action-based RPGs, even a race car RPG, which I always thought was a bit of a stretch. The folks at Level 5 have given us a new twist, though, with their soccer-based Inazuma Eleven. These scans from Famitsu give us a bit more info on the characters in this sporty tableau, specifically the teams from Denmon Junior High School (the main character's team, from the looks of things) and the Imperial Academy (who have dark, gloomy antagonism written all over). On your team, there's Shinichi Handa (all-around normal-looking kid), Ayumu Shorinji (who has kung-fu literally written into his last name), Ryuugo Someoka (tall, brooding type), and Jin Kageno (the ninja). The main antagonist seems to be a kid named Kouenji. There are a variety of special techniques that can be used in the soccer matches, in typical Japanese Xtreme-action style. Much of the interface, both for determining plays and for using techniques, strongly reminds me", "hasKeyColumn": true, "keyColumnIndex": 4, "headerRowIndex": 0}