{"relation": [["Subject", "Orthodox Singles", "Re: Orthodox Singles", "Re: Orthodox Singles"], ["Author", "ABC", "Donna Fletcher", "james"], ["Posted", "October 03, 2004 12:20AM", "January 21, 2008 05:33AM", "January 21, 2008 06:39PM"]], "pageTitle": "Orthodox Singles", "title": "", "url": "http://www.orthodox.tv/phorum/read.php?35,448,448,printview", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00089-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 633041792, "recordOffset": 633033590, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Quote Reply God bless you, I wish we could have some Church moderated web network of Orthodox singles , that would have the capabilities of www.match.com , without all the profanity of a secular dating site. It would be well worth to have something like this to help bring people of like-faith and like-mind together. As good as OCA could be , it is not attracting a lot of people due to the difficulty of communication. There is nothing easier than signing up and publishing an online profile on a church moderated online Orthodox singles' site. There is also this secular tool that seems to offer orthodox singles a network to join. It has some almost scientific personality and attraction tests , which I 'm not sure if they work. It requires membership in order to be able to relate to other members , so this is a drawback. Their website is : www.match.com www.oca.org] [ It's really unfortunate that there is no Orthodox singles' network , for those of us who look for devoted orthodox partners in other parishes or jurisdictions. Catholics do have their own and others also do. It's extremely important to catch up with the technology in this area. The OCA is the best we have in North American Orthodoxy for singles", "textAfterTable": "This forum is powered by Phorum.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}