{"relation": [["Year", "2001", "2001", "2002", "2003", "2003", "2004", "2005", "2006", "2007", "2008", "2008", "2009", "2009", "2009"], ["Author", "Eugene Charniak", "Ulrich Germann, Michael Jahr, Kevin Knight, Daniel Marcu, and Kenji Yamada", "Franz Och and Hermann Ney", "Dan Klein and Chris Manning", "Yukiko Nakano, Gabe Reinstein, Tom Stocky, and Justine Cassell", "Diana McCarthy, Rob Koeling, Julie Weeds, and John Carroll", "David Chiang", "Rion Snow, Dan Jurafsky, and Andrew Y. Ng", "Y. W. Wong and R. J. Mooney", "Liang Huang", "Libin Shen, Jinxi Xu and Ralph Weischedel", "Andre Martins, Noah Smith and Eric Xing", "S.R.K. Branavan, Harr Chen, Luke Zettlemoyer and Regina Barzilay", "Adam Pauls and Dan Klein"], ["Paper Title", "Immediate-head parsing for language modeling", "Fast Decoding and Optimal Decoding for Machine Translation", "Discriminative Traing and Maximum Entropy Models for Statistical Machine Translation", "Accurate Unlexicalized Parsing", "Towards a Model of Face-to-Face Grounding", "Finding Predominant Word Senses in Untagged Text", "A hierarchical phrase-based model for statistical machine translation", "Semantic taxonomy induction from heterogenous evidence", "Learning synchronous grammars for semantic parsing with lambda calculus", "Forest Reranking: Discriminative Parsing with Non-Local Features", "A New String-to-Dependency Machine Translation Algorithm with a Target Dependency Language Model", "Concise Integer Linear Programming Formulations for Dependency Parsing", "Reinforcement Learning for Mapping Instructions to Actions", "K-Best A* Parsing"]], "pageTitle": "Best paper awards - ACL Wiki", "title": "", "url": "http://aclweb.org/aclwiki/index.php?title=Best_paper_awards&oldid=8350", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00005-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 2311726, "recordOffset": 2303524, "tableOrientation": "HORIZONTAL", "textBeforeTable": "A few items are still missing. Please help complete this table. ACL search navigation, Jump to: diff) Newer revision → ( diff) | Latest revision ( ← Older revision | diff) ( (Talk | contribs) Pdturney Revision as of 09:01, 4 November 2010 by From ACL Wiki Best paper awards", "textAfterTable": "NAACL Year Author Paper Title 2004 Regina Barzilay, MIT, and Lillian Lee, Cornell Catching the Drift: Probabilistic Content Models, with Applications to Generation and Summarization 2006 Mehryar Mohri and Brian Roark Probabilistic Context-Free Grammar Induction Based on Structural Zeros 2006 Aria Haghighi and Dan Klein Prototype-Driven Learning for Sequence Models 2007 Antti-Veikko Rosti, Bing Xiang, Spyros Matsoukas, Richard Schwartz, Necip Fazil Ayan and Bonnie Dorr Combining Outputs from Multiple Machine Translation Systems 2009 Hoifung Poon, Colin Cherry and Kristina Toutanova Unsupervised Morphological Segmentation with Log-Linear Models 2009 David Chiang, Kevin Knight and Wei Wang 11,001 New Features for Statistical Machine Translation EMNLP Year Author Paper Title 2002 Michael Collins Discriminative Training Methods for Hidden Markov Models: Theory and Experiments with Perceptron Algorithms 2002 Frank Keller, Maria Lapata, and Olga Ourioupina Using the Web to Overcome Data Sparseness 2003 Peng Xu, Ahmad Emami and Frederick Jelinek Training Connectionist Models for the Structured Language Model 2004 Ben Taskar, Dan Klein, Michael Collins, Daphne Koller, and Christopher Manning Max-Margin Parsing 2005 (best student paper)", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}