{"relation": [["Author", "caprilyeous", "dragonblade3200", "lancelot1"], ["Message", "Looking for any good Harry Potter x-over fics...Any crossover fics for Harry potter, prefer slash. Also, i am looking specifically for ones with Supernatural or Stargate SG-1/Atlantis crossover. I am new to ficwad and have been having trouble finding the type of stories i would like to read. The categories/search engine is not very helpful in sorting stories by type/genre/pairing/etc. Thanks so much!!! Posted at 2009-09-27 21:41", "I know the author's clell65619 and bluminous on this site, as well as fanfiction.net, have a few really good crossovers. For Bluminous your better off on ff.net though. I don't think they have any slash though, just to warn you. A really really! good story for slash though it the Black Heir on fanfiction.net. And when I say that I truly mean it, cuz I don't usually read slash at all. Between that one and its sequel there's over a million words, supposedly smut to die for that isn't the base of the story(once again, I just skip over those parts) and a plot that I couldn't help but LOVE. But, not a crossover. Posted at 2009-10-12 21:28", "whilst it isn't a ficwad link this link will give you quite a few hp stargate xovers and even a few multi xovers too (my favourite at the moment is beggining a new path even though the lemony goodness is a bit repetetive) http://www.hpfanficarchive.com/stories/browse.php?type=categories&catid=247 Posted at 2010-11-25 19:05"]], "pageTitle": "FicWad: fresh-picked original and fan fiction", "title": "", "url": "http://ficwad.com/forum/topic/1735", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00333-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 88046396, "recordOffset": 88038194, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{2353=Site design Copyright 2005, K&D Lynch. All stories contained in this archive are the property of their respective authors, and the owners of this site claim no responsibility for their contents.}", "textBeforeTable": "Home > Fic Recs > Looking for any good Harry Potter x-over fics... Lost password Register Log in Remember me Log in ▼ Sign up to adjust the filter You won't see stories with a lower score when you browse or search. Filter Filter: 0 Help Forum Search Browse FicWad", "textAfterTable": "Site design Copyright 2005, K&D Lynch. All stories contained in this archive are the property of their respective authors, and the owners of this site claim no responsibility for their contents. Page created in 0.0123 seconds", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}