{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8"], ["Name", "Melody for Thelma", "Stein on Vine", "Shave Tail", "Gonga Din", "I Wonder Why", "Ballad Medley", "Blue Invasion", "A Gush of Periwinkles"], ["Artist", "Louie Bellson & Blue Mitchell", "Louie Bellson & Blue Mitchell", "Louie Bellson & Blue Mitchell", "Louie Bellson & Blue Mitchell", "Louie Bellson & Blue Mitchell", "Louie Bellson & Blue Mitchell", "Louie Bellson & Blue Mitchell", "Louie Bellson & Blue Mitchell"], ["Time", "6:43", "4:46", "4:46", "5:56", "3:09", "7:00", "5:56", "6:12"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "Album Only", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Louie Bellson Jam With Blue Mitchell by Louie Bellson & Blue Mitchell", "title": "", "url": "https://itunes.apple.com/gr/album/ballad-medley/id277810927?i=277810934", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00139-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 864654383, "recordOffset": 864630720, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{16915=Born: 06 July 1924 in Rock Falls, IL, 88331=Copyright © 2014 Apple Inc. Με επιφύλαξη παντός δικαιώματος.}", "lastModified": "Fri, 31 Jul 2015 07:52:02 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Louie Bellson & Blue Mitchell Louie Bellson Jam With Blue Mitchell iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Louie Bellson Jam With Blue Mitchell by Louie Bellson & Blue Mitchell, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open,", "textAfterTable": "8 Songs Album Review This CD reissue brings back one of Louie Bellson's better small-group dates for Pablo. In addition to the drummer/leader, his septet includes trumpeter Blue Mitchell (still in good form on one of his last recordings), the underrated but great tenor Pete Christlieb, pianist Ross Tompkins, guitarist Bob Bain, bassist Gary Pratt and percussionist Emil Richards. Most intriguing about the date (which mostly sticks to group originals) is that there is a three-song ballad medley comprised not of standards but of Bellson tunes. \"Shave Tail\" (an older song co-composed by Bellson and Charlie Shavers) is a highlight. Biography Born: 06 July 1924 in Rock Falls, IL Genre: Jazz Years Active: '40s, '50s, '60s, '70s, '80s, '90s, '00s One of the great drummers of all time (and one of the few whose name can be said in the same sentence with Buddy Rich), Louie Bellson has the rare ability to continually hold one's interest throughout a 15-minute solo. He became famous in the 1950s for using two bass drums simultaneously, but Bellson was never a gimmicky or overly bombastic player. In addition to... Full bio Top Albums", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}