{"relation": [["Rank", "1", "3", "4", "5", "6", "7", "10"], ["Title", "Facing Your Giants", "The Way of the Wild Heart", "Cure for the Common Life", "Get Out of That Pit!", "Captivating", "Grace for the Moment, Vol. 2", "The Christmas Candle"], ["Author", "Max Lucado", "John Eldredge", "Max Lucado", "Beth Moore", "John & Stasi Eldredge", "Max Lucado", "Max Lucado"]], "pageTitle": "Seven Out of the Top Ten Bestsellers - Michael Hyatt", "title": "", "url": "http://michaelhyatt.com/seven-out-of-the-top-ten-bestsellers.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00001-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 168847995, "recordOffset": 168824686, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{9255=Publishers Weekly just published the February Christian Marketplace Bestsellers list. Amazingly, we have seven out of the top ten hardcover bestsellers. Here’s the list:}", "textBeforeTable": "Publishers Weekly just published the February Christian Marketplace Bestsellers list. Amazingly, we have seven out of the top ten hardcover bestsellers. Here’s the list: Email Print Share Tweet Share Seven Out of the Top Ten Bestsellers Vote: Is Blogging a Good Use of My Time? ➡ ⬅ The Thomas Nelson “Death Crawl” Post navigation -->", "textAfterTable": "Congratulations to Max, John, Stasi, and Beth, as well as our publishing, sales, and marketing teams. I’m proud of you! Technorati Tags: bestsellers, books, publishing, thomas nelson Share Tweet Share Print Email Like this Post? Sign up for my blog updates and never miss a post. I’ll send you a FREE eBook as a thank-you. Want to Launch Your Own Blog or upgrade to a self-hosted WordPress blog? It’s easier than you think! Watch my free, twenty-minute screencast. I show you exactly how to do it, step-by-step. You don’t need any technical knowledge. Click here to get started.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}