{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20"], ["Name", "The Invisible Gardener", "Patient Hope in New Snow", "Saturday As Usual", "Falling Out of Love at This Volume", "Exaltation on a Cool, Kitchen Floor", "The Awful Sweetness of Escaping Sweat", "Puella Quam Amo Est Pulchra", "Driving Fast Through a Big City at Night", "How Many Lights Do You See?", "I Watched You Taking Off", "A Celebration Upon Completion", "Emily, Sing Something Sweet", "All of the Truth", "One Straw (Please)", "Lila", "A Few Minutes on Friday", "Supriya", "Solid Jackson", "Feb. 15th", "The 'Feel Good' Revolution"], ["Artist", "Bright Eyes", "Bright Eyes", "Bright Eyes", "Bright Eyes", "Bright Eyes", "Bright Eyes", "Bright Eyes", "Bright Eyes", "Bright Eyes", "Bright Eyes", "Bright Eyes", "Bright Eyes", "Bright Eyes", "Bright Eyes", "Bright Eyes", "Bright Eyes", "Bright Eyes", "Bright Eyes", "Bright Eyes", "Bright Eyes"], ["Time", "2:24", "4:07", "3:38", "2:17", "2:26", "4:05", "3:11", "2:11", "3:31", "3:57", "4:15", "3:01", "3:44", "2:49", "2:51", "4:08", "2:29", "4:31", "4:06", "3:31"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - A Collection of Songs Written and Recorded 1995-1997 by Bright Eyes", "title": "", "url": "https://itunes.apple.com/ee/album/celebration-upon-completion/id6920567?i=6920547", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00292-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 887001759, "recordOffset": 886971148, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{2090=We are unable to find iTunes on your computer. To preview and buy music from A Collection of Songs Written and Recorded 1995-1997 by Bright Eyes, download iTunes now.}", "TableContextTimeStampAfterTable": "{40665=Formed: 15 February 1980 in Omaha, NE, 38588=In 1995, at the age of 15, Conor Oberst left the Omaha, NE, group Commander Venus and began working on the material for his solo project, Bright Eyes. A Collection of Songs gathers the results: 20 compositions recorded during the singer's mid- to late teens. Even at a young age, it's clear that Oberst is an extremely talented songwriter, seemingly incapable of penning a bad tune (except in the odd case when you sense he didn't try). Despite his obvious gifts, however, there are plenty of sour moments throughout A Collection, but they are almost always the result of the singer's delivery, rather than an inherent fault of the song. Oberst walks a fine line and occasionally his tendency toward unrelenting honesty chases him over the edge. His tone turns bitter and you sense that he can't stand to bare his soul without couching the sentiments in a combination of anger, sarcasm, and parody. On songs like \"Patient Hope in New Snow,\" \"Saturday as Usual,\" and \"The Awful Sweetness of Escaping Sweat,\" the songs disintegrate as his vocals are reduced to the unintelligible babbling of a child. Any balance the music maintained up to that point, however fragile, is lost and so, more than likely, is the listener. Exercising more restraint, Oberst reveals a unique songwriting voice. On \"Exaltation on a Cool Kitchen Floor,\" the results are truly touching as he whispers, \"I can't help noticing that she is sitting closer to me than she ever has before\" — lines that manage to capture the deep emotional ache called love. On \"How Many Lights Do You See?,\" he expands the simple subject matter, exploring it with a near-cinematic perspective. Elsewhere (on the collection's best material), he is found teetering on the edge. Barely able to contain the welling emotions, a quiver rises in his voice. In such cases, you'd be hard-pressed to deny the truth of the sentiments Oberst is delivering., 141279=Autoriõigus © 2014, Apple Inc. Kõik õigused on reserveeritud.}", "lastModified": "Sat, 01 Aug 2015 03:50:58 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Bright Eyes A Collection of Songs Written and Recorded 1995-1997 iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from A Collection of Songs Written and Recorded 1995-1997 by Bright Eyes, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes", "textAfterTable": "20 Songs Album Review In 1995, at the age of 15, Conor Oberst left the Omaha, NE, group Commander Venus and began working on the material for his solo project, Bright Eyes. A Collection of Songs gathers the results: 20 compositions recorded during the singer's mid- to late teens. Even at a young age, it's clear that Oberst is an extremely talented songwriter, seemingly incapable of penning a bad tune (except in the odd case when you sense he didn't try). Despite his obvious gifts, however, there are plenty of sour moments throughout A Collection, but they are almost always the result of the singer's delivery, rather than an inherent fault of the song. Oberst walks a fine line and occasionally his tendency toward unrelenting honesty chases him over the edge. His tone turns bitter and you sense that he can't stand to bare his soul without couching the sentiments in a combination of anger, sarcasm, and parody. On songs like \"Patient Hope in New Snow,\" \"Saturday as Usual,\" and \"The Awful Sweetness of Escaping Sweat,\" the songs disintegrate as his vocals are reduced to the unintelligible babbling of a child. Any balance the music maintained up to that point, however fragile, is lost and so, more than likely, is the listener. Exercising more restraint, Oberst reveals a unique songwriting", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}