{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8"], ["Name", "Rest Enough (Song to Mother)", "A Prayer", "All God's Children Got a Home in the Universe", "The Lady", "The Cry of My People", "African Drum Suite, Pt. 1", "African Drum Suite, Pt. 2", "Come Sunday"], ["Artist", "Archie Shepp", "Archie Shepp", "Archie Shepp", "Archie Shepp", "Archie Shepp", "Archie Shepp", "Archie Shepp", "Archie Shepp"], ["Time", "4:38", "6:29", "2:56", "5:28", "5:43", "0:35", "7:32", "9:30"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "Album Only", "Album Only"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - The Cry of My People by Archie Shepp", "title": "", "url": "https://itunes.apple.com/WebObjects/MZStore.woa/wa/viewAlbum?playListId=5570843", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00311-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 876835367, "recordOffset": 876808855, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{15133=Recorded in 1972 with a core band of Leroy Jenkins, Cornell Dupree (!), Jimmy Garrison, and Charles McGhee, Shepp supplemented these proceedings in much the same way he did with the cast of Attica Blues, with gospel singers, big bands, quintets, sextets, and chamber orchestras, with guests that included Harold Mabern on piano, Bernard \"Pretty\" Purdie on drums, and Ron Carter on electric bass! Recorded during a period in which Shepp was reaching out of the jazz idiom to include all of what he perceived to be \"trans-African\" music at the time, there is gutbucket R&B here, as well as the sweetly soul gospel of \"Rest Enough.\" The charts' arrangements are a combination of Ellington's more pastoral moods — usually expressed in his suites — and the more darkly complex modal stylings of George Russell. Unlike some of Shepp's dates from this period, the vocals do not detract from the mix employed here. This is an urban record that showcases Shepp's ability, at this time in his career, to literally take on any project, combine as many sources as he was permitted by his financial resources, and come up with something compelling, provocative, and soulful. All extremes are subsumed by the whole: The avant-garde free jazz of the period is covered in the large-ensemble playing, which is covered by the gospel and R&B stylings that are accented by the free jazz players. Shepp worked with many larger ensembles as a leader, but never did he achieve such a perfect balance as he did on The Cry of My People. Given that the remastered version — with excellent liner notes, superb sound, and a gorgeous package — is being issued during an election year in the United States, its poignancy and urgency couldn't be more timely., 118886=Copyright © 2014 Apple Inc. All rights reserved., 17018=Born: May 24, 1937 in Fort Lauderdale, FL}", "lastModified": "Sat, 01 Aug 2015 03:44:09 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Archie Shepp The Cry of My People iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from The Cry of My People by Archie Shepp, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening", "textAfterTable": "8 Songs Album Review Recorded in 1972 with a core band of Leroy Jenkins, Cornell Dupree (!), Jimmy Garrison, and Charles McGhee, Shepp supplemented these proceedings in much the same way he did with the cast of Attica Blues, with gospel singers, big bands, quintets, sextets, and chamber orchestras, with guests that included Harold Mabern on piano, Bernard \"Pretty\" Purdie on drums, and Ron Carter on electric bass! Recorded during a period in which Shepp was reaching out of the jazz idiom to include all of what he perceived to be \"trans-African\" music at the time, there is gutbucket R&B here, as well as the sweetly soul gospel of \"Rest Enough.\" The charts' arrangements are a combination of Ellington's more pastoral moods — usually expressed in his suites — and the more darkly complex modal stylings of George Russell. Unlike some of Shepp's dates from this period, the vocals do not detract from the mix employed here. This is an urban record that showcases Shepp's ability, at this time in his career, to literally take on any project, combine as many sources as he was permitted by his financial resources, and come up with something compelling, provocative, and soulful. All extremes are subsumed by the whole: The avant-garde free jazz of the period is covered in the large-ensemble playing, which", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}