{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8"], ["Name", "Designated Hitter", "Evening Shades of Blue", "Last Ditch Wisdom", "Miller Time", "Park Avenue Petite", "Remember", "Reverence", "Yams"], ["Artist", "Jim Rotondi", "Jim Rotondi", "Jim Rotondi", "Jim Rotondi", "Jim Rotondi", "Jim Rotondi", "Jim Rotondi", "Jim Rotondi"], ["Time", "5:42", "10:12", "6:09", "6:48", "8:44", "6:26", "6:52", "9:01"], ["Price", "$1.79", "Album Only", "$1.79", "$1.79", "$1.79", "$1.79", "$1.79", "$1.79"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Destination Up by Jim Rotondi", "title": "", "url": "https://itunes.apple.com/nz/album/destination-up/id114206623", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00271-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 881027251, "recordOffset": 881004809, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{17514=Born: 28 August 1962 in Butte, MT, 116767=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 04:44:10 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Jim Rotondi Destination Up iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Destination Up by Jim Rotondi, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "8 Songs Album Review Trumpeter Jim Rotondi brings together vibraphonist Joe Locke and pianist Mulgrew Miller for this vibrant Sharp Nine date. Trombonist Steve Davis guests on two tracks and contributes the stately bossa \"Evening Shades of Blue.\" The rhythm is handled by bassist Peter Washington and drummer Joe Farnsworth. Rotondi's horn work, at once elegantly melodic and technically dazzling, provides a sonic centerpiece for the album, although it is the juxtaposition of Locke's vibes and Miller's authoritative piano that gives the music its most unique signature. Locke's own \"Last Ditch Wisdom,\" a fast line that takes its time settling into up-tempo swing, is one of the more surprising tracks. Rotondi weighs in with three originals: the opening \"Designated Hitter,\" a bright modified blues; \"Miller Time,\" a loping hard bop vehicle written in honor of the session's pianist; and the waltz \"Reverence,\" a similar version of which served as the title track of a Criss Cross CD by Rotondi from around the same time. The non-original picks are inspired ones: Benny Golson's ballad \"Park Avenue Petite,\" Herbie Hancock's seldom-played \"Yams,\" and a snappy, muted-trumpet reading of Irving Berlin's \"Remember,\" with Steve Davis reappearing on the bridge and taking a solo turn. ~ David R. Adler, Rovi Biography Born: 28 August 1962 in", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}