{"relation": [["Title", "MVD Changes Aimed At Preventing Identity Theft", "State Wants Input About Drivng Through Dust Storms", "Flight Diverted To Phoenix For Unruly Passenger", "Former ASU QB Settles Likeness Lawsuit With NCAA", "U Of A Apologizes For Graduation Issues", "Community College District Approves Tax Hike", "Vigil, Memorial Planned For Fallen Salt River Officer", "U of A Cuts Nonresident Law School Tuition By 30 Percent", "Study: Arizona Ranked Low For Military Retirees", "Four People Killed In I-10 Bus Crash Near State Line", "Albuquerque VA May Have Had Secret List Similar To Phoenix", "Pilot Killed In Grand Canyon Helicopter Accident", "Grand Canyon Pipe Break Points To Larger Problem", "Judge May Allow White House To Hold Back Fast And Furious Documents", "Tucson Student Who Fell To His Death Was Intoxicated", "Cop In 'Sexting' Case Keeps Her Job", "Goodyear Woman Charged With Stealing Scholarship Money", "Burning Weeds Creates House Fire Risk", "Court: Scottsdale Can't Prosecute Public Drunkenness", "Valley Fever Fungus Found In Washington State", "San Tan Valley Sexual Assault Suspect Back In Custody", "Group Formed By Robert Redford Helps Craft Wild Horse Agreement", "TUSD Audit Reveals 'Brutal' Findings", "Pit Bull Mickey Remanded To Sheriff's Shelter", "Congress Is Back, But Likely Won't Tackle Major Issues"], ["Author", "Dennis Lambert", "Dennis Lambert", "Dennis Lambert", "Dennis Lambert", "Dennis Lambert", "Dennis Lambert", "Dennis Lambert", "Dennis Lambert", "Dennis Lambert", "Dennis Lambert", "Dennis Lambert", "Dennis Lambert", "Dennis Lambert", "Dennis Lambert", "Dennis Lambert", "Dennis Lambert", "KJZZ News", "Dennis Lambert", "Dennis Lambert", "Dennis Lambert", "Dennis Lambert", "Dennis Lambert", "Dennis Lambert", "Dennis Lambert", "Dennis Lambert"], ["Publication Date", "June 16, 2014", "June 13, 2014", "June 11, 2014", "June 09, 2014", "May 29, 2014", "May 28, 2014", "May 27, 2014", "May 26, 2014", "May 22, 2014", "May 21, 2014", "May 20, 2014", "May 19, 2014", "May 16, 2014", "May 15, 2014", "May 14, 2014", "May 13, 2014", "May 09, 2014", "May 07, 2014", "May 06, 2014", "May 05, 2014", "May 02, 2014", "May 01, 2014", "April 30, 2014", "April 29, 2014", "April 28, 2014"]], "pageTitle": "| KJZZ", "title": "", "url": "http://kjzz.org/staff/%2010?page=8", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00282-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 133347757, "recordOffset": 133332107, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1147=A Michigan native, Dennis worked as a radio reporter in Lansing and Detroit before coming to Arizona in 1984. He has a degree in Communication Arts from Michigan State University., 614=Lambert has been married since 1969 and has two adult children and two grandchildren., 1413=He was honored in 2010 with the Order of the Silver Key from the Phoenix Chapter of the Society of Professional Journalists for 25 years of broadcast excellence., 3727=In the wee small hours of the morning, when most of us are working on REM sleep, Morning Edition host and reporter, Dennis Lambert busily prepares the news and information KJZZ listeners hear as they prepare for the day. He’s been doing that for KJZZ listeners since 1996.    , 2570=Throughout his award-winning career, which he began in 1969, Lambert has covered everything from plane crashes to bribery scandals as well as late night and early morning legislative sessions. There have also been celebrity interviews, a few wildlife escapades with sand cranes and bighorn sheep and many adventures in between.}", "lastModified": "Sat, 01 Aug 2015 03:38:01 GMT", "textBeforeTable": "Contact Dennis Lambert at 480-774-8237, or dlambert@rioradio.org or by way of Twitter @KJZZlambert. Lambert has been married since 1969 and has two adult children and two grandchildren. An avid Arizona Diamondbacks fan, Lambert has been a member of the Sunday Hackers season ticket group since the franchise began.  A Michigan native, Dennis worked as a radio reporter in Lansing and Detroit before coming to Arizona in 1984. He has a degree in Communication Arts from Michigan State University. He was honored in 2010 with the Order of the Silver Key from the Phoenix Chapter of the Society of Professional Journalists for 25 years of broadcast excellence. Lambert has won just about every award the Associated Press and the Phoenix Press Club had at one time or another. As a KJZZ reporter, he has won a regional Edward R. Murrow Award and several Associated Press awards. He won national Murrow and Scripps Howard awards for coverage of the Meacham impeachment. Lambert calls the impeachment of former Arizona Governor Evan Mecham the most memorable story he has covered. He was KTAR’s News Director at the time, and the station won a Peabody Award for its live coverage. Throughout his award-winning", "textAfterTable": "Pages « first ‹ previous … 5 6 7 8 9 10 11 12 13 … next › last »", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}