{"relation": [["Volume", "49", "4, 23, 31", "11", "39", "40", "", "(n/a)", "16", "39", "(n/a)", "1", "15", "10", "8"], ["Title", "Buddhist Mahayana Texts (Sacred Books of the East)", "The Zend Avesta of Zarathustra", "Buddhist Suttas: Major Scriptural Writings from Early Buddhism", "Texts of Taoism, vol 1.", "Texts of Taoism, vol 2.", "", "Confucian Analects, the Great Learning and the Doctrine of the Mean.", "I Ching: The Sacred Books of China: The Book of Changes", "Tao Te Ching (Dover Thrift Editions) by Lao-Tzu", "The Works of Mencius", "The Upanishads, volume 1", "The Upanishads, volume 2", "Wisdom of the Buddha: The Unabridged Dhammapada (Dover Thrift Editions)", "The Anugita"], ["Author", "E. B. Cowell", "James Darmesteter", "T. W. Rhys-Davids", "James Legge", "James Legge", "", "James Legge", "James Legge", "James Legge", "James Legge", "F. Max Müller", "F. Max Müller", "F. Max Müller", "K.T. Telang"], ["Price", "$12.95", "$7.95", "$27.95", "$10.95", "$10.95", "", "$14.95", "$7.95", "$1.00", "$14.95", "$11.95", "$11.95", "$1.00", "$16.00"], ["Publisher", "Dover", "Holmes Pub Group", "Book Tree", "Dover", "Dover", "", "Dover", "Dover", "Dover", "Dover", "Dover", "Dover", "Dover", "Wizards Bookshelf"]], "pageTitle": "Sacred Books of the East Index", "title": "", "url": "http://sacred-texts.com/sbe/index.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00339-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 213629055, "recordOffset": 213608248, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{45580=Another point is that the Motilal Banarsidass reprints have always had a formal copyright notice. Whether this is enforceable is dubious. The Indian copyright term is 60 years, which means all of these texts will be the public domain in India as of the end of 2005 (since the last SBE author died in 1945)., 62886=This is a quiet place in cyberspace devoted to religious tolerance and scholarship Non-public domain contents of this site not otherwise copyrighted are © copyright 2010, John Bruno Hare, All Rights Reserved. See Site copyrights, Terms of Service for more information. Index |  FAQ |  Contact |  Search |  Buy Disk Open Source for the Human Soul, 44829=The situation is a bit different in the UK and EU. UK and EU copyrights last 70 years after the death of the author. This means that as of 2005, works of authors who died prior to 1935 are now in the public domain. As can be seen from the table below, this means that the vast majority of the SBE texts are in the public domain (or will enter it in the next few years) according to the stringent UK and EU copyright laws. The remaining volumes not in the public domain in the UK and EU are those authored by Herman Jacobi, deceased 1937 (22 and 45), Junjiro Takakusu, deceased 1945 (co-author of 49) and Moriz Winternitz, deceased 1937 (vol. 50, the index)., 10928=The Sacred Books of the East (SBE) series, comprising fifty volumes, was issued by the Oxford University Press between 1879 and 1910. It has translations of key sacred texts of Hinduism, Buddhism, Taoism, Confucianism, Zoroastrianism, Jainism, and Islam. The series was edited by the famous linguist and scholar of comparative religion, Max Müller. He wrote three of the volumes, and collaborated on three others. The SBE has been designated by the United Nations Educational, Scientific and Cultural Organization (UNESCO) as part of the UNESCO Collection of Representative Works., 12013=As of September 2008, we have now reached a key milestone, completing and posting substantial etexts of all of the original 49 volumes of the SBE. This has been a ten-year project. The first volumes, the Upanishads (SBE 1 and 15), were originally scanned in 1997, two years before the inception of sacred-texts. All of these etexts, with the exception of volume 25, were prepared at sacred-texts, or by volunteers. At this point, future work on this project will involve bringing the older etexts up to current standards, and the completion of SBE 50, the General Index., 44275=All volumes of the SBE were originally published in the UK prior to the 1923 cutoff for the public domain in the US (by the 1998 US copyright law). This means that the SBE is in the public domain in the US in its entirety. Since sacred-texts is hosted in the United States by a US citizen, this site follows US copyright law, and all of the SBE texts are candiates for conversion to etext. If you are a US citizen, you can use any of the works in the SBE freely, for any purpose, without asking anyone's permission or paying anyone a fee.}", "lastModified": "Sun, 07 Feb 2010 00:27:58 GMT", "textBeforeTable": "JUMP TO SBE VOLUME Available reprints Transliteration Tables Index of Translators Table of Contents Sacred Books of the East Index Buy books: Sacred Books of the EastBuy CD-ROM ZoroastrianismIslamJainismBuddhismConfucianismTaoismHinduism Sacred-texts home               Topics Home Catalog African Age of Reason Alchemy Americana Ancient Near East Astrology Asia Atlantis Australia Basque Baha'i Bible Book of Shadows Buddhism Celtic Christianity Classics Comparative Confucianism DNA Earth Mysteries Egyptian England Esoteric/Occult Evil Fortean Freemasonry Gothic Gnosticism Grimoires Hinduism I Ching Islam Icelandic Jainism Journals", "textAfterTable": "1 * The Upanishads, Part 1 of 2 Chandogya Upanishad. Talavakara (Kena) Upanishad. Aitareya Upanishad. Kausitaki Upanishad. Vajasaneyi (Isa) Upanishad. Dover edition in print. Max Müller 1879 2 * The Sacred Laws of the Aryas, part 1 of 2 The sacred laws of the Aryas as taught in the school of Apastamba, Gautama, Vâsishtha, and Baudhâyana. pt. I. Apastamba and Gautama. (The Dharma Sutras) Georg Bühler 1879 3 * The Sacred Books of China, part 1 of 6. Part I of The Texts of Confucianism. The Shû king. The religions portions of the Shih king. The Hsiâo king. James Legge 1879 4 * The Zend-Avesta, part 1 of 3 The Vendîdâd. James Darmesteter 1880 5 * Pahlavi Texts, part 1 of 5 The Bundahis, Bahman Yast, and Shayast La-Shayast. E. W. West 1880 6 *", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}