{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Lions In Cages", "Something Unusual", "Stay and Defend", "Suego Faults", "The King and All of His Men", "Back to Back", "Midnight Dancers", "Dancing With the Devil", "Where Are You Now", "Planets"], ["Artist", "Wolf Gang", "Wolf Gang", "Wolf Gang", "Wolf Gang", "Wolf Gang", "Wolf Gang", "Wolf Gang", "Wolf Gang", "Wolf Gang", "Wolf Gang"], ["Time", "4:28", "3:21", "3:21", "2:59", "4:03", "4:14", "4:10", "3:43", "3:16", "5:15"], ["Price", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Suego Faults by Wolf Gang", "title": "", "url": "https://itunes.apple.com/gb/album/stay-and-defend/id437526523?i=437526601", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00026-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 859905587, "recordOffset": 859880895, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{121171=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 07:29:03 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Wolf Gang Suego Faults iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Suego Faults by Wolf Gang, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "10 Songs Editors’ Notes “Lions in Cages” opens Wolf Gang’s debut album with a soaring optimism similar to recordings by MGMT and The Flaming Lips. Frontman Max McElligott has carefully crafted some next-level indie pop, but credit also goes to producer extraordinaire Dave Fridmann, who's worked with the aforementioned bands. It’s easy to draw comparisons between Londoner McElligott and early Elvis Costello after hearing the pop gem “Something Unusual,” where pub-rock subtleties pepper the vocal melody under shimmering, synthesizer-based instrumentation and near-danceable grooves. With its captivating balance of restrained grip and erupting glamour, “Stay and Defend” bobs and weaves on a strain of “David DNA” that’s equal parts Byrne and Bowie. The orchestral approach to the title track's moody melody may garner comparisons to Lana Del Rey’s “Video Games,” but McElligott follows this with a diametric dose of disco-glam that’s nearly impossible to hear without moving your feet. “Planets” is a triumphant ballad, serving as a reminder that a good album should close epically. Customer Reviews Isn't It Enough Now?           by Groveler Splendid album. Cracking melodies and rhythms, a sort of cross between Queen and", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}