{"relation": [["Author", "Elobo", "Elobo", "Elobo", "Elobo", "Elobo"], ["Title", "Malevolent Winter (Supplementary 1)", "Malevolent Winter (Supplementary 2)", "Master in the Rotting Depths", "Mastermind", "Mondo Momma"], ["Description", "Closer looks at the Runaway Puppoplasm, Mushed Duck, and Mighty CrocoDIRE 7.", "A closer look at the Grim Goat and good ol' Shrooom!!!", "I am the lord of all the transients, miscreants, vermin, and garbage that have been rejected by the sickeningly immaculate world above. Those abandoned by the 'decent' sect of the world and thrust unto the raw death-sludge of the sewers beneath. Your neglect and wastefulness only fuel my dark dominion and we are steadily overtaking your vile stain under the wretched sun. And I will ride forth upon my kingdom of filth and smother out the flames of your lives.", "Ah, the elusive Master Criminal Worm. They are their own best getaway car. Having amassed a vast wealth and many battle scars, they are careful not to allow any of their money to be exposed. They have enough oomph in the criminal empire to quickly rise to the top, and always have aspiring hangers-on. Quick to preserve their empire, their efficiency is always lethal when it needs to be. But at least they're good to their mommies.", "Though she was never the third strongest mole, she had a reason to fight. Your Sanctuary was hers now, to protect and nurture her birth and surrogate children. True brutal savagery emerges in a threatened mother, a gentle touch remains as she holds her rowdy progeny back from the main fracas. They may have been playing rough, but without Momma they will be scared and scattered, completely out of their depth in the Dusty Dunes and Summers. You monster."], ["Date", "11/4/12", "11/4/12", "8/15/09", "4/19/09", "4/9/09"], ["Rank", "0.00", "0.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=26523&stuffPageNumber=10", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00252-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 229081971, "recordOffset": 229073769, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> Y W V U T S R Q P O N M L K I H G F E D C B A < Other Submissions by Elobo A myriad of tunnels beneath Onett was but the first giant step towards total domination for the Titanic Ant. Born a queen with tremendous resolve she would lead her daughters dauntless into battle, a chemical menagerie of silent war-cries. And though she may fall, perhaps the fruits of her royalty have already spread through the underground of Eagleland, rooting deep at the ends of the farthest capillary-like tunnels. Maybe your sanctuary will become their's once more...", "textAfterTable": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}