{"relation": [["Name", "Nginx Auto Lib Core", "Nginx Development Kit"], ["Description", "Reusable file for module developers to include with their modules to easily and consistently handle including external libraries; used in the Auto Lib module and included in the Nginx Development Kit", "An extension to the core functionality of Nginx which can be used as a basis for other modules"], ["Author", "Marcus Clyne", "Marcus Clyne"], ["Link", "Download", "Download"]], "pageTitle": "Difference between revisions of \"3rdPartyModules\" - Nginx Community", "title": "", "url": "http://wiki.nginx.org/index.php?title=3rdPartyModules&diff=3025&oldid=2907", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00336-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 252375603, "recordOffset": 252352745, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Known modules See also the tools at the bottom of this page. A github search turned up the Nginx Development Kit. It seems to be more up to date. Evan Miller has written the definitive guide to Nginx module development. But some parts of it are a little out of date. You've been warned. Writing your own module Be aware that some modules may require additional libraries to be installed on your system. You can use as many --add-module arguments as needed. --add-module=/path/to/module2/source ./configure --add-module=/path/to/module1/source \\  From the Nginx source directory, type:  Modules are typically added by compiling them along with the Nginx source.   Compiling third party modules  These modules are not officially supported and may not be compatible across versions of Nginx. Nevertheless many of them may prove useful to many people. Enjoy at your own risk.   Third party modules       6 References 5 Tools for Migration 4 Third party patches 3 Tools for module developers 2 Known modules   1.2 Writing your own module 1.1 Compiling", "textAfterTable": "AFCGI Asynchronous/multiplexing FastCGI for nginx (incl. ref server implementation) rsms Download Akamai G2O Restricts access to content to Akamai edge servers using G2O headers refractalize Download Array Var Add support for array variables to nginx config files agentzh Download Auth Digest HTTP Digest Authentication. Christian Swinehart Download Auth PAM HTTP Basic Authentication using PAM. Sergio Talens-Oliag Download Auth Request Allows authorization based on subrequest result. Maxim Dounin Download Auto Lib Reuse pre-compiled/installed versions of OpenSSL, PCRE and Zlib without re-compiling them each time Nginx is compiled Marcus Clyne Download AWS auth Generate security headers for", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}