{"relation": [["Title", "Our Man in Havana", "Before Night Falls", "Broken Paradise", "Take Me with You", "Adios Havana", "Blessed by Thunder", "Conversations with Cuba"], ["Author", "Graham Greene", "Reinaldo Arenas", "Cecilia Samartin", "Carlos Frias", "Andrew J. Rodriguez", "Flor Fernandez Barrios", "C. Peter Ripley"]], "pageTitle": "Cuba Tours & Holidays | Intrepid Travel CA", "title": "", "url": "http://www.intrepidtravel.com/ca/cuba", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00096-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 521697127, "recordOffset": 521633963, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{86615=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 87934=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 188393=Review submitted 23 Jul 2015}", "TableContextTimeStampAfterTable": "{76814=Two iconic figures play the largest roles in Cuba’s more recent history. Fidel Castro and Che Guevara are embedded in the national psyche of Cuba, their power and influence pivotal to the Cuban Revolution of 1959. After taking control, Castro soon set out to remove political opponents from the administration and gain control of newspapers, radio and television stations. Relations between the United States and Cuba became strained almost immediately with the US resenting Castro’s takeover and Communist rule. Trade embargoes were put in place after the failed Bay of Pigs invasion. The Cuban Missile Crisis of 1962 added further tension to relations between the US and Cuba, which continues into the present day. Standing alongside Fidel Castro as an equally important political figure, Che Guevara (although Argentinean) holds a very important place in Cuban history. A revolutionary, author, doctor and military leader, Guevara played pivotal roles in the guerrilla campaign leading up to the Cuban Revolution and the defence of the Bay of Pigs, as well as diplomatic relations between Cuba and the Soviet Union, up until his death in 1967. It’s impossible not to notice the reverence and honour held for Guevara when visiting Cuba. Street art, monuments, statues and museums dedicated to the man Cubans simply call ‘El Che’ can be found all over the country., 82156=Chess and dominoes are popular national past-times in Cuba. Watch locals play chess in the park or try to get in on a dominoes match in a coffee house or bar. Sports fanatics should head to a baseball game to see passionate fans get behind their favourite team. The baseball season runs from October to April and games are a low-cost, fun way to absorb Cuban culture and meet locals., 75734=Originally inhabited by indigenous people, Christopher Columbus first sighted Cuba in 1492, and later claimed it as a Spanish territory. The Spanish went on to create many settlements around Cuba, which created conflict and warfare between the Spanish settlers and indigenous people. With the establishment of tobacco plantations and other cash crops like sugar cane, Cuba came to rely upon African slaves for labour during the 17th and 18th centuries. Bringing unique customs, music, language and food with them, the African slaves added to the melting pot of cultures already forming in Cuba. Due to Cuba’s rich natural environment and relative prosperity, the island became a prime target for pirates and other foreign invaders. When visiting Cuba today there are a number of fortresses and other historical remnants that act as a reminder of Cuba’s pirate past. After the Spanish-American War, Cuba was handed over to the United States, which assumed control until 1902, when power was then granted to a Cuban government., 65701=Cuba's subtropical climate is ideal for travelling, with most places catching the cool trade winds that blow from the coast, giving Cuba pleasant temperatures year round. June, July and August are usually the hottest months, the dry season runs from November to April and the wet season from May to October. Even in the rainy season, downpours are short and heavy and shouldn't hinder travel plans. Tropical storms and hurricanes are more prevalent in September and October but rarely cause problems for travellers.}", "textBeforeTable": "Recommended reading Further reading 8. When on community visits or homestays, refrain from giving gifts or money to locals. 7. Please ask and receive permission before taking photos of people, including children. 6. Refrain from supporting businesses that exploit or abuse endangered animals. 5. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 4. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 3. Always dispose of litter thoughtfully, including cigarette butts. 2. For environmental reasons, try to avoid buying bottled water. Fill a reusable water bottle or canteen with filtered water. 1. Be considerate of Cuba’s customs, traditions, religion and culture. Top responsible travel tips for Cuba Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this in mind while travelling. Cuba Travel Tips Responsible Travel also provides useful health information: Go to: http://www.who.int/en/ The World Health Organisation Go to:", "textAfterTable": "Handy links www.lonelyplanet.com/worldguide/cuba www.worldtravelguide.net/cuba × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwaitKyrgyzstanLaosLatvia", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}