{"relation": [["Title", "Without Silicon Photonics, Moore's Law Won't Matter", "Researchers Hope Sharing Costs Will Spur Optical Chips", "Intel Makes Advance in Silicon-Based Lasers", "Record-Breaking Optical Chip", "Intel Shows Off Its Enviro-lovin' Side", "Intel’s High Speed Optical Trinity", "Intel Completes Photonics Trifecta", "Illuminating Silicon", "Intel has world’s fastest Si-Ge Photo detector", "Intel Developer Forum - the show begins", "40G photodetector: The other end of the link", "The Silicon Solution", "Intel's Breakthrough: Its new silicon laser could add decades to Moore's Law", "Silicon Shines On", "All-silicon laser makes its debut", "The Optical Age of Silicon"], ["Author", "Tiffany Trader", "Don Clark", "Don Clark", "Kate Greene", "Stacey Higginbotham", "Ori Reshef", "Kate Greene", "Kate Greene", "Tim Smalley", "Rupert Goodwins", "Sean Koehl", "Mario Paniccia, Sean Koehl", "Robert Service", "Jerome Faist", "Belle Dume", "Graham T. Reed"], ["Publication", "HPCwire", "Wall Street Journal", "Wall Street Journal", "Technology Review", "Earth2Tech", "The Future of Things", "Technology Review", "Technology Review", "bit-tech", "ZDNet", "Intel Labs", "IEEE Spectrum", "Technology Review", "Nature", "PhysicsWorld", "Nature"], ["Date", "9 Feb 2011", "1 Feb 2011", "28 Jul 2010", "25 Jun 2008", "14 Jun 2008", "24 Oct 2007", "10 Oct 2007", "Oct 2007", "18 Sep 2007", "18 Sep 2007", "17 Sep 2007", "Oct 2005", "Jul 2005", "17 Feb 2005", "Jan 2005", "12 Feb 2004"]], "pageTitle": "Intel® Silicon Photonics Research", "title": "", "url": "http://www.intel.co.uk/content/www/uk/en/research/intel-labs-silicon-photonics-research.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00272-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 510071771, "recordOffset": 510052633, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{11646=Intel® Silicon Photonics Technology is a new approach to make optical devices out of silicon and use light (photons) to move huge amounts of data at very high speeds with extremely low power over a thin optical fiber rather than using electrical signals over a copper cable. After nearly a decade of research and innovation to prove its viability, Intel created a P&L (Silicon Photonics Solutions Group) in 2012 to move the project into production., 7921=Dr. Mario Paniccia received the 2011 EE Times’ “ACE” award for Innovator of the Year. These awards celebrate technologists who demonstrate leadership and innovation to change the electronics industry and the world. He won this for leading the research team that developed the 50Gbps Silicon Photonics Link, a concept fiber-optic connection designed to validate Mario’s vision to ‘siliconize’ photonics., 2118=Optical modulators are used to encode a high-quality data signal onto an optical beam, effectively by turning the beam on and off rapidly to create ones and zeros. Before the year 2004, no one had built an optical modulator from silicon that was faster than about 20 MHz. In February of 2004, Intel announced in the prestigious scientific journal Nature the first gigahertz silicon optical modulator. By integrating a novel transistor-like device, Intel was able to create a modulator that scaled much faster than previous attempts. In 2005, Intel researchers further demonstrated that this silicon modulator is capable of transmitting data up to 10 gigabits per second (Gbps)., 7182=Intel Labs has announced an important advance in the quest to use lasers to replace the use of electrons to carry data in and around PCs and servers a 50Gbps Silicon Photonics Link. This research prototype represents the world’s first silicon-based optical data connection with integrated lasers. This concept vehicle is the result of a multi-year silicon photonics research agenda, which included numerous world firsts. It is composed of a silicon transmitter and a receiver chip, each integrating all the necessary building blocks from previous Intel breakthroughs including the first Hybrid Silicon Laser (see below) as well as high-speed optical modulators and photodetectors announced in 2007., 11101=In September of 2013 Intel and Corning announced  a new Optical Connector technology called MXC*.  On March 11th, 2014 US Conec announced that it would start production shipments of MXC components to the industry in Q2 2014.  Corning also announced that it would start shipping MXC cable assemblies in Q3 2014.  Additionally Molex and TE Connectivity announced they would develop MXC based cables., 3136=In a paper published February 17, 2005 by the prestigious scientific journal Nature, Intel researchers disclosed the development of the first continuous wave all-silicon laser using a physical property called the Raman Effect. They built the experimental device using Intel's existing standard CMOS high-volume manufacturing processes. This is the third silicon photonics paper Intel has published in Nature since 2004, beginning with the modulator breakthrough (see the Learn More section).}", "lastModified": "Thu, 09 Jul 2015 08:50:33 GMT", "textBeforeTable": "Silicon Photonics in the Press Over time, Intel's vision is to develop integrated, high-volume silicon photonic chips that could dramatically change the way that enterprises use photonics links for their systems and networks. Simply having photonics could eliminate bandwidth and distance limitations, allowing for radically new flexible architectures capable of processing data more efficiently. Silicon photonics may even have applications beyond digital communications, including optical debug of high-speed data, expanding wireless networks by transporting analog RF signals, and enabling lower-cost lasers for certain biomedical applications. Vision and Applications Optical modulators are used to encode a high-quality data signal onto an optical beam, effectively by turning the beam on and off rapidly to create ones and zeros. Before the year 2004, no one had built an optical modulator from silicon that was faster than about 20 MHz. In February of 2004, Intel announced in the prestigious scientific journal Nature the first gigahertz silicon optical modulator. By integrating a novel transistor-like device, Intel was able to create a modulator that scaled much faster than previous attempts. In 2005, Intel researchers further demonstrated that this silicon modulator is capable of transmitting data up to 10 gigabits per second (Gbps). First GHz Silicon Modulator Download", "textAfterTable": "Show more Show less View all Technical Papers Explore the following links for more details on silicon photonics research. Publication   Laser Publications Mode locked and distributed feedback silicon evanescent lasers, by B. R. Koch, A. W. Fang, E. Lively, R. Jones, O. Cohen, D. J. Blumenthal, and J. E. Bowers, Laser and Photonics Reviews, Rev. 3, No. 4, pp. 355-369, 24 Nov 2008.   Integration of", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}