{"relation": [["Subject", "Why Arizona will beat the Saints (good stuff here)", "As you may know...", "Re: Yeah, I think Arizona wins this game also", "Interesting...", "Re: Interesting...", "I agree... The Jets and Cowboys..."], ["Author", "Ram Mas", "JamesJM", "BigGame81", "JamesJM", "BigGame81", "JamesJM"], ["Views", "1074", "165", "170", "192", "146", "159"], ["Posted", "January 13, 2010 04:50PM", "January 13, 2010 04:57PM", "January 13, 2010 04:57PM", "January 13, 2010 05:04PM", "January 13, 2010 05:09PM", "January 13, 2010 05:33PM"]], "pageTitle": "Why Arizona will beat the Saints (good stuff here)", "title": "", "url": "http://www.ramsrule.com/herd/read.php?5,17456,17456", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00072-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 651634851, "recordOffset": 651626649, "tableOrientation": "HORIZONTAL", "textBeforeTable": "RSS Quote Reply Week 19 NFL Pick: Cardinals 31, Saints 17 Weather: Dome. Opening Total: 57. Opening Line: Saints -7. Saints are 8-21 ATS in December home games since 2000. Saints are 20-31 ATS as a home favorite since 2001. Saints are 27-42 ATS at home since 2001 (10-6 since 2008). Cardinals are 6-1 ATS as underdogs in 2009. Worst Bye: Playoff teams coming off byes are 7-17 ATS since 2003 (4-12 since 2005). The Trends. Edge: Cardinals. Percentage of money on Arizona: 67% (30,000 bets) Seems like a lot of points, doesn't it? It's early, but the public is leaning toward Arizona. The Vegas. Edge: Saints. The Cardinals are red-hot. The Saints are ice-cold after resting their starters and struggling down the stretch. The Psychology. Edge: Cardinals. Arizona is 6-1 against the spread as underdogs this year. I say that improves to 7-1. Not only will the Cardinals cover; I think they win outright. The Saints were already struggling before they rested their starters. Meanwhile, the Cardinals are red-hot. They have extensive playoff experience, and Warner, who is secretly one of the best postseason performers in NFL history, will not be rattled in the Superdome.", "textAfterTable": "Previous Message Next Message Forum List Message List New Topic Print View The Original HERD Rams Moving or Rams Staying Posts Bucky's Pub Jim Everett Chat Kevin Demoff Chat Game Time Forum HERDfest Discussion Help and Support Forum Deacon Jones Chat Thursday April 5th at 9pm est. Mike Karney Q&A Jack Youngblood Chat The Original HERD - Archives Announcements   Recent Messages", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}