{"relation": [["TITLE", "Any way to contact anyone here?", "Hidden Post - Ghost trip", "\"you violate the First Ammendment\"", "Ghost Troop"], ["AUTHOR", "Ann Garrison", "Will", "wrong", "Captain Athena Z"], ["DATE", "Monday, Oct. 14, 2013 at 10:59 PM", "Saturday, Oct. 22, 2005 at 5:42 PM", "Monday, Oct. 17, 2005 at 8:52 AM", "Sunday, Oct. 16, 2005 at 6:54 PM"]], "pageTitle": "About the New Orleans IMC : NOLA Indymedia", "title": "", "url": "http://neworleans.indymedia.org/news/2003/07/9.php", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 11, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00190-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 172192391, "recordOffset": 172175997, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{22592=About the New Orleans IMC by New Orleans IMC Monday, Jul. 21, 2003 at 11:05 PM imc-neworleans@lists.indymedia.org, 23068=- - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - About the New Orleans IMC: About Us | Editorial Policy - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - ABOUT US jump to: »About New Orleans Indymedia »Mission Statement »Principles of Unity »How NOLA IMC Works »Working Groups »Get Involved »Notes About New Orleans Indymedia New Orleans Indymedia is a website for you to self-publish your articles (and eventually photos, audio and video) for the world to see. Every reader is a reporter--you make the news yourself and bypass the corporate/government filters so people get the information directly from the source. New Orleans Indymedia is the online component and main focus of the New Orleans Independent Media Center, or NOLA IMC. The NOLA IMC is an entirely volunteer-run collective of individuals interested in helping present unfiltered news and information by and for Louisianans, particularly the greater New Orleans community and those who are typically under-represented in media production and content. The NOLA IMC is organized along anti-authoritarian principles of open and transparent decision-making processes, including open public meetings; a form of modified consensus; and the elimination of hierarchies. We strive for consensus in all decisions, and have agreed to use 2/3 majority rule for extreme cases of last resort if consensus cannot be reached. Other process details: 3 members constitute a quorum; everybody must attend two meetings before they can vote on official NOLA IMC issues. What is consensus? It is a decision making process based not on \"majority rule,\" but the greater agreement of the community. Instead of a majority making a decision for the group, all people in the decision making body have equal voice and power. Consensus involves being aware to not railroad decisions and protecting against having \"losers\". Consensus only requires interested groups in consensing; for example the tech group can consense about tech-specific things without having to get everybody who is involved in the IMC to also consense. As more affinity groups form the expectation is the main NOLA IMC would require consensus only for issues that affect all affinity groups. some more info on consensus: Consensus Overview A Revolutionary Decision-Making Process A Handbook on Formal Consensus Decisionmaking New Orleans IMC Mission Statement The mission of the New Orleans IMC is to provide well-crafted, honest information about events that are either ignored or misrepresented by other media sources and to combat inaccuracies in the mainstream media. Furthermore we seek to empower our communities and citizens to make their own media and thereby liberate the flow of information both from controlling groups and corporate interests. We are the local unit of the worldwide Indymedia Network and seek to provide information not only from New Orleans but all of Louisiana and other areas of the rural south when possible. New Orleans IMC Principles of Unity Our organization opposes racism, sexism and homophobia. Beyond that we strive to be an open environment free of censorship where individuals involved in a wide range of issues can share knowledge and express their views freely. We follow the global IMC's principles of unity, namely: 1. The New Orleans Independent Media Center Network (NOLA IMC) is based upon principles of equality, decentralization and local autonomy. The NOLA IMC is not derived from a centralized bureaucratic process, but from the self-organization of autonomous collectives that recognize the importance in developing a union of networks. 2. The NOLA IMC considers open exchange of and open access to information a prerequisite to the building of a more free and just society. 3. The NOLA IMC respects the right of activists who choose not to be photographed or filmed. 4. New Orleans Indymedia, based upon the trust of our contributors and readers, shall utilize open web-based publishing, allowing individuals, groups and organizations to express their views, anonymously if desired. 5. The NOLA IMC shall be not-for-profit. 6. The NOLA IMC recognizes the importance of process to social change and is committed to the development of non-hierarchical and anti-authoritarian relationships, from interpersonal relationships to group dynamics. Therefore, we organize ourselves collectively and are committed to the principle of consensus decision-making and the development of a direct, participatory democratic process that is transparent to its membership. 7. The NOLA IMC recognizes that a prerequisite for participation in the decision making process is the contribution of an individual's labor to the group. 8. The NOLA IMC is committed to caring for one another and our respective communities both collectively and as individuals, and will promote the sharing of resources including knowledge, skills, and equipment. 9. The NOLA IMC is committed to the use of free source code, whenever possible, in order to develop the digital infrastructure, and to increase the independence of the network by not relying on proprietary software. 10. The NOLA IMC is committed to the principle of human equality, and will not discriminate, including discrimination based upon race, gender, age, class or sexual orientation. Recognizing the vast cultural traditions within the IMC network and our local communities, we are committed to building diversity within our IMC. How NOLA IMC Works NOLA IMC is an all-volunteer organization consisting of groups of people that self-organize into smaller groups, based on what they are interested in working on. Most of the work people do revolves around maintaining and growing the New Orleans Indymedia website into a useful tool and alternative media outlet. It's important that every NOLA Indymedia user understands that there is no Indymedia staff -- you are the staff. If there's a story you want to see covered that you don't find here on the site, well, perhaps you've just found yourself a project! This site is maintained by a very small group of unpaid volunteers who have regular jobs and other commitments, just like the rest of us. Many of them do contribute stories -- sometimes most of the stories -- but we'd like it to not be that way. The New Orleans Indymedia site is your news website and the content reflects back what you put in. NOLA IMC Working Groups Below are the core groups involved in the NOLA IMC. As more people get involved the groups available will change. For example, some projects people have mentioned eventually being involved with include a printed newsletter, a streaming audio channel, and a community media creation space. * Main organizing group - Decisions that affect all of the groups and the overall organizational structure of the entire IMC are discussed and acted upon in this group. * Tech group - Builds and maintains the technology that powers the New Orleans Indymedia website. * Editorial Group - Decides what will be featured in the center column of the New Orleans Indymedia home page based on the Editorial Policy. * Usability Group - Conducts user testing and strategizes about ways to make the New Orleans Indymedia site as easy to use as possible and encourage it's widespread use. How To Get Involved This is your independent media center. As an all-volunteer organization, we need you to get involved! Check the calendar for upcoming organizational meetings. Also check our organizational email list, where you can send us comments and get involved in discussion. Best of all: Publish your news! Notes: This document, as are all NOLA IMC policies, is constantly up for review and debate. The NOLA IMC group invites suggestions, comments, criticisms and ideas. Comments may be posted below and/or you may email the group at imc-neworleans@lists.indymedia.org last updated 26 Oct 2004: updated email list & email contact info [ij] - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - About the New Orleans IMC: About Us | Editorial Policy - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - -}", "lastModified": "Tue, 15 Oct 2013 02:59:25 GMT", "textBeforeTable": "LATEST COMMENTS ABOUT THIS ARTICLE Listed below are the 10 latest comments of 11 posted about this article. These comments are anonymously submitted by the website visitors. - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - About the New Orleans IMC: About Us | Editorial Policy - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - - ABOUT US jump to: »About New Orleans Indymedia »Mission Statement »Principles of Unity »How NOLA IMC Works »Working Groups »Get Involved »Notes About New Orleans Indymedia New Orleans Indymedia is a website for you to self-publish your articles (and eventually photos, audio and video) for the world to see. Every reader is a reporter--you make the news yourself and bypass the corporate/government filters so people", "textAfterTable": "© 2002-2011 New Orleans Independent Media Center. Unless otherwise stated by the author, all content is free for non-commercial reuse, reprint, and rebroadcast, on the net and elsewhere. Opinions are those of the contributors and are not necessarily endorsed by the New Orleans Independent Media Center. Running sf-active v0.9.2Disclaimer | Privacy", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}