{"relation": [["NAME", "FBPLOT", "Bachar et al.", "Uliel at al", "SHEBA", "Multiprot", "RASPODOM", "CPSARST", "GANGSTA +", "SANA", "CE-CP"], ["Type", "Sequence", "Structure, topology independent", "Sequence", "Structure", "Structure, Topology independent", "Sequence", "Structure", "Structure", "Structure", "Structure"], ["Description", "Draws dot plots of suboptimal sequence alignments", "Uses geometric hashing for the topology independent comparison of proteins", "First suggestion of how a sequence comparison algorithm for the detection of circular permutations can work", "Uses SHEBA algorithm to create structural alignments for various permutation points, while iteratively improving the cut point.", "Calculates a sequence order independent multiple protein structure alignment", "Modified Needleman & Wunsch sequence comparison algorithm", "Describes protein structures as one-dimensional text strings by using a Ramachandran sequential transformation (RST) algorithm. Detects circular permutations through a duplication of the sequence representation and \"double filter-and-refine\" strategy.", "Works in two stages: Stage one identifies coarse alignments based on secondary structure elements. Stage two refines the alignment on residue level and extends into loop regions.", "Detect initial aligned fragment pairs (AFPs). Build network of possible AFPs. Use random-mate algorithm to connect components to a graph.", "Built on top of the combinatorial extension algorithm. Duplicates atoms before alignment, truncates results after alignment"], ["Author", "Zuker", "Bachar et al.", "Uliel et al.", "Jung & Lee", "Shatsky", "Weiner et al.", "Lo, Lyu", "Schmidt-Goenner et al.", "Wang et al.", "Bliven et al."], ["Year", "1991", "1993", "1999", "2001", "2004", "2005", "2008", "2009", "2010", "2015"], ["Availability", "", "", "", "", "server, download", "server", "server", "server, download", "download", "server, download"], ["Reference", "[39]", "[35]", "[36]", "[14]", "[38]", "[34]", "[40]", "[41]", "[42]", "[43]"]], "pageTitle": "Circular permutation in proteins - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/Circular_permutation_in_proteins", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00328-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 855434423, "recordOffset": 855398256, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{28097=Despite the early discovery of post-translational circular permutations and the suggestion of a possible genetic mechanism for evolving circular permutants, it was not until 1995 that the first circularly permuted pair of genes were discovered. Saposins are a class of proteins involved in sphingolipid catabolism and antigen presentation of lipids in humans. Chris Ponting and Robert Russell identified a circularly permuted version of a saposin inserted into plant aspartic proteinase, which they nicknamed swaposin.[7] Saposin and swaposin were the first known case of two natural genes related by a circular permutation.[7], 26781=Hundreds of examples of protein pairs related by a circular permutation were subsequently discovered in nature or produced in the laboratory. As of February 2012, the Circular Permutation Database[8] contains 2,238 circularly permuted protein pairs with known structures, and many more are known without structures.[9] The CyBase database collects proteins that are cyclic, some of which are permuted variants of cyclic wild-type proteins.[10] SISYPHUS is a database that contains a collection of hand-curated manual alignments of proteins with non-trivial relationships, several of which have circular permutations.[11], 29265=After the discovery of a natural circularly permuted protein, researchers looked for a way to emulate this process. In 1983, David Goldenberg and Thomas Creighton were able to create a circularly permuted version of a protein by chemically ligating the termini to create a cyclic protein, then introducing new termini elsewhere using trypsin.[5] In 1989, Karolin Luger and her colleagues introduced a genetic method for making circular permutations by carefully fragmenting and ligating DNA.[6] This method allowed for permutations to be introduced at arbitrary sites.[6], 30426=In 1979, Bruce Cunningham and his colleagues discovered the first instance of a circularly permuted protein in nature.[1] After determining the peptide sequence of the lectin protein favin, they noticed its similarity to a known protein – concanavalin A – except that the ends were circularly permuted. Later work confirmed the circular permutation between the pair[2] and showed that concanavalin A is permuted post-translationally[3] through cleavage and an unusual protein ligation.[4], 38098=A circular permutation is a relationship between proteins whereby the proteins have a changed order of amino acids in their peptide sequence. The result is a protein structure with different connectivity, but overall similar three-dimensional (3D) shape. In 1979, the first pair of circularly permuted proteins – concanavalin A and lectin – were discovered; over 2000 such proteins are now known.}", "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT", "textBeforeTable": "The algorithms are classified according to the type of input they require. Sequence-based algorithms require only the sequence of two proteins in order to create an alignment.[36] Sequence methods are generally fast and suitable for searching whole genomes for circularly permuted pairs of proteins.[36] Structure-based methods require 3D structures of both proteins being considered.[37] They are often slower than sequence-based methods, but are able to detect circular permutations between distantly related proteins with low sequence similarity.[37] Some structural methods are topology independent, meaning that they are also able to detect more complex rearrangements than circular permutation.[38] Many sequence alignment and protein structure alignment algorithms have been developed assuming linear data representations and as such are not able to detect circular permutations between proteins.[34] Two examples of frequently used methods that have problems correctly aligning proteins related by circular permutation are dynamic programming and many hidden Markov models.[34] As an alternative to these, a number of algorithms are built on top of non-linear approaches and are able to detect topology-independent similarities, or employ modifications allowing them to circumvent the limitations of dynamic programming.[34][35] The table below is a collection of such methods. Algorithmic detection of circular permutations[", "textAfterTable": "References[edit] ^ a b c Cunningham, B. A.; Hemperly, J. J.; Hopp, T. P.; Edelman, G. M. (1979). \"Favin versus concanavalin A: Circularly permuted amino acid sequences\". Proceedings of the National Academy of Sciences of the United States of America 76 (7): 3218–3222. doi:10.1073/pnas.76.7.3218. PMC 383795. PMID 16592676.  edit ^ Einspahr, H.; Parks, E. H.; Suguna, K.; Subramanian, E.; Suddath, F. L. (1986). \"The crystal structure of pea lectin at 3.0-Å resolution\". The Journal of Biological Chemistry 261 (35): 16518–16527. PMID 3782132.  edit ^ Carrington, D. M.; Auffret, A.; Hanke, D. E. (1985). \"Polypeptide ligation occurs during post-translational modification of concanavalin A\". Nature 313 (5997): 64–67. doi:10.1038/313064a0. PMID 3965973.  edit ^ a b Bowles, D. J.; Pappin, D. J. (1988). \"Traffic and assembly of concanavalin A\". Trends in Biochemical", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}