{"relation": [["Artist", "STEVIE WONDER", "LTD", "donald byrd", "madlib", "michael jackson", "jackson 5", "rance allen group", "donald byrd", "bobbi humphrey", "johnny hammond", "a taste of honey", "LTD", "michael jackson", "edwin starr", "roger glenn", "dj spinna", "gary bartz (f. syreeta wright)"], ["Title", "summer soft", "love to the world prayer", "where are we going", "stepping into tomorrow", "wings of my love", "to know", "piece of mind", "you and the music", "harlem river drive", "back to the projects", "boogie oogie oogie", "love ballad", "up again", "like we used to do", "don't leave", "lansana's priestess", "macaroni"], ["Album", "songs in the key of life", "love to the world", "black byrd", "shades of blue", "got to be there", "lookin' through the windows", "say my friend", "places and spaces", "blacks and blues", "gambler's life", "12\"", "love to the world", "music and me", "hell up in harlem OST", "reachin'", "blue note revisited", "music is my sanctuary"], ["Label", "tamla", "A&M", "blue note", "blue note", "motown", "motown", "capitol", "blue note", "blue note", "salvation", "capitol", "A&M", "motown", "motown", "fantasy", "blue note", "capitol"]], "pageTitle": "Guess Who's Coming to Radio??!! | KBOO", "title": "", "url": "http://www.kboo.org/GuessWhosComingtoRadio?page=0%2C7%2C0%2C0%2C4", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00269-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 540362551, "recordOffset": 540324877, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{35099=\"moved to Brooklyn, NY in 2008 after having a successful career as a photographer in Israel. I decided to move to NY to evolve, expand, and progress as a professional photographer. As a working photographer, I was always on the look out for personal projects to nourish my creativity, and since I’m primarily a portrait photographer, I was looking for a subject matter that will fulfill my passion for photography and music. I was always collecting records, but back home it was very limited. When I arrived to NY suddenly the sky was the limit. People were digging for vinyl records everywhere. It suddenly made sense that there is a whole scene here that could and should be documented. This gave me a whole new inspiration for a personal project.\", 35507=in 2009, pat. was featured in a site called called dust and grooves, dedicated to featuring vinyl enthusiasts and collectors.    he introduced me to the 'curator' of the site, eilon paz, who has started a kickstarter page to raise money for a book he is self-publishing.  paz describes himself as having:, 33849=take a listen, watch and enjoy.  and check out what the kickstarter project (which ends 10 august 1012) entails, as well as paz' dust and grooves site. , 72976=the 29th of august is a day we at 'guess who's coming to radio??!!' celebrate annually as the day of teacher MICHAEL JACKSON; even though we do our annual radio celebration it's never on the day he came to this earth, so this will be the first time we'll actually be celebrating with you!  from 7 PM to MIDNIGHT we will be honoring his gifts- primarily, the words and music.  what makes this day even more special is that JENNIFER BATTEN will be celebrating with us, live and direct!  ms.}", "TableContextTimeStampAfterTable": "{83237=Would it be possible for KBOO to post tonight's show or, at least, the fifteen minutes that Chris spoke about his encounter with Portland police on your webpage or myspace page?  I would be very interested to listen to it again and pass it along to my friends at Copwatch, if that is okay.  I believe the segment ranged between 8:45 pm - 9:00 pm.  Please feel free to e-mail me with a response - it would be great to hear from you.  Thank you very much for your help, and keep up the excellent work!, 91414=Latest newsletter: May 2015, 86192=yes, i am actually planning to do another show on motown; i didn't get to fit everything i wanted to fit into the show... my plan is to do something in april. i would like to go more in depth about what i was touching on in the last show... is it possible for a 'person of colour' to be successful in america and not sacrifice or compromise their beliefs? i want to do more in-depth conversations/interviews about that., 99826=Copyright © 2012 KBOO Community Radio | Copyright Policy | Community Guidelines | Website Illustration & Design by: KMF ILLUSTRATION}", "lastModified": "Sat, 01 Aug 2015 03:59:00 +0000", "textBeforeTable": "07/28/2011 Air date:  Guess Who's Coming to Radio??!! Program name:  Guess Who's Coming to Radio??!! playlist for 07/28/2011 Playlists last » next › 3 2 1 Download audio file Login or register to post comments Format: MP3 Stereo 44kHz 320Kbps (CBR) Length: 41:16 minutes (94.44 MB) http://www.doj.state.or.us/consumer/foreclosure_settlement.shtml and if you are in the process of getting your home foreclosed on- or", "textAfterTable": "Label STEVIE WONDER summer soft songs in the key of life tamla LTD love to the world prayer love to the world A&M donald byrd where are we going black byrd blue note madlib stepping into tomorrow shades of blue blue note michael jackson wings of my love got to be there motown jackson 5 to know lookin' through the windows motown rance allen group piece of mind say my friend capitol donald byrd you and the music places and spaces blue note bobbi humphrey harlem river drive blacks and blues blue note johnny hammond back to the projects gambler's life salvation a taste of honey boogie oogie oogie 12\" capitol LTD love ballad love to the world A&M michael jackson up again music and me motown edwin starr like we used to do hell up in harlem OST motown roger glenn don't leave reachin' fantasy dj spinna lansana's priestess blue note revisited blue note gary bartz (f. syreeta wright) macaroni music is my sanctuary capitol honoring the life and works of alphonso 'fonce' mizell.  we also spoke to s. renee mitchell!!!  yaaaaaaayyyy!", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}