{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14"], ["Name", "Stiff Little Breeze", "Tie the Devil Down", "Red House", "The Tiger in the Tall Grass", "Big Guitars", "Love Is a River", "Bats", "High Road to Heaven", "Money", "The Dreamer", "Wicked Woman", "A Light Texas Rain", "When the Heart Beats Once", "Beal St."], ["Artist", "Jon Butcher Axis", "Jon Butcher Axis", "Jon Butcher Axis", "Jon Butcher Axis", "Jon Butcher Axis", "Jon Butcher Axis", "Jon Butcher Axis", "Jon Butcher Axis", "Jon Butcher Axis", "Jon Butcher Axis", "Jon Butcher Axis", "Jon Butcher Axis", "Jon Butcher Axis", "Jon Butcher Axis"], ["Time", "2:43", "3:37", "4:39", "4:42", "3:29", "3:35", "1:26", "3:17", "3:35", "3:13", "3:57", "2:14", "3:14", "1:26"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - A Stiff Little Breeze by Jon Butcher Axis", "title": "", "url": "https://itunes.apple.com/lu/album/stiff-little-breeze/id4657056?i=4656983", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00014-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 864245723, "recordOffset": 864219307, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{120691=Copyright © 2014 Apple Inc. Tous droits réservés.}", "lastModified": "Sat, 01 Aug 2015 03:57:47 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Jon Butcher Axis A Stiff Little Breeze iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from A Stiff Little Breeze by Jon Butcher Axis, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop.", "textAfterTable": "14 Songs Album Review A Stiff Little Breeze is a superb album from the Jon Butcher Axis, getting straight As in pacing, performance, and material. Jon Butcher personally essays, the tales behind each tune found in the eight-page booklet brimming with photos and rich in band history. As the music crosses decades, Butcher cleverly splashes some of his favorite phrasings throughout the melodies and production, making it very, very appealing. \"The Tiger in the Tall Grass\" borrows heavily from early Rod Stewart/Faces, Beatles backing vocals, and, most notably, Paul McCartney's \"That Would Be Something\" from his first solo album. \"Wicked Woman\" (the title of a Janis Joplin bootleg, a fact that couldn't have escaped Butcher's notice) adds some culture shock from what precedes it — the kind of polished '80s rock that Bon Jovi's \"Livin' on a Prayer\" provided, only this Jon plays it so cool, slipping in a bit of \"Purple Haze\" into the mix. And speaking of such things, \"Red House\" is a standout. This artist has certainly come up with enough diverse sounds to separate him from his major influence — but when he dives into Hendrix territory, it is with true understanding and wild abandon. Jimi's friend Buzzy Linhart heard this version of \"Red House\" and noted that the tune has become the \"Stormy Monday Blues\"", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}