{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"], ["Name", "Om Gang Ganapataye Namaha", "Lokah Samastah Sukhino Bhavantu", "Om Shakti", "Calling the Spirits", "Govinda Gopala", "Bhajarangi Hanuman", "Om Namo Bhagavate Vasudevaya", "Om Namah Shivaya", "Jai Saraswati", "Jai Ma", "Hari Om"], ["Artist", "Sean Johnson & The Wild Lotus Band", "Sean Johnson & The Wild Lotus Band", "Sean Johnson & The Wild Lotus Band", "Sean Johnson & The Wild Lotus Band", "Sean Johnson & The Wild Lotus Band", "Sean Johnson & The Wild Lotus Band", "Sean Johnson & The Wild Lotus Band", "Sean Johnson & The Wild Lotus Band", "Sean Johnson & The Wild Lotus Band", "Sean Johnson & The Wild Lotus Band", "Sean Johnson & The Wild Lotus Band"], ["Time", "4:10", "3:53", "4:21", "4:44", "4:30", "6:08", "6:51", "7:02", "4:23", "5:30", "4:41"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Calling the Spirits by Sean Johnson & The Wild Lotus Band", "title": "", "url": "https://itunes.apple.com/us/album/calling-the-spirits/id253892735?i=253893208", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00065-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 860092931, "recordOffset": 860064646, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{123700=Copyright © 2014 Apple Inc. All rights reserved., 22248=\"Calling the Spirits is destined to become one of the most well regarded recordings in the world of chant music. Each arrangement is unique and inspiring from the smooth saxophone on Jai Ma to the danceable beat of Om Shakti. Sean Johnson's vocals are impeccable. Gwendolyn Colman backs him up strongly, adding a balancing feminine component. Colman also contributes percussion and her skill on a variety of exotic instruments. She is joined by other talented guest musicians, resulting in a colorful and well integrated sound. Though chant music is a fairly recent genre in our musical culture, it has a longstanding history. In fact, highlighting sacred words with beautiful melodies is a tradition that spans at least a thousand years. This tradition is now being transformed by time and place. Western artists performing kirtan today bring their varied cultural experiences to the melodies they choose. Johnson's music is infused with a subtle flavor of his native city, New Orleans. This recording is also a reflection of his attempt to bring light and hope back to his beloved city after the devastation of Hurricane Katrina.\" - Bette Timm, Aura Magazine \"When Hurricane Katrina struck New Orleans, studio owner and kirtan singer Sean Johnson left his hometown to go on tour with his band. In between performances, the group set to work on writing new material that blended Big Easy jazz with Sanskrit chants. The resulting studio album represents the band's emotional grieving for its city and hopefulness for its renaissance. In this acoustically based album, Johnson, his brother and guitarist Matt Johnson, percussionist Gwendolyn Colman, and jazz bassist Alvin Young aims to capture the spirit of the devastated city. Tenor sax and guitar fuse beautifully with the Indian harmonium and tamboura, Middle Eastern dumbek and udu, and Laten castanets. Many of the tracks are improvised recordings, giving each song a life of its own. This organic energy is evident throughout the album, especially with \"Lokah Samastah Sukhino Bhavantu,\" in which the opening guitar riff precedes a soulful saxophone accompanying the mantra for happiness and freedom to all. The funky rhythms and vocals in \"Om Shakti\" exuding the power of the divine feminine, are paired with a rapped chant of the \"Durga Chalisa,' a Hindu prayer honoring Durga, the lion-riding warrior goddess. Calling The Spirits delivers the spicy sounds of the bayou with devotion. For that reason, the album is a joy to listen to whether you're a yogi, a jazz connoisseur, or anyone who appreciates wildly creative music.\" -- Erica Rodifer, Yoga Journal Magazine \"Sean Johnson’s kirtan will ignite the world! Starting on slow simmer, Calling The Spirits is a jazzy hybrid of East and West that will bring joy to your heart and get your body boogieing! New Orleans is home for this band, and there’s something in the arrangements and in the horns that brings to mind the old-time Cajun mix of high culture and deep roots. With deep reverence for mantra and melody, the Wild Lotus Band does its magic, creating a stew of shimmering world music. Sean’s voice is sublime beyond belief. I adore Gwendolyn Coleman’s vocals, and her Middle Eastern percussion skills are fabulous. The horns add a bit of Eastern European flavor. The cover art is a dreamy feast for the eyes–Hanuman on harmonium, Krishna on sax and Ganesh on bass, while the Devi keeps it all together in time. It’s highly recommended for all chant fans, yogis and music lovers alike. Calling The Spirits will ground you, while at the same time allow your wings to emerge and fly--a true spiritual phenomena.\" - Debi Buzil, Yoga Chicago Magazine \"Sean Johnson & the Wild Lotus Band are a New Orleans-based collective that offer a unique twist on classic kirtan chant. Acoustic guitar, bluesy rhythms, lots of clap-style percussion... the band takes the essence of the bayou and merges it with Indian spiritual music for a sound that bubbles with soul and unbridled passion. Johnson provides lead vocals on the album, and his voice has a low, smooth quality that melds well with the earthy, acoustic-based backdrops. Their take on the perennial \"Om Namah Shivaya\" is fresh and original, with a light jazz sound and joyous singing that captivates. The same could be said for another favorite \"Govinda Gopala,\" which makes great use of Kristen Jensen's violin to provide an upbeat yet tender melody. Johnson and his band perform regularly at yoga studios around the country and have frequently put on benefit concerts to help rebuilding efforts in their New Orleans home.\" -- Music Design In Review}", "lastModified": "Fri, 31 Jul 2015 07:22:04 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Sean Johnson & The Wild Lotus Band Calling the Spirits iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Calling the Spirits by Sean Johnson & The Wild Lotus Band, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon", "textAfterTable": "11 Songs Customer Reviews Critically acclaimed chant album from New Orleans....           by Kirtan Love \"Calling the Spirits is destined to become one of the most well regarded recordings in the world of chant music. Each arrangement is unique and inspiring from the smooth saxophone on Jai Ma to the danceable beat of Om Shakti. Sean Johnson's vocals are impeccable. Gwendolyn Colman backs him up strongly, adding a balancing feminine component. Colman also contributes percussion and her skill on a variety of exotic instruments. She is joined by other talented guest musicians, resulting in a colorful and well integrated sound. Though chant music is a fairly recent genre in our musical culture, it has a longstanding history. In fact, highlighting sacred words with beautiful melodies is a tradition that spans at least a thousand years. This tradition is now being transformed by time and place. Western artists performing kirtan today bring their varied cultural experiences to the melodies they choose. Johnson's music is infused with a subtle flavor of his native city, New Orleans. This recording is also a reflection of his attempt to bring light and hope back to his beloved city after", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}