{"relation": [["", "176", "177", "178", "179", "180", "181", "182", "183", "184", "185", "186", "187", "188", "189", "190", "191", "192", "193", "194", "195", "196", "197", "198", "199", "200"], ["Name", "Baby Please Don't Leave Me", "Look What All You Got", "Tramp", "She's Got the Devil In Her", "I Gotta Try You Girl", "Who's Been Foolin' You", "It's a Jungle Out There", "Hard Time Killing Floor", "Crawlin' Kingsnake", "Lucy Mae Blues", "Can't See Baby", "I Love the Life I Live", "Louise McGhee", "Moanin' and Groanin'", "Black Cat Blues", "Bad Life Blues", "Sally Mae", "Anna Lee", "Lonesome Home Blues", "Broken-Hearted Blues", "This Is the End", "Girl You're Nice and Clean", "Dedication to the Late T-Bone Walker", "Good News", "Blues At My Baby's House"], ["Album", "Sweet Tea", "Sweet Tea", "Sweet Tea", "Sweet Tea", "Sweet Tea", "Sweet Tea", "Sweet Tea", "Blues Singer", "Blues Singer", "Blues Singer", "Blues Singer", "Blues Singer", "Blues Singer", "Blues Singer", "Blues Singer", "Blues Singer", "Blues Singer", "Blues Singer", "Blues Singer", "This Is Blues", "An Introduction to Electric Blues Guitar", "DJ Play My Blues", "DJ Play My Blues", "DJ Play My Blues", "DJ Play My Blues"], ["Time", "7:22", "4:44", "6:47", "5:10", "12:08", "4:55", "5:38", "2:47", "5:17", "3:32", "4:03", "2:46", "5:22", "3:27", "4:27", "3:44", "4:25", "4:13", "5:00", "3:10", "2:58", "4:57", "6:57", "4:41", "7:03"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "Album Only", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Buddy Guy", "title": "", "url": "https://itunes.apple.com/lt/artist/buddy-guy/id97577?trackPage=8", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00161-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 877817331, "recordOffset": 877787984, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{37118=By the end of the '70s, Guy was without an American record deal, and his career took a hit as a result; while he recorded some material for specialist labels in Europe and Japan, and Alligator issued two collections in 1981, Alone and Acoustic and Stone Crazy, for the most part Guy supported himself in the '80s through extensive touring and live work, often appearing in Europe, where he seemed better respected than in the United States. Despite this, he continued to plug away at the American market, buoyed by interest from guitar buffs who had heard major stars sing his praises; in 1985, Eric Clapton told a reporter for Musician magazine, \"Buddy Guy is by far and without a doubt the best guitar player alive...he really changed the course of rock & roll blues,\" while Vaughan declared, \"Without Buddy Guy, there would be no Stevie Ray Vaughan.\" In 1989, Guy opened his own nightclub in Chicago, Buddy Guy's Legends, where he frequently performed and played host to other top blues acts, and in 1991, after a well-received appearance with Clapton at London's Royal Albert Hall (documented in part on the album 24 Nights), he finally scored an international record deal with the Silvertone label, distributed by BMG. Guy's first album for Silvertone, Damn Right, I've Got the Blues, featured guest appearances by Clapton, Jeff Beck, and Mark Knopfler, and featured fresh versions of several fan favorites as well as a handful of new tunes; it was the Buddy Guy album that finally clicked with record buyers, and became a genuine hit, earning Guy a gold album, as well as a Grammy Award for Best Contemporary Blues Album. Guy wasted no time cutting follow-ups, releasing Feels Like Rain in 1993 and Slippin' In in 1994, both of which racked up solid sales figures and won Guy further Grammy Awards., 38338=Chess didn't issue an album on Guy until the 1967 release of I Left My Blues in San Francisco, and when his contract with the label ran out, he promptly signed with Vanguard, who put out A Man and the Blues in 1968. As a growing number of rock fans were discovering the blues, Guy was finding his stock rising with both traditional blues enthusiasts and younger white audiences, and his recordings for Vanguard gave him more room for the tougher and more aggressive sound that was the trademark of his live shows. (It didn't hurt that Jimi Hendrix acknowledged Guy as an influence and praised his live show in interviews.) At the same time, Guy hadn't forsaken the more measured approach he used with Junior Wells; Buddy and Wells cut an album that also featured Junior Mance on piano for Blue Thumb called Buddy and the Juniors, and in 1972, Eric Clapton partnered with Ahmet Ertegun and Tom Dowd to produce the album Buddy Guy and Junior Wells Play the Blues. In 1974, Guy and Wells played the Montreux Jazz Festival, with Bill Wyman of the Rolling Stones sitting in on bass; the show was later released as a live album, Drinkin' TNT and Smokin' Dynamite, with Wyman credited as producer., 35260=In 1993, Guy reunited with Junior Wells on the stage of his Legends club; it would prove to be one of Wells' last live performances, and the show was released in 1998, several months after Wells' passing, on the album Last Time Around: Live at Legends. While most of Guy's work in the late '90s and into the new millennium was the sort of storming Chicago blues that was the basis of his reputation, he also demonstrated he was capable of exploring other avenues, channeling the hypnotic Deep Southern blues of Junior Kimbrough on 2001's Sweet Tea and covering a set of traditional blues classics on acoustic guitar for 2003's Blues Singer. In 2004, Guy won the W.C. Handy Award from the American Blues Foundation for the 23rd time, more than any other artist, while he took home his sixth Grammy Award in 2010 for the album Living Proof. Guy also received the National Medal of the Arts in 2003, and was awarded with Kennedy Center Honors in 2012. He was inducted into the Rock and Roll Hall of Fame in 2005, with both Eric Clapton and B.B. King presenting him with his award, and in 2012 he performed a special concert at the White House, where he persuaded President Barack Obama to join him at the vocal mike for a few choruses of \"Sweet Home Chicago.\" Guy continued his late-career revival with the 2012 memoir When I Left Home: My Story and the summer 2013 release of the ambitious, guest star-laden double album Rhythm & Blues., 41507=George \"Buddy\" Guy was born in Lettsworth, Louisiana on July 30, 1936, and is said to have first learned to play on a homemade two-string instrument fashioned from wire and tin cans. Guy graduated to an acoustic guitar, and began soaking up the influences of blues players such as T-Bone Walker, B.B. King, and Lightnin' Hopkins; as his family relocated to Baton Rouge, Guy had the opportunity to see live performances by Lightnin' Slim (aka Otis Hicks) and Guitar Slim, whose raw, forceful sound and over the top showmanship left a serious impression on Guy. Guy started playing professionally when he became a sideman for John \"Big Poppa\" Tilley, where he learned to work the crowd and overcome early bouts of stage fright. In 1957, Guy cut a demo tape at a local radio station and sent a copy to Chess Records, the label that was home to such giants as Muddy Waters, Howlin' Wolf, and Etta James, shortly before buying a one-way train ticket and moving to Chicago, eager to make music his career., 40458=Guy didn't enjoy immediate success in Chicago, and struggled to find gigs until his fiery guitar work and flashy stage style (which included hopping on top of bars and strutting up and down their length while soloing, thanks to a 100-foot long guitar cable) made him a regular winner in talent night contests at Windy City clubs. Guy struck up friendships with some of the city's best blues artists, including Muddy Waters, Otis Rush, Freddie King, and Magic Sam, and landed a steady gig at the 708 Club, where he became known as a talent to watch. In 1958, Magic Sam arranged for Guy to meet Harold Burrage, the owner of local blues label Cobra Records, and Guy was soon signed to Cobra's sister label Artistic Records. Willie Dixon produced Guy's debut single, \"Sit and Cry (The Blues),\" as well as the follow-up, \"This Is the End,\" but in 1959, Cobra and Artistic abruptly closed up shop, and like labelmate Otis Rush, Guy found a new record deal at Chess. Guy's first single for Chess, 1960's \"First Time I Met the Blues,\" was an artistic triumph and a modest commercial success that became one of his signature tunes, but it was also the first chapter in what would prove to be a complicated creative relationship between Guy and label co-founder Leonard Chess, who recognized his talent but didn't appreciate the louder and more expressive aspects of his guitar style. While Guy enjoyed minor successes with outstanding Chess singles such as \"Stone Crazy\" and \"When My Left Eye Jumps,\" much of his work for the label was as a sideman, lending his talents to sessions for Muddy Waters, Koko Taylor, Howlin' Wolf, Little Walter, and many others. And one of Guy's definitive recordings of the '60s wasn't even issued by Chess; Guy had been performing occasionally with blues harpist Junior Wells, and Guy and his band backed up Wells on the 1965 Delmark release Hoodoo Man Blues, a masterful exercise in the Chicago blues style, with Guy credited as \"Friendly Chap\" on initial pressings in deference to his contract with Chess.}", "TableContextTimeStampAfterTable": "{71158=© „Apple Inc.“, 2014. Visos teisės saugomos., 66047=30 July 1936 in Lettsworth, LA}", "lastModified": "Sat, 01 Aug 2015 04:35:49 GMT", "textBeforeTable": "Top Songs 2 1 View In iTunes Sweet Tea 20. View In iTunes Buddy's Baddest: The Best of Buddy Guy 19. View In iTunes Buddy's Baddest: The Best of Buddy Guy 18.", "textAfterTable": "Previous 3 4 5 6 7 8 9 10 11 12 Next Top Music Videos 1. Messin' With The Kid View In iTunes 2. Don't Start Me Talkin' View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}