{"relation": [["", "", "", ">>"], ["", "1.", "2.", "3."], ["Date", "Jun 29, 04:28", "Jun 29, 07:10", "Jun 30, 03:10"], ["Subject", "weird things ppl say", "Re: weird things ppl say", "Re: weird things ppl say"], ["Author", "shul", "Rolphus", "shul"]], "pageTitle": "Beta Testing Updates - Blue's News Comments", "title": "", "url": "http://www.bluesnews.com/cgi-bin/board.pl?action=viewthread&boardid=1&threadid=26362&id=830&view=threads", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 20, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00218-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 324355811, "recordOffset": 324339417, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{31527=Chatbear v1.4.0/blue++: Page generated 31 July 2015, 03:52. Chatbear Announcements., 31324=News CGI copyright © 1999-2015 James \"furn\" Furness & Blue's News. All rights reserved., 29409=Copyright © 1996-2015 Stephen Heaslip. All rights reserved. All trademarks are properties of their respective owners.}", "textBeforeTable": "story) so presumably there are still spots available. sign-ups for the upcoming beta test of Etherlords that we mentioned last week ( beta testing this upcoming RTS game until at least early August. According to the post, \"the designers are working to further refine gameplay and balance to compensate for the month of your input that we're losing\" (which seems to bring the entire concept behind beta testing into question). Finally, we received another reminder about the Battle Reams forums announcing a delay in Liquefied.org has reproduced a post from the following press release announcing the beginning of the second stage of beta testing for Fighting Legends, their upcoming massively multiplayer role-playing/strategy game. Word is they are still on track for a November release, heartened by the \"fact that Phase One gamers, worldwide, played off our local server and that we ran 21 consecutive days without a complete system failure...\" Meanwhile, A few beta testing updates: First, Maximum Charisma Studios sends along [Jun 28, 2001, 9:17 pm ET] - Share - Viewing Comments Beta Testing Updates --> Blue's News Favorite! Join Blue's News! Get TMNF", "textAfterTable": "3. Re: weird things ppl say Jun 30, 2001, 03:10 shul   WOW! Dilbert. Black&White. pictures of my non-existent trip to the moon. dum developers. even dummer publishers. All of those things and more are running through my head while reading this post of yours ... On a brighter note I hope Maximum Charisma knows what they are doing  ", "hasKeyColumn": true, "keyColumnIndex": 3, "headerRowIndex": 0}