{"relation": [["Title", "Black Lamb and Grey Falcon", "The Golden Mean", "Hidden Macedonia", "Macedonia"], ["Author", "Rebecca West", "Annabel Lyon", "Christopher Deliso", "Harvey Parker and Heather Roberson"]], "pageTitle": "Macedonia Tours & Travel | Intrepid Travel FR", "title": "", "url": "http://www.intrepidtravel.com/fr/macedonia", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00264-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 513126011, "recordOffset": 513070834, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{102118=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 100799=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o...}", "TableContextTimeStampAfterTable": "{2643=At the conclusion of World War II, the country was incorporated into the Socialist Republic of Yugoslavia under the leadership of Tito – an era during which, by and large, the territory prospered. With the collapse of European communism, however, came new calls for Macedonian independence, and the state peacefully ceded from the republic in 1992. Wary of ‘Macedonia’ being used as the country’s proposed name due to implied claims to Aegean Macedonia, Greece made its objections known and the compromise ‘The Former Yugoslav Republic of Macedonia’ was eventually arrived at. Greek ire was re-aroused in 1994, culminating in its enforcement of an economic embargo that was eventually lifted upon Macedonia’s changing of its flag and agreeing to discussions about its name. The country evaded being embroiled in the Yugoslav Wars of the 1990s, but experienced a potentially catastrophic civil conflict from 1997-2001 over tensions with its sizeable Albanian population. Hostilities were becalmed with a NATO ceasefire, but the Albanian-Macedonian relationship is still a touchy subject that’s best avoided. The same goes for Macedonian-Greek relations due to the still unresolved ‘naming issue’. And also Macedonian-Bulgarian relations for that matter., 952=Macedonia has a climate somewhere between a transitional continental and Mediterranean climate, which can vary greatly between seasons and regions. The country’s mountainous areas can be subjected to brutally cold winters (December to February), while the lower lying areas can reach 40° C during summer (June to September). Between May and September is the best time to visit, unless you’re into skiing., 4346=Back in the good old days, the villagers of Galičnik had only one day each year where Macedonian couples could get married: 12th July. These days, starry-eyed lovers can take their vows on whichever day they please, but for one lucky couple a traditional wedding ceremony is still a possibility. Held on the weekend closest to the 12th July, the Galičnik Wedding Festival commemorates the custom with dances, elaborate dress and a horse bridle being placed on the bride as a test of her obedience. Any Macedonian couple that has already been married in a civil service can apply for the role of official couple, with the winning entrant generally being the one with the prettiest bride., 1589=Even by Balkan standards, Macedonia’s history is characterised by complexity and controversy. Going back to the days of Alexander the Great (the country’s favourite son), Macedonia has been pin-balled between external powers, from the Romans to the Byzantines, the Serbs to the Ottoman Turks, the Bulgarians to the Greeks. In fact, it wasn’t until 1991 that the country officially attained its status as an independent nation – and even that remains a point of contention in certain circles. From the sixth century AD until the fourteenth, the territory was wrestled to-and-fro between the Byzantines, Slavs, Bulgars and Serbs before eventually falling to the Ottoman Empire in 1371. The country remained under Turkish rule until the empire’s decline in the eighteenth century, then was once again split up but this time between Greece, Bulgaria and Serbia. Various pushes for independence and ‘reunion’ with Bulgaria were then stymied by the two World Wars and the advent of communism., 6089=Macedonia’s breweries aren’t as prolific as its wineries, but beer is still a pretty big player in national culture and deemed worthy a festival. The first Pivo Fest Prilep was held in 2003 and, in contrast to many of the country’s other tradition-orientated festivals, the focus here is on live music, grilled meats, skimpy attire and ales abundant. Perhaps unsurprisingly, it’s now one of the most popular summer events in the country., 5110=Each September, Kavadarci, a small town in Macedonia’s seriously scenic wine-growing region, plays host to the Tikveški Grozdober festival. A celebration of both the town’s liberation and the beginning of the grape harvest, the festival swells with food stalls and music concerts and culminates in an extravagantly costumed carnival procession through the town’s main streets. Oh, and much wine drinking.}", "textBeforeTable": "Recommended reading Further reading 8. Please ask and receive permission before taking photos of people, including children. 7. Refrain from supporting businesses that exploit or abuse endangered animals. 6. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive and supports the local community. 5. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 4. Always dispose of litter thoughtfully, including cigarette butts. 3. For environmental reasons, try to avoid buying bottled water. Fill a reusable water bottle or canteen with filtered water. 2. Dress modestly and respectfully when entering places of worship. Shoulders to knees should be covered and shoes removed. 1. Be considerate of Macedonia’s customs, traditions, religion and culture. Avoid expressing opinions about the country’s relations with Greece, Bulgaria or its significant Albanian population. Top responsible travel tips for Macedonia Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this in mind while travelling. Macedonia Travel Tips Responsible Travel also provides useful health information: Go to: http://www.who.int/en/ The World Health Organisation", "textAfterTable": "Handy links macedonia-timeless.com lonelyplanet.com/macedonia worldtravelguide.net/macedonia × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}