{"relation": [["Title", "The American Civil War: A Military History", "The Battle For History : Re-fighting World War II", "The Battle For History : Re-fighting World War II", "The Book of War", "The Face of Battle", "The Face of Battle: A Study of Agincourt, Waterloo, and the Somme", "Fields of Battle", "The First World War", "A History of Warfare", "How War Begins", "Intelligence in War: Knowledge of the Enemy from Napoleon to Al-Qaeda", "The Iraq War", "The Price of Admiralty: The Evolution of Naval Warfare", "The Second World War", "War and Our World: The Reith Lectures, 1998", "The Wars of the Ancient Greeks and Their Invention of Western Military Culture", "Winston Churchill: A Life"], ["Author", "John Keegan", "John Keegan", "John Keegan", "John Keegan", "John Keegan", "John Keegan", "John Keegan", "John Keegan", "John Keegan", "John Keegan", "John Keegan", "John Keegan", "John Keegan", "John Keegan", "John Keegan", "John Keegan Victor Davis Hanson", "John Keegan"], ["Copyright", "2009", "1995", "1995", "1999", "1976", "1976", "1995", "1998", "1993", "1998", "2003", "2004", "1988", "2005", "1998", "1999", "2002"], ["Date Added", "12/08/10", "11/05/04", "04/04/14", "05/07/14", "07/13/15", "04/29/14", "09/19/12", "11/21/12", "09/19/12", "11/13/14", "12/08/10", "04/05/14", "10/20/04", "10/02/14", "05/05/11", "10/07/04", "04/29/14"], ["Action", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]], "pageTitle": "Author - Bookshare - Accessible Books for Individuals with Print Disabilities", "title": "", "url": "https://www.bookshare.org/browse/author?key=Keegan,%20John&resultsView=TABLE", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00196-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 894491247, "recordOffset": 894480182, "tableOrientation": "HORIZONTAL", "textBeforeTable": "2550100 Results Per Page: By TitleBy AuthorBy Copyright DateBy Date Added Sort Order: Showing 1 through 17 of 17 results Keegan, John Author Browse List View Table View Browse Results You are using an outdated browser. Please upgrade your browser to improve your experience. My Bookshare Training and Resources User Feedback Help", "textAfterTable": "Showing 1 through 17 of 17 results Help Select your format based upon: 1) how you want to read your book, and 2) compatibility with your reading tool. To learn more about using Bookshare with your device, visit the \"Using Bookshare\" page in the Help Center. Here is an overview of the specialized formats that Bookshare offers its members with links that go to the Help Center for more information. Bookshare Web Reader - a customized reading tool for Bookshare members offering all the features of DAISY with a single click of the \"Read Now\" link. DAISY (Digital Accessible Information System) - a digital book file format. DAISY books from Bookshare are DAISY 3.0 text files that work with just about every type of access technology that reads text. Books that contain images will have the download option of ‘DAISY Text with Images’. BRF (Braille Refreshable Format) - digital Braille for use with refreshable Braille devices and Braille embossers. MP3 (Mpeg audio layer 3) - Provides audio only with no text. These books are created with a text-to-speech engine and spoken by Kendra, a high quality synthetic voice from Ivona. Any device that supports MP3 playback is compatible. DAISY Audio - Similar to the Daisy 3.0 option above; however, this option uses MP3 files created with our text-to-speech engine that utilizes", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}