{"relation": [["Side C Titles", "1. Even Hell Has Its Heroes", "2. Rooks Across The Gate"], ["Artist", "Earth", "Earth"], ["Length", "09:43", "08:58"]], "pageTitle": "Earth - Primitive And Deadly (Vinyl LP) - Amoeba Music", "title": "", "url": "http://www.amoeba.com/primitive-and-deadly-lp-earth/albums/3334627/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00321-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 293487084, "recordOffset": 293471136, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{2291=09/01/2014}", "TableContextTimeStampAfterTable": "{10222=Copyright © 2015 Amoeba, All Rights Reserved. Amoeba and the Amoeba Music mark and logo are trademarks of Amoeba Music Inc.}", "lastModified": "Sat, 01 Aug 2015 03:47:18 GMT", "textBeforeTable": "Track Listing Over the course of their 20-plus years of existence, the band Earth have created an crater-like impact in the world of ambient and drone metal, setting the stage for the genre to flourish with their seminal Earth 2 album and continuing from there on six more albums. But their seventh, Primitive & Deadly, is only the second to have vocals. As the band has evolved to strip down some of the corrosive feedback that marked their early work and have added in more Americana and jazz-based elements, this addition of vocals can just be seen as another development in their sound, especially when they’re so effective. After setting sail on a slow-rolling metallic ocean with “Torn By the Fox of the Crescent Moon,” Mark Lanegan throws his gritty vocals into the mix on the whiskey-soaked “There Is a Serpent Coming” as well as the desert metal of “Rooks Across the Gate.” Lanegan tends to be an ace guest vocalist, as his particularly grizzled voice can add gravitas to something light (his work with Isobel Campbell) as well as it can sound like it’s cracking the earth on a metal album (his work with Queens of the Stone Age), and here, of course, Lanegan’s voice works wonders, selling otherwise silly lines like “I see all the creepin’ crawlies comin’” to help make “There Is a Serpent Coming” the album’s standout track. Beneath Lanegan’s voice, as", "textAfterTable": "Side B Titles Artist Length 1. From The Zodiacal Light Earth 11:29 Side C Titles Artist Length 1. Even Hell Has Its Heroes Earth 09:43 2. Rooks Across The Gate Earth 08:58 Side D Titles Artist Length 1. Badgers Bane [Vinyl Only] Earth BUY $22.98", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}