{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"], ["Name", "Good Vibes", "Sweet Love", "The Real Deal", "Tlc", "Jb", "Misty", "A Night In Baltimore", "Divine Order", "House Party", "Fontana", "Carnival In San Juan", "Quantum Leap"], ["Artist", "Mark Mosley", "Mark Mosley", "Mark Mosley", "Mark Mosley", "Mark Mosley", "Mark Mosley", "Mark Mosley", "Mark Mosley", "Mark Mosley", "Mark Mosley", "Mark Mosley", "Mark Mosley"], ["Time", "4:52", "5:10", "4:31", "5:31", "4:02", "5:35", "4:45", "4:10", "5:02", "4:08", "4:44", "4:20"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Tlc by Mark Mosley", "title": "", "url": "https://itunes.apple.com/us/album/tlc/id385703726", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00157-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 881057223, "recordOffset": 881032767, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{24411=Once again browsing through itunes I came across this artist listening to Jb. Wow!!! I could not sample all the songs fast enough so I purchased the WHOLE album. Can't say which is my favorite selection because they can't occupy the number one slot at the same time. Mark plays live in the Baltimore/Washington area. I will catch one of his shows in 2014. Cat Can Play!!!, 22494=In Fall 2010, my wife purchased tickets to Mark's album release party at local restaurant. The show was great and we purchased an album for ourselves and another as a gift for my in-laws. I have over 2000+ songs in my jazz playlist (8000+ total songs) and I listen to this album in its entirety several times a week. Each song is that good! I play it while commuting to work, travel to and from my kids events, and sometimes traveling with colleagues to business meetings. Honestly, I do skip over 'Misty' because it is love song that you have to be in the mood for. To me, it brings the tempo of the album down but at the same time displays the artist's versatility and adds to the album's influential diversity. My favorite song is Quantum Leap. I play this song about 3 or more times in a row because I don't want it to end. My other favorites that get repeated are Divine Order, TLC, House Party, A Night in Baltimore, San Juan, Fontana, and JB. That's almost the entire album. Yes, the album is that good. By the way, this is not a paid endorsement and I do not know the artist. Nowadays, it is hard to find an album with 90% being consistently good. This album deserves recognition. NOW GO BUY IT!, 112238=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 03:37:05 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Mark Mosley Tlc iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Tlc by Mark Mosley, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "12 Songs Customer Reviews Nice album? Actually, it's a great album!           by DrWEJ In Fall 2010, my wife purchased tickets to Mark's album release party at local restaurant. The show was great and we purchased an album for ourselves and another as a gift for my in-laws. I have over 2000+ songs in my jazz playlist (8000+ total songs) and I listen to this album in its entirety several times a week. Each song is that good! I play it while commuting to work, travel to and from my kids events, and sometimes traveling with colleagues to business meetings. Honestly, I do skip over 'Misty' because it is love song that you have to be in the mood for. To me, it brings the tempo of the album down but at the same time displays the artist's versatility and adds to the album's influential diversity. My favorite song is Quantum Leap. I play this song about 3 or more times in a row because I don't want it to end. My other favorites that get repeated are Divine Order, TLC, House Party, A Night in Baltimore, San Juan, Fontana, and", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}