{"relation": [["Author", "Author", "erok Private Message Aug 10 2011 at 3:21pm #", "Swalfoort Private Message Aug 10 2011 at 8:02pm #", "erok Private Message Aug 10 2011 at 8:21pm #", "Kordite Private Message Aug 11 2011 at 6:37pm #", "Swalfoort Private Message Aug 11 2011 at 7:30pm #", "robjdlc Private Message Aug 13 2011 at 5:46pm #", "Swalfoort Private Message Aug 13 2011 at 11:27pm #", "robjdlc Private Message Aug 29 2011 at 7:23pm #", "Nick D Private Message Aug 29 2011 at 8:25pm #", "robjdlc Private Message Aug 29 2011 at 8:48pm #"], ["Posts", "Posts", "Hey, we have a flickr group that anyone on there should join and post photos of biking in pittsburgh. we always need photos for stuff, blogs, and sometimes print, so you could end up with a photo credit somewhere. if it’s a bikefest event, try to tag it bikefest. that would rule. http://www.flickr.com/groups/bikepittsburgh/", "Is there an easy way to do that? I use Flickr for Wheelset of Fortune, Tagorama and Bloomin Bikes, so have a ton of stuff out there. Is there an easy way to share it to another user group? Could someone provide instructions here? Thanks!", "You need to first join the group. Then, any photo that you want to share, you simply click on the photo, click on the “Actions” dropdown, then click on “add to group.” It brings up a window that allows you to add the photo to as many groups that you are a member of", "Or you can go to Organize and then drag a block of images into the window in the center. Then select “add to group” to send them all at once.", "Thansk Kordite and Erok; that made it easy. Added about a hundred photos to the mix. Some are way better than others, of course……", "Pretty sure my photos still make up like 60% of whats in the pool. If not, they will be once I get these bikefest photos done!", "Rob; You must have taken hundreds last night alone. it will take a village to catch up with your rate of photo production.", "Bump. http://www.flickr.com/photos/rjdlc/sets/72157627422703469/", "How many times can you spot me?", "And there are maybe 10 that were lost on the cutting room floor."]], "pageTitle": "Bike Pittsburgh | Topic: Flickr Folks:Please submit stuff to the BikePGH flickr group", "title": "", "url": "http://bikepgh.org/mb/topic/flickr-folksplease-submit-stuff-to-the-bikepgh-flickr-group/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00130-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 22571645, "recordOffset": 22555251, "tableOrientation": "HORIZONTAL", "textBeforeTable": "  ← Forums Home Viewing 10 posts - 1 through 10 (of 10 total) This topic contains 0 voices and has 9 replies. Flickr Folks:Please submit stuff to the BikePGH flickr group Monthly emails, no SPAM. Newsletter Signup Instagram Pinterest Flickr Facebook Twitter Google Plus Login Search Bike Racks Gear Shop Bike Theft Prevention Bike Education In a Crash?", "textAfterTable": "Viewing 10 posts - 1 through 10 (of 10 total) ← Forums Home   You must be logged in to reply to this topic. Become a Member Volunteer Newsletter Subscribe to our mailing list Monthly emails, no SPAM. Search the Forums Search Sponsors Web Design by ClickNathan Handmade Websites All original material is licensed under a Creative", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}