{"relation": [["Title", "To Benin and Back", "The Viceroy of Ouidah", "Show Me The Magic"], ["Author", "Chris Starace", "Bruce Chatwin", "Annie Caulfield"]], "pageTitle": "Benin Tours & Travel | Intrepid Travel", "title": "", "url": "https://www.intrepidtravel.com/benin", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00235-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 934919147, "recordOffset": 934869174, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{101392=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 102714=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan...}", "TableContextTimeStampAfterTable": "{987=The most pleasant months to visit Benin are between November and February when temperatures drop along with the humidity. From April to July and September to October expect heavy rains. The dry and dusty harmattan winds from the Sahara blow between December and March, and this period (particularly February to April) can be uncomfortably hot, with temperatures in the mid-40s (Celsius).}", "textBeforeTable": "Recommended reading Further reading 10. When on community visits or homestays, refrain from giving gifts or money to locals. 9. Please ask and receive permission before taking photos of people, including children. 8. Refrain from supporting businesses that exploit or abuse endangered animals. 7. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 6. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 5. When bargaining at markets, stay calm, be reasonable and keep a smile on your face. It's meant to be fun! 4. Always dispose of litter thoughtfully, including cigarette butts. 3. For environmental reasons, try to avoid buying bottled water. Fill a reusable water bottle or canteen with filtered water. 2. Dress modestly and respectfully. Shoulders to knees should be covered, especially when entering places of worship. 1. Be considerate of Benin’s customs, traditions, religion and culture. Top responsible travel tips for Benin Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this in mind while", "textAfterTable": "Handy links www.lonelyplanet.com/worldguide/Benin www.worldtravelguide.net/benin www.benintourisme.com www.africaguide.com/country/benin × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}