{"relation": [["TITLE", "into the jaws of death", "BREAKING: City Council Votes Unanimously Against South Central Farmers", "TM", "Jan Perry's latest offensive against South Central Farm Land"], ["AUTHOR", "food is a weapon", "A", "TM", "Linda Piera-Avila"], ["DATE", "Wednesday, Nov. 16, 2011 at 10:59 AM", "Wednesday, Nov. 16, 2011 at 1:06 PM", "Friday, Nov. 18, 2011 at 1:15 AM", "Monday, Nov. 21, 2011 at 12:20 PM"]], "pageTitle": "Editorial: Jan Perry's Latest Offensive Against the South Central Farm Land (41st & Alameda) : LA IMC", "title": "", "url": "http://la.indymedia.org/news/2011/11/249634.php", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00298-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 138425797, "recordOffset": 138409832, "tableOrientation": "VERTICAL", "TableContextTimeStampAfterTable": "{34400=Russia to Veto UN Resolution for US-Controlled MH17 Tribunal J29 10:57AM, 34677=Israel Bombs Syria During Large-Scale War Games J29 6:51AM, 38606=Bring Me Home Retro Future hack cheats telecharger {CHIPS} J27 9:51AM, 34128=US Wants Enhanced UN Peacekeepers Serving Its Interests J29 11:51AM, 39451=Cleveland Police Attack Black Activists J27 3:36AM, 35986=Greece demonstrate J28 10:28AM, 37310=NUCLEAR SHUTDOWN NEWS JULY 2015 J27 4:54PM, 32472=Nords Heroes of the North hack cheats ANDROID IOS [Mod Emeralds] J30 11:46PM, 36527=Hezbollah's Nasrallah Urges Resistance Against Israeli Lawlessness J28 7:00AM, 38071=Anti-fascist and anarchist from Russia needs help and solidarity J27 11:17AM, 33569=Israel Declares War on Palestinian Hunger Strikers J30 5:41AM, 36809=Tormenting Greece is about sending a message J28 5:16AM, 31520=Why The Actual Artists Keep Fleeing What Once Was The Los Angeles Arts District J16 4:15PM, 34940=Another US Jail Cell Death Sentence J29 3:46AM, 35716=United Nations Votes for Global Bankruptcy Principles J28 11:37AM, 39183=Saudis Keep Bombing Yemen After Declaring 5-Day Halt J27 6:36AM, 37069=Balkanizing Syria Planned J28 4:01AM, 33835=Irresponsibly Bashing Russia Veto Against Establishing Kangaroo MH17 Tribunal J30 3:13AM, 37818=Troika Bandits Want More from Greece J27 11:37AM, 38352=Assad Vows to Defend Syria's Homeland J27 11:16AM, 33015=Russia Challenges America's Orwellian National Endowment for Democracy J30 11:59AM, 37557=Kayle League Of Legends Hack iOS Android Cheats J27 1:45PM, 32213=Titans Card Game Hack cheats [Coins,Lyras] J30 11:47PM, 31268=Latest Black Flag Newsletter Available J20 8:05PM, 32753=The Shortwave Report 07/31/15 Listen Globally! J30 5:05PM, 36221=Craigslist foot sucker stabs feet takes foot print and places at crime scenes, wofford hei J28 7:44AM, 38880=CFPB Fines Predatory Student Lending Practices; Religious Organizations Pray for Relief J27 9:40AM, 35191=Illegitimate Show Trial Sentences Gaddafi's Son to Death J28 12:15PM, 33302=Anti-Iranian Nuclear Deal Blitzkrieg in Full Swing J30 11:37AM, 35464=Another Jail Cell Murder in America J28 11:52AM, 31813=12 Peoples Of Rain To the People of California J16 3:36PM}", "lastModified": "Fri, 14 Mar 2014 08:43:11 GMT", "textBeforeTable": "LATEST COMMENTS ABOUT THIS ARTICLE Listed below are the 10 latest comments of 4 posted about this article. These comments are anonymously submitted by the website visitors. add your comments Google+FacebookTwitterShare on , , : qcOfftopic(249634); qcDouble(249634); qcSpam(249634); qcAd(249634); qcHate(249634); qcFraud(249634); qcBestOf(249634);", "textAfterTable": "Local News Latest Black Flag Newsletter Available J20 8:05PM Why The Actual Artists Keep Fleeing What Once Was The Los Angeles Arts District J16 4:15PM 12 Peoples Of Rain To the People of California J16 3:36PM More Local News... Other/Breaking News Titans Card Game Hack cheats [Coins,Lyras] J30 11:47PM Nords Heroes of the North hack cheats ANDROID IOS [Mod Emeralds] J30 11:46PM The Shortwave Report 07/31/15 Listen Globally! J30 5:05PM Russia Challenges America's Orwellian National Endowment for Democracy J30 11:59AM Anti-Iranian Nuclear Deal Blitzkrieg in Full Swing J30 11:37AM Israel Declares War on Palestinian Hunger Strikers J30 5:41AM Irresponsibly Bashing Russia Veto Against Establishing Kangaroo MH17 Tribunal J30 3:13AM US Wants Enhanced UN Peacekeepers Serving Its Interests J29 11:51AM Russia to Veto", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}