{"relation": [["Position", "3", "6", "9", "17", "25", "26", "27", "43", "47"], ["Title", "Final Fantasy XII International: Zodiac Job System", "The Legend of Zelda: The Phantom Hourglass", "Wild Arms XF", "It's a Wonderful World", "Pokemon Diamond", "Pokemon Pearl", "Dragon Quest Swords: The Masked Queen and the Tower of Mirrors", "Zettai Onkan Otoda Master", "Itsuwari no Rondo"], ["Publisher", "Square Enix", "Nintendo", "SCE", "Sqaure Enix", "Nintendo", "Nintendo", "Square Enix", "Hudson Soft", "Success"], ["Platform", "", "", "", "", "", "", "", "", ""]], "pageTitle": "RPGamer > Japandemonium > August 22, 2007", "title": "", "url": "http://www.rpgamer.com/news/japan/bm082207.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00025-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 685925019, "recordOffset": 685912197, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{15619=<bgsound src=\"/news/japan/images/Q3-2007/sailpipe.mid\">}", "textBeforeTable": "RPGs made a decent showing this time around. There was a an error though, where Taikon Tatsujin was listed as an RPG by the Pokemon division of Nintendo. I'm guessing it was supposed to be Diamond... Dengeki Rankings Hey, I'm back! I apologize for the erotic erratic updates. I'm really busy with my big move back to Japan. Pretty soon, I'm packing up and heading West to the East. Changing locales and jobs has got things a little crazy, but it'll be worth it for both of us, I promise! I'll be attending the Tokyo Game Show soon, so I'll have lots of pictures and video to show you guys and gals. Konnichiwa -->", "textAfterTable": "Source: Dengeki Hey, if you're not levelling tomorrow night... It took the manpower of three different gaming companies, Compile Hearts, Idea Factory, and Red Entertainment. Still, Japan is on the verge of releasing the more expansive dating simulation game ever: Agarest Senki. Over the course of the game, you will traverse five separate continents and play different characters over five generations. The scope of dating possibilities is just enormous. Here are a few of the potential lucky ladies in their formal wear: As you go on your adventures, you will encounter a number of potential female partners. How you treat them, and their resulting opinion of you, will effect who aids you on your travels. This system spans multiple generations, and how you treat one girl as a child could affect her becoming your heroine in the future.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}