{"relation": [["Side D Titles", "1. Mirrors", "2. Blue Ocean Floor"], ["Artist", "Justin Timberlake", "Justin Timberlake"], ["Length", "08:05", "07:22"]], "pageTitle": "Justin Timberlake - The 20/20 Experience (Vinyl LP) - Amoeba Music", "title": "", "url": "http://www.amoeba.com/the-20-20-experience-lp-justin-timberlake/albums/2871474/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00145-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 286332571, "recordOffset": 286311239, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{2714=03/18/2013, 3172=Aaron Sausedo, Hollywood 09/01/2013}", "TableContextTimeStampAfterTable": "{11724=Copyright © 2015 Amoeba, All Rights Reserved. Amoeba and the Amoeba Music mark and logo are trademarks of Amoeba Music Inc.}", "lastModified": "Sat, 01 Aug 2015 03:53:21 GMT", "textBeforeTable": "Track Listing The latest in epic pop albums comes from Justin Timberlake, whose first album in seven years is an hour-long tour de force that aims to put Timberlake firmly back on top as one of the top entertainers of his generation. Following grandiose albums from some of his peers — Kanye West’s My Beautiful Dark Twisted Fantasy and Frank Ocean’s channel ORANGE, to name the most noteworthy — Timberlake goes big with The 20/20 Experience. Though nearly each song stretches past six, seven, even eight minutes in an apparent bid for every track to hit like Ocean’s huge “Pyramids,” 20/20 thankfully mostly avoids the excess of, say, Beyonce’s I Am…Sasha Fierce and doesn’t pander to his audience of now-grown-up, former teenyboppers, actual teens and “serious music fans.” Producer Timbaland, with whom Timberlake previously collaborated very successfully, shows up to produce 20/20 with Jerome “J-Roc” Harmon (Jay-Z, Chris Brown). Timberland and Harmon keep things relatively mature and redolent of classic soul and R&B, wisely avoiding the sort of europop faddism that has drowned recent efforts by Madonna and Rihanna. “Pusher Love Girl” is funky and spare, allowing Timberlake to unleash the high-end vocals he first debuted on “Cry Me a River” and showing the strongest bit of the Stevie Wonder influence that crops up all over the album. First single “Suit & Tie” moves from slo-mo, tripped-out hip-hop of the classic Timbaland variety before morphing into a", "textAfterTable": "3. Don't Hold The Wall Justin Timberlake 07:10 Side B Titles Artist Length 1. Strawberry Bubblegum Justin Timberlake 07:59 2. Tunnel Vision Justin Timberlake 06:46 Side C Titles Artist Length 1. Spaceship Coupe Justin Timberlake 07:17 2. That Girl Justin Timberlake 04:47 3. Let The Groove Get In Justin Timberlake 07:11", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}