{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Nom", "I Am What I Am (From \"La Cage Aux Folles\")", "The Impossible Dream (From \"Man of La Mancha\")", "A New Life (From \"Jekyll and Hyde\")", "Man of La Mancha (From \"Man of La Mancha\")", "Over the Rainbow", "Son of a Preacher Man", "Someone Like You", "Don't Rain on My Parade (From \"Funny Girl\")", "This Is the Moment", "In His Eyes"], ["Album", "Broadway, My Way", "Broadway, My Way", "Broadway, My Way", "Broadway, My Way", "It's Time", "Gold", "Jekyll & Hyde - The Musical (1997 Original Broadway Cast Recording)", "Broadway, My Way", "Jekyll & Hyde - The Musical (1997 Original Broadway Cast Recording)", "Jekyll & Hyde - The Musical (1997 Original Broadway Cast Recording)"], ["Durée", "3:19", "2:29", "4:36", "3:20", "3:05", "3:16", "3:46", "3:02", "3:14", "4:01"], ["Prix", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "Afficher sur iTunes", "Afficher sur iTunes", "Afficher sur iTunes", "Afficher sur iTunes", "Afficher sur iTunes", "Afficher sur iTunes", "Afficher sur iTunes", "Afficher sur iTunes", "Afficher sur iTunes", "Afficher sur iTunes"]], "pageTitle": "iTunes - Musique - Broadway, My Way par Linda Eder", "title": "", "url": "https://itunes.apple.com/fr/album/broadway-my-way/id995215", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00158-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 876228807, "recordOffset": 876200259, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{27137=Né(e) : 3 février 1961 à Brainerd, MN, 25503=Almost exactly one year after her last foray into the pop music realm with Gold, Linda Eder returns to the Broadway style that made her a sensation with this 13-track tribute to the Great White Way. Tackling such famous songs as \"On the Street Where You Live\" from My Fair Lady, \"Some People\" from Gypsy, \"Edelweiss\" from The Sound of Music, and \"I'll Be Seeing You\" from Right This Way, Eder puts her own spin on some of her favorites while retaining the emotional draw that made them popular in the first place. A rather eclectic set, one might question why Eder would choose two songs from the same musical (Man of La Mancha) and one (\"Gold\") from a show that is still in the works (not to mention that it was the title song from her previous release), when there are so many other selections that her fans, no doubt, would love to hear her cover. Also troublesome is that two recordings (\"Man of La Mancha\" and \"Unusual Way\" from Nine) were taken from Eder's 1997 release, It's Time, causing the listener to wonder if time restraints created the need to duplicate, or if these songs are so close to Eder's heart that she felt compelled to include them on this collection. Either way, it really doesn't matter. As the album title states, this is Eder's Broadway, and style and substance make up for any false steps on this outing. A timeless talent that will far outlive many of those taking the undeserved spotlight on the Top 40 charts., 129568=Copyright © 2014 Apple Inc. Tous droits réservés.}", "lastModified": "Sat, 01 Aug 2015 05:02:21 GMT", "textBeforeTable": "Afficher sur iTunes Frank Wildhorn & Friends 5. Afficher sur iTunes Christmas Stays the Same 4. Afficher sur iTunes Greatest Hits 3.", "textAfterTable": "D’autres ont aussi acheté Stage Heroes Colm Wilkinson Afficher sur iTunes Songs Luther Vandross Afficher sur iTunes Liza With a \"Z\" (Live) Liza Minnelli Afficher sur iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}