{"relation": [["Artist", "Billy Joel", "Britney Spears", "Broadway musical \"Pippin\"", "Dolly Parton", "Frank Sinatra", "Leslie Bricusse", "Nickelback"], ["Song Title", "Piano Man", "I'm a Slave 4 U", "Corner of the Sky", "Nine To Five", "The Second Time Around", "Talk to the Animals", "Far Away"], ["Played When", "sung by Chris Calabasa at the bar", "sung at the bar", "sung by the Broadway Wanna-Be", "sung by Dolly Parton wannabe", "sung at the bar", "sung at the bar", "sung by Tommy Sour at the bar"]], "pageTitle": "Bones Season 3 Episode 14 - The Wannabe in the Weeds (3x14) - Watch Online - s3 e14 Spoilers", "title": "", "url": "http://www.tvrage.com/Bones/episodes/650078?vote=6", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00170-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 786206233, "recordOffset": 786190272, "tableOrientation": "VERTICAL", "textBeforeTable": "Music American Idol on season 5 and season 6, respectively. Brandon Rogers (Broadway Wanna-Be) were both contestants on FOX's Ace Young (Tommy Sour) and Guest stars CSI: Miami. Crime Wave\" episode of Tamara Taylor (Cam) previously worked together on the \" Corbin Allred (Adam Matthews) and series star Guest star Episode Notes Click here to add a recap for The Wannabe in the Weeds Next Episode --> <-- Previous Episode Recap Dr. Zack Addy As Eric Millegan Dr. Lance Sweets As John Francis Daley Dr. Camille \"Cam\" Saroyan As Tamara Taylor Dr. Jack Hodgins As T.J. Thyne", "textAfterTable": "Episode Quotes Bones: Hey! Break down the door! Booth: It hurts my shoulder when I break down the door! Sweets: Mocking will not change my opinion. I have been mocked many, many times before. (Booth and Bones give each other a look) Sweets: That came out wrong. Pam: If he didn't love me, why would he give me this bracelet? P-A-M, do you know what that spells? Booth: (pause) Pam. Pam: That's right. Bones: So he was killed, decapitated, and mulched. Wow, can't be worse for this guy. Bones: How does a former sniper have a grass allergy? Wouldn't a sneeze give away your position? Booth: Bones, okay, I worked in the desert. Sand, no grass. (while an amateur is singing) Brennan: This guy is good. Booth: Thank you Paula. Just focus here. Sweets: She has body issues, which are not congruent with her actual appearance. She's someone who's slightly large, who believes she's a very large woman who can convince people she's only slightly large. And the way they treat her convinces her that", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}