{"relation": [["Title", "Whispering in the Giant's Ear", "The Pearl", "Devil in the Mountain: A Search for the Origin of the Andes", "American Visa", "1491"], ["Author", "William Powers", "John Steinbeck", "Simon Lamb", "Juan de Recacoechea", "Charles C. Mann"]], "pageTitle": "Bolivia Tours & Travel | Intrepid Travel FR", "title": "", "url": "http://www.intrepidtravel.com/fr/bolivia", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00204-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 523409419, "recordOffset": 523346303, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{188463=Review submitted 25 Jul 2015, 87489=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 86170=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o...}", "TableContextTimeStampAfterTable": "{87733=Discovered by Bolivian construction workers in 1994, Cal Orko (or the Dinosaur Wall) is a prehistoric oddity of epic proportions. Found on the banks of a cement quarry, this collection of over 5,000 tracks from 330 different species of dinosaurs is a rarity in the world of palaeontology. Over 68 million years old, it's thought that this quarry was previously a gigantic lake, its steep slopes once traversed by gravity-defying dinosaurs keen for a drink. Nowadays, this precious landmark is beginning to crumble - resulting in conservation efforts from the Bolivian government., 84434=So you weren’t hallucinating when you thought you saw a giant frog, but surely there's nothing else hiding beneath Titicaca’s surface? Wrong again. In 1988, taking hints from a local legend, divers descended to Titicaca’s murky depths and discovered a real-life lost city. The temple complex, believed to be pre-Inca, is said to be over 1,500 years old., 80427=May to October (winter) is generally considered to be the best time to visit Bolivia, as days are usually dry and clear. Summer (November to April) is the rainy season, and during this time it can get hot and humid. The peak tourist season runs from late June to early September. This season holds the best weather for travel, but is Bolivia's main fiesta season and holiday period, so some disruptions can be expected at times.}", "textBeforeTable": "Recommended reading Further reading 9. When on community visits or homestays, refrain from giving gifts or money to locals. 8. Please ask and receive permission before taking photos of people, including children. 7. Refrain from supporting businesses that exploit or abuse endangered animals. 6. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 5. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 4. When bargaining at markets, stay calm, be reasonable and keep a smile on your face. It's meant to be fun! 3. Always dispose of litter thoughtfully, including cigarette butts. 2. For environmental reasons, try to avoid buying bottled water. Instead, fill a reusable water bottle or canteen with filtered water. 1. Be considerate of Bolivia’s customs, traditions, religion and culture. Top responsible travel tips for Bolivia Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this in mind while travelling. Bolivia Travel", "textAfterTable": "Handy links www.lonelyplanet.com/worldguide/bolivia www.visitbolivia.net www.boliviaweb.com www.worldtravelguide.net/bolivia × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}