{"relation": [["Title", "Student's Book", "Teacher’s Edition with answers overprinted and 6 Class Audio CDs"], ["ISBN", "978-960-492-018-1", "978-960-492-019-8"], ["Price", "€15.00", "€20.00"]], "pageTitle": "Practice Tests for the ALCE™ Exam | Learning Resources", "title": "", "url": "http://www.hau.gr/?i=learning.en.alcebcce.323", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00077-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 484976758, "recordOffset": 484968556, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Information Call our office for more details. Special offers are available for language schools and EFL teachers.   English-Greek glossary available for free download on ORFEAS (http://orfeas.hau.gr) Complete transcripts Sample answer sheet Rating scales for the Writing and Speaking sections Introduction with a complete description of the revised examination Six complete practice tests in the format of the revised ALCE™ examination Contents Practice Tests for the ALCE™ Exam provides essential practice in all parts of the ALCE™ examination. The practice tests accurately reflect the level, format, and skills tested in the actual examination. Order online Related Content Components Information Practice Tests for the ALCE™ Exam Twitter Facebook LinkedIn Google + ALCE™/BCCE™ / Practice Tests for the ALCE™ Exam Publications / Learning Resources / You are at: Orfeas Germany home Cyprus Orfeas Project Management", "textAfterTable": "Components Title ISBN Price Student's Book 978-960-492-018-1 €15.00 Teacher’s Edition with answers overprinted and 6 Class Audio CDs 978-960-492-019-8 €20.00 Add To Basket Components: Student's Book Teacher’s Edition with answers overprinted and 6 Class Audio CDs Quantity: Related Content: User Groups: Adolescent, Candidate, Parent, School Owner, Student Tags: ALCE books Last Update At: 2012/08/31 - 16:23:10 In this section: Publications New Publications ECCE ECPE ALCE™/BCCE™ TOEIC® Modern Greek Book Exhibitions Cultural Publications Shipping & Delivery", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}