{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15"], ["Name", "All Night Long", "Long Train Runnin'", "On Through the Night", "Hold Tight", "Chinatown", "Little Queen", "383", "Dragonfly", "Never Goin' Home", "The Hammer", "Roller", "Dölphenwülf", "'Til the Livin' End", "Ride to Live", "Ever Onward"], ["Artist", "Zeke", "Zeke", "Zeke", "Zeke", "Zeke", "Zeke", "Zeke", "Zeke", "Zeke", "Zeke", "Zeke", "Zeke", "Zeke", "Zeke", "Zeke"], ["Time", "1:41", "1:39", "1:31", "2:14", "1:37", "2:02", "2:45", "2:31", "1:35", "1:22", "1:06", "2:06", "1:52", "3:00", "3:48"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - 'Til the Livin' End by Zeke", "title": "", "url": "https://itunes.apple.com/us/album/til-the-livin-end/id73639636", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00026-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 860010035, "recordOffset": 859980157, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{132873=Copyright © 2014 Apple Inc. All rights reserved., 32736=Formed: 1993 in Seattle, WA}", "lastModified": "Fri, 31 Jul 2015 08:23:56 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Zeke 'Til the Livin' End iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from 'Til the Livin' End by Zeke, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "15 Songs Album Review Propelled by a frantic speed-streak not seen this side of Texas' Speedealer, Seattle's Zeke straddle that fine line between hardcore and speed metal on their sixth album — and first since getting back together as a slimmed-down trio — Til the Livin' End. Produced by alternative rock guru Jack Endino, the album's \"15 tracks in 30 minutes\" approach kind of says it all about both the band and their music; but before you automatically envision the Ramones (they're here as well, but mostly in spirit), think Motörhead gone hardcore, since tracks like \"Long Train Runnin',\" \"Hold Tight,\" and the very \"Metropolis\"-ish \"Dragonfly\" all recall the immortal Lemmy and his charges. The agonized howl of singer/guitarist Blind Marky Felchtone is partly to blame there, but really, no complaints. And frankly, who knows if Motörhead ever achieved the shocking velocity of Zeke's \"The Hammer.\" Other than that, it's rather remarkable to hear Felchtone effortlessly driving the Zeke bullet train — rounded out by the so-tight-it's-stoopid rhythm section of bassist Diamond Jeff Matz and drummer Donny Paycheck — while holding down this considerable workload with nary a bum note in sight. And thankfully, just when both their speaker cabinets and most listeners' intensity thresholds are approaching an utter and complete melting point, Zeke ease off the throttle just a", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}