{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Don't Leave Me This Way", "On Broadway (Edit)", "Breezin'", "This Masquerade", "On Broadway", "Give Me the Night", "Don't Leave Me This Way (Single Version)", "This Masquerade (Edit)", "Turn Your Love Around", "Give Me the Night (Edit)"], ["Album", "20th Century Masters - The Millennium Collection: Motown 1970s, Vol. 1", "The Best of George Benson", "Breezin'", "Breezin'", "The George Benson Collection", "Give Me the Night", "Motown 1's", "The Best of George Benson", "The George Benson Collection", "The Best of George Benson"], ["Time", "3:38", "5:16", "5:41", "8:03", "5:16", "5:01", "3:38", "3:16", "3:50", "3:42"], ["Price", "$1.29", "$0.99", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Absolute Benson by George Benson", "title": "", "url": "https://itunes.apple.com/us/album/absolute-benson/id401311?ign-mpt=uo%3D4", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00240-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 871092407, "recordOffset": 871062658, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{22124=Born: March 22, 1943 in Pittsburgh, PA, 16571=George Benson is well embarked on the third phase of his career, and Absolute Benson, though unfortunately titled (it sounds like a compilation, but is actually an album of new recordings) is another in a series of consistently excellent CDs that characterize it. Benson excited traditional jazz fans in the 1960s and early '70s with his albums of inventive guitar playing on Columbia, A&M, and CTI, records that made him seem the logical successor to Wes Montgomery. Then, in 1976, he moved to Warner Bros. Records and recorded Breezin', featuring the single \"This Masquerade,\" on which he sang, and suddenly he became a million-selling pop vocalist who happened to play guitar, seemingly the logical successor to Nat \"King\" Cole. That, of course, made him anathema to traditional jazz critics. After a decade, however, his pop success began to diminish, and by the end of the decade he was making another move — to contemporary jazz. By the 1990s, he was restricting his vocal excursions to a few tracks on each disc, and his albums began to top the contemporary jazz album charts consistently. His move from Warner Bros. to GRP, a label devoted to contemporary jazz, confirmed the transition. Absolute Benson is his third GRP release, and on it he turns in a varied set, accompanied by Joe Sample on keyboards; Carlos Hernandez or Christian McBride on bass; Vidal Davis, Steve Gadd, or Cindy Blackman on drums; and Luis Conte or Luisito Quintero on percussion. Four of the nine tracks feature vocals of one sort or another. On the leadoff track, \"The Ghetto,\" Benson (accompanied by five background vocalists) sings a few words, and on \"Come Back Baby,\" he takes a real lead vocal, while on \"El Barrio\" and \"Medicine Man\" he only scats along with his guitar playing in his familiar style. But none of these performances is a conventional pop vocal performance. Similarly, Benson flirts with various pop music styles, covering Donny Hathaway's \"The Ghetto,\" Stevie Wonder's \"Lately,\" and Ray Charles' \"Come Back Baby\" for elements of R&B and blues, while \"El Barrio\" has a Latin feel. But he employs these styles as flavorings, the main course of which always remains his melodic guitar playing. His lead work in \"Jazzenco\" is particularly notable, but throughout the disc he plays with assurance in a manner his fans will recognize and appreciate. If it is difficult to crossover from jazz to pop, crossing back can be just as treacherous. Benson's oldest fans, who later became his detractors, still may not be satisfied with his current approach, but it has deservedly won him a secure place in contemporary jazz., 122712=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 08:34:53 GMT", "textBeforeTable": "View In iTunes Guitar Man 5. View In iTunes The George Benson Collection 4. View In iTunes The Best of George Benson 3. View In", "textAfterTable": "Listeners Also Bought Confidential Peter White View In iTunes Migration Dave Grusin View In iTunes The George Benson Cookbook The George Benson Quartet View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}