{"relation": [["Number", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Artist", "Eminem", "Jay-Z", "50 Cent", "Rick Ross", "Young Money", "Jadakiss", "Kid Cudi", "Fabolous", "Gucci Mane", "UGK"], ["Album", "Relapse", "The Blueprint 3", "Before I Self Destruct", "Deeper Than Rap", "We Are Young Money", "The Last Kiss", "Man on the Moon: The End of Day", "Loso's Way", "The State vs. Radric Davis", "UGK 4 Life"], ["1st week sales", "608,000", "476,000", "160,000", "158,000", "142,000", "134,000", "104,000", "99,000", "90,000", "76,000"], ["1st week position", "#1", "#1", "#5", "#1", "#9", "#3", "#4", "#1", "#10", "#6"]], "pageTitle": "2009 in hip hop music - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/2009_in_hip_hop_music", "hasHeader": true, "headerPosition": "MIXED", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00085-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 857666455, "recordOffset": 857622042, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{119982=As of December 31, 2009.[91][91][92][93][94][95][96][97], 6776=This article summarizes the events, album releases, and album release dates in hip hop music for the year 2009.}", "lastModified": "Thu, 30 Jul 2015 19:30:44 GMT", "textBeforeTable": "Albums[edit] Trina made an appearance at Minnesota Vikings tackle Bryant McKinnie's birthday party and while on stage took shots at fellow female rapper Khia.[67] Following the burglary in his St. Louis mansion, Nelly offers a cash reward for information leading to the arrest of the housebreaker.[66] T.I. was released three months early from prison and was admitted into a halfway house in his hometown of Atlanta.[65] Entertainment Weekly named Kid Cudi's Man on the Moon: The End of Day the best Hip-Hop Album of 2009.[64] Billboard names The Neptunes \"Producers Of Decade\".[63] Long awaited Lil Wayne album, Rebirth leaks 2 months before release. Jim Jones leaves Columbia Records and stays at E1.[62] Young Jeezy has squashed his beef with DJ Drama as well as Gucci Mane.[61] December[edit] Beanie Sigel as well as 50 Cent, has ignited a beef with", "textAfterTable": "Debuted at No. 149 on the Billboard 200 Singles: \"Get Low wit it\" March 17 Gorilla Zoe Don't Feed Da Animals Debuted at No. 8 on the Billboard 200 Singles: \"Lost\", \"What It Is\", \"Echo\" Capone-N-Noreaga Channel 10 Debuted at No. 136 on the Billboard 200 Singles: \"Rotate\", \"Talk To Me Big Time\" Their first album in nine years Twiztid W.I.C.K.E.D. (Wish I Could Kill Every Day) March 23 Noah23 & Madadam Crab Nebula March 24 MF DOOM Born Like This Jim Jones Pray IV Reign Debuted at No. 9 on the Billboard 200 Singles: \"Pop Champagne\", \"Na Na Nana Na Na\", \"Blow the Bank\" Major label debut Slim Thug", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}