{"relation": [["Author", "Author", "fultonco Private Message Mar 2 2013 at 11:00am #", "Jack Private Message Mar 2 2013 at 1:07pm #", "brybot Private Message Mar 2 2013 at 5:46pm #"], ["Posts", "Posts", "Actually an old topic but wanted to pass on another recommendation. The Library, on E. Carson St., South Side. On the site of the old Brady Street Bridge Tavern, approximately 22nd St and E. Carson. Good selection of craft beers on tap. The bartender is very well-versed in all of them and many more. Generous with samples of the various offerings. Food is good also.", "I’ve been told this before and have been meaning to check this place out. Thanks for reminding me.", "The Library also has very good wings. They are kind of expensive, but they have an all you can eat wing special on Tuesday I believe. These are some of the biggest wings (of chicken) I’ve ever seen."]], "pageTitle": "Bike Pittsburgh | Topic: Best Watering Holes For Cyclists/Rides!", "title": "", "url": "http://bikepgh.org/mb/topic/best-watering-holes-for-cyclistsrides-2/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00046-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 23261776, "recordOffset": 23253574, "tableOrientation": "HORIZONTAL", "textBeforeTable": "  ← Forums Home Viewing 3 posts - 1 through 3 (of 3 total) This topic contains 2 replies, has 3 voices, and was last updated by  brybot 2 yrs, 5 mos. Best Watering Holes For Cyclists/Rides! Monthly emails, no SPAM. Newsletter Signup Instagram Pinterest Flickr Facebook Twitter Google Plus Login Search Bike Racks Gear", "textAfterTable": "Viewing 3 posts - 1 through 3 (of 3 total) ← Forums Home   You must be logged in to reply to this topic. Become a Member Volunteer Newsletter Subscribe to our mailing list Monthly emails, no SPAM. Search the Forums Search Sponsors Web Design by ClickNathan Handmade Websites All original material is licensed under a Creative", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}