{"relation": [["", "1", "2"], ["Name", "Killers & Kings (Demo)", "Our Darkest Days / Bleeding"], ["Artist", "Machine Head", "Machine Head"], ["Time", "4:28", "2:49"], ["Price", "$1.29", "$1.29"], ["", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Killers & Kings - Single by Machine Head", "title": "", "url": "https://itunes.apple.com/us/album/killers-kings-single/id860355337?app=itunes&ign-mpt=uo%3D4", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00152-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 872322183, "recordOffset": 872299437, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{109319=Copyright © 2014 Apple Inc. All rights reserved., 7835=Formed: 1992 in Oakland, CA}", "lastModified": "Fri, 31 Jul 2015 07:21:22 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Machine Head Killers & Kings - Single iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Killers & Kings - Single by Machine Head, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening", "textAfterTable": "2 Songs Customer Reviews Above-average original, awesome cover.           by Torturephile The Machine Head original song, \"Killers & Kings\", is somewhat close to the song from The Blackening, \"Clenching the Fists of Dissent\", except it lacks a punchline/climax during its solo. It offers a similar \"marching\" pace and riff to the aforementioned song. McClain's drumming in this song stands out. However, the Ignite cover, \"Our Darkest Days/Bleeding\", is an amazing Melodic Hardcore song that offers a pretty summary of Machine Head's discography, except the two Nu Metal albums. The band's performance is very top-notch, with heart-felt vocal performances from Mr. Flynn. At least metal is not dead           by Machineheadrises This is the only band doing what metallica, slayer and pantera started. This is another great song by them. Big Fan           by Asylumjerk", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}