{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15"], ["Name", "Song of Peace (Finlandia)", "Indian Sunset", "Song for the Asking", "Circus", "On the Path of Glory (La Colline au Whisky)", "Follow Me", "Rhymes and Reasons", "Erika With the Windy Yellow Hair", "I Wish I Knew How It Would Feel to Be Free", "The First Time Ever I Saw Your Face", "Children One and All", "I Guess He'd Rather Be In Colorado", "The Song Is Love", "Light a Candle", "Cristo Ya Nacio en Palacaquina"], ["Album", "Retro Children's Songs", "The Solo Recordings (1971-1972)", "The Solo Recordings (1971-1972)", "The Solo Recordings (1971-1972)", "The Solo Recordings (1971-1972)", "The Solo Recordings (1971-1972)", "The Solo Recordings (1971-1972)", "The Solo Recordings (1971-1972)", "The Solo Recordings (1971-1972)", "The Solo Recordings (1971-1972)", "The Solo Recordings (1971-1972)", "The Solo Recordings (1971-1972)", "The Solo Recordings (1971-1972)", "Fast Folk Musical Magazine (Vol. 3, No. 8) Season's Greetings", "Fast Folk Musical Magazine (Vol. 3, No. 8) Season's Greetings"], ["Time", "3:00", "7:00", "2:09", "3:20", "2:21", "2:40", "2:44", "1:14", "3:29", "2:57", "3:23", "2:10", "3:04", "6:12", "4:50"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$1.29", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Mary Travers", "title": "", "url": "https://itunes.apple.com/us/artist/mary-travers/id63017069", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00304-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 878476239, "recordOffset": 878452423, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{4765=She juggled music and work, including a stint as a model and sometime sales girl at the legendary Elaine Starkman Boutique on Bleecker Street (Starkman — later a pioneer in the SoHo arts community — also designed the dress that Travers wore for her wedding to photographer Barry Feinstein), and she made her professional stage debut in the chorus of a short-lived Broadway show. She later balanced work in the literary and advertising fields with appearances in New York clubs at night and on weekends. After meeting humorist, folksinger, and guitarist Stookey and folk music producer Milt Okun, Travers helped to form Peter, Paul and Mary with Peter Yarrow. The trio performed its debut show at the Bitter End in 1961 and began a decade-long series of concerts and recordings, which eventually came to embrace elements of folk-rock and pop music, as tastes and their sound evolved. Their self-titled debut album, released in 1962, became a major hit, remaining in the Top Ten for ten months and the Top 20 for two years. Their single, \"If I Had a Hammer,\" became an anthem of the civil rights movement and restored composer Pete Seeger (and, to a lesser degree, co-author Lee Hays), whose blacklisting in the mid-'50s had removed them from much of the nation's mass media, to major popular culture prominence. They then did the same for \"Blowin' in the Wind,\" transforming composer Bob Dylan from a promising new figure on the Village folk scene into the songwriter of the moment on the national scene, and launching his rise to pop culture stardom. Over the next decade, Travers and the trio helped to popularize the songs of John Denver and Gordon Lightfoot. Travers' clear lead vocal helped to make the trio's rendition of Denver's \"Leaving on a Jet Plane\" a major hit in 1970, becoming the trio's only number one single., 2881=Shortly after releasing a greatest-hits album, Ten Years Together, in May 1970, the trio members announced their separation. The mother of two daughters — Erika, born in 1960, and Alicia, born in 1966 — Travers nonetheless remained the most musically active of the three as a soloist, at least in terms of recording; across a four-year period, she released the albums Mary (1971), Morning Glory (1972), All My Choices (1973), and Circles (1974) on Warner Bros., in addition to performing at colleges and clubs throughout the United States. Travers also lectured at colleges on \"Society and Its Effect on Music\"; hosted a music and interview show on Radio Pacifica (KPFK) in Los Angeles; and produced, wrote, and starred in a television series for the BBC. Unlike a lot of '60s music activists who seemed to lose focus and direction for their work in the '70s, especially after President Nixon's 1974 resignation and the subsequent end of the Vietnam War, Travers was as active and motivated as ever in the second half of the '70s. Indeed, if making new music became a secondary activity, it was only because she was so involved with other matters. Even so, in 1978, she was signed to Chrysalis Records for one album, It's in Every One of Us, which included her cover of the Hammond/Hazelwood pop/rock standard \"The Air That I Breathe.\", 1496=Travers reunited with Stookey and Yarrow in 1978 for a benefit concert, Survival Sunday, that Yarrow organized and produced at the Hollywood Bowl. Their performance was so encouraging that they agreed to resume their partnership, commencing with the Reunion album that year on Warner Bros., which showed their harmonizing to be as beautiful and compelling as ever. It was accompanied by a single of the Bob Dylan song \"Forever Young.\" In the following two decades, Travers continued to record and perform approximately 45 concerts each year with the trio. Indeed, it was as though they'd never left, as they took on such causes as human rights in Central and South America and world hunger, among numerous other issues, often opposing a singularly unamused (and unsympathetic) Reagan or Bush administration and their supporters in the process. In 2004, the music world was roundly shocked by the news that Travers had developed leukemia — a bone marrow transplant was successful, however, and allowed Travers to resume performing and recording on a limited basis, activities she pursued until she died on September 16, 2009, at age 72. ~ Craig Harris & Bruce Eder, Rovi, 6713=A native of Louisville, KY, and the daughter of journalists, Travers grew up in New York's Greenwich Village, where the combination of her parents' professions and the tolerant, relatively free-spirited ambience of the neighborhood in which she lived had a profound effect on her sensibilities about art, life, and living. As a youngster, she also became enchanted with the American folk songs played by the Weavers, Leadbelly, and Woody Guthrie. While in high school, Travers became a regular performer at the Sunday afternoon folk music sessions at Washington Square Park, which were already a neighborhood institution in the early '50s — apart from being a recreational center for the Village's resident iconoclast population, the park also served as the campus for New York University, which surrounds it, and had long been (and remains to this day) a magnet for young listeners and casual strollers. Together with a teenage group, the Songswappers, Travers appeared twice at Carnegie Hall and recorded with Pete Seeger. Her other influences included Josh White, Jo Mapes, and Ronnie Gilbert of the Weavers. Her musical impulses thrived in the environment of the Village, where a performing career seemed like more of a possibility, or, at least, not an impossibility. In a 1978 interview for a press biography, she explained how the Village allowed her to nurture such ambitions, far better than many other neighborhoods: \"Greenwich Village was [still very much] a middle-class Italian enclave in those days — as opposed to Little Italy, which was a ghetto — and Italians have a long cultural and social tradition of tolerating artists in their midst. And they also have a great sympathy for and appreciation of 'village idiots.' So you knew that as long as you were friendly with the grocer or the pizza guy on the corner, you would probably not starve while trying to live as a musician or an artist.\"}", "TableContextTimeStampAfterTable": "{34025=November 7, 1937 in Louisville, KY, 42247=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 08:52:27 GMT", "textBeforeTable": "Top Songs Travers reunited with Stookey and Yarrow in 1978 for a benefit concert, Survival Sunday, that Yarrow organized and produced at the Hollywood Bowl. Their performance was so encouraging that they agreed to resume their partnership, commencing with the Reunion album that year on Warner Bros., which showed their harmonizing to be as beautiful and compelling as ever. It was accompanied by a single of the Bob Dylan song \"Forever Young.\" In the following two decades, Travers continued to record and perform approximately 45 concerts each year with the trio. Indeed, it was as though they'd never left, as they took on such causes as human rights in Central and South America and world hunger, among numerous other issues, often opposing a singularly unamused (and unsympathetic) Reagan or Bush administration and their supporters in the process. In 2004, the music world was roundly shocked by the news that Travers had developed leukemia — a bone marrow transplant was successful, however, and allowed Travers to resume performing and recording on a limited basis, activities she pursued until she died on September 16, 2009, at age 72. ~ Craig Harris & Bruce Eder, Rovi Shortly after releasing a greatest-hits album, Ten Years Together, in May 1970, the trio members announced their separation. The mother of two daughters — Erika, born in 1960, and Alicia, born in 1966 — Travers nonetheless remained", "textAfterTable": "Top Books 1. Litany View In iTunes Birth Name: Mary Allin Travers Born: November 7, 1937 in Louisville, KY Genre Singer/Songwriter Years Active: '60s, '70s, '80s, '90s, '00s Influencers Woody Guthrie Leadbelly The Weavers Contemporaries John Denver Pete Seeger Bob Dylan Joan Baez Richie Havens John Stewart Kate & Anna McGarrigle Arlo Guthrie Gordon Lightfoot Tom Paxton Discover and share new apps. Follow us on @AppStore.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}