{"relation": [["Title", "Ancient Gods Speak, The: A Guide to Egyptian Religion", "Complete Gods and Goddesses of Ancient Egypt, The", "Complete Temples of Ancient Egypt, The", "Dictionary of Ancient Egypt, The", "Dictionary of Egyptian Gods and Goddesses, A", "Egyptian Treasures from the Egyptian Museum in Cairo", "Gods and Myths of Ancient Egypt", "Gods of Ancient Egypt, The", "Gods of the Egyptians, The (Studies in Egyptian Mythology)", "Oxford Encyclopedia of Ancient Egypt, The", "Valley of the Kings"], ["Author", "Redford, Donald B.", "Wilkinson, Richard H.", "Wilkinson, Richard H.", "Shaw, Ian; Nicholson, Paul", "Hart, George", "Tiradritti, Francesco, Editor", "Armour, Robert A.", "Vernus, Pascal", "Budge, E. A. Wallis", "Redford, Donald B. (Editor)", "Weeks, Kent R."], ["Date", "2002", "2003", "2000", "1995", "1986", "1999", "1986", "1998", "1969", "2001", "2001"], ["Publisher", "Oxford University Press", "Thames & Hudson, LTD", "Thames and Hudson, Ltd", "Harry N. Abrams, Inc., Publishers", "Routledge", "Harry N. Abrams, Inc.", "American University in Cairo Press, The", "George Braziller Publisher", "Dover Publications, Inc.", "American University in Cairo Press, The", "Friedman/Fairfax"], ["Reference Number", "ISBN 0-19-515401-0", "ISBN 0-500-05120-8", "ISBN 0-500-05100-3", "ISBN 0-8109-3225-3", "ISBN 0-415-05909-7", "ISBN 0-8109-3276-8", "ISBN 977 424 669 1", "ISBN 0-8076-1435-1", "ISBN 486-22056-7", "ISBN 977 424 581 4", "ISBN 1-5866-3295-7"]], "pageTitle": "The Baboons and Monkeys of Ancient Egypt", "title": "", "url": "http://www.touregypt.net/featurestories/baboons.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00255-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 755721991, "recordOffset": 755706106, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{30775=ISBN 0-8076-1435-1, 28690=1995, 29180=1986, 27141=2002, 31125=1969, 28209=2000, 31616=2001, 29671=1999, 37747=Copyright © 1996-2013 Tour Egypt. All Rights Reserved. Web Development & Design By AKN Solutions, 31277=ISBN 486-22056-7, 30621=1998, 27635=2003}", "textBeforeTable": "However, monkeys were not necessarily considered benevolent creatures. There were rites involving monkeys that are documented by early illustrations and alter by religious texts that describe the danger of monkeys \"who cut off heads\". In fact, the image of a baboon with raised tail serves as the hieroglyph for \"enraged\". The baboon's wildness made it into a dangerous, apotropaic intercessory, being the primordial creation in a mythical landscape. For example, four baboon-like creatures guarded the mythical \"Lake of Fire\" in the Egyptian underworld. Monkeys and baboons played an essential role in Egyptian cosmogony. Various gods were portrayed as these creatures, and some of the earliest deities were sometimes depicted with baboon heads. One of the Four Sons of Horus, Hapy, who was associated with mummification, was represented as a baboon-headed canopic god. The green monkey, particularly when depicted shooting with bow and arrows, was an aspect of the invisible primeval god, Atum. The baboon also became an aspect of the sun god Re, as well as of the moon god Thoth-Khonsu. The ancient Egyptians who observed the baboon barking at the rising sun gave rise to a favorite theme in sculpture, paintings and reliefs of a baboon worshiping the sun with raised hands. Monkey demons as the companion of the sun god appear in the royal", "textAfterTable": "Who are we? Tour Egypt aims to offer the ultimate Egyptian adventure and intimate knowledge about the country. We offer this unique experience in two ways, the first one is by organizing a tour and coming to Egypt for a visit, whether alone or in a group, and living it firsthand. The second way to experience Egypt is from the comfort of your own home: online. Popular Pages Egypt Pyramids Monuments & Ancient Sites Egyptian Kings Ancient Temples Pharaohs General Travel What to Take Destinations Egypt Travel Articles Budget Travel Fees to Monuments Shopping Guide Beach Vacations Interactive Pages Picture of the Day Reader Pictures Recipe of the Week Weekly Crossword Puzzle Send Postcard Hieroglyph Converter Egyptian Money Specific Activities Scuba Diving Therapy Golf Courses Fishing Lake Nasser Birding in Egypt", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}