{"relation": [["journal", "Distributed and parallel databases", "Information systems journal", "Information Systems", "Knowledge and information systems", "Data & knowledge engineering", "VLDB journal", "Information Sciences", "IEEE Trans. knowledge & data engineering", "ACM Trans. on database systems", "SIGMOD Record"], ["publisher", "Springer", "Wiley", "Elsevier", "Springer", "Elsevier", "Springer", "Elsevier", "IEEE", "ACM", "ACM"], ["price per article", "61.50", "58.16", "53.44", "25.39", "24.55", "22.19", "21.67", "10.80", "6.64", "0.00"]], "pageTitle": "Should you boycott academic publishers?", "title": "", "url": "http://lemire.me/blog/archives/2012/01/23/boycott-elsevier/comment-page-1/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00294-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 144516443, "recordOffset": 144504792, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1=© 2004-2015, Daniel Lemire (lemire at gmail dot com). This work is licensed under a Creative Commons License.}", "TableContextTimeStampAfterTable": "{17372=Comment by Itman — 24/1/2012 @ 16:03, 21700=Comment by Denzil Correa — 25/1/2012 @ 12:25, 20922=Comment by Daniel Lemire — 25/1/2012 @ 10:52, 12292=Comment by Peter Murray-Rust — 23/1/2012 @ 20:07, 22427=Comment by Itman — 25/1/2012 @ 18:47, 11448=Comment by p4bl0 — 23/1/2012 @ 16:59, 25488=Comment by Mark C. Wilson — 8/3/2012 @ 11:43, 19913=Comment by Rich Apodaca — 25/1/2012 @ 10:29, 7526=Comment by Mr. Gunn — 23/1/2012 @ 16:33, 9723=Comment by Mr. Gunn — 23/1/2012 @ 16:50, 24655=Comment by Daniel Lemire — 25/1/2012 @ 19:09, 13301=Comment by Daniel Lemire — 23/1/2012 @ 21:46, 9058=Comment by p4bl0 — 23/1/2012 @ 16:48, 24141=This is, of course, backward. The authors should give the rights that ACM needs, and they should keep the rest. If I pay $1800 to publish a paper, I don’t think it is unreasonable to think I should get to keep ownership over the paper. With the current system, ACM asks me to pay page charges *and* to give away all of my rights. Again, ACM is not very progressive here., 22867=My follow-up blog post (http://lemire.me/blog/archives/2012/01/25/open-access-journals-in-computer-science/) explains why I think it is not happening., 21420=http://m.theatlantic.com/business/archive/2012/01/locked-in-the-ivory-tower-why-jstor-imprisons-academic-research/251649/, 8112=Comment by Jordan Peacock — 23/1/2012 @ 16:47, 17895=Comment by Itman — 24/1/2012 @ 16:04, 10796=Comment by Daniel Lemire — 23/1/2012 @ 16:59, 15248=Comment by Rich Apodaca — 24/1/2012 @ 13:05, 13942=Comment by Peter Murray-Rust — 24/1/2012 @ 5:00, 16649=Comment by Daniel Lemire — 24/1/2012 @ 14:11, 18350=Comment by Daniel Lemire — 24/1/2012 @ 16:45}", "textBeforeTable": "Focusing solely on database-related journals, I decided to look at how much journals charge per article. The boycott is currently lead by a famous mathematician, Timothy Gowers. Gowers accuses Elsevier of charging exorbitant prices for its journals. Elsevier has committed too many sins to give an exhaustive list: they have created fake academic journals so that pharmaceutical corporations could claim that certain facts appeared in a journal, they have sponsored evil regulations, and they have restrictive views on what constitutes fair use. Unbelievably, they were also involved in arms trade. They probably have the devil on their board of directors. There is a growing list of famous scientists who have pledged to boycott Elsevier as a publisher. If I were in charge of Elsevier, I would be very nervous: academic publishers need famous authors more than the famous authors need the publishers. After all, famous scientists could simply post their work online, and people would still read it. Should you boycott academic publishers?", "textAfterTable": "Observations: The price distribution appears almost random. I can see no relation between prestige or paper length and prices. Elsevier is hardly alone at charging high prices for papers. Wiley and Springer are just as expensive. Of course, it is possible that Elsevier ends up charging more through deals and bundling. ACM is very inexpensive on a per-article basis. However, ACM often asks the authors to pay page charges whereas Elsevier rarely does in my experience. Though SIGMOD Record is limited to short contributions, its price is unbeatable. And it has no page charge. Moreover, it is generally a well regarded publication venue among database researchers. My take: The evidence is strong that high-quality inexpensive journals are possible. Current journals are up to an order of magnitude too expensive. However, Elsevier is selling what we want to buy: prestigious journals that people outside the best schools cannot afford. Just like middle-income Americans get into debt to keep up with the top 1%, colleges increase their library budgets to keep up with Stanford and Harvard. The solution to overpriced journals is to reduce library purchasing power. Most colleges do not have the infinite budgets Harvard and Stanford have, and they should not act like they do. In fact, if we could reduce the purchasing power of most libraries to zero, then researchers and students would be forced to pay $20 or more per article. You can be quite certain that they would mostly read the cheaper", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}