{"relation": [["", "1", "2", "3", "4"], ["Name", "The Other Side", "I Am", "Failure", "Sleep On It"], ["Artist", "The Circle", "The Circle", "The Circle", "The Circle"], ["Time", "3:15", "3:05", "3:18", "3:32"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Who I Am - EP by The Circle", "title": "", "url": "https://itunes.apple.com/us/album/i-am/id672278100?i=672278106", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00105-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 882890767, "recordOffset": 882862576, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{105415=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 09:04:11 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist The Circle Who I Am - EP iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Who I Am - EP by The Circle, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening", "textAfterTable": "4 Songs Customer Reviews Soundtrack to awesomeness           by craignelson7007 AKA \"the epitome of rock and roll.\" Buy it. Don't look back. Rock is back in Dallas           by Max L. Billington ...and it's about time! Frequenting the local music scene in Dallas several years ago, you could hear plenty of great bands; then something happened and they all went away. The Circle is one of a few bands that are reviving the rock music scene in Dallas with a vengeance. The latest EP entitled \"Who I Am\" is a perfect example of what happens when talent and determination converge to produce what I am sure will be the first of several releases from The Circle. Skip your latte, save a few bucks, and give this a download and a listen. You won't regret it. -Max L. Billington, Author, The Libertines Motorcycle Club Series Awesome!  ", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}