{"relation": [["", "1", "2", "3", "4", "5", "6"], ["Name", "Fire Escape (Tom Elmhirst Mix)", "Fire Escape (David Sitek Remix)", "Fire Escape (Toro Y Moi Remix)", "Fire Escape (The Time and Space Machine Remix)", "Fire Escape (Tom Furse Remix)", "VideoFire Escape"], ["Artist", "Fanfarlo", "Fanfarlo", "Fanfarlo", "Fanfarlo", "Fanfarlo", "Fanfarlo"], ["Time", "2:59", "2:53", "4:34", "6:09", "8:30", "5:13"], ["Price", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$2.29"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Fire Escape - EP by Fanfarlo", "title": "", "url": "https://itunes.apple.com/ca/album/fire-escape-time-space-machine/id376407833?i=376407838", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00251-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 868079747, "recordOffset": 868051758, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{108832=Copyright © 2014 Apple Inc. All rights reserved., 11895=Formed: 2006 in London, England}", "lastModified": "Fri, 31 Jul 2015 09:09:51 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Fanfarlo Fire Escape - EP iTunes for Mac + PC Already have iTunes? Click I have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Fire Escape - EP by Fanfarlo, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store…", "textAfterTable": "6 Items Biography Formed: 2006 in London, England Genre: Alternative Years Active: '00s, '10s Emerging from London, England in the mid- to late 2000s as an up-and-coming indie pop band, Fanfarlo got their name out with a series of singles, a strong Internet presence, and an engaging live show that took them as far as the South by Southwest festival in Austin, Texas. Citing influences such as Broken Social Scene, Pavement, Neutral Milk Hotel, Olivia Tremor Control, Belle & Sebastian, and Sufjan Stevens, the band comprises Simon Balthazer (vocals), Mark West (guitar), Leon Beckenham (trumpet),... Full bio Top Albums and Songs by Fanfarlo 1. Reservoir View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}