{"relation": [["Author", "Artemis251", "Artemis251", "Artemis251", "Artemis251", "Artemis251"], ["Title", "Realistic Bookas", "PSI Starstorm Omega", "PSI Rockin'", "PSI Fire Omega", "Prediction? Ridiculous!"], ["Description", "Fan Art of the Week winner! 6 Nov 2005 Crested Bookas live in the open Dusty Dunes Desert in EarthBound. The polygynic males often attack those who threaten their mates, though they often end up tame from some kid with a baseball bat. The darker brown bookas are female, and the males grow their crests as they reach their adult stage.", "Poo, from EarthBound, also has a unique power - the power to shake stars from the sky and rain them down upon foes. PSI STARSTORM OMEGA!", "Ness's mind can unleash some pretty potent psychic waves, as seen here. The picture originally started by me messing with the different filters and effect in Paint Shop Pro, but ended up reminding me of Ness's PSI prowess. :D", "Paula, from EarthBound. She's the only one equipped with PSI Fire, so I made a picture of her a while back using PSI Fire Omega. It's 75% of its true size, so it may look a bit pixelated.", "Heroes Past, HP - #02 Who is this 'Ness'?"], ["Date", "5/3/05", "12/31/04", "12/31/04", "12/31/04", "11/6/05"], ["Rank", "10.00", "8.00", "8.00", "8.00", "8.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=16482&stuff=TitleDESC&stuffPageNumber=9", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00126-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 226772443, "recordOffset": 226764241, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> Y W V U T S R P O N M L K J I H G F E D C B A < Other Submissions by Artemis251 Mimmie never seems to get a break. You think she'd give up on dolls by now. This image has been resized for your convenience. Click on it to view the full size version. Mimmie's Gift Mimmie's Gift - by Artemis251  Mother1", "textAfterTable": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}