{"relation": [["Title", "April Fool's Day", "Zagreb, Exit South", "Croatia: Travels in an Undiscovered Country", "Marco Polo's Isle: Sketches from the Dalmatian Island of Korcula", "Gold, Frankincense and Myrrh"], ["Author", "Josip Novakovich", "Edo Popovic", "Dr Tony Fabijancic", "Michael Donley", "Slobodan Novak"]], "pageTitle": "Croatia Tours & Travel | Intrepid Travel NZ", "title": "", "url": "http://www.intrepidtravel.com/nz/croatia", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00290-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 513278299, "recordOffset": 513214022, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{87488=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 86169=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 187950=Review submitted 26 Jul 2015}", "TableContextTimeStampAfterTable": "{84457=Built in 1895, this national treasure located in Zagreb is an elegant example of neo-Baroque style architecture. Visitors lucky enough to catch an opera, ballet or classical music concert here will be able to revel in all the fine details, from the luxe furnishings to the excellent acoustics., 91783=Classical music, theatre, dance and opera combine to create an enriching program of events performed in open air venues around Dubrovnik. Held every year since 1949, Croatia's temperate summer climate ensures the perfect conditions for outdoor performances., 70755=Croatia's peak season runs between July and August, with temperatures in the high 20s or 30s on the coast. But in this region you can expect plenty of sunshine from May to October, which are the best times to visit if you want to take advantage of Croatia's beautiful beaches and islands. The inland areas are also hot in the summer but can get cold in the winter with low temperatures and snowfall. Winter on the coast is milder and frequent rain can be expected., 80235=Croatia, Slovenia and Serbia formed a union in 1918 to create the Kingdom of Yugoslavia, but the occupation of Axis forces during World War II lead to the creation of the Independent State of Croatia, which only lasted a couple of years during the war. By the end of the war in 1945, Croatia had become a Socialist Republic (within the Socialist Federal Republic of Yugoslavia, together with Bosnia, Serbia, Slovenia, Macedonia and Montenegro), with the constitution of 1963 attempting to alleviate tensions surrounding the balance of power between Serbians and Croats. By 1980, after the death of President Tito (founder of modern Yugoslavia), economic and political difficulties (in addition to regional tensions in other parts of Yugoslavia) resulted in a near collapse of government. What followed was years of conflict, polarity and political turmoil. The referendum of 1991 resulted in an overwhelming vote for independence, with Croatia and Slovenia declaring independence from Yugoslavia in June of the same year. Much armed conflict followed and lasted until 1995, leading to great loss of civilian life and displacement, creating large populations of refugees. The last two decades have been a time of peace and reconciliation for the people of Croatia. Tourism has opened up and the government has focused on ensuring further economic growth for the country. Currently, Croatia is poised to join the European Union by 2013.}", "textBeforeTable": "Recommended reading Further reading 8. When on community visits or homestays, refrain from giving gifts or money to locals. 7. Please ask and receive permission before taking photos of people, including children. 6. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 5. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 4. When bargaining at markets, stay calm, be reasonable and keep a smile on your face. It's meant to be fun! 3. Always dispose of litter thoughtfully, including cigarette butts. 2. For environmental reasons, try to avoid buying bottled water. Instead, fill a reusable water bottle or canteen with filtered water. 1. Be considerate of Croatia’s customs, traditions, religion and culture. Top responsible travel tips for Croatia Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this in mind while travelling. Croatia Travel Tips Responsible Travel also provides useful health information: Go to: http://www.who.int/en/ The World Health", "textAfterTable": "Handy links www.lonelyplanet.com/croatia www.worldtravelguide.net/croatia www.croatia.hr × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}