{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "I'm Not in Love", "The Things We Do for Love", "Dreadlock Holiday", "Dreadlock Holiday", "I Don't Like Cricket -I Love It (Dreadlock Holiday)", "I’m Not In Love", "The Wall Street Shuffle", "I'm Not In Love", "Rubber Bullets", "Art for Art's Sake"], ["Album", "20th Century Masters - The Millennium Collection: The Best of 10cc", "20th Century Masters - The Millennium Collection: The Best of 10cc", "20th Century Masters - The Millennium Collection: The Best of 10cc", "Live Rock Masters: Ars Gratia Artis", "I Don't Like Cricket, I Love It (Dreadlock Holiday) - Single", "Live Rock Masters: Ars Gratia Artis", "Sheet Music", "The Original Soundtrack", "10cc", "20th Century Masters - The Millennium Collection: The Best of 10cc"], ["Time", "6:08", "3:33", "5:01", "6:06", "5:06", "6:41", "3:56", "6:06", "5:18", "5:54"], ["Price", "$1.29", "$1.29", "$1.29", "$0.99", "$0.99", "$0.99", "$0.99", "$1.29", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - 20th Century Masters - The Millennium Collection: The Best of 10cc by 10cc", "title": "", "url": "https://itunes.apple.com/ca/album/the-things-we-do-for-love/id405363?i=405349", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00270-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 888408015, "recordOffset": 888383459, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{126481=Copyright © 2014 Apple Inc. All rights reserved., 20632=10cc is one of those bands that creates problems for the compilers of compilations because they changed record companies, spreading their catalog around. The good news, from the viewpoint of American fans, is that most of the group's U.S. hits reside in the archives of one of the major labels, Universal Music, which is responsible for the 20th Century Masters - The Millennium Collection series of midline-priced best-of collections. 10cc began life on the UK Records label, for which the band scored a series of British hits in 1972-1974, none of which are featured here. The only one of those to reach the U.S. charts was \"Rubber Bullets.\" Then the group switched to Mercury for the 1975 British hit \"Life Is a Minestrone\" (included here). They made their American breakthrough with the pop ballad \"I'm Not in Love\" later that year. (Both it and its non-LP B-side \"Channel Swimmer\" are included.) \"I'm Not in Love\" was not really typical of this eclectic, arty band, but subsequent singles scored only modestly in the U.S. (while continuing to hit the Top Ten at home) until another pop ballad, \"The Things We Do for Love,\" restored them to favor in America in early 1977. They remained basically a two-hit wonder stateside, but this collection, which features eight of their nine U.S. chart entries, gives a good sense of their ambitious, conceptual approach to music, an approach that occasionally embraced light, romantic pop tunes like their two big American hits. Of course, a comprehensive collection would have to include the early hits, but for U.S. fans who heard the band on the radio between 1975 and 1979, this inexpensive set should do fine., 24054=Formed: 1972 in Manchester, England}", "lastModified": "Sat, 01 Aug 2015 04:05:36 GMT", "textBeforeTable": "View In iTunes Live Rock Masters: Ars Gratia Artis 5. View In iTunes Sheet Music 4. View In iTunes Bloody Tourists 3. View In iTunes Deceptive Bends (Remastered)", "textAfterTable": "Listeners Also Bought 20th Century Masters - The Millennium Collection: The Best of Stephen Bishop Stephen Bishop View In iTunes The Best of Manfred Mann's Earth Band Manfred Mann's Earth Band View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}