{"relation": [["", "1", "2", "3", "4", "5", "6"], ["Name", "ExplicitOn It", "Bitter Sweet", "Alone", "Ghetto Serenade", "Ridin'", "Opportunity"], ["Artist", "Tekitha", "Tekitha", "Tekitha", "Tekitha & The RZA", "Tekitha", "Tekitha"], ["Time", "3:59", "3:12", "3:47", "3:01", "4:05", "3:20"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - The Prelude by Tekitha", "title": "", "url": "https://itunes.apple.com/us/album/ghetto-serenade/id345563247?i=345563754", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00135-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 882304331, "recordOffset": 882277193, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{106323=Copyright © 2014 Apple Inc. All rights reserved., 12482=Just dowloaded tekitha's prelude and I am glad I did! She has such a soulful voice and those beats are definitely the truth! Although it has been some time since we heard from tekitha, it was worth the wait. Can't wait for the album to drop! If it has just as much creativeity as the prelude and some features from her friends from the wu.... Can you say going platinum? 2010 the year of wisdom body!}", "lastModified": "Fri, 31 Jul 2015 08:03:31 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Tekitha The Prelude iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from The Prelude by Tekitha, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "6 Songs Customer Reviews Great listen!           by Dieselman84 Just dowloaded tekitha's prelude and I am glad I did! She has such a soulful voice and those beats are definitely the truth! Although it has been some time since we heard from tekitha, it was worth the wait. Can't wait for the album to drop! If it has just as much creativeity as the prelude and some features from her friends from the wu.... Can you say going platinum? 2010 the year of wisdom body! Love It!           by Monie1985 Ridin has always been my favorite song. Now I can listen to it as much as I would like!! I am definitly enjoying the new songs as well! Bout time to hear this incredible talent           by GHPIII Oakland's Deathmask", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}