{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Following Caligula", "Calibrate the Virus", "Watcher", "Courtesy Bow", "The Fall of Rome", "Malice In Wonderland", "55/23", "The Hampton Roads Fourth Annual Parade of the Blind", "To the Nines", "L'aeroport"], ["Album", "The Fall of Rome", "The Fall of Rome", "The Fall of Rome", "The Fall of Rome", "The Fall of Rome", "The Fall of Rome", "The Fall of Rome", "The Fall of Rome", "The Fall of Rome", "The Fall of Rome"], ["Time", "4:20", "3:39", "4:01", "4:23", "2:22", "4:17", "3:18", "3:32", "4:28", "5:57"], ["Price", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - The Fall of Rome by Winter Solstice", "title": "", "url": "https://itunes.apple.com/bg/album/the-fall-of-rome/id57943247", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00120-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 867113199, "recordOffset": 867090292, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{116886=Copyright © 2014 Apple Inc. All rights reserved., 19515=Winter Solstice isn't the type of band one ordinarily expects to record for Metal Blade. They're a Christian band, and the people their members thank in the credits include President George W. Bush, the Republican Party, and Liberty University (as in the Rev. Jerry Falwell). In other words, they represent many of the things that KRS-1, Rage Against the Machine, Ani DiFranco, Nellie McKay, and a long list of other left-leaning musicians have railed against — not so much the Christianity part (there are some very left-wing Christians out there), but definitely the far-right militant fundamentalist part. But if the First Amendment of the United States Constitution gives liberal musicians the freedom to state their views, there's no reason why right-wing artists shouldn't do the same — and besides, The Fall of Rome is far from an album that beats listeners over the head with an overtly Christian Right message. You have to read the credits to find the metalcore band's pro-Bush, pro-Christian Right views; the lyrics are a lot more subliminal, and on the surface, this 2004 recording doesn't seem much different from all the secular metalcore discs that were recorded in 2004. Musically, The Fall of Rome is as metalcore as it gets — a harsh, claustrophobic, ferocious, extremely dense CD that is without a trace of musical subtlety. The lyrics promote Christianity in a subtle fashion (much like many of the bands that record for Solid State/Tooth & Nail), but musically, Winter Solstice is as skull-crushing as Hatebreed, Throwdown, Deadsoil, Brick Bath, or Rotten Sound. Winter Solstice's material isn't terribly distinctive — they're far from the only Christian band in metalcore — but even so, this 40-minute CD is a decent, noteworthy demonstration of the fact that a Christian perspective and metalcore ferocity are not mutually exclusive.}", "lastModified": "Fri, 31 Jul 2015 07:23:21 GMT", "textBeforeTable": "View In iTunes Winter Solstice 3. View In iTunes The Save The Peaks Compilation 2. View In iTunes The Fall of Rome 1.", "textAfterTable": "Listeners Also Bought The Powerless Rise As I Lay Dying View In iTunes Atlas Parkway Drive View In iTunes As Daylight Dies (Special Edition) Killswitch Engage View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}