{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16"], ["Name", "ExplicitThese Things Happen", "ExplicitFar Alone (feat. E-40 & Jay Ant)", "ExplicitI Mean It (feat. Remo)", "Interlude", "ExplicitOpportunity Cost", "ExplicitAlmost Famous", "ExplicitLotta That (feat. A$AP Ferg & Danny Seth)", "Factory Girl (Skit)", "ExplicitDowntown Love (feat. John Michael Rouchell)", "ExplicitComplete", "ExplicitLet's Get Lost (feat. Devon Baldwin)", "ExplicitShoot Me Down (feat. Anthony Stewart)", "ExplicitBeen On", "ExplicitRemember You (feat. Blackbear)", "ExplicitTumblr Girls (feat. Christoph Andersson)", "ExplicitJust Believe"], ["Artist", "G-Eazy", "G-Eazy", "G-Eazy", "G-Eazy", "G-Eazy", "G-Eazy", "G-Eazy", "G-Eazy", "G-Eazy", "G-Eazy", "G-Eazy", "G-Eazy", "G-Eazy", "G-Eazy", "G-Eazy", "G-Eazy"], ["Time", "2:24", "4:27", "3:56", "0:44", "3:54", "4:28", "4:48", "0:13", "5:26", "3:08", "4:00", "3:16", "3:28", "3:35", "4:15", "4:02"], ["Price", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "Album Only", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - These Things Happen by G-Eazy", "title": "", "url": "https://itunes.apple.com/ca/album/tumblr-girls-feat.-christoph/id868738564?i=868738657&ign-mpt=uo%3D4", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00172-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 872348271, "recordOffset": 872319019, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{137175=Copyright © 2014 Apple Inc. All rights reserved., 35027=Born: May 24, 1989 in Oakland, CA, 31733=Gerald Earl Gillum (aka G-Eazy) delivers his first official studio album with 2014's These Things Happen. Produced by G-Eazy along with contributions from Christoph Andersson, Jay Ant, Blackbear, Jordan Evans, and Matthew Burnett, These Things Happen showcases the California-based rapper's electronic and indie rock-tinged hip-hop sound. The album follows up a string of G-Eazy's previous mixtapes, including his hugely popular and widely lauded 2011 release, The Endless Summer. Featured on the album are such guest artists as E-40, Remo, John Michael Rouchell, Devon Baldwin, and others. Included on These Things Happen are the singles \"Been On,\" \"Lotta That,\" \"Almost Famous,\" and more.}", "lastModified": "Fri, 31 Jul 2015 08:33:29 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist G-Eazy These Things Happen iTunes for Mac + PC Already have iTunes? Click I have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from These Things Happen by G-Eazy, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store…", "textAfterTable": "16 Songs Album Review Gerald Earl Gillum (aka G-Eazy) delivers his first official studio album with 2014's These Things Happen. Produced by G-Eazy along with contributions from Christoph Andersson, Jay Ant, Blackbear, Jordan Evans, and Matthew Burnett, These Things Happen showcases the California-based rapper's electronic and indie rock-tinged hip-hop sound. The album follows up a string of G-Eazy's previous mixtapes, including his hugely popular and widely lauded 2011 release, The Endless Summer. Featured on the album are such guest artists as E-40, Remo, John Michael Rouchell, Devon Baldwin, and others. Included on These Things Happen are the singles \"Been On,\" \"Lotta That,\" \"Almost Famous,\" and more. Customer Reviews G-Eazus Christ           by Apocalypse of the Hippo's Finally blowing up. Well deserved. This album is going to be fire. Never a Disappointment           by Lululululululimee I always am excited for new songs/albums by G Eazy because I know they keep getting better and better which", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}