{"relation": [["Author", "kenisu3000", "kenisu3000", "kenisu3000", "kenisu3000", "kenisu3000"], ["Title", "Chapter 1 - Page 28: Holy Flying Furniture, Batman!", "Chapter 1 - Page 29: NOW, it's Personal!", "Chapter 1 - Page 30: The Biggest Insult Ever", "Chapter 1 - Page 31: A Gasp of Relief?", "Chapter 1 - Page 32: Inopportunity Doesn't Knock"], ["Description", "kenisu - #28 I might have gone a little too dark on the shading here. It makes it difficult to follow the artwork, and it might take away from my little joke in the middle of the page - it's the whole reason why I included the Garfield poster, was for that sight gag. In fact, it wasn't until I had come up with the idea that I realized how similiar the image was to the same scene in Strawberry Tofu's Crying For MOTHER. Sorry about that, Strawberry - I didn't mean it! Anyway, the Garfield poster was one that I had when I was 13 (one of those \"Enter At Your Own Risk\" ones with bullet holes in the wall behind Garfield), so I thought I'd bring it back for a little joke.", "kenisu - #29 More goodness from the Encyclopedia MOTHER. I'm so out of the loop as far as sports goes that I had to look up Shigeo Nagashima on that Internet Bible known as Wikipedia, just to make sure I got the information correct. One strange thing I found out was that his team is called the Tokyo Giants in the Encyclopedia, but Wikipedia calls them the Yomiuri Giants. It's all Greek to me. From the very first time I started orchestrating this battle, I knew I wanted Ninten to realize that... \"umm.... I'm talking to a lamp....\", and then get smacked in the face. Of course, what I was originally going to have him say after that was \"Never let your guard down around maniacal electric stands\" (because the enemy's Japanese name, Denki Stand, translates out to that), but then I found out that denki can mean \"lamp\" as well as \"electricity\". And that last panel... don't ask me where that came from :) I started getting funny ideas, one after the other, and it evolved into one of those dramatic \"tumbleweed\" scenes. WHERE the wind came from is anyone's guess, but I knew I had to have an article of clothing tumbling across the room for humorous effect. And it landed on tighty-whiteys! Underwear is always funny.", "kenisu - #30 Anyone should be able to figure out what happens in the next page :) And kudos to whoever can guess where I got the phrase \"awww, peas!\"", "kenisu - #31 ...My scanner is beginning to severely weird me out, what with how fitful it gets. Anyway. what shall I say here? Let's start with the first panel - I like to call it the \"SMAAAASH!!\" panel (get it? Splash panel? Smash panel? Heh heh, heh... aww, never mind). I tried my best to recreate the \"SMAAAASH!!\" logo directly from the game, but holy crap, I never imagined it would be so difficuly, what with the way the angle curves back what with each progressive letter. I'm not so sure how well it works anyway, because I wanted at least two letter \"A\"s completely out in the open, and not blocked by Ninten's fat head. Instead I wound up with a couple of them half-hidden. Drat. Oh well, everything else turned out pretty much *exactly* how I had imagined it, and THAT, friends, is a good day! Except Ninten seems to resemble Charlie Brown here, what with the angle I chose for his nose - but MOTHER has a lot of Peanuts references anyway. I also decided to establish Ninten's asthma here. Also, it looks like Minnie and Mimmie are still playing butt tag :) How long WAS that staircase anyway?!", "kenisu - #32 I like the unintended effect I created in the background of the \"Bad Enough Dude\" panel. Ninten gloats, but very visibly behind him, the black cloud out the window has not yet departed. I didn't even catch the irony until I finished the panel. Also, I was playing around with the idea of Ninten saying \"Shoot... and I thought 'The Brave Little Toaster' was farfetched!\" when looking at the destroyed lamp in disgust, but I already wanted the \"Bad Enough Dude\" line, and I figured working in two whole retro culture references one after the other would just be in bad taste, especially considering that I've already gone over the top with those culture references! There's a couple more I want to throw in before the end of the chapter though, so just... humor me. And on a much relieved note, this is the last page to feature Ninten's room for a long time! All I can say is... THANK GOODNESS! I was getting so freaking sick of that stupid Garfield poster, and I'm sure everyone else was too."], ["Date", "2/10/07", "2/10/07", "2/10/07", "2/18/07", "4/19/07"], ["Rank", "0.00", "0.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=17338&stuff=AuthASC&stuffPageNumber=9", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00325-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 230887826, "recordOffset": 230879624, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> K < Other Submissions by kenisu3000 Shading can be a beast on pages like this one. kenisu - #33 This image has been resized for your convenience. Click on it to view the full size version. Chapter 1 - Page 33: A Force Beyond Control Chapter 1 - Page 33: A Force Beyond Control - by kenisu3000  Mother1 Go Back! --> } } } ThisImgResized.style.display = \"\"; //alert (ThisImgResized.style.display); ThisImgResized = document.getElementById('ImgResized') what.width=(winW-275); what.style.cursor = \"pointer\"; saveWidth = what.width; { else what.width=saveWidth; if (what.width==(winW-275)) if (what.width>(winW-275) || saveWidth>(winW-275)) { what = document.getElementById(what); function scaleImg(what){ } winW = document.body.offsetWidth; if (navigator.appName.indexOf(\"Microsoft\")!=-1) { winW = window.innerWidth; if (navigator.appName==\"Netscape\") //what = document.getElementById(what); //function scaleImg(what){ var saveWidth = 0;", "textAfterTable": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}