{"relation": [["Author", "SaturnStorm", "SaturnStorm", "SaturnStorm", "SaturnStorm", "SaturnStorm"], ["Title", "Gabilaan", "Hinawa's passing", "Taking the joke too far", "Giegue is, undeniably, evil", "Loid is Dr.Andonuts? MAYBE"], ["Description", "The strange enemy from Mother 1. I doubt this is the first time I've submitted one here. :P", "Hinawa's death wasn't by chance", "(That point where a joke stops being a joke)", "\"I didn't mean to go about killing humans! Honest!!\"", "Don't run away yet, It's just a possibility!"], ["Date", "8/11/11", "10/21/11", "12/1/11", "12/1/11", "12/1/11"], ["Rank", "0.00", "0.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=33709&stuff=DateASC&stuffPageNumber=7", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00264-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 222642965, "recordOffset": 222634763, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> 1 < Other Submissions by SaturnStorm Porky will never die: http://mother3.fobby.net/interview/m3int_09.html Resources: ~~SS Admittedly this could all be well-off-center. It's a strange idea with loose ties to the games, and I acknowledge this. But the ASC as physical imagery for Porky's own ego shield? You've gotta admit, that would be some pretty apt imagery. Of course in a physical world few people would have the influence over the material to change it, no doubt himself included. After all he isn't a psychic, and probably didn't even have access to his own Magicant (especially not in the ways Ness and Maria had -- after all why would he go about building New Pork City the way he did if he did have such access). This could well have been something Fassad oversaw. Perhaps this is why Dr.Andonuts never really got round to finishing it. So I doubt when all's said and done Porky could go ahead and create himself a door handle. I mean what could be tougher to crack than a fool's thick head? Mentally speaking. And what could be a better way to enforce", "textAfterTable": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day. Activities:", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}