{"relation": [["Author", "Author", "P-Rob Private Message Jun 19 2013 at 7:40am #", "jonawebb Private Message Jun 19 2013 at 7:47am #", "buffalo buffalo Private Message Jun 19 2013 at 9:52am #", "Steven Private Message Jun 19 2013 at 10:23am #", "StuInMcCandless Private Message Jun 19 2013 at 11:28am #", "billkamm Private Message Jun 19 2013 at 2:26pm #", "billkamm Private Message Jun 19 2013 at 2:29pm #", "billkamm Private Message Jun 19 2013 at 2:31pm #", "billkamm Private Message Jun 19 2013 at 2:35pm #", "Mikhail Private Message Jun 19 2013 at 3:04pm #", "StuInMcCandless Private Message Jun 20 2013 at 5:10am #"], ["Posts", "Posts", "I am a warmshowers and couchsurfing host just up the hill from the Priory on the Northside. I have a GAP rider coming in tonight and two groups at the end of the month (some from England and some from Ohio) – so the finished connection really is making a difference. I will be returning from my GAP ride on the 15th so I can provide an update since I haven’t ridden it for 6 years (all the way to DC). @Annie – I will PM you with my details.", "@bb Beechwood and Forward BTW this reminds me of something — both of the longest, most ambling streets in the East End have names starting with ‘B’, and one of them is named after the traffic engineer (Bigelow) who was naming streets. And there are more ‘B’ streets, like Beacon, Bartlett, Barnesdale, Beeler, Bellerock, and Braddock, than you’d expect from random distribution. Was the guy a megalomaniac?", "Like Bigelow, Braddock, probably Beeler and Bartlett, and maybe Barnesdale, are all named for people… (Bigelow, btw, was renamed for him afterwards. It was Grant Boulevard when it was built.)", "One major avenue running from downtown through Oakland was supposed to get a name with Four B’s, but there was some miscommunication, possibly a phone call with a bad connection, resulting in its current name. it’s hard to believe, I know.", "*groan*", "I think riding from the start of the Montour Trail to Downtown Pittsburgh is an easy and safe enough ride. I’ve rode from Neville Island to various points in the South Hills. Grand Ave to Neville Rd to 51 (Island Ave) is a route I have taken a lot. I have never crossed over the Mckees Rocks Bridge, but if you simply crossover from there you should be able to get down to the Ohio River Trail that starts near the end of the Mckees Rocks Bridge and take that all the way into downtown Pittsburgh. Has anyone ever gone from Mckees Rocks to this trail? Is the Mckees Rocks Bridge safe? I see no reason why this person couldn’t make this happen.", "Boom Goes The Dynamite: http://goo.gl/maps/y66ZF Do It!", "Except you can crossover the Fort Duquesne Bridge. Not sure why it has you going all the way to the 6th St Bridge lol.", "Okay Street View of the McKees Rocks Bridge looks quite scary lol", "billkamm wrote:Has anyone ever gone from Mckees Rocks to this trail? On a club rides we go on regular basis through W. Carson both directions and McKees Rocks bridge both directions. But we stay together claiming the whole lane two abreast.", "I’ve ridden the McKees Rocks Bridge both directions. It’s do-able, but the sidewalk is less hassle. Once across the bridge (as I said in an earlier post), from the 51 to 65 side, cross 65, go 50 yards, dismount, and carry your bike up a set of steps, to the end of Davis Street. Immediately you’re out of heavy traffic and into a quiet neighborhood. Proceed straight on Davis across California, right on Fleming, left on Antrim, right on McClure to Woods Run to Eckert, go around the prison and you’re on the trail. Peel off the trail up to street level a bit before the Ft Duquesne Bridge and use the bridge walk/bike-way into Point State Park to get downtown. Sixth and Seventh St Bridges can be gotten to via ramp, though Sixth is tricky with a set of switchbacks, and Seventh you have to go past the bridge and double back. Ninth is a quick staircase."]], "pageTitle": "Bike Pittsburgh | Topic: Best, Safe Most Direct Route from Airport to Start of GAP", "title": "", "url": "http://bikepgh.org/mb/topic/best-safe-most-direct-route-from-airport-to-start-of-gap/page/2/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00306-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 23160431, "recordOffset": 23142278, "tableOrientation": "HORIZONTAL", "textBeforeTable": "  2 1 ← ← Forums Home Viewing 11 posts - 41 through 51 (of 51 total) This topic contains 50 replies, has 19 voices, and was last updated by  StuInMcCandless 2 yrs, 1 mo. Best, Safe Most Direct Route from Airport to Start of GAP Monthly emails, no SPAM. Newsletter Signup Instagram Pinterest Flickr Facebook Twitter Google Plus Login Search", "textAfterTable": "Viewing 11 posts - 41 through 51 (of 51 total) ← Forums Home ← 1 2   You must be logged in to reply to this topic. Become a Member Volunteer Newsletter Subscribe to our mailing list Monthly emails, no SPAM. Search the Forums Search Sponsors Web Design by ClickNathan Handmade", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}