{"relation": [["Artist", "Dizzy Gillespie and Chano Pozo", "Cal Tjader", "Poncho Sanchez", "Stan Getz and Joao Gilberto"], ["Title", "Manteca", "Soul Sauce (Guachi Guara)", "\"Watermelon Man", "The Girl from Ipanema"], ["", "The story behind this song is part of Latin Jazz lore: Cuban conguero (conga player) Chano Pozo sang the parts to bandleader and trumpet great Dizzy Gillespie, who wrote them down, and added another section. Together the two created one of the most identifiable, and one of the earliest, Latin Jazz songs.", "As perhaps the best-known non-Latino Latin bandleader, Tjader bridged the worlds of Jazz and Latin music. As he lived in San Francisco, he also influenced the Latin Rock movement of the late 1960s and early 70s. This cover of a Gillespie-Pozo tune was the hit title track from one of his most memorable albums.", "Conguero Poncho Sanchez continues the tradition of the West Coast Latin Jazz scene with this live performance from 1999, covering Herbie Hancock's classic \"Watermelon Man\", a hit in 1963 for conguero Mongo Santamaría.", "Brazilian music has also influenced Jazz, especially 60s Bossa Nova. This composition, one of the most ubiquitous songs in (and out) of Jazz, was a collaboration by American saxophonist Stan Getz and two Brazilian masters: composer Antonio Carlos Jobim and guitarist João Gilberto."]], "pageTitle": "Latin Music USA | PBS", "title": "", "url": "http://www.pbs.org/wgbh/latinmusicusa/en/exp/latinjazz/listen.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00275-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 638404030, "recordOffset": 638395828, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{10240=© 2009 WGBH Educational Foundation. All rights reserved.}", "textBeforeTable": "Read | Listen | Watch Genres & Songs: Latin Jazz Genres & Songs | Instruments | Ensembles | Rhythmic Cells | Places Explore the Music You are viewing the non-Flash Latin Music USA website. For a richer experience, make sure that you have version 9.0.115.0 or higher of the Flash plug-in installed. You can download the Flash plug-in for free here. For a richer experience, please make sure that JavaScript is enabled in your web browser. Find Resources Go Behind the Scenes Explore the Music Watch the Show Véalo en Español Skip Latin Music USA Navigation", "textAfterTable": "Explore Further: Watch: Only in New York: Machito & His Afro-Cubans Watch: Dizzy Gillespie & Chano Pozo: Champions of Latin Jazz Watch: A Superstar is Born: Carlos Santana at Woodstock Watch: Bobby Sanabria & Machito's Kenya Find Resources: Books Find Resources: Movies Find Resources: Web Links Watch the Show | Explore the Music | Go Behind the Scenes | Find Resources Site Map | PBS Privacy Policy | Terms of Use | Feedback | Credits © 2009 WGBH Educational Foundation. All rights reserved. Latin Music USA is a WGBH/BBC co-production Major funding provided by Additional funding provided by", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}