{"relation": [["", "1", "2", "3", "4"], ["Name", "Sleepwalker", "Stage Lights", "Temper Temper", "Crashing Down"], ["Artist", "Flee the Seen", "Flee the Seen", "Flee the Seen", "Flee the Seen"], ["Time", "3:21", "2:58", "3:34", "3:20"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - 2008 Demo - EP by Flee the Seen", "title": "", "url": "https://itunes.apple.com/cz/album/2008-demo-ep/id273029239", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00260-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 874314287, "recordOffset": 874292623, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1992=We are unable to find iTunes on your computer. To preview and buy music from 2008 Demo - EP by Flee the Seen, download iTunes now.}", "TableContextTimeStampAfterTable": "{8224=Formed: 2003 in Kansas City, MO, 100293=Copyright © 2014 Apple Inc. Všechna práva vyhrazena.}", "lastModified": "Sat, 01 Aug 2015 03:34:34 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Flee the Seen 2008 Demo - EP iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from 2008 Demo - EP by Flee the Seen, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop.", "textAfterTable": "4 Songs Biography Formed: 2003 in Kansas City, MO Genre: Rock Years Active: '00s Although Flee the Seen was the first band signed to the alternative CCM label Facedown Records whose music is not explicitly Christian in nature, the four-piece post-hardcore act from Kansas City, MO, still maintains a lyrically positive stance in the midst of their screamo assault. The roots of Flee the Seen lie in the small western Missouri college town of St. Joseph, where bassist and lead singer Kim Anderson and guitarist R.L. Brooks met while attending Missouri Western State University. After... Full bio Top Albums and Songs by Flee the Seen 1. 2008 Demo - EP View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}