{"relation": [["ARTIST", "Elizabeth Johnson", "Elizabeth Johnson", "Elizabeth Johnson", "George Torey", "George Torey", "Frenchy's String Band", "Frenchy's String Band", "Edward Thompson", "Edward Thompson", "Edward Thompson", "Leola Manning", "Leola Manning", "Pigmeat Terry", "Pigmeat Terry", "Dan Stewart", "Lonnie Clark", "Lonnie Clark", "Bobby Grant", "Bobby Grant", "Margaret Thornton", "Margaret Thornton", "Blind Leroy Garnett", "Blind Leroy Garnett", "Johnnie Head", "Johnnie Head", "Hattie Burleson", "Hattie Burleson", "Hattie Burleson", "Marshall Owens", "Marshall Owens", "Hattie Hudson", "Hattie Hudson", "Leola Manning", "Leola Manning"], ["SONG", "Empty Bed Blues Part 1", "Sobbin' Woman Blues", "Be My Kid Blues", "Lonesome Man Blues", "Married Woman Blues", "Sunshine Special", "Texas and Pacific Blues", "Seven Sister Blues", "Showers Of Rain Blues", "West Virginia Blues", "Satan Is Busy In Knoxville", "The Blues Is All Wrong", "Moaning the Blues", "Black Sheep Blues", "New Orleans Blues", "Down In Tennessee", "Broke Down engine", "Lonesome Atlanta Blues", "Nappy Head Blues", "Texas Bound Blues", "Jockey Blues", "Louisiana Glide", "Chain 'em Down", "Fare Thee Well - Part I", "Fare Thee Well - Part II", "Jim Nappy", "Sadie's Servant Room Blues", "Bye Bye Baby", "Texas Blues", "Try Me One More Time", "Doggone My Good Luck Soul", "Black Hand Blues", "The Arcade Building Moan", "Laying in the Graveyard"], ["ALBUM", "Clarence Williams & The Blues Singers Vol. 1 1923-1928", "American Primitive Vol. II", "I Can't Be Satisfied Vol. 1", "Memphis Blues 1927-1938", "Blues Images Vol. 3", "The Frog Blues & Jazz Annual No. 1", "How Low Can You Go: Anthology Of The String Bass", "A Richer Tradition", "The Rise & Fall of Paramount Records Vol. 2 1928-1932", "The Rise & Fall of Paramount Records Vol. 2 1928-1932", "Barrelhouse Mamas", "Favorite Country Blues Guitar: Piano Duets 1929-1937", "American Primitive Vol. II", "American Primitive Vol. II", "Down In Black Bottom", "Down In Black Bottom", "Down In Black Bottom", "Mississippi Moaners", "Before The Blues Vol. 3", "Barrelhouse Mamas", "Barrelhouse Mamas", "Mama Don't Allow No Easy Riders Here", "Mama Don't Allow No Easy Riders Here", "The Rise & Fall of Paramount Records Vol. 2 1928-1932", "The Rise & Fall of Paramount Records Vol. 2 1928-1932", "I Can't Be Satisfied Vol. 2", "Territory Singers Vol. 2", "I Can't Be Satisfied Vol. 2", "Blues Images vol. 4", "Blues Images vol. 4", "Dallas Alley Drag", "I Can't Be Satisfied Vol. 1", "Rare Country Blues Vol. 1", "Rare Country Blues Vol. 1"]], "pageTitle": "1930’s Blues | Big Road Blues", "title": "", "url": "http://sundayblues.org/archives/category/1930s-blues", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00156-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 227822723, "recordOffset": 227792750, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{6194=Noah Lewis was born in Henning, Tennessee, and raised in the vicinity of Ripley. He played in local string bands and brass bands, and began playing in the Ripley and Memphis areas with Gus Cannon. When jug bands became popular in the mid-1920's, he joined Cannon's Jug Stompers. He cut seven sides under his own name at sessions in 1929 and 1930. Recording as Noah Lewis' Jug Band, he was backed on two numbers by Sleepy John Estes and Yank Rachell with just Estes backing him on two other numbers cut a couple of days apart., 38261=Sun 31 May 2015, 11044=Today's show is the fourth installment spotlighting great recording sessions. The first spotlighted two sessions conducted by the Victor label in New Orleans in 1936 and 1937, the second was conducted by Brunswick in Memphis in 1929 and 1930, the third was recordings Columbia made in December 1927 and December 1928 and the fourth spotlighted Victor in Memphis in 1928 ., 8043=Jug bands are synonymous with Memphis and Victor recorded two of the greatest groups: Memphis Jug Band and Cannon's Jug Stompers. The Memphis Jug Band first recorded for Victor in February 1927 and over the next four years recorded 57 sides. Hattie Hart had appeared on several of the Memphis Jug Band's discs in 1929 and 1930, singing the unforgettable \"Memphis Yo Yo Blues\", \"Cocaine Habit Blues\", \"Oh Ambulance Man\", \"Papa's Got Your Bath Water On\" and \"Spider's Nest Blues.\" Her first recordings were made in Memphis for the Victor label in 1929. Three songs were recorded but only two were issued for her debut single. In 1934 she was recorded again in New York City in September of that year. She moved Chicago where in in 1938 she cut sides as Hattie Bolten., 3254=Kokomo Arnold made his debut in 1930 although would not record again until he was in Chicago in 1934 where he recorded prolifically through 1938., 5586=When the Victor recording company sent a field recording unit to Memphis in September 1929, Estes recorded several sides backed by the Three J's, with Jones playing piano instead of the jug. . He was invited to record again for Victor in May 1930. This session yielded the up-tempo \"Milk Cow Blues,\" a tune Robert Johnson would later record as \"Milkcow Calf Blues.\" In all the group cut fifteen sides, three were unissued, over the course of eight session in 1929 and 1930., 3434=Bukka White made his debut for Victor in 1930 and it may be Minnie's voice backing him on \"I am In The Heavenly Way\" b/ \"Promise True And Grand.\", 26608=In 1963 three high school students – George Mitchell, Roger Brown, and Jack Boozer tracked Howell down. Mitchell coaxed him into recording again. After a month of practicing on the guitar, Howell made the field recordings that were issued by Testament Records as The Legendary Peg Leg Howell. Howell was also interviewed by Mitchell the results of which were published in Blues Unlimited (the full article is provided below) which is where the below quotes come from., 29151=Like Memphis, Atlanta was a staging post for musicians on their way to all points. It’s not surprising then that the first country blues musician, Ed Andrews, was recorded there in 1924. The company that recorded him, Okeh, was one of many to send their engineers to Southern cities to record local talent. Companies like Victor, Columbia, Vocalion and Brunswick made at least yearly visits until the depression. One of the earliest recorded Atlanta bluesmen, Peg Leg Howell, bridged the gap between the era of pre-blues and the period when the blues eventually became the popular music of the day. Born Joshua Barnes Howell in Eatonton, Georgia on March 5, 1888, he was a self-taught guitarist who acquired his nickname after a 1916 run-in with an irate brother-in-law which ended in a shotgun wound to the leg and, ultimately, amputation. Unable to continue working as a farmhand, he migrated to Atlanta, where he began pursuing music full-time; in addition to playing street corners for passing change, Howell supplemented his income by bootlegging liquor, an offense which led to a one-year prison sentence in 1925. He recorded four songs at the end of 1926, eight sides in 1927 with guitarist Henry Williams and Eddie Anthony which were billed as Peg Leg Howel and his gang. Ten final sides were recorded in 1929. Tony Russell described the music as \"rugged and without artifice. Howell's early recordings like 'Coal Man Blues' do no lack appeal but are rather overshadowed by his trio sides with Anthony and Williams, which give us a stringband music both less suave and more diverse than that of their near-contemporaries the Mississippi Sheiks.\" Howell backed singer Sloppy Henry on a few sides and his pals Eddie Anthony and Henry Williams also recorded on their own., 19613=Sun 24 May 2015, 830=Sun 19 Apr 2015, 24354=Howell was back before the microphone five months after his debut this time with Henry Williams and Eddie Anthony. His “New Jelly Roll Blues” from this session was his bestselling number and advertised in the Chicago Defender newspaper (Columbia ran eight ads for Howell between 1927 and 1929). The record was listed as Peg Leg Howell and His Gang. The label promoted Peg Leg Howell by putting his photo on the cover of its 1927 catalog. In November 1927, Peg Leg Howell and His Gang recorded three more 78's. \"Eddie Anthony recorded with me. He played violin. And Henry Williams; he played guitar. We called the group Peg Leg Howell and His Gang. Made quite a few records with them two.\"At the November 1st session “Too Tight Blues,” “Moanin’ and Groanin’ Blues,” “Hobo Blues,” and “Peg Leg Stomp” were recorded. Howell made three final Columbia 78's in April 1929. Ollie Griffin was probably the violinist. Three days later, Howell fronted four songs that came out credited to Peg Leg Howell and Jim Hill., 25253=He began performing music in parks and on the streets of Atlanta, sometimes working alongside mandolinist Eugene Pedin, guitarist Henry Williams, and violinist Eddie Anthony, his closest friend. “The men from Columbia Records found me there in Atlanta. A Mr. Brown – he worked for Columbia – he asked me to make a record for them. I was out serenading, playing on Decatur Street, and he heard me playing and taken me up to his office and I played there. …My first record. was \"New Prison Blues\" (coupled with \"Fo Day Blues\" on Columbia 14177D). In 1925 I had been in prison for s selling whiskey and I heard the song there. I don't know who made it up. As for selling the whiskey, I would sell it to anybody who came to the house. I bought the moonshine from people who ran it and I sold it. I don't know how they caught me; they just ran down on me one day.\", 5078=Frank Stokes was first recorded by Victor in 1927 with his \"Downtown Blues\" and \"Bedtime Blues\" selling well and when Victor returned to Memphis in August 1928 they recorded ten further selections. In 1929, Stokes and Sane recorded again for Paramount, resuming their 'Beale Street Sheiks' billing for a few cuts. In September, Stokes was back on Victor to make what were to be his last recordings, this time without Sane, but with Will Batts on fiddle., 4590=Among the major artists recorded by Victor during these sessions were Bukka White, Memphis Minnie & Kansas Joe and Kokomo Arnold. In 1930 Bukka White met furniture salesman Ralph Limbo, who was also a talent scout for Victor. White traveled to Memphis where he made his first recordings, singing a mixture of blues and gospel material under the name of Washington White. Victor only saw fit to release four of the 14 songs Bukka White recorded that day., 25960=\"My friends call me Peg, …Peg Leg Howell. I was born on the fifth of March. in 1888. I was born in Eatonton, Putnom. County, Georgia. …My father was a farmer. when I was a child I went to school in Putnam County; I went as far as the ninth grade before I stopped. After that I worked on my father's farm with him…plowed. Worked on the farm until 1916, when I was about 28. …I had lost my leg in 1916 and had to quit farm work. I got shot by my brother-in-law; he got mad at me and shot me. …I came to Atlanta when I was about 35 years old. …I learned how to play the guitar about 1909. I learnt myself – didn't take long to learn. I just stayed up one night and learnt myself.\", 22260=Henry Williams perished in jail in 1930, and Peg Leg Howell was soon back serving time for bootlegging. After Eddie Anthony died in 1934, Howell told Mitchell, “I just didn’t feel like playing anymore. I went back to selling liquor. Then I ran a woodyard for about two years around 1940. I lost my other leg in 1952, through sugar diabetes.” Howell's final recordings issued on the Testament label captured him in sad shape so those songs will not be featured. Better to remember Howell and his pals in their prime., 9164=According to Recording The Blues: \"The record industry as a whole had not been in too healthy a state during the early twenties. After the boom year of 1921, in which for the first time 100 million discs were sold, sales declined slowly but steadily. Eventually even Victor began to feel the squeeze – their sales fell from $51 million in 1921 to $44 million in 1923, and then dropped to $20 million in 1925. Something had to be done, and one obvious move was for Victor to begin large scale production of race records, and compete for a market that had been growing an an enormous rate during the period when overall sales had been falling.\" After a not too promising start, \"…Victor hired Ralph Peer who had been largely responsible for building up Okeh's fine race and hillbilly catalogs. Peer realized that Victor was several years too late to be able to get a substantial share of the classic blues market and decided to concentrate his efforts on the country blues field.\" Victor begin going in the field in a big way in 1927 stopping in Atlanta, Memphis and New Orleans., 23317=During the spring of 1929 Eddie Anthony recorded eight sides for OKeh Records as part of a duo called Macon Ed and Tampa Joe (the identity of Tampa Joe has never been established). On April 19, 1928, Henry Williams and Eddie Anthony recorded a Columbia 78 on their own, the raucous “Georgia Crawl” backed with “Lonesome Blues.” Howell and Anthony were probably the accompanists on a four song session by Sloppy Henry recorded on August 13, 1928. Henry cut sixteen sides between 1924 and 1929 for Okeh. It's been speculated that Anthony plays on on the record \"I've Got A Home In Beulah Land\" by the Brothers Wright And Williams recorded in 1930., 6789=In 1928 Ralph Peer, who had previously recorded the Memphis Jug Band, returned to Memphis looking for other jug bands to record. Charlie Williamson, the manager of the Palace Theater, recommended Gus Cannon. Gus called up Noah Lewis and Ashley Thompson and on Jan 30 1928 they recorded 4 sides in an old auditorium as Cannon's Jug Stompers. They recorded over two-dozen sides with the group through 1930 for Victor., 21587=-Welding, Pete; Mitchell, George. “I’m Peg Leg Howell.” Blues Unlimited no. 10 (Mar 1964) [PDF], 10052=To feed the demand for blues and gospel records the record companies conducted exhaustive searches for new talent, which included making trips down south with field recording units. As Robert Dixon and John Godrich wrote in the seminal Recording The Blues book: \"Victor was the only company systematically to exploit the gold mine of black talent in and around Memphis.\"  Today we spotlight Victor in Memphis again, this time between Sept. and Nov. 1929 and May through June of 1930. In 1929 Victor recorded Hattie Hart, the Memphis Jug Band, Cannon's Jug Stompers, Noah Lewis, Sleepy John Estes, Blind Clyde Church, Frank Stokes, Memphis Sanctified Singers and Bessie Tucker. In 1930 they recorded several of the same artists in addition to the Shreveport Home Wreckers, Kokomo Arnold, Kaiser Clifton, Bukka White and Memphis Minnie and Kansas Joe., 3791=Memphis Minnie's marriage and recording debut came in 1929, to and with Kansas Joe McCoy, when a Columbia Records talent scout heard them playing in a Beale Street barbershop. In 1930 Minnie recorded a pair of songs back by her friends, the Memphis Jug Band. She may also be on sides Jed Davenport and His Beale Street Jug Band cut that year.}", "TableContextTimeStampAfterTable": "{28579=Lead Belly's recording career began with recordings made in 1933 by John and Alan Lomax at Angola prison and after his release from prison he recorded prolifically right up until his death in 1949. Lead Belly never had much success among black audiences, his commercial blues recordings did not sell, but he found success among the folk music audience. He became a fixture in New York City's folk music scene befriending and performing with Sonny Terry, Brownie McGhee, Woody Guthrie, and a young Pete Seeger. Lead Belly was also the first blues musician to see success in Europe when he traveled there in 1949. He died later that year in New York City., 38329=Over the next few years, a series of memorial LP's honoring Lead Belly were released by both the new Folkways label and Stinson Records, and many of Lead Belly’s numerous friends took part in memorial concerts. The band the Weavers, featuring Pete Seeger, celebrated Lead Belly’s music on stage, recording “Rock Island Line,” “Silvy,” and “Goodnight Irene” (among others). \"Goodnight Irene” became a huge hit in 1950., 19789=Sun 5 Apr 2015, 29262=As Robert Santelli writes in the notes: \"Lead Belly was a man of contradiction and complexity. It was hard to truly know him, said the people who tried, and it was next to impossible to place him in a particular music style or form and have him remain there for long. He was a folk musician who also played the blues. He knew his share of work songs and field hollers, having sung them while picking cotton and doing farm chores. He learned prison songs while incarcerated, and he sang them like a man who had seen life’s underbelly. Spirituals and gospel tunes came naturally to him. He gave new life to old ballads whose origins were buried in the past. He could sing children’s songs when kids were present. And at house parties and local fish fries, if someone wanted to hear a few standards or a pop hit of the day, he could sing and play them too. Lead Belly moved through American music genres and song circles naturally and effortlessly, never seeing the boundaries and categories that were created for commodity’s sake by men with bow ties and clean suits. He was the very definition of a 'songster,' an old-time, old-school human jukebox of a performer and recording artist who never quite realized just what an American music treasure he had become in his life.\" Huddie Ledbetter was born January 15, 1888, in the Caddo Lake District near Mooringsport in the northwest corner of Louisiana, near the Texas and Arkansas lines. Two of Huddie’s uncles, Bob and Terrell, were musicians and introduced him to new songs. His uncle Terrell gifted him a small accordion when was seven years old. He would acquire a guitar around 1903. Huddie had become adept at all sorts of musical styles, and found that he could pick up a few extra cents playing at local country dances, or “sukey jumps.\" By the time Huddie left Mooringsport in 1906, he had fathered two children out of wedlock and had a bad reputation locally. After some rambling to New Orleans and other places, he landed in Shreveport. Along the way he had learned all types of songs, including popular songs of the early 1900s. Around 1910, a now-married Huddie moved to Dallas, Texas. According to Charles K. Wolfe and Kip Lornell in The Life And Legend Of Leadbelly: \"Sometime during his wanderings – probably late in 1910, when he was living near Dallas – Huddie acquired his first twelve-string guitar.\" Leadbelly told may tales of how he picked up the instrument. One of the less fanciful stories is recounted in the book: 'I saw one of those old 12-string Stellas sitting in the window of a Dallas store. The year before I heard a man play it in one of those traveling medicine shows where they sold a cure-all for fifty cent a a bottle.' Captivated by the loud, ringing sound of the instrument, Leadbelly  had spent the rest of the night hanging around the medicine show tent listening to the man play. Shortly, thereafter, when he finally saw one of the twelve-strings for sale; 'the price of the guitar was $12', he recalled, 'I had to have it.'\" In 1912, he met and started playing as a duo with Blind Lemon Jefferson who in the 1920's would become one of the best-selling blues artists in the country., 33869=He would be free for just five years; in 1930 another fight landed him in Louisiana’s notorious Angola Prison for six to ten. Lead Belly became known around the prison for his singing and guitar playing. John and Alan Lomax arrived at Angola on July 16. Lead Belly was suggested to them as a good singer to record, and they realized they had really made a “find.” The Lomaxes made 12 recordings and returned the following July to record 15 more songs. He had a special one prepared, “Governor O.K. Allen.” He asked if John Lomax would deliver a recording of the song to Allen’s office. Lead Belly had previously written asking for a pardon as well. It is not known whether Allen listened to the song, but Lead Belly was officially granted a pardon on July 25, 1934., 35440=In breadth and number, the greatest collection of songs Lead Belly ever recorded were the hundreds he did for the Library of Congress. The two Lomaxes were acting as his managers and took two thirds of the cut. Eventually there was a falling out and Leadbelly moved to Shreveport then Dallas. He eventually decided to give New York City another try. During the same time period, Lead Belly was being introduced to singers in New York who came from a strong protest song background. In April 1939, Lead Belly recorded a session for the small Musicraft Records and the following year for the Library of Congress. Throughout 1941 and early 1942, Lead Belly had a weekly show on WNYC’s The American School of the Air called Folk Songs of America. He also made recordings for RCA in 1940, some backed by the Golden Gate Quartet., 9194=An East Knoxville cafeteria worker and aspiring evangelist of 25, Leloa Manning was struggling with a troubled marriage when she recorded at the St. James Hotel in Knoxville, TN; once  on Aug. 28, 1929, and once on April 4, 1930. Six numbers were cut between the two sessions, all were issued. The first couple of sides she cut were religious songs, \"He Cares For Me b/w He Fans Me\", the latter sounding more like a blues number than a religious one. The previous year Frankie 'Half-Pint' Jaxon cut the risque \"Fan It.\" When she returned to the studio she had a batch of utterly unique songs such as \"Satan Is Busy In Knoxville\" which seems about a real-life serial killer, \"The Blues Is All Wrong\" an up-tempo boogie-woogie piece, \"Laying in the Graveyard\" and the topical \"The Arcade Building Moan\" about a tragic fire that occurred in Knoxville just fifteen days prior:, 15048=Edward Thompson was a native of Alabama, and he may have known and played with Ed Bell and Pillie Bolling at some point in his life. He traveled to New York City in 1929 and cut six songs in one session. All of these were issued over three records. The recordings were mastered by Gennett, and either sold or leased to Paramount. This recording had Thompson billed as \"Tenderfoot Edwards\". Nothing else about him is known., 32858=In June 1915, Huddie was involved in an altercation and was sentenced to 30 days on a chain gang. Huddie escaped and fled to New Orleans, and then back to Mooringsport. He could not stay there, and so, traveling with his wife, he began going by the name Walter Boyd and went to live with relatives in DeKalb, Texas. In December 1917, Lead Belly found himself in a confrontation, a gun was fired, and Will Stafford lay dead. Huddie claimed it was self-defense but was sentenced to between 7 and 30 years in a Texas prison. He began at the Shaw State Prison and later was transferred to the notorious Sugarland Prison. He was released in 1925., 10219=It was on one Thursday morning, March the 20th day I think it was about two a.m., I believe I can firmly say The women and the children was screaming and crying Not only that, they was slowly dying Oh, listen, listen, how the bell did ring When the Arcade Building burnt down., 13508=Johnnie Head cut one 78 for Paramount in 1928, the two-part \"Fare Thee Well.\", 8698=\"Rainin' here, rainin' here, rainin' here, rainin' here, stormin' on the sea\" sings Elizabeth Johnson in mesmerizing fashion on her masterpiece \"Be My Kid Blues.\" Johnson is a mystery woman who cut four sides in 1928. “Be My Kid Blues b/w Sobbin’ Woman Blues” finds her backed by a unique band (listed as Her Turpentine Tree-O) that consisted of woodblocks, clarinet and guitar. She's backed by the great King Oliver on cornet on the two-part “Empty Bed Blues.”, 37605=In 1948 Lead Belly was recorded extensively  by Fredric Ramsey. These sides were eventually released by Smithsonian Folkways as a 4-CD set titled Lead Belly's Last Sessions. In the late 1940's, Lead Belly began to feel something was physically wrong. In 1948, at a show in Paris during his trip to Europe, he found he could not continue playing his guitar. He was taken to a Parisian doctor who diagnosed Leadbelly with ALS, better known as Lou Gehrig’s Disease. He died in New York at Bellevue Hospital a little over a year later on December 5, 1949., 16063=Dan Stewart cut only one side of a 78 for Brunswick in 1929. The flipside was Jim Clarke's “Fat Fanny Stomp.”, 34649=He returned to Shreveport and began to lobby John Lomax for a job. Alan was suffering from an illness, and John needed a driver. In the fall, performing this role, Lead Belly took off with them on a recording trip. He would sometimes warm up the prisoners by singing his songs and showing them the kinds of things Lomax wanted. Lomax was anxious to present his new discovery to a meeting of the Modern Language Association in Philadelphia, which launched the flurry of sensationalism that accompanied Lead Belly’s arrival on the scene. Finally it was the big move to New York. In 1935, the Lomaxes had lobbied for Lead Belly to sign a recording contract with the American Recording Corporation (ARC). Of the 43 songs Lead Belly recorded for ARC, only six saw the light of day., 11688=Burleson was also responsible for discovering Lillian Glinn singing in a Dallas church and encouraged her to pursue a musical career. Pianist Willie Tyson cut two solo piano numbers for Columbia in 1927 which went unissued. The next day he backed singer Hattie Hudson on “Black Hand Blues” and the classic “Doggone My Good Luck Soul\" her only 78 cut for Columbia records., 12614=Most of today's male blues guitarists are as mysterious as their female counterparts. George Torey, Johnnie Head, Bobby Grant, Frenchy's String Band, Dan Stewart, Lonnie Clark and Pigneat Terry left behind a sole 78. George Torey had only two titles released, both recorded at a session in Birmingham, Alabama on April 2, 1937.  The two tracks, \"Married Woman Blues\" and \"Lonesome Man Blues\" were included on an early Yazoo anthology, Ten Years in Memphis. There is no other evidence that Torey was from Memphis, and none of the Memphis musicians questioned about him in the late '60s and '70s could remember him. One other song from the session, \"Delta Blues\" was unissued and may hint at his origins., 16187=Lonnie Clark only left behind two recordings that were made in 1929 for Paramount, \"Down In Tennessee b/w Broke Down Engine.\" Bob Hall wrote of him \"his heavy expressive voice on \"Broke Down Engine\" is accompanied by a rocking two-handed chorded piano played in a rather primitive style and nicely offset by a neat mandolin obbligato.\", 36287=The commercial labels that recorded Lead Belly didn’t know how to market his music. For better or worse, Lead Belly’s strongest audience turned out to be the music fans involved in the folk revival, mainly in New York. City. Around this time Leadbelly began recording for Moe Asch and his Asch label. Lead Belly recorded mainly for Asch for the rest of his life. In 1945, Asch Records went out of business and was followed by Asch’s second label, Disc Recordings of America. Lead Belly continued to record for Disc. During that time and for years to come Lead Belly’s apartment at 414 East 10th Street was a hub of musical activity. His niece Tiny Robinson remembers “it being like a friendly hotel that would receive musical guests like Sonny and Brownie, Bill Broonzy, Burl Ives, Eartha Kitt, Pete Seeger, Woody Guthrie, and Harry Belafonte.\", 13951=Frenchy's String Band cut \"Sunshine Special b/w Texas And Pacific Blues\" in 1928. Polite \"Frenchy\" Christian was one of the New Orleans jazzmen who ventured westward in the 1920's, settling in Dallas. With a line-up here consisting of cornet, banjo, guitar and bowed bass, \"Texas and Pacific Blues\" gives an inkling of music played around New Orleans when a string band line up was used., 16567=Leroy Garnett's recorded legacy only consisted of two sides, \"Louisiana Glide b/w Chain 'Em Down\", waxed in 1929 for Paramount. He is believed to have been from Fort Worth, TX. He also recorded behind singer James 'Boodle It' Wiggins. As Bob Hall and Richard Noblett wrote: \"Garnett's two solos reveal his as a pianist of considerable technique. 'Chain 'Em Down', a superb barrelhouse piece has echoes of the Alabama pianist Cow Cow Davenport …'Louisiana Glide' has strong ragtime influence and the air of a set composition rather than an improvised performance\", 13636=Bobby Grant was  recorded early in 1927 and whose driving slide guitar showpieces \"Nappy Head Blues\" and \"Lonesome Atlanta Blues\" denote a possible Mississippi background. I first heard him on the Yazoo compilation Mississippi Moaners., 10622=Hattie Burleson recorded four tracks in Dallas, TX, for Brunswick Records in October 1928. Two years later she recorded three sides in Grafton, WI, for Paramount Records. Little else is known about her life, save that she lived in the famed Deep Ellum area of downtown Dallas, where she operated a dancehall for a time. Her song \"Jim Nappy\" became a favorite among the Santa Fe group of pianists. According to Paul Oliver it was about her real life lover who managed the traveling shows she put together.  Her \"Sadie’s Servant Room Blues\" is a rare protest song dealing with domestic service., 15772=Marshall Owens cut  two 78 s 'for Paramount in 1932, \"Texas Blues b/w Try Me One More Time\" and one 78 which has never been found, \"Texas Blues – Part II b/w Seventh St. Alley Strut.\", 14409=Pigmeat Terry only cut one 78, for Decca \"Black Sheep Blues b/w Moaning The Blues\" in 1935 and possessed a high, whispery, moaning voice, a bit reminiscent of the popular Joe Pullum who made his debut the prior year.}", "textBeforeTable": "Posted by Jeff under 1920's Blues, 1930's Blues, Playlists No Comments Big Road Blues Show 4/19/15: The Blues Is All Wrong – Little Recorded But Great Pt. II Sun 19 Apr 2015   --> trackback:ping=\"http://sundayblues.org/archives/9324/trackback\" /> dc:title=\"Big Road Blues Show 5/24/15: Fence Breakin' Blues – Great Recording Sessions Pt. V (Pt. 1)\" dc:identifier=\"http://sundayblues.org/archives/9324\" xmlns:dc=\"http://purl.org/dc/elements/1.1/\" Tags: Bessie Tucker, Blind Clyde Church, Bukka White, Cannon's Jug Stompers, Frank Stokes, Hattie Hart, Kokomo Arnold, Memphis Jug Band, Memphis Minnie, Noah Lewis, Shreveport Homewreckers, Sleepy John Estes Kokomo Arnold made his debut in 1930 although would not record again until he was in Chicago in 1934 where he recorded prolifically through 1938. Bukka White made his debut for Victor in 1930 and it may be Minnie's voice backing him on \"I am In The Heavenly Way\" b/ \"Promise True And Grand.\" Memphis Minnie's marriage and recording debut came in 1929,", "textAfterTable": "Show Notes: All the artists featured today recorded from one to eight titles and all left behind barley a trace of biographical information. We hear from several outstanding blues ladies including Elizabeth Johnson, Leola Manning, Margaret Thornton, Hattie Burleson, and Hattie Hudson. In addition we spotlight  several other excellent bands, singers, guitarists and pianists including George Torey, Frenchy's String Band, Edward Thompson, Pigmeat Terry, Lonnie Clark, Dan Stewart, Johnnie Head, Bobby Grant, Blind Leroy Garnett and Marshall Owens. \"Rainin' here, rainin' here, rainin' here, rainin' here, stormin' on the sea\" sings Elizabeth Johnson in mesmerizing fashion on her masterpiece \"Be My Kid Blues.\" Johnson is a mystery woman who cut four sides in 1928. “Be My Kid Blues b/w Sobbin’ Woman Blues” finds her backed by a unique band (listed as Her Turpentine Tree-O) that consisted of woodblocks, clarinet and guitar. She's backed by the great King Oliver on cornet on the two-part “Empty Bed Blues.” An East Knoxville cafeteria worker and aspiring evangelist of 25, Leloa Manning was struggling with a troubled marriage when she recorded at the St. James Hotel in Knoxville, TN; once  on Aug. 28, 1929, and once on April 4, 1930. Six numbers were cut between the two sessions, all were issued. The first couple of sides she cut were religious songs, \"He Cares For Me", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}