{"relation": [["", "101", "102", "103", "104", "105", "106", "107", "108", "109", "110", "111", "112", "113", "114", "115", "116", "117", "118", "119", "120", "121", "122", "123", "124", "125"], ["Name", "Just As I Am", "He'll Make a Way (Take 2/Alt.)", "All Right Now (Take 4/Alt.)", "Pilgram of Sorrow", "The Last Mile of the Way", "He's My Guide (Take 13)", "He's My Guide (Take 4/Alt.)", "Pilgrim of Sorrow", "Were You There", "That's Heaven to Me (Take 1/Alt.)", "Mean Old World (Take 3/Alt.)", "The Last Mile of the Way", "It Won't Be Very Long", "Jesus Gave Me Water", "Oh, Lord I'm Trying", "When the Gates Swing Open", "Oh, Lord I'm Trying", "Jesus Gave Me Water", "Were You There", "Touch the Hem of His Garment", "I'm Gonna Build Right On That Shore (with the Soul Stirrers)", "The Last Mile of the Way (with the Soul Stirrers)", "Jesus Gave Me Water (with the Soul Stirrers)", "Touch the Hem of His Garment (with the Soul Stirrers)", "Last Mile of the Way"], ["Album", "The Last Mile of the Way", "The Last Mile of the Way", "The Last Mile of the Way", "The Last Mile of the Way", "The Last Mile of the Way", "The Last Mile of the Way", "The Last Mile of the Way", "The Last Mile of the Way", "The Last Mile of the Way", "The Last Mile of the Way", "The Last Mile of the Way", "The Last Mile of the Way", "We Loved You Madly, Chapter 20: Come On-A-My House", "We Loved You Madly, Chapter One", "Gospel Baby", "Absolutely the Best of Gospel, Vol. 4", "The Gospel Baby", "We Loved You Madly", "Sam Cooke And The Soul Stirrers", "Sam Cooke And The Soul Stirrers", "Specialty Profiles: Sam Cooke with The Soul Stirrers", "Specialty Profiles: Sam Cooke with The Soul Stirrers", "Specialty Profiles: Sam Cooke with The Soul Stirrers", "Specialty Profiles: Sam Cooke with The Soul Stirrers", "Traveling On…"], ["Time", "1:51", "2:58", "2:48", "2:34", "2:56", "2:32", "2:42", "2:16", "2:31", "3:10", "2:33", "2:58", "2:35", "2:29", "4:01", "6:05", "4:01", "2:29", "2:30", "2:02", "2:31", "3:00", "2:30", "2:04", "3:03"], ["Price", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.99", "£0.79"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - The Soul Stirrers", "title": "", "url": "https://itunes.apple.com/gb/artist/the-soul-stirrers/id2133642?trackPage=5", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00124-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 877938851, "recordOffset": 877914785, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{36644=The first Soul Stirrers 78 to feature Cooke, \"Jesus Gave Me Water,\" was a major hit, and with his good looks the young singer made an instant impact with female audiences, in the process becoming the gospel circuit's first sex symbol. The group's popularity continued to soar, but as the Soul Stirrers entered their third decade, the daily grind began to wear on its members, and soon Bruster retired; he was replaced by baritone Bob King, who also doubled as a guitarist, becoming their first-ever steady instrumentalist. In 1954, the Soul Stirrers briefly added Julius Cheeks to their roster; after lending his raspy vocals to a recording of \"All Right Now,\" however, contractual obligations forced him to exit almost as quickly as he arrived. In 1956, Cooke finally crossed over to the pop market, and was replaced by ex-Highway QC Johnnie Taylor; while Taylor himself would also enjoy pop success in the years to follow, he failed to command the same devotion as his predecessor. Lineup changes continued regularly in the years to follow, but the Soul Stirrers forged on, with new, younger members keeping the group afloat into the 1990s., 40000=Indisputably among the premier gospel groups of the modern era, the Soul Stirrers pioneered the contemporary quartet sound. Pushing the music away from the traditional repertoire of jubilees and spirituals towards the visceral, deeply emotional hard gospel style so popular among postwar listeners, the group's innovative arrangements — they were the first quartet to add a second lead — and sexually charged presence irrevocably blurred the lines between religious and secular music while becoming a seminal influence on the development of rock & roll and soul, most notably by virtue of their connection to the legendary Sam Cooke. The Soul Stirrers' origins date back to 1926, where in the town of Trinity, TX, baritone Senior Roy Crain formed a quartet with a number of other teens with whom he attended church. After one of the group's early appearances, a member of the audience approached Crain to tell him how their performance had \"stirred his soul,\" and from this chance compliment the Soul Stirrers were officially born., 38926=The original group fell apart soon after, but Crain continued to pursue a singing career; upon relocating to Houston during the early '30s, he joined a group called the New Pleasant Green Singers on the condition that they change their name to the Soul Stirrers. So rechristened, this incarnation of the quartet made a 1936 field recording for Alan Lomax; as other members dropped out, Crain brought in replacements, finally arriving at the classic early lineup which also included bass Jesse Farley, baritone T.L. Bruster, second lead James Medlock, and, most notably, lead R.H. Harris, whose high, crystalline voice remains the inspiration for virtually all great male quartet leads to follow since. After moving to Chicago, the Soul Stirrers began shifting away from the signature tight harmonies and compact songs of traditional gospel towards a harder style distinguished by shifting leads and performances elongated to increase their emotional potency; they also began performing new material from the pens of Thomas A. Dorsey, Kenneth Morris, and others., 37835=Throughout the 1940s, the Soul Stirrers' reputation grew; not only were they constantly on tour, but they booked most of the major gospel programs in the Chicago area — in their spare hours, they even operated their own cleaning business. When the grind got to be too much for Medlock, he retired from the road, and was replaced by onetime Golden Echo Paul Foster. In early 1950, the Soul Stirrers signed to the Specialty label, debuting with the single \"By and By\"; it was quickly followed by \"I'm Still Living on Mother's Prayer\" and \"In That Awful Hour,\" both originals composed by Detroit's Reuben L.C. Henry. In total, the Soul Stirrers recorded over two dozen tracks for Specialty in 1950 before Harris quit the group that same year; many predicted a dire future, especially when it was announced that his replacement was a relatively unknown 20-year-old named Sam Cooke. When Cooke made his recording debut with the Soul Stirrers in 1951, however, any reservations were quickly dispelled — blessed with a gossamer voice even sweeter and more graceful than Harris', he would take the group to even greater heights than before.}", "TableContextTimeStampAfterTable": "{55596=1927 in Trinity, TX, 64792=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 04:28:41 GMT", "textBeforeTable": "Top Songs 2 1 View In iTunes Traveling On… 20. View In iTunes The Soul Stirrers In Concert/Live From Chicago, IL 19. View In iTunes Sunday Morning Prayer Meeting 18.", "textAfterTable": "Previous 1 2 3 4 5 6 7 8 9 10 Next Formed: 1927 in Trinity, TX Genre Christian & Gospel Years Active: '20s, '30s, '40s, '50s, '60s, '70s, '80s, '90s Followers The Sensational Nightingales The Pilgrim Travelers Candi Staton The Fairfield Four Willie Banks The Dixie Hummingbirds The Charioteers The Highway Q.C.'s The Swan Silvertones John Ellison Contemporaries The Mighty Clouds of Joy Dorothy Norwood The Harmonizing Four The Five Blind Boys of Mississippi The Chosen Gospel Singers The Pilgrim Travelers The Fairfield Four The Paschall Brothers The Zion Travelers Discover and share new apps. Follow us on @AppStore. Discover and share new", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}