{"relation": [["Side C Titles", "1. From This Valley", "2. Tell Mama", "3. Oh Henry"], ["Artist", "The Civil Wars", "The Civil Wars", "The Civil Wars"], ["Length", "03:33", "03:48", "03:32"]], "pageTitle": "The Civil Wars - The Civil Wars (Vinyl LP) - Amoeba Music", "title": "", "url": "http://www.amoeba.com/the-civil-wars-lp-the-civil-wars/albums/2965751/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00157-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 297836999, "recordOffset": 297818986, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{16662=Copyright © 2015 Amoeba, All Rights Reserved. Amoeba and the Amoeba Music mark and logo are trademarks of Amoeba Music Inc.}", "lastModified": "Fri, 31 Jul 2015 07:21:16 GMT", "textBeforeTable": "Track Listing Check out the Civil Wars Live at Amoeba EP on CD or MP3 (cut or uncut with on-stage banter between Joy White and John Paul Williams). Nashville folk duo The Civil Wars have been all over this great country since releasing their debut album, Barton Hallow. The result is that their brand of Americana sounds more open, more assured on their self-titled follow-up. Singer Joy Williams has an impressive set of pipes, one she unleashes at will, but she seems to having more fun here on songs like “Oh Henry,” while John Paul White lets loose, too, with some electric guitar. The duo makes Smashing Pumpkins’ “Disarm” even more confessional and dirge-like, as first premiered on their Live at Amoeba release. Fans don’t have to worry, though, that they’ve forgotten their roots or gone the way of Mumford & Sons-style bombast. Even with production from Rick Rubin, “I Had Me a Girl” sounds like a old Western blues — it just hits harder than anything they’ve done before, with extra cowboy-booted kick. “The One That Got Away” is some of the duo’s finest work yet, moody and rocky, with some production and songwriting from Charlie Peacock. But even with these collaborators, Williams and White know what makes them work is their particular chemistry, and The Civil Wars often still sounds like the work of two people alone in a room creating", "textAfterTable": "Side B Titles Artist Length 1. Dust To Dust The Civil Wars 03:49 2. Eavesdrop The Civil Wars 03:35 3. Devil's Backbone The Civil Wars 02:29 Side C Titles Artist Length 1. From This Valley The Civil Wars 03:33 2. Tell Mama The Civil Wars 03:48 3. Oh Henry The Civil Wars 03:32", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}