{"relation": [["Track", "Coming Up", "Temporary Secretary", "On The Way", "Waterfalls", "Nobody Knows"], ["Composer", "McCartney", "McCartney", "McCartney", "McCartney", "McCartney"], ["Recording Information", "Paul's vocal is distorted using vari-speed on this, the cream of the album.", "A song (quite clearly) in the form of a letter to the Alfred Marks employment bureau, who after hearing it, asked permission to use the song in a radio advert. Oddly, they were turned down. (Why, Paul ?)", "Paul recorded the backing track for this, then left it for one week. During that week he was influenced by a BBC programme about Alexis Korner, and transformed the track into a more \"bluesy\" number. And what a great sound on this simple, but effective track.", "Originally entitled, \"I Need Love\". Paul's house in Kent is called \"Waterfalls\", and this song was actually written long in advance of recording. The finished article ? ... An immense ballad.", "This song was also influenced by the BBC programme about Alexis Korner, but starts like it's a one man band like Don Partridge ! ... a very happy-sounding knockabout."], ["Time", "3:52", "3:13", "3:36", "4:41", "2:51"]], "pageTitle": "McCartney II", "title": "", "url": "http://www.jpgr.co.uk/pctc258.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00243-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 535617338, "recordOffset": 535609136, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{12457=June 1993, a \"Re-master\" re-issue C.D. has catalogue number CDPMCOL 11 (+ TCPMCOL 11), (international number CDP 7 89137 2), This release has a 16 page booklet which includes all the lyrics (even including the bonus tracks) This has a running time of 59:31, as it adds the bonus tracks of :, 14291=©2001 Graham Calkin's Beatles Pages. All Rights Reserved., 10850=October 1987, the first C.D. release, it's on Fame catalogue number CDFA 3191 (the International number is CDM 7 52024 2) The front cover \"booklet\", only opens out to three cheapo pages containing just the pictures seen on the album. This has a running time of 55:02 as it adds the bonus tracks of :, 12342=31st January 1988, \"McCartney II\" is deleted from the E.M.I. catalogue., 10764=September 1987, the next listing is on the Fame label, FA 3191 (+ TCFA 3191)., 2926=McCartney II - Recording Sessions, July 1979 The tracks were recorded WITHOUT a mixing console, with all microphones plugged directly into the back of the Studer 16 track tape machine at chez Macca. And in almost every case, Paul laid down backing tracks with bass, drums and guitar and added the vocals subsequently. As well as the tracks on the album, these other tracks were recorded : \"Check My Machine\" - The first song recorded, but left off the album, later appears as a B-side. It starts off with some odd sampling noises, the first in a Frog voice says, \"Hi George\", reply \"Morning Terry\", and then what sounds like Barney Rubble from The Flintstones saying, \"Sticks and Stones ...\" \"Secret Friend\" - The longest song Paul has ever recorded, at almost 10 and a half minutes long. Later appears as a B-side. \"Blue Swat\" - Unreleased \"Mr. H Atom\" - Unreleased \"You Know I'll Get You Baby\" - Unreleased \"Bogey Wobble\" - Unreleased \"Wonderful Christmastime\" - A later smash hit single. and, \"All You Horseriders\" - featured in the MPL documentary \"Blankit's First Show\" about Linda's horses. This is first shown on BBC2 on 12th July 1986.}", "lastModified": "Fri, 10 Aug 2012 09:33:08 GMT", "textBeforeTable": "Side 1 Paul's twelfth solo venture, truly solo, 10 years after the first \"McCartney\" album. Entering at number 1 is a great achievement, but, hadn't there been better releases before this one, that had NOT reached the upper echelon ? ... Fortunately the single \"Coming Up\" had been released one month earlier (successfully), and with it's tremendous video, people were obviously keen to buy the album to accompany the smash single. As with the \"McCartney\" album of 10 years earlier, Paul recorded this release completely solo, except for Linda's backing vocals on the last track. The sessions for the album actually produced over 20 songs and originally this release was going to be a double album. But with prudent editing emerged as a single L.P. McCartney II - Recording Sessions, July 1979 The tracks were recorded WITHOUT a mixing console, with all microphones plugged directly into the back of the Studer 16 track tape machine at chez Macca. And in almost every case, Paul laid down backing tracks with bass, drums and guitar and added the vocals subsequently. As well as the tracks on the album, these other tracks were recorded : \"Check My Machine\" - The first song recorded, but left off the album, later appears as a B-side. It starts off with some odd sampling noises, the first in a Frog voice says, \"Hi George\", reply \"Morning Terry\", and then what sounds like Barney Rubble from", "textAfterTable": "Side 2 Track Composer Recording Information Time Front Parlour McCartney An odd instrumental, named because it was recorded in the same room in Paul's farmhouse. 3:30 Summer's Day Song McCartney Nice words, nice melody, with an almost hymnal feel about it. 3:24 Frozen Jap McCartney Is this Aneka ? ... very similar sounding. But seriously, a pretty mundane instrumental. 3:38 Bogey Music McCartney As described on the inner sleeve, this track is inspired by the Raymond Briggs book Fungus The Bogeyman An early 50's heavily reverberated feel, that sounds like a one-take job. 3:25 Darkroom McCartney This was ad-libbed as it went along (and sounds it), but allegedly was NOT inspired by Linda's photographic interests. 2:18 One Of These Days McCartney A very pleasant ballad .... but ... The ONLY track I can think of by Paul, where the title appears in better form elsewhere. Checkout Pink Floyd`s \"One Of These Days\" !", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}