{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "In the Dutch Mountains", "Nescio", "Sketches of Spain", "Adieu, Sweet Bahnhof", "J.O.S. Days", "The Train", "Soap Bubble Box", "In the Dutch Mountains", "Cars & Cars", "Nescio (Live)"], ["Album", "Nits Hits", "Nits Hits", "Nits Hits", "Nits Hits", "Nits Hits", "Nits Hits", "Nits Hits", "In the Dutch Mountains", "Nits Hits", "Nits Hits"], ["Time", "3:27", "4:46", "4:22", "4:47", "3:12", "4:08", "3:24", "3:26", "3:52", "5:55"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Doing the Dishes by Nits", "title": "", "url": "https://itunes.apple.com/be/album/doing-the-dishes/id270353349", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00306-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 884377199, "recordOffset": 884351846, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{32345=For Nits fans, the Dutch band has continued to remain relevant, unique and utterly original. For casual music fans not familiar with their history, their 30 year career could be a little frustrating. When the band released their major-label debut album, Tent, in 1979, they appeared to be a quirky new wave band not too dissimilar from XTC with a healthy Beatles influence. By the time New Flat hit the stores a year later, the Nits had changed course. And so it went on with each and every release since then: the band continued to evolve and change, expanding their musical influences and maturing and morphing at an alarming rate. Original members Henk Hofstede and Rob Kloet plus former Supersister leader Robert Jan Stips (who'd joined the band by 1981) continued to experiment in the band's own studio, pushing themselves in different directions on each album. By the time they released In the Dutch Mountains in 1987, they no longer sounded like the same band that had released Tent almost a decade before, yet they had managed to retain their own distinct musical personality within that sound. When the title track of In the Dutch Mountains was a surprise European hit, their new fans were expecting more of the same as the band continued to release albums, but it was not meant to be. The Nits were never a musical entity that could stand still. Each album since ...Dutch Mountains has pushed boundaries, confused critics, and delighted fans. Some 27 years into their career, they actually started to receive critical accolades outside their homeland when they released the dark and brooding Les Nuits in 2005. So, if anyone expected the band to continue in the same vein as Les Nuits, then you haven't been paying attention. In fact, Doing the Dishes is certainly the same band, but the mood has switched from dark to light, from the music on the disc to the bright and colorful cover that houses the album. Anyone wanting another slice of Les Nuits will be disappointed, but for anyone who has been waiting for a proper follow-up to ...Dutch Mountains can rejoice...sort of. While this album is very different from their 1987 creation, it is closer in spirit and playfulness than any Nits release in the last two decades. Doing the Dishes is lighthearted while still being serious, smart and artistic. \"The Flowers,\" \"Yesterday,\" \"Cowboys and Indians\" and \"Heart\" are just as good as anything the band has put down on tape. Anyone in love with ...Dutch Mountains or even their 1995 album Da Da Da will love Doing the Dishes. If you want sad, somber Nits, you'll just have to see what they do next. It's hard to tell with these guys, but you know it will be interesting! ~ Steve \"Spaz\" Schnee, Rovi, 133676=Copyright © 2014 Apple Inc. Tous droits réservés., 35224=Formed: 1974 in Amsterdam, The Netherlands}", "lastModified": "Sat, 01 Aug 2015 04:38:36 GMT", "textBeforeTable": "View In iTunes Doing the Dishes 5. View In iTunes Strawberry Wood 4. View In iTunes Nest 3. View In iTunes Nits Hits 2.", "textAfterTable": "Listeners Also Bought Nachtmuziek Acda & De Munnik View In iTunes Aardige Jongens Boeijen Hofstede Vrienten View In iTunes This Is the Life Amy Macdonald View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}