{"relation": [["File Name", "SDM Icons beta", "SuperDuperMacro WoW 4.x fix 4"], ["Version", "2.5", "1.8.3-4"], ["Size", "128kB", "16kB"], ["Author", "hypehuman", "Ambro"], ["Date", "03-04-12 10:27 PM", "06-30-11 11:50 AM"], ["Type", "Patch", "Patch"]], "pageTitle": "Super Duper Macro : Miscellaneous : World of Warcraft AddOns", "title": "", "url": "http://www.wowinterface.com/downloads/fileinfo.php?id=10496&so=&page=13", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00235-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 835173879, "recordOffset": 835149425, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{16602=To view recent changes, click the \"Change Log\" tab at the top of this page. Open the in-game interface by typing /sdm This addon allows you to create macros beyond the 255-character limit, and even beyond the 1023-character macrotext limit. However, no individual line in a macro may be more than 1023 characters long (you will get a warning). The number of lines is unlimited. Super Duper Macro also allows you to share macros with your friends in-game. This mod allows you to make two types of macros:}", "textBeforeTable": "Optional Files (2) just two minor updates in code to make it 3.0-ready. More UI improvements to come! 1.0 (11/13/08) More UI improvements. Some UI elements are still placeholders. 1.1 (12/12/08) Fixed a bug that caused major problems when there were no macros in the list. 1.2 (12/13/08) - The SDM window will now become unresponsive during confirmation dialogs - Buttons will now \"gray out\" when appropriate - Added buttons that link between the regular macro window and the SDM window - Moved some buttons around to more appropriate places - Pressing enter will now be equivalent to the appropriate button click - Pressing tab will now add four spaces \u0095 Added many UI improvements to make working with the addon more intuitive: \u0095 Because of this, SDM will no longer ever replace your macros, and their names do not need to be unique at all. Floating macros and Scripts still have some restrictions on naming, you will get a warning it you try to violate them. \u0095 SDM now keeps track of the button macros it creates, and deletes orphaned ones upon login. If you are upgrading from a previous version, you can delete the old button", "textAfterTable": "Archived Files (28) File Name Version Size Author Date   Super Duper Macro 2.6 56kB hypehuman 10-16-14 01:32 AM   Super Duper Macro 2.4.6 124kB hypehuman 02-20-12 02:11 PM   Super Duper Macro 2.4.5 124kB hypehuman 01-17-12 10:43 PM   Super Duper Macro 2.4.4 124kB hypehuman 12-17-11 09:12 AM   Super Duper Macro 2.4.3", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}