{"relation": [["Disc 1 Titles", "1. Black Moon Spell", "2. Sick Mind", "3. Rainbow's Run", "4. Headbanger", "5. Beautiful Thing", "6. I Love You Ugly", "7. Magic Mirror", "8. Madness", "9. Demon From Hell", "10. Black holes in Stereo", "11. Radiation", "12. Eyes of the Muse", "13. Staircase of Diamonds", "14. Eddie's Song"], ["Artist", "King Tuff", "King Tuff", "King Tuff", "King Tuff", "King Tuff", "King Tuff", "King Tuff", "King Tuff", "King Tuff", "King Tuff", "King Tuff", "King Tuff", "King Tuff", "King Tuff"], ["Length", "04:53", "02:09", "03:25", "03:28", "02:38", "01:01", "02:57", "02:54", "01:29", "01:53", "01:17", "04:14", "04:47", "03:50"]], "pageTitle": "King Tuff - Black Moon Spell (CD) - Amoeba Music", "title": "", "url": "http://www.amoeba.com/black-moon-spell-cd-king-tuff/albums/3340377/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00147-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 281945067, "recordOffset": 281929535, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{15481=Copyright © 2015 Amoeba, All Rights Reserved. Amoeba and the Amoeba Music mark and logo are trademarks of Amoeba Music Inc., 1448=When King Tuff released his breakthrough self-titled album in 2012, he came off as a successor to T. Rex’s Marc Bolan, alone and stoned in his room and writing perfect power-pop gems. But like Bolan before him, who started with a few English folk albums before going glam, King Tuff aka Kyle Thomas seems to have set his sights higher this time around, filling out the sound with full-bodied heavy rock riffs and pushing his nasal wail into a wolf’s howl. Like King Tuff’s “Anthem,” “Black Moon Spell’s” big fat riff sounds pulled out from the ether, like it was always there, judging by the way it nestles into your skull. “Rainbow’s Run” calls to mind another garage-rock luminary, Ty Segall, in the way it takes a simple glam structure and pours acid all over it, impossible distortion and flailing solos flying off the edges. Though there’s a winking hair-metal touch to Black Moon Spell, songs like “Headbanger” (complete with demonic opening) don’t stray so far from the glam-garage foundation that it’s jarring—and Thomas’ voice is too cartoonish and the songs are too damn catchy to really scare off any garage kids, anyway. Even a song called “Demon From Hell” is more fey and punk than hellish, despite pushing the sound into the red. If there’s one thing Black Moon Spell is, it’s a great guitar album, as songs like “Eyes of the Muse” prove, starting with a ’70s AM radio gold jangle and moving into psychedelic, searching riffs, while Bobby Harlow’s production practically places the drums in your living room. There hasn’t been a better album released this year to play air guitar and drums to than Black Moon Spell., 1363=09/22/2014}", "lastModified": "Sat, 01 Aug 2015 03:59:07 GMT", "textBeforeTable": "Track Listing When King Tuff released his breakthrough self-titled album in 2012, he came off as a successor to T. Rex’s Marc Bolan, alone and stoned in his room and writing perfect power-pop gems. But like Bolan before him, who started with a few English folk albums before going glam, King Tuff aka Kyle Thomas seems to have set his sights higher this time around, filling out the sound with full-bodied heavy rock riffs and pushing his nasal wail into a wolf’s howl. Like King Tuff’s “Anthem,” “Black Moon Spell’s” big fat riff sounds pulled out from the ether, like it was always there, judging by the way it nestles into your skull. “Rainbow’s Run” calls to mind another garage-rock luminary, Ty Segall, in the way it takes a simple glam structure and pours acid all over it, impossible distortion and flailing solos flying off the edges. Though there’s a winking hair-metal touch to Black Moon Spell, songs like “Headbanger” (complete with demonic opening) don’t stray so far from the glam-garage foundation that it’s jarring—and Thomas’ voice is too cartoonish and the songs are too damn catchy to really scare off any garage kids, anyway. Even a song called “Demon From Hell” is more fey and punk than hellish, despite pushing the sound into the red. If there’s one thing Black Moon Spell is, it’s a great guitar album, as songs like “Eyes of the Muse”", "textAfterTable": "BUY $14.98 SHIPS FREE in U.S. 1 used from 7.99 Also available in: LP , Download User Reviews Overall Rating 0 Submissions RATE & REVIEW Who We Are Amoeblog Buy Sell Trade News & Contests Gift Certificates Contact Us Support & FAQ", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}