{"relation": [["Title", "The Last Resort", "Where We Have Hope: A Memoir of Zimbabwe", "When a Crocodile Eats the Sun", "Nervous Conditions", "Butterfly Burning"], ["Author", "Douglas Rogers", "Andrew Meldrum", "Peter Godwin", "Tsitsi Dangarembga", "Yvonne Vera"]], "pageTitle": "Zimbabwe Tours & Travel | Intrepid Travel FR", "title": "", "url": "http://www.intrepidtravel.com/fr/zimbabwe", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00329-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 536937655, "recordOffset": 536878045, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{162828=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 164147=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan...}", "TableContextTimeStampAfterTable": "{8240=The land of Zimbabwe has been occupied since the 9th century, with tribes first emerging in the Limpopo Valley before starting to occupy the highlands. Zimbabwe's early society developed into a series of kingdoms which traded commodities such as gold and copper with other nations. The Great Zimbabwe ruins are a remnant of this illustrious time in Zimbabwean history and can be visited while travelling in the Masvingo area. Portuguese settlers arrived in the 16th century, having a devastating effect on the empire. Trade was halted and a series of wars rendered the empire near collapse at the dawn of the 17th century. The British arrived in the late 19th century, by way of Cecil Rhodes' British South Africa Company, which lobbied to colonise the area and control the land (and precious minerals within). By 1898 the area of Zimbabwe was known as Southern Rhodesia (with modern day Zambia known as Northern Rhodesia). The Shona and Ndebele (along with other indigenous tribes) staged revolts against their colonisers, which were largely unsuccessful and lead to displacement, with land unfairly being allocated to European settlers, rather than local tribal people whose ancestors and families had lived there for centuries. In part, this issue of disproportionate allocation of land would return to haunt modern Zimbabwe many years later., 9667=Although controversial, colonial rule endured until Zimbabwe gained its independence in 1980, with Canaan Banana serving as the first President. In 1988, changes to the constitution enabled Robert Mugabe to become President. By the 1990s ethnic tensions, confrontation and political instability were changing the face of modern Zimbabwe. Zimbabweans had endured demonstrations, displacement, violence, drought, food shortages and forcible land removal. The unstable economy, wildly fluctuating currency value and drop in tourism revenue translated into widespread poverty for many Zimbabweans. With the highest inflation rate in the world, Zimbabwe still suffers economic difficulties mainly due to the collapse of the once-strong agriculture sector. Despite this, Zimbabwe's people are irrepressible, the landscapes are as beautiful as ever and tourists have begun to return to experience the natural wonders and exotic wildlife of this great land., 961=Zimbabwe is located in a tropical zone but due to its high altitude, the climate remains temperate and comfortable all year, making it a suitable destination to visit all year round. May to October is the dry winter season and if wildlife watching, these months are perfect for easy viewing because animals flock to watering holes seemingly just for you. November to April is wetter and hotter but brings about a stunning, lush landscape that serves as a brilliant backdrop to photos.}", "textBeforeTable": "Recommended reading Further reading 10. Avoid purchasing ivory or other products harvested from endangered animals. 9. When on community visits or homestays, refrain from giving gifts or money to locals. 8. Please ask and receive permission before taking photos of people, including children. 7. Refrain from supporting businesses that exploit or abuse endangered animals. 6. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 5. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 4. When bargaining at markets, stay calm, be reasonable and keep a smile on your face. It's meant to be fun! 3. Always dispose of litter thoughtfully, including cigarette butts. 2. For environmental reasons, try to avoid buying bottled water. Instead, fill a reusable water bottle or canteen with filtered water. 1. Be considerate of Zimbabwe’s customs, traditions, religion and culture. Top responsible travel tips for Zimbabwe Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this", "textAfterTable": "Handy links www.lonelyplanet.com/zimbabwe www.worldtravelguide.net/zimbabwe www.zimbabwetourism.net × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}