{"relation": [["", "1", "2", "3", "4", "5"], ["Name", "Across the Universe (remix) [Remix]", "Sister Golden Hair", "New Slang", "Fields of Gold", "Lisztomania"], ["Album", "Poses", "America's Greatest Hits: History", "Oh, Inverted World", "Fields of Gold - The Best of Sting (1984-1994)", "Wolfgang Amadeus Phoenix"], ["Artist", "Rufus Wainwright", "America", "The Shins", "Sting", "Phoenix"], ["Time", "4:10", "3:19", "3:51", "3:39", "4:01"], ["Price", "$1.29", "$1.29", "$0.99", "$1.29", "$1.29"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Out of My Way by Peter Holsapple", "title": "", "url": "https://itunes.apple.com/us/album/i-am-a-tree/id268643535?i=268644218", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00145-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 880061020, "recordOffset": 880040865, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{22452=Born: February 19, 1956, 93209=Copyright © 2014 Apple Inc. All rights reserved., 21033=The solo debut from Holsapple, co-leader of North Carolina power-popsters the dB's, was released in 1997, and it seemed to vanish from circulation almost as soon as it hit the racks. And that's a shame, because it meant the world was robbed of the chance of hearing one of pop's finest craftsmen at his most stripped-down and honest. Recorded with friends in a New Orleans studio in the early 1990s, \"Out of My Way's\" 11 tracks run from the rollicking, full-band peformances \"I Been There,\" and \"Meet Me In The Middle,\" to the gentle, solo acoustics of \"Pretty, Damned, Smart,\" and \"I Am A Tree.\" Throughout, Holsapple's knowing way with a hook and keen melodic sense provide strong underpinnings to the tunes. And it's always mystified this reviewer why Holsapple's work, both with the dB's and on his own, never seemed to reach the wider audience that it deserved. Holsapple recently reacquired rights to the LP after a decade of it floating in limbo and chose to re-release it in this digital-only format. Take advantage of the opportunity. It's rare that a songwriter provides such an intimate glance behind the curtain. -- John L. Micek Pop Culture Press}", "lastModified": "Fri, 31 Jul 2015 07:57:47 GMT", "textBeforeTable": "View In iTunes The dB's Falling Off the Sky Listeners Also Bought View In iTunes $0.99 3:08 Songs from Radio Free Song Club 2010 The Smartest Thing I've Ever Done 10", "textAfterTable": "View In iTunes $9.99 Genres: Rock, Music, Singer/Songwriter, Alternative, College Rock, Roots Rock, Adult Alternative Released: Jan 21, 1997 ℗ 2009 Hospital Music Customer Ratings We have not received enough ratings to display an average for this album. Contemporaries Syd Straw The Minus 5 Chris Kowanko Susan Cowsill Discover and share new apps. Follow us on @AppStore. Discover and share new music, movies, TV, books, and more. Follow us @iTunes and", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}