{"relation": [["Author", "ozwalled", "ozwalled", "ozwalled", "ozwalled", "ozwalled"], ["Title", "Anty Personel", "Apple Kid", "Arachnid!", "Arachnid!!", "Armor"], ["Description", "Titanic Ant.", "The smart, smelly guy that everyone loves!", "I like the effect I got on the spider's web for this one.", "Guh. I really don't like spiders.... SMAAAAAAAAASH!", "Armor from Mother 1. When I was a kid, I LOVED Dungeons and Dragons type medieval fantasy stuff and over the years a drew a TON of knights and dragons and stuff. I loved all the Dragon Warrior and Final Fantasy stuff when it came out (and stuff like \"The Sword of Fargoal\" and \"Knight Games\" on the old Commodore 64), but when EaarthBound came out, it was a nice change of pace. So I always thought that in EB0, when the knight appeared, that it sort of defied that \"trying to break the RPG rules\" theme of the game. This is an hommage to that, and was a bit like time-travelling to my shining-armor chlidhood."], ["Date", "6/10/10", "4/26/05", "8/13/06", "7/15/05", "4/27/05"], ["Rank", "0.00", "0.00", "7.00", "8.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=31422&stuffFirstLetter=A&stuffPageNumber=3", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00035-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 231452986, "recordOffset": 231444784, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> Z Y W V U T S R Q P O N M L K J I H G F E D C B A < Other Submissions by ozwalled Baked Yammonster. Cooked at about 400F for approx 40 minutes, and THEN carved the face, which was much easier than the last time I'd gouged out the face while the sweet potato was still raw. http://starmen.net/vote/vote.php?id=19286 This image has been resized for your convenience. Click on it to view the full size version. Actual Baked", "textAfterTable": "1 2 3 4 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day. Activities:", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}