{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"], ["Namn", "Already In Love", "Brand New Memory", "Alone In Arizona", "Falling", "I Wish It Would Stop Raining", "Turning With the World", "Dirty Snow", "Beyond You", "Someday I'll Forget", "Half Past Forever", "I'll Admit It Now", "Love and Haight"], ["Artist", "Exene Cervenka", "Exene Cervenka", "Exene Cervenka", "Exene Cervenka", "Exene Cervenka", "Exene Cervenka", "Exene Cervenka", "Exene Cervenka", "Exene Cervenka", "Exene Cervenka", "Exene Cervenka", "Exene Cervenka"], ["Tid", "3:31", "3:35", "4:07", "2:10", "3:07", "2:15", "3:56", "2:22", "2:16", "3:27", "3:02", "3:25"], ["Pris", "12,00 kr", "12,00 kr", "12,00 kr", "12,00 kr", "12,00 kr", "12,00 kr", "12,00 kr", "12,00 kr", "12,00 kr", "12,00 kr", "12,00 kr", "12,00 kr"], ["", "Visa i iTunes", "Visa i iTunes", "Visa i iTunes", "Visa i iTunes", "Visa i iTunes", "Visa i iTunes", "Visa i iTunes", "Visa i iTunes", "Visa i iTunes", "Visa i iTunes", "Visa i iTunes", "Visa i iTunes"]], "pageTitle": "iTunes - Musik - The Excitement of Maybe av Exene Cervenka", "title": "", "url": "https://itunes.apple.com/se/album/the-excitement-of-maybe/id420718927", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00228-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 851470363, "recordOffset": 851445253, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{23025=For many years, Exene Cervenka has been torn between her first love, loud and aggressive rock & roll (as she's embraced it with X, Auntie Christ and The Original Sinners) and her ongoing flirtation with acoustic music rooted in folk, country and blues (see her work with The Knitters and her first two solo albums, Old Wives' Tales and Running Sacred). Cervenka's 2009 album Somewhere Gone was firmly rooted in acoustic territory, but its follow-up, 2011's The Excitement of Maybe, finds her trying to bring to the two sides together for a change. This album's volume is quite low by the standards of Wild Gift or Under The Big Black Sun, but with Brady Blade on drums on drums and Christian McBride on bass, Cervenka has an acoustic rhythm section that can lock into a groove and set a mood like nobody's business, and Dave Alvin adds subtle but scrappy electric guitar on most of these twelve tracks, giving this music a rough, soulful undertow. Add the presence of R&B-influenced piano and organ on many tunes and some solid horn arrangements from David Ralicke and The Excitement of Maybe becomes a low key but potent and atmospheric roots rock set that merges the expressive force of her rock & roll with the dynamics and subtleties of her acoustic material. Somewhere Gone boasted some of Cervenka's finest vocal work to date, and she's every bit as strong on The Excitement of Maybe; while she's a powerful punk rock shouter, without having to outrun a bank of amps Cervenka's voice sounds sly, bittersweet and eloquent, and her best moments here reflect an understated strength that sounds fresh and supple despite her three decades of experience. And also like Somewhere Gone, The Excitement of Maybe features a batch of well-written songs that merge simple but haunting melodies with lyrics that speak of love, heartache and life's trials, and together they speak with the voice of someone who will not acknowledge defeat for all their troubles. It's safe to say no one was expecting a mid-career renaissance from Cervenka when she signed to Bloodshot Records, but with Somewhere Gone and The Excitement of Maybe she's made two of the strongest and most impressive albums she's recorded outside of her work with X, confirming her status as a one of a kind talent with plenty of welcome surprises up her sleeve., 128857=Copyright © 2014 Apple Inc. Alla rättigheter förbehålls., 25476=Född: 01 februari 1956 i Chicago, IL}", "lastModified": "Fri, 31 Jul 2015 08:32:44 GMT", "textBeforeTable": "Öppna iTunes när du vill provlyssna, köpa och hämta musik. Visa mer av den här artisten Exene Cervenka The Excitement of Maybe iTunes för Mac och PC Har du redan iTunes? Klicka på Jag har iTunes om du vill öppna det nu. Det går inte att hitta iTunes på datorn. Hämta iTunes nu så kan du provlyssna på och köpa musik från The Excitement of Maybe av Exene Cervenka. I iTunes är det otroligt enkelt att ordna en samling av digitala mediefiler och lägga till nya. iTunes Förloppsindikator Om iBooks inte öppnas klickar du på iBooks i Dock. Öppnar iBooks Store. Förloppsindikator Om iTunes inte öppnas klickar du på", "textAfterTable": "12 låtar Albumrecension For many years, Exene Cervenka has been torn between her first love, loud and aggressive rock & roll (as she's embraced it with X, Auntie Christ and The Original Sinners) and her ongoing flirtation with acoustic music rooted in folk, country and blues (see her work with The Knitters and her first two solo albums, Old Wives' Tales and Running Sacred). Cervenka's 2009 album Somewhere Gone was firmly rooted in acoustic territory, but its follow-up, 2011's The Excitement of Maybe, finds her trying to bring to the two sides together for a change. This album's volume is quite low by the standards of Wild Gift or Under The Big Black Sun, but with Brady Blade on drums on drums and Christian McBride on bass, Cervenka has an acoustic rhythm section that can lock into a groove and set a mood like nobody's business, and Dave Alvin adds subtle but scrappy electric guitar on most of these twelve tracks, giving this music a rough, soulful undertow. Add the presence of R&B-influenced piano and organ on many tunes and some solid horn arrangements from David Ralicke and The Excitement of Maybe becomes a low key but potent and atmospheric roots rock set that merges the expressive force of her rock & roll with the dynamics and subtleties of her acoustic", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}