{"relation": [["Disc 1 Titles", "1. Into The Black", "2. Kill For Love", "3. Back From The Grave", "4. The Page", "5. Lady", "6. These Streets Will Never Look The Same", "7. Broken Mirrors", "8. Candy", "9. The Eleventh Hour", "10. Running From The Sun", "11. Dust To Dust", "12. Birds Of Paradise", "13. A Matter Of Time", "14. At Your Door", "15. There's A Light Out On The Horizon", "16. The River"], ["Artist", "Chromatics", "Chromatics", "Chromatics", "Chromatics", "Chromatics", "Chromatics", "Chromatics", "Chromatics", "Chromatics", "Chromatics", "Chromatics", "Chromatics", "Chromatics", "Chromatics", "Chromatics", "Chromatics"], ["Length", "05:23", "03:58", "03:43", "03:36", "05:08", "08:37", "07:04", "02:30", "03:28", "07:07", "02:41", "04:26", "05:06", "03:53", "04:45", "06:10"]], "pageTitle": "Chromatics - Kill For Love (CD) - Amoeba Music", "title": "", "url": "http://www.amoeba.com/kill-for-love-cd-chromatics/albums/970543/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00036-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 284158575, "recordOffset": 284138919, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1441=I have been waiting for this album for 6 years! I was a huge fan of their last album in 2007. Both Night Drive by Chromatics and Beat Box by Glass Candy made it into my top 50 that year. But in 2012 we got a brilliant new album by Chromatics. These guys are from the beautiful town of Portland. They have been around for about a decade. But really became a different kind of band back in 2007. Another perfect album of dreamy electronic love songs. These songs are seriously breathtaking and they make it seem so easy. These guys can do no wrong and always manage to create exactly what I need from them., 1550=Brad Schelden, Hollywood 12/13/2012, 764=Billy Gil, Hollywood 07/31/2015}", "TableContextTimeStampAfterTable": "{12890=Copyright © 2015 Amoeba, All Rights Reserved. Amoeba and the Amoeba Music mark and logo are trademarks of Amoeba Music Inc.}", "lastModified": "Sat, 01 Aug 2015 03:42:58 GMT", "textBeforeTable": "Track Listing On an almost overwhelmingly massive album, Chromatics don’t make things easy with Kill For Love. Unlike their friendlier labelmates Glass Candy, their catchiest songs are buried amongst extended Dario Argento soundtrack-style jams, and even then they’re delivered with such a cool demeanor, you’re the one who has to reach out to connect to these songs. Thank God, cause Kill For Love’s nighttime mystique and seedy club jams keep me coming back and uncovering something new every time. Billy Gil, Hollywood 07/31/2015 I have been waiting for this album for 6 years! I was a huge fan of their last album in 2007. Both Night Drive by Chromatics and Beat Box by Glass Candy made it into my top 50 that year. But in 2012 we got a brilliant new album by Chromatics. These guys are from the beautiful town of Portland. They have been around for about a decade. But really became a different kind of band back in 2007. Another perfect album of dreamy electronic love songs. These songs are seriously breathtaking and they make it seem so easy. These guys can do no wrong and always manage to create exactly what I need from them. Brad Schelden, Hollywood 12/13/2012 Amoeba Review Vinyl LP Also available in: SHIPS FREE", "textAfterTable": "BUY $13.98 SHIPS FREE in U.S. Also available in: LP User Reviews Overall Rating 0 Submissions RATE & REVIEW Who We Are Amoeblog Buy Sell Trade News & Contests Gift Certificates Contact Us Support & FAQ Sign-up for email news, sales alerts & more:", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}