{"relation": [["Artist", "Bobby Darin", "Fats Domino", "Ricky Nelson"], ["Song Title", "\"Splish Splash\" (1958)", "\"Blueberry Hill\" (sung briefly by Mork) (1956)", "\"It's Late\" (1959)"], ["Played When", "", "", ""]], "pageTitle": "Happy Days Season 5 Episode 22 - My Favorite Orkan (5x22) - Watch Online - s5 e22 Spoilers", "title": "", "url": "http://www.tvrage.com/happy-days/episodes/75602", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00082-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 792690841, "recordOffset": 792674876, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Music In the original ABC broadcast of this episode, Robin Williams' final scene was where he was a simple Joe on Richie's porch after he woke up from his dream. However, when the episode was rerun in August, as \"Mork & Mindy\" was set to begin in the fall, a new scene featuring Williams as Mork talking to Orson was added at the end. Mork says he made everyone forget about him, let Fonzie go, and was heading for a mission in the year 1978. This scene is broadcast by TV Land / Nick at Nite and not broadcast on other stations. Mork & Mindy, later in 1978. Robin Williams makes his debut as Mork. He would soon land his own spin-off, Episode Notes Click here to add a recap for My Favorite Orkan Next Episode --> <-- Previous Episode Recap Howard C. Cunningham As Tom Bosley Arthur Herbert \"Fonzie\" Fonzarelli As Henry Winkler", "textAfterTable": "Other Episode Crew Click here to add other crew for My Favorite Orkan Missing Information Click here to add Episode Quotes Click here to add Episode Goofs Click here to add Cultural References Click here to add Episode References Click here to add Analysis   Flash Show Menu General Info Forum Episode List Episode Guide Printable Guide Cast Recurring Guests Character Guide (1) Show Tidbits (1) Stats Links (7) Credits Contribute Submit Trivia Gallery (0) Empty Sections", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}