{"relation": [["Author", "Ultimoo", "Ultimoo", "Ultimoo", "Ultimoo", "Ultimoo"], ["Title", "On The Rise", "The \"Mother\" of EarthBound", "Rebuttal Double Whammy", "Reflections of EarthBound", "The Return of the King"], ["Description", "298", "297", "299", "300", "301"], ["Date", "7/31/06", "7/31/06", "7/31/06", "7/31/06", "7/31/06"], ["Rank", "0.00", "0.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=14583&stuff=DateASC", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00340-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 226868311, "recordOffset": 226860109, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> 1 < Other Submissions by Ultimoo The possibility of Mother on Game Boy Color only reinforces this idea. Speaking of which, another huge RPG series that has experienced a lengthy hiatus from American soil is the fabled Dragon Quest series, by Akira Toriyama and Yuji Horii. This series is considered by many to be the first true console RPG series. Of course, it hasn't gone under the American name Dragon Warrior since the late days of NES. Apparently, due to the boom of Pokemon, Enix (the developer of the Dragon Quest series) plans on releasing their own DQ Monsters in the US, in addition the original two Dragon Quest games on GBC. Should these two titles do good, Dragon Quest VII for PSX is a shoe-in for the American RPG market. Despite Nintendo's unstable relationship with American release dates, there's no reason why we shouldn't see EarthBound back in America before long. And as far as I'm concerned....EarthBound.net as an American fan site of the series, can only last so much longer than the series itself. Many despise my commentary on this, but regardless of the quality of the game, Final Fantasy VII is the reason for the booming RPG genre", "textAfterTable": "1 2 3 4 5 6 7 8 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day. Activities:", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}