{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Jai Ho! (You Are My Destiny) [feat. Nicole Scherzinger]", "If I Rise", "Storm", "Jai Ho (feat. Sukhwinder Singh, Tanvi Shah & Mahalakshmi Iyer)", "Dil Se Re", "Afreen", "Mitwa", "Radha Kaise Na Jale", "Ghanan Ghanan", "Chale Chalo"], ["Album", "Jai Ho! (You Are My Destiny) [feat. Nicole Scherzinger] - Single", "127 Hours (Music from the Motion Picture)", "Elizabeth - The Golden Age (Music from the Motion Picture)", "Slumdog Millionaire (Music From the Motion Picture)", "Dil Se (Original Motion Picture Soundtrack)", "The Hundred-Foot Journey (Original Motion Picture Soundtrack)", "Lagaan (Original Motion Picture Soundtrack)", "Lagaan (Original Motion Picture Soundtrack)", "Lagaan (Original Motion Picture Soundtrack)", "Lagaan (Original Motion Picture Soundtrack)"], ["Time", "3:42", "4:38", "3:00", "5:19", "6:45", "4:05", "6:47", "5:34", "6:11", "6:40"], ["Price", "$1.29", "$1.29", "$0.99", "$1.29", "$0.99", "$1.29", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Elizabeth - The Golden Age (Music from the Motion Picture) by Craig Armstrong & AR Rahman", "title": "", "url": "https://itunes.apple.com/album/elizabeth-golden-age-music/id265010827?name=trailers&siteID=KcYgFL4xzJU", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00315-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 864057571, "recordOffset": 864028173, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{148793=Copyright © 2014 Apple Inc. All rights reserved., 38973=Since it was only two years earlier in 2005 that HBO covered the same material in a two-part, three-and-a-half-hour mini-series called Elizabeth I, starring Helen Mirren and Jeremy Irons, and there have been earlier depictions as well, one may wonder why the world needed yet another movie about the 16th century queen of England in 2007. But director Shekhar Kapur could make prior claim to the story in the sense that Elizabeth: The Golden Age was really a sequel, nine years on, to his 1998 film Elizabeth, also starring Cate Blanchett and Geoffrey Rush, and treating the famed monarch's early years. Elizabeth: The Golden Age moved on to the familiar events of the 1580s, well into Elizabeth's long reign, including the execution of Mary Queen of Scots and the defeat of the Spanish Armada. To handle the scoring, Kapur turned to two composers, Craig Armstrong and A.R. Rahman, who are co-credited on all the compositions. Their writing, for an orchestra with bits of \"programming\" (the percussion sounds augmented by synthesized effects here and there), seems well shaped to the story, providing stately, majestic themes like \"Immensities\" before turning to an ominous, foreboding cue with choir for the inevitable \"Mary's Beheading\" and drum rolls and rollicking rhythms for \"Battle.\" At odd moments, for instance in the vocal solo in \"Mary's Beheading\" and in a sitar-like sound in \"Divinity Theme,\" there is a seemingly inappropriate Indian flavor to the music. Such sounds recall similar elements in another adaptation of a thoroughly English story, Mira Nair's 2004 film of Vanity Fair, and one can't help wondering if the Indian or Indian-heritage artists making these films and these scores felt compelled to sneak a bit of their own culture in, whether it makes sense or not, perhaps as a claim on the Indian influence on the British Empire., 44319=Born: January 6, 1967 in Chennai, India}", "lastModified": "Fri, 31 Jul 2015 07:31:20 GMT", "textBeforeTable": "View In iTunes Jab Tak Hai Jaan (Original Motion Picture Soundtrack) 5. View In iTunes Million Dollar Arm (Original Motion Picture Soundtrack) 4. View In iTunes The Hundred-Foot Journey (Original Motion Picture Soundtrack) 3.", "textAfterTable": "Listeners Also Bought Trailer Music Kerry Muzzey View In iTunes Elizabeth (Original Motion Picture Soundtrack) David Hirschfelder View In iTunes Partition (Original Motion Picture Soundtrack) Brian Tyler View", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}