{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"], ["Name", "Infidel Infidel (Six Fingered Hell)", "Last Gasp of Revenge", "The Apollo Creed", "Blueprint", "Kids Now", "Digital Dirt", "M.I.A.", "This Is Active", "The Russian Disco", "Ex-Airport", "This Is the Magnificents"], ["Artist", "The Magnificents", "The Magnificents", "The Magnificents", "The Magnificents", "The Magnificents", "The Magnificents", "The Magnificents", "The Magnificents", "The Magnificents", "The Magnificents", "The Magnificents"], ["Time", "2:30", "4:06", "3:17", "2:33", "2:30", "4:57", "4:02", "2:50", "5:58", "3:28", "6:54"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - The Magnificents by The Magnificents", "title": "", "url": "https://itunes.apple.com/gr/album/kids-now/id153614115?i=153614121", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00295-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 873031811, "recordOffset": 873008366, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{116102=Copyright © 2014 Apple Inc. Με επιφύλαξη παντός δικαιώματος.}", "lastModified": "Fri, 31 Jul 2015 08:22:03 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist The Magnificents The Magnificents iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from The Magnificents by The Magnificents, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "11 Songs Album Review If it weren't for the icy willy-nilly synths, Scotland's the Magnificents would probably be considered just another decent, scrappy punk band. Those synths are all-important — almost, but not quite, as important as they were to Gary Numan after the first Tubeway Army album. Each song provides its own form of racket; despite being chaotic as hell, the band is deceivingly tight, with springboard-shot rhythms (both programmed and played), clattering guitars, synths that prod and buzz, and vocals that either bark or drone. These components sort of fall on top of one another to form an ideal mess. If anything, the band resembles a nervy, crabby version of the Silicon Teens, a short-lived synth pop \"group\" led by Mute leader Daniel Miller. Just like that group's Music for Parties, The Magnificents is, at the very least, deserving of adored, cult status. Biography Formed: Edinburgh, Scotland Genre: Alternative Years Active: '00s A nervy quartet from Manchester, England, the Magnificents released a self-titled album for... Full bio Top Albums and Songs by The Magnificents", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}