{"relation": [["Title", "Better comfort than NRG2?", "Not 8 hours without pain?", "SPP 17L vs NRG2 16"], ["Date", "2007-04-02", "2007-04-03", "2007-04-08"], ["Time", "22:14:45", "09:57:04", "02:23:40"], ["Author", "Jens (14)", "Mogli (2)", "bbzz24 (2)"]], "pageTitle": "Stringforum.net: Reviews of the Signum Pro Poly Plasma 1.18", "title": "", "url": "https://www.stringforum.net/ratings.php?sdnr=2234&start=85&sort=DESC&fstatus=0&limit=5", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 18, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00129-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 917969118, "recordOffset": 917960916, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Comments: comfortable, explosive, precise StringAdjectives n/a Similar string(s): I compared it to my previous string on the Wilson nSix-One 95 18x20, a Tecnifibre NGR2 16 gauge. The Poly Plasma just lacks in the spin department (no gel-like surface to bite the ball) but the amount of spin it can generate is still plentyful. There is so much more power and above all, it is extremely easy on the arm: now I can play 8 hours on weekends without any aches in my forearm at all. That was a total surprise to me. Tension Stability Spin Comfort Feel Control Power Durability Compared to: n/a Satisfied? This string plays unbelievable on Wilson nSix-One 95 18x20 stringbed. Be sure to string it AT LEAST 5% below your usual poly tension, preferrably", "textAfterTable": "Please log in to be able to post a comment. Tester jenks (1), 2007-03-08   male seniors team player upper league, serve & volley game Test Conditions Tension Racquet 52/52 lbs Babolat Pure Drive Team (MP, 16/19) Absolute Rating Durability Power Control Feel Comfort Spin Tension Stability n.a. What a waste of money. I can see why this string is so cheap. It's like playing with a wet sponge. Had it taken out and replaced in the first week. Don't bother. Satisfied? Compared to: n/a Durability", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}