{"relation": [["Author", "ozwalled", "ozwalled", "ozwalled", "ozwalled", "ozwalled"], ["Title", "Punked-Out Sharks", "Mr. Molecule Trapped in a Crystal", "Handsome Tom", "Criminal Caterpillar", "Psychic Psycho"], ["Description", "\"Ness dealt some good damage!\" I really had a lot of fun doing this one, and I think it turned out to be fun to look at as a result.", "\"Help!\" Mr. Molecule is one of those enemies that just about anyone could draw, due to its simplicity. I wanted to draw him too, but do something different. I thought about trying to assemble a large, compound mollectule out of Mr. Mollecules but decided against it, figuring it'd be better suited at a 3D artist. So I decided on a regular formation of Mr. Mollecules, to form a magnified bit of crystal. I made the \"atom\" balls a bit on the blurry side to illustrate the \"whirlingness\" of their electrons. ;P", "\"Handsomely Handsome Puppet\". I'm a big fan of Threed's Handsome Tom. Sure, it was merely an alternate palette version of Smilin' Sam, but come ON! He's a puppet/ dummy that has purple skin and white hair. How creepy is THAT? And how creepy is the person who'd have made him? Handsome Tom is cool.", "\"Don't get the gray swirl!\". A Criminal Catepillar on a desert background (which was fun to draw). I still can't believe that I forgot to draw his arms. x_x", "\"But it's the Major one you want to fight.\" I'd started this one pondering the idea that the Psychic Psycho wasn't so much on fire, but that his suit has become a sort of psyonically-generated living flame. Well, I goofed somehwere along the way in drawing it and saved it as a png and its layers weren't preserved... Oh well. I abandonned it but submitted it anyway, 'cause it still was looking kinda' cool."], ["Date", "4/26/05", "4/27/05", "4/26/05", "4/27/05", "4/27/05"], ["Rank", "0.00", "0.00", "0.00", "8.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=22092&stuff=DescDESC&stuffPageNumber=108", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00331-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 221617988, "recordOffset": 221609786, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> Z Y W U T S R P O N M L K J I H G F E D C B A 8 7 < Other Submissions by ozwalled A small sketch of a Gang Zombie, from Mother 1. This image has been resized for your convenience. Click on it to view the full size version. Gang Zombie Gang Zombie - by ozwalled  Mother1", "textAfterTable": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}