{"relation": [["Artist", "Lenny Kravitz", "Norah Jones"], ["Song Title", "Heaven Help", "Happy Pills"], ["Played When", "Start of episode", "Kate moves into her new apartment"]], "pageTitle": "Fairly Legal Season 2 Episode 13 - Finale (2x13) - Watch Online - s2 e13 Spoilers", "title": "", "url": "http://www.tvrage.com/Fairly_Legal/episodes/1065154039", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00258-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 796617279, "recordOffset": 796601323, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Music Read the full recap Recap The episode begins with Kate waking up in Justin’s bed; looking confused and unsure about her feelings. Next, Kate reaches office and tells Leo that she and Justin are moving in together and that she needs him to find her an apartment. Ben hears this and suggests that they shouldn’t be renting an apartment; instead they should buy it. Leo reminds her that her nine o’clock appointment is arrived. She asks them to leave. Kate is still confused about Ben. Next, her today’s case is about two lesbian partners who were fired from work for fraternizing at work place. But the girls’ lawyer claims that Real Time News Network fired them because they are gay. The lawyer admits that Nora, is an anchor and Rachael was a research and analyst intern. .. Leonardo Prince As Baron Vaughn Ben Grogan As Ryan Johnson (1) Lauren Reed As Virginia Williams Justin Patrick As Michael", "textAfterTable": "Other Episode Crew Click here to add other crew for Finale Missing Information Click here to add Episode Notes Click here to add Episode Quotes Click here to add Episode Goofs Click here to add Cultural References Click here to add Episode References Click here to add Analysis   Flash Show Menu General Info Forum Episode List Episode Guide Printable Guide Cast Recurring Guests Stats Links (2) Credits Contribute Submit Trivia Character Guide (0) Show Tidbits (0) Gallery (0) Empty Sections", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}