{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Man of Steel", "The Air That I Breathe", "Woman On the Run", "She Had Me", "Midnight Rider", "Lovesick Blues", "Queen of My Heart", "Now I Know How George Feels", "It Just Don't Get It No More", "Orange Blossom Special"], ["Artist", "Hank Williams, Jr.", "Hank Williams, Jr.", "Hank Williams, Jr.", "Hank Williams, Jr.", "Hank Williams, Jr.", "Hank Williams, Jr.", "Hank Williams, Jr.", "Hank Williams, Jr.", "Hank Williams, Jr.", "Hank Williams, Jr."], ["Time", "4:36", "4:03", "3:17", "2:06", "2:51", "2:11", "3:46", "2:43", "2:48", "5:55"], ["Price", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Man of Steel - Original Classic Hits, Vol.10 by Hank Williams, Jr.", "title": "", "url": "https://itunes.apple.com/lv/album/lovesick-blues/id73995832?i=73995764", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00274-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 875186223, "recordOffset": 875156981, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{122073=Autortiesības © 2014 Apple Inc. Visas tiesības aizsargātas., 20597=Born: 26 May 1949 in Shreveport, LA}", "lastModified": "Fri, 31 Jul 2015 07:26:39 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Hank Williams, Jr. Man of Steel - Original Classic Hits, Vol.10 iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Man of Steel - Original Classic Hits, Vol.10 by Hank Williams, Jr., download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open,", "textAfterTable": "10 Songs Album Review Man of Steel is a bit of a disappointing album from Hank Williams, Jr. Even though the record contains a few hits, including the title cut and his father's classic \"Queen of My Heart,\" the majority of the material lacks the Bocephus edge. Songs like \"The Air That I Breathe\" by the Hollies or the Allman Brothers' \"Midnight Rider\" may have been too well-known in their original incarnations to allow Williams to really add anything new to them. Not a failure, but not one of his best from the '80s. Biography Born: 26 May 1949 in Shreveport, LA Genre: Country Years Active: '50s, '60s, '70s, '80s, '90s, '00s, '10s The offspring of famous musicians often have a hard time creating a career for themselves, yet Hank Williams, Jr. is one of the few to develop a career that is not only successful, but markedly different from his legendary father. Originally, Hank Jr. simply copied and played his father's music, but as he grew older, he began to carve out his own niche and it was one that owed as much to country-rock as it did to honky tonk. In the late '70s, he retooled his image to appeal both to", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}