{"relation": [["Title", "A brief guide to the assessment and treatment of alcohol dependence", "A framework for supporting the implementation of community-based alcohol primary prevention and early intervention", "Aboriginal alcohol and other drugs worker resource: a guide to working with our people, families and communities", "Aboriginal practice checklist: a cultural assessment tool for MERIT teams", "Alcohol and other drug treatment services national minimum data set 2010-11: specifications and collection manual", "Alcohol and Other Drug Treatment Services National Minimum Data Set 2011-12: specifications and collection manual", "Alcohol and other drug treatment services NMDS 2009–10: specifications and collection manual", "Alcohol and other drug treatment services NMDS specifications 2007–08: data dictionary, collection guidelines and validation processes", "Alcohol and other drug treatment services NMDS specifications 2008–09: data dictionary, collection guidelines and validation processes", "Alcohol and other drug withdrawal practice guideline", "Alcohol and other drug withdrawal practice guidelines: acute inpatient and residential services", "Alcohol and other drugs assessment clinicians' booklet", "Alcohol screen (audit)", "Alcohol, tobacco and other drugs prevention statement", "Alcohol, tobacco and other drugs: clinical guidelines for nurses and midwives: version 3", "Australian guidelines to reduce health risks from drinking alcohol", "Australian guidelines to reduce health risks from drinking alcohol: from research to practice", "Can I ask...? An alcohol and drug clinician's guide to addressing family and domestic violence", "Clinical guidelines for nursing and midwifery practice in NSW: identifying and responding to drug and alcohol issues", "Clinical management of Aboriginal people with co-existing diabetes and alcohol related health problems: a review, final report", "Comorbidity of mental disorders and substance use: a brief guide for the primary care clinician", "Complex needs capable: a practice resource for drug and alcohol services", "Drug and alcohol psychosocial interventions professional practice guidelines", "Drug and alcohol treatment guidelines for residential settings", "Drug prevention work with Indigenous Australian clients and communities", "Evidence based practice indicators for alcohol and other drug interventions: literature review", "Evidence based practice indicators for alcohol and other drug interventions: summary", "Good practice toolkit", "Guidelines for the management of substance use during pregnancy birth and the postnatal period", "Guidelines for the treatment of alcohol problems", "Guidelines on the management of co-occurring alcohol and other drug and mental health conditions in alcohol and other drug treatment settings", "Handbook for Aboriginal alcohol and drug work", "Harmful substance use and mental health", "Healthy living", "Indigenous risk impact screen and brief intervention project: screening instrument", "Interagency guidelines for the early intervention, response and management of drug and alcohol misuse", "Koori practice checklist: a cultural audit tool for the alcohol and other drugs service sector", "Learning from each other: working with Aboriginal and Torres Strait Islander Young People: youth alcohol and drug practice guide", "Making sense of Australia's alcohol guidelines", "Mental health reference resource for drug and alcohol workers", "MERIT residential treatment guidelines", "National clinical guidelines for the management of drug use during pregnancy, birth and the early development years of the newborn", "National guide to a preventive health assessment for Aboriginal and Torres Strait Islander people: second edition", "No one size fits all: alcohol treatment guidelines for Indigenous Australians [DVD]", "NSW clinical guidelines: for the care of persons with comorbid mental illness and substance use disorders in acute care settings", "NSW drug and alcohol withdrawal clinical practice guidelines", "Our Healing Ways: putting wisdom into practice: working with co-existing mental health and drug and alcohol issues: Aboriginal way", "Our Healing Ways: supervision: a culturally appropriate model for Aboriginal workers", "Primary clinical care manual: 8th edition", "Problem drinking: guidelines for providing mental health first aid to an Aboriginal or Torres Strait Islander person", "Queensland Health dual diagnosis clinical guidelines and clinicians tool kit", "Quick reference guide to the treatment of alcohol problems: companion document to The Guidelines for the Treatment of Alcohol Problems", "Standard for culturally secure practice (alcohol and other drug sector): (final draft for consultation)", "Supporting pregnant women who use alcohol or other drugs: a review of the evidence", "The AUDIT alcohol consumption questions (Audit – C): an effective brief screening test for problem drinkers", "The culturally secure Aboriginal and Torres Strait islander recruitment and retention guide", "The relationship between alcohol and drugs and mental health: a resource book for Aboriginal workers", "Trauma-informed treatment guide for working with women with alcohol and other drug issues", "Treating alcohol problems: guidelines for alcohol and drug professionals", "Treating alcohol problems: guidelines for general practitioners", "Treating alcohol problems: guidelines for hospital staff", "Tucker talks tips: healthy drinking guidelines", "Working together: Aboriginal and Torres Strait Islander mental health and wellbeing principles and practice", "Youth alcohol and drug practice guide 2: legal and ethical dimensions of practice", "Youth alcohol and drug practice guide: practice strategies and interventions"], ["Year", "2012", "2009", "2005", "2010", "2010", "2011", "2009", "2008", "2008", "2009", "2011", "2011", "2003", "2009", "2012", "2009", "2009", "2013", "2013", "2004", "2009", "2013", "2008", "2007", "2004", "2007", "2007", "2012", "2014", "2009", "2009", "2012", "2014", "2010", "2011", "2005", "2007", "2014", "2009", "2007", "2007", "2006", "2012", "2007", "2009", "2008", "2012", "2012", "2013", "2008", "2010", "2009", "2011", "2014", "2011", "2011", "2012", "2011", "2004", "2004", "2004", "2011", "2014", "2012", "2013"], ["Author", "Next Step Drug and Alcohol Services Drug and Alcohol Office Workforce Development Branch", "Seldon, S.", "Casey, W. Keen, J. McGuire (Mullark), B. Bayly, P.", "Aboriginal Health and Medical Research Council of NSW", "Australian Institute of Health and Welfare", "Australian Institute of Health and Welfare", "Australian Institute of Health and Welfare Blakey-Fahey, K.", "Australian Institute of Health and Welfare", "Australian Institute of Health and Welfare", "Kenny, P. Swan, A. Berends, L. Jenner, L. Hunter, B. Mugavin, J", "Cementon, E.", "Drug and Alcohol Office", "Australian Department of Veteran Affairs", "Alcohol, Tobacco and Other Drugs Prevention Unit", "de Crespigny, C. Talmet, J.", "National Health and Medical Research Council", "McClean, R.", "White, M. Roche, A. Nicholas, R. Long, C. Gruenert, S. Battams, S.", "Mental Health and Drug and Alcohol Office", "de Crespigny, C. Groenkjaer, M. King, M. Van Loon, A.", "Gordon, A.", "Network of Alcohol and other Drugs Agencies", "New South Wales Mental Health and Drug and Alcohol Office", "New South Wales Mental Health and Drug and Alcohol Office", "DrugInfo Clearinghouse", "Marsh, A. Dale, A. Willis, L.", "Marsh, A. Dale, A. Willis, L.", "Crane, P. Buckley, J. Francis, C.", "NSW Mental Health and Drug and Alcohol Office", "Haber, P. Lintzeris, N. Proude, E. Lopatko, O.", "Mills, K.L. Deady, M. Proudfoot, H. Sannibale, C. Teesson, M. Mattick, R. Burns, L.", "Lee, K. Freeburn, B. Ella, S. Miller, W. Perry, J. Conigrave, K.", "Wilkes, E. Gray, D. Casey, W. Stearne, A. Dadd, L.", "Kimberley Aboriginal Medical Services Council WA Country Health Service", "Queensland Health", "New South Wales Department of Health", "Ngwala Willumbong Co-operative", "Encompass Family and Community", "Roche, A.M.", "New South Wales Department of Health", "Mental Health and Drug and Alcohol Office", "New South Wales Department of Health", "National Aboriginal Community Controlled Health Organisation Royal Australian College of General Practitioners", "Rural Health Education Foundation", "New South Wales Department of Health", "Mental Health and Drug & Alcohol Office", "Victorian Dual Diagnosis Education and Training Unit", "Victorian Dual Diagnosis Education and Training Unit", "Queensland Health Royal Flying Doctor Service (Queensland Section)", "Mental Health First Aid Australia", "Queensland Health", "Haber, P. Lintzeris, N. Proude, E. Lopatko, O.", "Western Australian Network of Alcohol and Other Drug Agencies", "Breen, C. Awbery, E. Burns, L.", "Northern Territory Department of Health", "Western Australian Network of Alcohol and Other Drug Agencies", "Victorian Dual Diagnosis Education and Training Unit", "Marsh, A. Towers, T. O’Toole, S.", "Shand, F. Gates, J.", "Shand, F. Gates, J.", "Shand, F. Gates, J.", "Victorian Aboriginal Community Controlled Health Organisation", "", "Crane, P.R.", "Crane, P. Francis, C. Buckley, J."], ["Type", "Report", "Report", "Flipchart", "Checklist", "Report", "Report", "Handbook", "Report", "Report", "Report", "Report", "Handbook", "Checklist", "Report", "Report", "Report", "Journal article", "Report", "Report", "Report", "Report", "Booklet", "Report", "Report", "Factsheet", "Report", "Report", "Resource package", "Report", "Report", "Report", "Handbook", "Book section", "Brochure", "Checklist", "Report", "Checklist", "Report", "Factsheet", "Report", "Report", "Report", "Report", "Audiovisual", "Report", "Report", "Report", "Report", "Report", "Factsheet", "Report", "Booklet", "Report", "Report", "Factsheet", "Report", "Report", "Handbook", "Booklet", "Booklet", "Booklet", "Leaflet", "Edited book", "Report", "Report"]], "pageTitle": "Guidelines « Health Practice resources « Alcohol « AOD Knowledge Centre « Australian Indigenous HealthInfoNet", "title": "", "url": "http://www.healthinfonet.ecu.edu.au/print/3997", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00236-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 477787089, "recordOffset": 477778887, "tableOrientation": "HORIZONTAL", "textBeforeTable": "If you have information you would like to have included on this page please contact us. When you click on one of the headings of the table, the list will be sorted according to that heading. For more information about the resource, click on the title. » Guidelines » Health Practice resources » Alcohol » AOD Knowledge Centre Home Guidelines   http://www.healthinfonet.ecu.edu.au Close Print", "textAfterTable": "  © 2001-2015 Australian Indigenous Health InfoNet", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}