{"relation": [["Author", "Ostara", "Gabbi", "YasminM", "total_stranger", "SunTyger", "JesusKetchum31", "YasminM", "Zen444", "Moira", "PhantomSith"], ["Message", "Kids Site? O.oWoooops someone just informed me this is a site for cough younger writers. (hence the name?) Shouldn't that sort of thing be posted so no inappropriate material is put up? Posted at 2005-08-19 2:55", "Yeah...Yeah I noticed there's mostly younger people here so far. If you're older I would suggest putting your stories on AFF, since people on FictionPress don't review. I would say the biggest clues would be the name \"FicWad\" (wtf?) the high concentration of fics for kid's shows/games/books, and the fact that this section of the forum is called \"The Melting Pot\" Oh, and let's not forget the confirmation email says \"Happy ficcing\" Anyways, AFF is great for reviews, and most people there are older so they actually have valuable advice for you (unlike here, I noticed) Good luck!~ Gabbi Posted at 2005-08-19 3:10", "Um, no. SunTyger and Kemayo will be able to fill you in better, but FicWad is NOT a site for younger writers. I don't see how anyone could have had that impression from the phrase \"happy ficcing\", unless you have something against archive admins who actually try to make people feel welcome. I'm over 20, and so are a large number of writers I personally know who are archived here. The highest concentration of fics, incidentally, is in the Anime/Manga category. Anime and manga encompass all kinds of genre and all age groups -- \"Love Mode\" and \"Sex Pistols\", for example, are adult, sexually-explicit manga. Posted at 2005-08-19 5:32", "Whew, some shaky logic here. Not at all sure how 'FicWad' 'Melting Pot' and 'happy ficcing' point towards a younger writer base. (If you want the conclusion I'd draw from those three pieces of information, it's that the site designers were having fun when they were making it, and possibly that they tend to make the odd in-joke). Gabbi, evidence for the lack of 'valuable advice'? From what I've seen the site's very new, but the systems that are in place should tend to encourage useful reviewing & rating. My snap forcast on author age range - modal value mid 20s. Forum usage might be a shade younger. Posted at 2005-08-19 9:38", "Oh, look--it's our first troll! I feel so proud.... For the benefit of anyone who's wondering, FicWad does not market to any particular age group; however, when new users sign up, they are asked to confirm that they are age 13 or older. We have nothing against younger writers, but we cannot allow users under 13 to use the site due to the Children's Online Privacy Protection Act (COPPA), which prohibits websites from collecting any personal information from children under 13. If we collected so much as an email address, that would open us up to legal action and fines. Incidentally, through my Godly Modly Powers [TM], I am able to divine that our friends \"Ostara\" and \"Gabbi\" are in fact the same person. The user has been notified that the duplicate account will be deleted in 24 hours. We are also updating our Terms of Service to more clearly state that duplicate accounts are not allowed (it is not explicitly stated at the moment, and it should be, but duplicate accounts unquestionably violate the spirit of the terms). Feel free to plug another site in our forums if you wish (there's nothing wrong with a little cross-promotion, after all), but doing it through misleading tactics like this is unnecessary and unethical, and we don't like it much. You should be ashamed. Posted at 2005-08-19 9:56", "And a dumb troll, too!Apparently they didn't see all the NC-17 stories in the Harry Potter section. LOL. Posted at 2005-08-19 15:49", "Oh, you know those cunning NC-17 HP fics. Always hiding in the vegetable crisper. XD Posted at 2005-08-20 0:03", "^ XD Good one. Posted at 2005-10-05 21:23", "just curious though, IS there a fanfiction or original fic site just for kids? (and by kids I mean 18 below who aren't allowed into the hallowed circles of the worldly wise.) Posted at 2005-10-10 3:02", "I know a few sites for Star Wars Luke/Vader sites that are kid friendly. But I know nothing of kid friendly fanfiction sites other then that. I can look though. Posted at 2005-11-15 9:42"]], "pageTitle": "FicWad: fresh-picked original and fan fiction", "title": "", "url": "http://ficwad.com/forum/topic/138", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00086-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 87511170, "recordOffset": 87502968, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{6757=Site design Copyright 2005, K&D Lynch. All stories contained in this archive are the property of their respective authors, and the owners of this site claim no responsibility for their contents.}", "textBeforeTable": "» 2 1 « Home > The Melting Pot > Kids Site? O.o Lost password Register Log in Remember me Log in ▼ Sign up to adjust the filter You won't see stories with a lower score when you browse or search. Filter Filter: 0 Help Forum Search Browse FicWad", "textAfterTable": "« 1 2 » Site design Copyright 2005, K&D Lynch. All stories contained in this archive are the property of their respective authors, and the owners of this site claim no responsibility for their contents. Page created in 0.0483 seconds", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}