{"relation": [["", "1", "2", "3", "4", "5"], ["Name", "I'd Really Love to See You Tonight", "Nights Are Forever Without You", "Love Is the Answer (Single Version)", "It's Sad to Belong (Single Version)", "We'll Never Have to Say Goodbye Again (Single Version)"], ["Artist", "England Dan Seals & John Ford Coley", "England Dan & John Ford Coley", "England Dan Seals & John Ford Coley", "England Dan Seals & John Ford Coley", "England Dan & John Ford Coley"], ["Time", "2:40", "2:54", "4:43", "2:53", "2:53"], ["Price", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Rhino Hi-Five: England Dan & John Ford Coley - EP by England Dan & John Ford Coley", "title": "", "url": "https://itunes.apple.com/us/album/love-is-answer-single-version/id80002310?i=80002207&ign-mpt=uo%3D4", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00197-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 868148571, "recordOffset": 868124133, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{115112=Copyright © 2014 Apple Inc. All rights reserved., 12808=Fear not, I don't think you are being short-changed with the \"single version\". I'm not sure why they hang that terminology on there when the running time is the same as the album version (give or take 1 to 5 seconds), especially with \"Love Is The Answer\" (The listing I'm looking at from my copy of the \"Best of\" album says 4:42, actually). If there had been an album/longer version of any of these five songs, I would have remembered it. That's the kind of geek I am.}", "lastModified": "Fri, 31 Jul 2015 08:35:53 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist England Dan & John Ford Coley Rhino Hi-Five: England Dan & John Ford Coley - EP iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Rhino Hi-Five: England Dan & John Ford Coley - EP by England Dan & John Ford Coley, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the", "textAfterTable": "5 Songs Customer Reviews Too bad we only get the \"single version\"           by Cebuano Steve G I'm glad to see that England Dan & John Ford Coley have finally arrived in the iTunes music store. However, I notice my two favorite songs, \"It's Sad to Belong...\" and \"Love Is the Answer\" are specified as \"Single Version.\" If longer versions of these songs exist, I hope the music store can somehow make them available in the future. I feel that we are being short-changed when this Hi-Five album only provides the \"AM radio\" versions. Single version           by Ribeye Lover Fear not, I don't think you are being short-changed with the \"single version\". I'm not sure why they hang that terminology on there when the running time is the same as the album version (give or take 1 to 5 seconds), especially with \"Love Is The Answer\" (The listing I'm looking at from my copy of the \"Best", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}