{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13"], ["Name", "It Will Be Me", "Word of God Speak", "Because He Lives", "Abide In Me", "Borrowed Angels", "There Will Never Be Another", "Poor, Wayfaring Stranger", "Joyful, Joyful", "The Song Remembers When", "Power", "Just As I Am", "Upon This Rock", "Taylor, The Latte Boy"], ["Artist", "Kristin Chenoweth, Christine Dente, Jerry McPherson, Jan Harris, Angela Cruz, Gary Burnett, Ken Lewis, John Hammond, Sr., Jeff Roach & Jimmy Lee", "Kristin Chenoweth, Jerry McPherson, Joy Wise, Gary Burnett, Brandon Harris, Dan Dugmore, Kent Hooper, Ken Lewis, John Hammond, Sr., Jeff Roach, Taylor Harris, David Davidson, Jimmy Lee & Matt Slocum", "Kristin Chenoweth, Christopher Harris, Felicia Sorenson, Gary Burnett, Ron Robinson, John Hammond, Sr., Joshua Yudkin & Jimmy Lee", "Kristin Chenoweth, Christopher Harris, Joy Wise, Jan Harris, Christine Dente, Brandon Harris, Gary Burnett, Scott Dente, Dan Dugmore, Ken Lewis, John Hammond, Sr., Jeff Roach, Taylor Harris & Jimmy Lee", "Kristin Chenoweth, Christine Dente, Jan Harris, Tom Howard, Angela Cruz, Gary Burnett, Jerry McPherson, Scott Dente, Ken Lewis, John Hammond, Sr., Jeff Roach, Prague Symphony Orchestra, Debi Selby, Nissi Walls, Melinda Doolittle, Delores Cox, Drew Cline, Cedric Williams, Jason Eskridge, Jimmy Lee & Cindy Wyatt Renolds", "Kristin Chenoweth, Christopher Harris, Jan Harris, Jerry McPherson, Joy Wise, Christine Dente, Gary Burnett, Scott Dente, Ken Lewis, John Hammond, Sr., Jeff Roach & Jimmy Lee", "Kristin Chenoweth, Christopher Harris, Christine Dente, Jerry McPherson, Joy Wise, Gary Burnett, Dan Dugmore, David Davidson, Ken Lewis, Jimmy Lee & Brandon Harris", "Kristin Chenoweth, Tim Davis Singers, Tom Howard, Jerry McPherson, Ken Lewis, Phillip Keveren, Prague Symphony Orchestra & Jennifer Kummer", "Kristin Chenoweth, Christopher Harris, Christine Dente, Jerry McPherson, Jan Harris, Dan Dugmore, John Hammond, Sr., Jeff Roach & Jimmy Lee", "Kristin Chenoweth, Ashley Anderson, Anna Flautt, Joy Wise, Jerry McPherson, Nissi Walls, Gary Burnett, Brandon Harris, Ken Lewis, John Hammond, Sr., Jeff Roach & Jimmy Lee", "Kristin Chenoweth, Jan Harris, Christine Dente, Angela Cruz, Brandon Harris, David Davidson, Dan Dugmore & Mary-Mitchell Campbell", "Kristin Chenoweth, Jerry McPherson, Tim Davis Singers, Tom Howard & Prague Symphony Orchestra", "Kristin Chenoweth, Mary-Mitchell Campbell & Matt Slocum"], ["Time", "3:57", "3:15", "4:56", "5:09", "4:02", "3:59", "5:09", "3:29", "3:55", "4:20", "3:42", "4:44", "4:05"], ["Price", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €", "0,69 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - As I Am by Kristin Chenoweth", "title": "", "url": "https://itunes.apple.com/cz/album/as-i-am/id208299246", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00153-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 862421543, "recordOffset": 862391594, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{131446=Copyright © 2014 Apple Inc. Všechna práva vyhrazena., 33497=Born: 24 July 1968 in Broken Arrow, OK, 31475=Kristin Chenoweth's 2001 album was a collection of standards that showcased her winning soprano and remarkable ability to shift from Broadway brassy to \"My Funny Valentine\" sultry at the turn of a note. Let Yourself Go was a great follow-up to her 1999 Tony win for You're a Good Man, Charlie Brown. But since then Chenoweth has branched out from Broadway, particularly into acting (she joined the cast of West Wing in 2004), and As I Am reflects her higher profile. It's a personal album that mixes country and adult contemporary instrumentation in a set featuring hymnal book standards and contemporary Christian favorites. Chenoweth herself is pictured in relaxed cotton separates — every bit the attractive, approachable celebrity — and there isn't a Broadway tune in the bunch. As I Am begins with \"It Will Be Me.\" A pedal steel helps the 1999 Faith Hill tune retain its country-pop feel, but there's also a slickness suitable to Chenoweth's flawless vocal. \"Because He Lives\" has a similar modern country sheen, while \"Joyful, Joyful\"'s rich arrangement for strings and piano gives the vocalist a stage for a little of that Broadway expression. Diane Warren's pristine \"Borrowed Angels\" is destined for lite FM radio, and Chenoweth dedicates \"There Will Never Be Another\" to Amy Grant. Though its slickness is suited to the material, As I Am can also seem to flutter inside its own perfect globe, untouched by the elements and radiant as Chenoweth's golden hair. That's why a version of the traditional \"Poor, Wayfaring Stranger\" is so refreshing with its warm B-3 tones and subtly expressive vocal, and the fun closer \"Taylor, the Latte Boy\" — about Kristin's crush on her Starbucks barista — is so important. These songs further personalize As I Am; they add a layer of realness to its shiny dedications of faith.}", "lastModified": "Fri, 31 Jul 2015 08:56:36 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Kristin Chenoweth As I Am iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from As I Am by Kristin Chenoweth, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "13 Songs Album Review Kristin Chenoweth's 2001 album was a collection of standards that showcased her winning soprano and remarkable ability to shift from Broadway brassy to \"My Funny Valentine\" sultry at the turn of a note. Let Yourself Go was a great follow-up to her 1999 Tony win for You're a Good Man, Charlie Brown. But since then Chenoweth has branched out from Broadway, particularly into acting (she joined the cast of West Wing in 2004), and As I Am reflects her higher profile. It's a personal album that mixes country and adult contemporary instrumentation in a set featuring hymnal book standards and contemporary Christian favorites. Chenoweth herself is pictured in relaxed cotton separates — every bit the attractive, approachable celebrity — and there isn't a Broadway tune in the bunch. As I Am begins with \"It Will Be Me.\" A pedal steel helps the 1999 Faith Hill tune retain its country-pop feel, but there's also a slickness suitable to Chenoweth's flawless vocal. \"Because He Lives\" has a similar modern country sheen, while \"Joyful, Joyful\"'s rich arrangement for strings and piano gives the vocalist a stage for a little of that Broadway expression. Diane Warren's pristine \"Borrowed Angels\" is destined for lite FM radio, and Chenoweth dedicates \"There Will Never Be Another\" to Amy Grant. Though its slickness is", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}