{"relation": [["Subject", "Re: [gentoo-releng] Livecd building with catalyst", "Re: [gentoo-releng] Livecd building with catalyst"], ["Author", "Jason Wever", "Brad House"]], "pageTitle": "[gentoo-releng] Livecd building with catalyst - gentoo-releng - Gentoo Mailing List Archives", "title": "", "url": "https://archives.gentoo.org/gentoo-releng/message/029f4db42c9d9a2c9a1ccbea2b7f3ed1", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00248-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 859436730, "recordOffset": 859428528, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Replies gentoo-releng@g.o mailing list -- Lug Charleroi (Belgium) Gentoo Linux - HPPA port Lead / IPv6 team Guy Martin -- Cheers Also, I have exams soon (from 3 Jan to 17) and I'd like to finish this asap because that's the only way I can be in the release time. If not, I really must be implemented soon because building and testing livecd is _REALLY_ a long/hard/boring task for me. How is it done ? Is it yet implemented ? I just started to build new stages for hppa with catalyst but I don't see any doc for livecd building. Hello,  20031216150455.1f6ace1e.gmsoft@gentoo.org Message-Id: Tue, 16 Dec 2003 08:05:06 Date: [gentoo-releng] Livecd building with catalyst Subject: gentoo-releng@g.o To: Guy Martin <gmsoft@g.o> From: Gentoo Archives: gentoo-releng gentoo-releng All Archives Home Toggle navigation Archives Infra Status", "textAfterTable": "Report Message Find on GMANE Find on MARC All times displayed are UTC (GMT+0). Contents reflect the opinion of the author, not the Gentoo project or the Gentoo Foundation. Questions or comments? Please feel free to contact us. © 2001–2015 Gentoo Foundation, Inc. Gentoo is a trademark of the Gentoo Foundation, Inc. The contents of this document, unless otherwise expressly stated, are licensed under the CC-BY-SA-3.0 license. The Gentoo Name and Logo Usage Guidelines apply.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}