{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13"], ["Name", "And Winter Came", "Journey of the Angels", "White Is In the Winter Night", "O Come, O Come Emmanuel", "Trains and Winter Rains", "Dreams Are More Precious", "Last Time By Moonlight", "One Toy Soldier", "Stars and Midnight Blue", "The Spirit of Christmas Past", "My! My! Time Flies!", "Oíche Chiúin", "VideoAnd Winter Came (Track By Track Video)"], ["Artist", "Enya", "Enya", "Enya", "Enya", "Enya", "Enya", "Enya", "Enya", "Enya", "Enya", "Enya", "Enya", "Enya"], ["Time", "3:15", "4:47", "3:00", "3:40", "3:44", "4:25", "3:57", "3:54", "3:08", "4:18", "3:02", "3:49", "13:35"], ["Price", "0,99 €", "0,99 €", "0,99 €", "1,29 €", "1,29 €", "0,99 €", "0,99 €", "0,99 €", "1,29 €", "0,99 €", "1,29 €", "1,29 €", "Album Only"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - And Winter Came by Enya", "title": "", "url": "https://itunes.apple.com/si/album/and-winter-came/id295597610", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00280-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 876665467, "recordOffset": 876635560, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{26138=Born: 17 May 1961 in Gaoth Dobhair, Donegal, Ireland, 123914=Copyright © 2014 Apple Inc. All rights reserved., 24062=In 2006 Enya released her most subtle and song-oriented album to date. Amarantine may have paled in comparison to Watermark or Shepherd Moons, but its under-produced (in Enya-world) balladry was a small leap forward for the reclusive Irish superstar. 2008's And Winter Came follows in the same footsteps as Amarantine, but it hints at the grandeur of earlier recordings, specifically 1994's Christmas EP. Enya's ferociously multi-tracked recording style lends itself well to the season, filling in the simplistic lyrical holes with small avalanches of vocal harmonies and the dated but reliable keyboard patches that have come to define the singer/composer's work over the years. Enya, lyricist Roma Ryan, and producer Nicky Ryan have crafted a pleasant little snow globe of an album that sounds exactly like one would expect from the longtime collaborators. For the most part the formula is intact, boasting a soft Edward Scissorhands-inspired intro, copious amounts of secular and non-secular ballads (all original), and two or three upbeat, midtempo jams to break the stillness. Of the former, the lovely and reverent \"Come, O Come, Emmanuel\" is the most effective, while the galloping \"White Is in the Winter Night\" leads the pack for the latter. There are copious amounts of \"stars in the skies\" and \"bells ringing,\" and even a surprising left turn (maybe even a complete u-turn) near the end on \"My! My! Time Flies!,\" a straight-up \"Beatlesque\" pop tune with drums and a screaming guitar solo that sounds like something off of a late-'60s Bee Gees record. As usual, Enya fans will be pleased with the results while non-believers will find that the same arguments against her are still valid, but in the end And Winter Came is an undeniably welcome addition to the holiday season, if only for its effortless, white, spray-painted pinecone elegance and potpourri-scented, gift shop comforts.}", "lastModified": "Fri, 31 Jul 2015 07:57:34 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Enya And Winter Came iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from And Winter Came by Enya, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "13 Items Album Review In 2006 Enya released her most subtle and song-oriented album to date. Amarantine may have paled in comparison to Watermark or Shepherd Moons, but its under-produced (in Enya-world) balladry was a small leap forward for the reclusive Irish superstar. 2008's And Winter Came follows in the same footsteps as Amarantine, but it hints at the grandeur of earlier recordings, specifically 1994's Christmas EP. Enya's ferociously multi-tracked recording style lends itself well to the season, filling in the simplistic lyrical holes with small avalanches of vocal harmonies and the dated but reliable keyboard patches that have come to define the singer/composer's work over the years. Enya, lyricist Roma Ryan, and producer Nicky Ryan have crafted a pleasant little snow globe of an album that sounds exactly like one would expect from the longtime collaborators. For the most part the formula is intact, boasting a soft Edward Scissorhands-inspired intro, copious amounts of secular and non-secular ballads (all original), and two or three upbeat, midtempo jams to break the stillness. Of the former, the lovely and reverent \"Come, O Come, Emmanuel\" is the most effective, while the galloping \"White Is in the Winter Night\" leads the pack for the latter. There are copious amounts of \"stars in the skies\" and \"bells ringing,\" and even a surprising left turn (maybe", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}