{"relation": [["Author", "Author", "salty Private Message Oct 5 2013 at 9:32am #", "stefb Private Message Oct 5 2013 at 10:22am #", "RustyRed Private Message Oct 5 2013 at 11:30am #", "Vannevar Private Message Oct 5 2013 at 1:03pm #", "Mick Private Message Oct 7 2013 at 10:53am #", "Vannevar Private Message Oct 7 2013 at 12:00pm #"], ["Posts", "Posts", "Screw the cleveland rivalry, this one hurts… How do we get us some of that? http://stlouis.cbslocal.com/2013/10/04/st-louis-to-get-100-miles-of-additional-upgraded-bike-lanes/", "Very jealous", "Nice, but they have incredibly wide streets downtown compared to our roads. Ideal for adding a bike lane.", "That urban network will eventually interface with the eastern end of the Katy Trail. And Amtrak with RORO service. very awesome.", "I recall reading a blog from STL where the blogger claimed they couldn’t have bike infrastructure because there streets were too wide. It was a WTF? moment. It’s the center of the country. I think it’s wonderful. When are we going to link up the GAP and the Katy?", "Mick wrote:When are we going to link up the GAP and the Katy? The link between the GAP and the Katy is further along than you might think. GAP – Montour Trail – Panhandle Trail. We rode the Katy in the spring. It’s awesome. Cool Fact: the railroad abandoned the Katy route because of the frequent periodic flooding. The area still floods in a major way. The locals repair the trail quickly, and they’ve embraced the trail economy in a big way. On the eastern end of the Katy, they’er developing what they call the Missouri Rhine Valley – B&B’s and wineries."]], "pageTitle": "Bike Pittsburgh | Topic: feds spring for $1.1M of bike lanes in STL", "title": "", "url": "http://bikepgh.org/mb/topic/feds-spring-for-1-1m-of-bike-lanes-in-stl/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00247-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 22561741, "recordOffset": 22545347, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{1541=http://stlouis.cbslocal.com/2013/10/04/st-louis-to-get-100-miles-of-additional-upgraded-bike-lanes/}", "textBeforeTable": "  ← Forums Home Viewing 6 posts - 1 through 6 (of 6 total) This topic contains 5 replies, has 5 voices, and was last updated by  Vannevar 1 yr, 9 mos. feds spring for $1.1M of bike lanes in STL Monthly emails, no SPAM. Newsletter Signup Instagram Pinterest Flickr Facebook Twitter Google Plus Login Search Bike Racks", "textAfterTable": "Viewing 6 posts - 1 through 6 (of 6 total) ← Forums Home   You must be logged in to reply to this topic. Become a Member Volunteer Newsletter Subscribe to our mailing list Monthly emails, no SPAM. Search the Forums Search Sponsors Web Design by ClickNathan Handmade Websites All original material is licensed under a Creative", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}