{"relation": [["Volume", "0", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14"], ["Title", "Rough Stuff", "Nothin' But Misery", "My Murderous Childhood (and Other Grievous Yarns)", "Heaps of Ruination", "Virtue and the Grim Consequences Thereof", "Wicked Inclinations", "Chinatown and the Mystery of Mr. Wicker", "A Place of Heartache and Grief", "Those That is Damned", "Calamity of Conscience", "Death's Greedy Comeuppance", "The Deformed of Body and Devious of Mind", "Them That Raised Us Lament", "For Want of Whiskey and Blood", "Occasion of Revenge"], ["Collects", "The Goon #1-3 (Avatar Press)", "The Goon Color Special (self-published) The Goon #1-4 (self-published)", "The Goon #1-4 The Goon Meets the Brothers Mud", "The Goon #5-8", "The Goon #9-13", "The Goon #14-18", "Chinatown and the Mystery of Mr. Wicker (hardcover original graphic novel)", "The Goon #19-23", "The Goon #24-27", "The Goon #28-31", "The Goon #32-33 The Buzzard #1-3", "An Irish Wake The Goon's on Vacation The Goon #34-37", "The Goon #38-41", "The Goon #41-45", "The Goon #46-49"], ["Published", "April 14, 2004 (1st) January 6, 2010 (2nd)", "July 16, 2003 (1st) May 18, 2011 (2nd)", "May 5, 2004 (1st) October 13, 2010 (2nd)", "February 23, 2005 (1st) August 31, 2011 (2nd)", "February 8, 2006 (1st) October 27, 2010 (2nd)", "December 13, 2006 (1st) November 30, 2011 (2nd)", "December 16, 2009", "May 20, 2009", "June 24, 2009", "September 16, 2009", "January 19, 2011", "June 27, 2012", "February 20, 2013", "October 8, 2014", "April 1, 2015"], ["ISBN", "ISBN 9781593070861 (1st) ISBN 9781595824684 (2nd)", "ISBN 9781569719985 (1st) ISBN 9781595826244 (2nd)", "ISBN 9781593071097 (1st) ISBN 9781595826169 (2nd)", "ISBN 9781593072926 (1st) ISBN 9781595826251 (2nd)", "ISBN 9781593074562 (1st) ISBN 9781595826176 (2nd)", "ISBN 9781593076467 (1st) ISBN 9781595826268 (2nd)", "ISBN 9781595824066", "ISBN 9781595823113", "ISBN 9781595823243", "ISBN 9781595823465", "ISBN 9781595826435", "ISBN 9781595828811", "ISBN 9781616550066", "ISBN 9781616551018", "ISBN 9781616555962"]], "pageTitle": "The Goon - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/The_Goon", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00255-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 874881311, "recordOffset": 874853528, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{9719=On July 22, 2009 a one-shot comic was released titled Dethklok vs. The Goon. Both Eric Powell and Brendon Small co-wrote the comic., 62697=In the 2007 film The Mist, issues of both The Goon & Hellboy are briefly visible on a rotating comic book rack in the scene when Thomas Jane and a small band of survivors venture into a pharmacy to get drugs for the injured at their home base in the adjoining grocery store., 10042=On July 20, 2011 another one-shot comic was released titled \"When Freaks Collide\". It was a collaboration between the Criminal Macabre comic series and The Goon by Steve Niles, Christopher Mitten, and Eric Powell.[4], 32783=January 6, 2010 (2nd), 8354=The Goon debuted in Dreamwalker #0 (March 1998, Avatar Press) in a 4-page Preview, which is the true first appearance of the character (later reprinted as the third story in the Goon #1). Powell was unhappy with the quality of the Avatar Press comics after just 3 issues, so he stopped handing in new material and waited for his contract to expire. Once that happened, he was unable to find another publisher, so he moved into self-publishing in 2002 with Albatross Exploding Funny Books. These self-published issues caught the eye of Dark Horse Comics, which approached Powell by telling him that they didn't know why they passed on the book, and in 2003 publication of The Goon moved to Dark Horse.[3], 7898=An early prototype of The Goon was first published in 1995, in a book called Best Cellars #1 from Out of the Cellar Comics. This prototype was called Monster Boy, and the story was written and illustrated by Eric Powell.[1][2], 33990=October 13, 2010 (2nd), 62362=In the 2007 film Superbad, Evan is playing a video game in his bedroom while his friend Seth stands in the doorway. During this scene's lively exchange, two different posters for The Goon are clearly visible hanging on the walls next to each actor., 56560=Not necessarily a spin-off, but maintaining a similar tone while being appropriate for all ages, is another recently published comic by Powell called Chimichanga. Chimichanga is about a bearded girl, a gorilla monster and a witch. Originally a self-published graphic novel, in September 2011 it was published in hardcover format by Dark Horse Comics, with colours by Dave Stewart.[6][7], 33383=May 18, 2011 (2nd), 35580=November 30, 2011 (2nd), 54655=Eventually, a release date was set as May 16 with the title changed to \"Satan's $@#%* Baby\" and carrying a disclaimer. The inside cover, however, maintained the original title \"Satan's Sodomy Baby,\" along with the original cover art. Four pages of the book reprinted several fan letters in support of the struggle against Snodgrass., 9399=After Dark Horse Comics published issue #18, The Goon went on hiatus to allow Eric Powell to work on Chinatown, a graphic novel which tells more of the Goon's back story. The series returned with issue #19 on July 11, 2007., 34512=August 31, 2011 (2nd), 35055=October 27, 2010 (2nd), 55842=In January 2010, Eric Powell announced plans for a 3-part miniseries featuring the character Buzzard, set after the events of Goon Year. The 3-part series (simply entitled \"Buzzard\") was later published in The Goon: Volume 10., 57533=In June, 2008 it was announced on the Goon official site that a CG animated film of The Goon was to be produced by the award-winning Blur Studio and David Fincher and written by Eric Powell.[8] Clancy Brown will voice The Goon and Paul Giamatti will be Franky.[9] A release date has not yet been specified, nor has a plot. The film's future is uncertain as it has had trouble procuring funds.[10] The film's poster states that it will be released theatrically.[11] The first trailer from the film was released on 20 July 2010.[12] In January 2012, Powell updated the film status, saying, \"The Goon is in the exact same position it's been in for the past couple of years. Prepping the design and script while searching for funding.\"[13], 55333=In September 2010 on Twitter, Eric Powell confirmed that a sequel to Satan's Sodomy Baby was in the works. It will be called SSB2 to avoid the same issues with the title of the first story., 59126=On October 12, 2012, Blur Studio and Fincher launched a 30-day Kickstarter, an on-line fundraising campaign, titled \"The Goon\" Movie... let's KICKSTART this sucker!!!,\" to raise $400,000 to finance a story reel for the entire film.[14] The Kickstarter page also explained why they need the money: \"The Goon Film has NEVER been in production. All the work you've seen (animation footage, trailers, artwork, etc.) has been produced independently and out-of-pocket by the creative team of David Fincher, Eric Powell, Blur Studio and Dark Horse Entertainment. We created \"proof of concept\" footage to show Hollywood the incredible potential of a Goon movie. It was very well received BUT because this movie isn't a sequel or filled with dancing animals we'll need more to bust open the gates and UNLEASH Goon and Franky on Hollywood.\"[15] Two days before the deadline, the landmark was achieved,[16] and the campaign closed on November 11, 2012, raising $441,900 from 7,576 backers.[17], 63069=In the 2008 film The Sasquatch Gang, PVC figurines of Goon and Buzzard from the comic are seen on a character's desk., 53200=Eric Powell 'revealed' on July 5, 2006, in the introduction to The Goon Issue #18, that the issue was originally going to be \"Satan's Sodomy Baby\". That story was allegedly held back due to complaints of a woman called 'Margaret Snodgrass,' a fictitious person created by Powell to generate buzz about this 'controversial' issue. Powell wrote, \"For various reasons I've decided to hold off on putting that story out.\" He states that the story is incredibly graphic and he had considered placing a label reading \"NOT FOR MINORS\" on it. He wrote that Dark Horse, while supporting both him and the issue completely, feared public backlash from its publication, but would eventually put out the issue. Word of the comic's release was allegedly leaked, leading to a threat of a boycott by the fictitious Snodgrass. According to Powell, \"a grass-roots movement was started to try to keep retailers from carrying it by a right-wing Bible thumper in Alabama named 'Margaret Snodgrass'. She claimed that the comic was morally reprehensible and contacted local area retailers telling them that even allowing the comic to be stocked on their shelves could lead to their ever-lasting damnation. Some listened to her and threatened to stop carrying The Goon altogether because of this single issue.\"}", "lastModified": "Sun, 26 Jul 2015 03:18:28 GMT", "textBeforeTable": "† denotes an Avatar Press publication ‡ denotes an Exploding Albatross Funny Books publication (self-published by Eric Powell) Issues[edit] On July 20, 2011 another one-shot comic was released titled \"When Freaks Collide\". It was a collaboration between the Criminal Macabre comic series and The Goon by Steve Niles, Christopher Mitten, and Eric Powell.[4] On July 22, 2009 a one-shot comic was released titled Dethklok vs. The Goon. Both Eric Powell and Brendon Small co-wrote the comic. After Dark Horse Comics published issue #18, The Goon went on hiatus to allow Eric Powell to work on Chinatown, a graphic novel which tells more of the Goon's back story. The series returned with issue #19 on July 11, 2007. The book also received a release that would never be reprinted in trade format, Satan's Sodomy Baby. The Goon debuted in Dreamwalker #0 (March 1998, Avatar Press) in a 4-page Preview, which is the true first appearance of the character (later reprinted as the third story in the Goon #1). Powell was unhappy with the quality of the Avatar Press comics after just 3 issues, so he stopped handing in new material and waited for his contract to expire. Once that happened, he was unable to find another publisher, so he moved", "textAfterTable": "Neil Vokes Eric Powell Equine Twine Tony Shasteen ¡El Hombre del Lagarto el Diablo de Pantano! Eric Powell Kyle Hotz Eric Powell #15 December 21, 2005 Eric Powell #16 February 15, 2006 Eric Powell ― Spike Thomas Sniegoski Eric Powell ― Spike Michael Avon Oeming Eric Powell #17 April 19, 2006 Eric Powell #18 July 5, 2006 Eric Powell Eric Powell It's All Fun and Games 'Til... Mike Hawthorne Eric Powell (dialogue) Dwight T. Albatross's The Goon: Noir #1 September 20, 2006 Franky's Revival ― Eric Powell Dwight T. Albatross's The Goon: Noir Patton Oswalt Mike Ploog The Little Unholy Bastards in Peg Leg Full of Heaven (Part 1) Thomas Sniegoski Eric Powell Hey Goon, Comics! Bill Morrison Big Ma's Hootenanny & Slack-Jaw Fighting Steve Niles Ryan Sook Dwight T. Albatross's The Goon: Noir #2 November 22, 2006 Man of the Hour John Arcudi Kevin Nowlan Rag and Bone", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}