{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"], ["Name", "Safe Love", "Take Your Eyes Out", "In a Vacuum", "This Is the Last", "All Right", "Real World", "What to Do", "Nothing", "It Never Ends", "Keep Us 2", "Get You Out", "Hot"], ["Artist", "Amy X Neuburg", "Amy X Neuburg", "Amy X Neuburg", "Amy X Neuburg", "Amy X Neuburg", "Amy X Neuburg", "Amy X Neuburg", "Amy X Neuburg", "Amy X Neuburg", "Amy X Neuburg", "Amy X Neuburg", "Amy X Neuburg"], ["Time", "4:42", "3:56", "5:40", "3:56", "5:21", "2:30", "2:58", "6:05", "5:17", "4:10", "4:05", "4:08"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Songs 91 to 85 by Amy X Neuburg", "title": "", "url": "https://itunes.apple.com/us/album/songs-91-to-85/id305039502", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00143-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 873397463, "recordOffset": 873373819, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{24018=91 to 85, Amy X Neuburg's collection of first recordings, will be of most interest to listeners, who, like me, have become fascinated with her music only recently. The songs, presented in reverse chronological order, are something of an archaeological dig -- revealing fragmentary clues to her extroardinary vocal talents and vast warehouse of musical knowledge. There's a definte 80s pop feel to Ms. Neuburg's voice and compositions here. But she also introduces listeners to her urge to tamper, experiment, and never quite go commercial. The unitiated can listen to these songs without realizing that Neuburg is equally at home singing opera, madrigals, alt-country tunes and cabaret standards. The best tracks are \"All right\" and \"HOT.\" The latter, recorded back in 1985, exhibits Neuburg's talents at their best and most original, and could have been included on any of her more recent albums. The song shimmers with heat, sweat and desire., 72949=Copyright © 2014 Apple Inc. All rights reserved., 22031=The similarities between Amy X Neuburg and Kate Bush are numerous, although Neuburg tends to be wittier. They were at their strongest in her early years. This album collects songs recorded between 1985 and 1991, presented in backward chronology. The music consists of multi-layered synthesizers (including drum programming) and vocals, all by Neuburg, with the exception of a few guitar takes by Herb Heinz. There can be as much as six Amys singing at the same time, and that's where most of the charm of her songs resides. The woman has a beautiful pop voice, seductive and tricky. Lyrics speak mostly of personal relationships, stressing the need for fantasy and freedom. The all-synth instrumentation evokes at times the worst days of synth pop, especially tracks from the mid-'80s. The vocals keep things interesting, although \"Get You Out\" has aged too badly to be salvaged (unnerving fast-paced beatbox). The more accomplished songs come first: \"Safe Love,\" \"Take Your Eyes Out,\" \"In a Vacuum,\" where you find the creativity of Kate Bush circa Never for Ever intact. More pop and linear than her albums with her group Men, Songs 91 to 85 fills in the details of her apprenticeship, but it is not an essential item. ~ François Couture, Rovi}", "lastModified": "Sat, 01 Aug 2015 04:16:08 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Amy X Neuburg Songs 91 to 85 iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Songs 91 to 85 by Amy X Neuburg, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening", "textAfterTable": "12 Songs Album Review The similarities between Amy X Neuburg and Kate Bush are numerous, although Neuburg tends to be wittier. They were at their strongest in her early years. This album collects songs recorded between 1985 and 1991, presented in backward chronology. The music consists of multi-layered synthesizers (including drum programming) and vocals, all by Neuburg, with the exception of a few guitar takes by Herb Heinz. There can be as much as six Amys singing at the same time, and that's where most of the charm of her songs resides. The woman has a beautiful pop voice, seductive and tricky. Lyrics speak mostly of personal relationships, stressing the need for fantasy and freedom. The all-synth instrumentation evokes at times the worst days of synth pop, especially tracks from the mid-'80s. The vocals keep things interesting, although \"Get You Out\" has aged too badly to be salvaged (unnerving fast-paced beatbox). The more accomplished songs come first: \"Safe Love,\" \"Take Your Eyes Out,\" \"In a Vacuum,\" where you find the creativity of Kate Bush circa Never for Ever intact. More pop and linear than her albums with her group Men, Songs 91 to 85 fills in the details of her apprenticeship, but it is not an essential item. ~ François Couture, Rovi Customer Reviews", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}