{"relation": [["Artist", "Catherine Wheel", "Wayne Newton"], ["Song Title", "Waydown", "Danke Schoen"], ["Played When", "", "Heard over muzak speaker at yuppie supermarket"]], "pageTitle": "CSI: Crime Scene Investigation Season 1 Episode 23 - The Strip Strangler (1x23) - Watch Online - s1 e23 Spoilers", "title": "", "url": "http://www.tvrage.com/CSI/episodes/40412", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00144-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 792576987, "recordOffset": 792556774, "tableOrientation": "VERTICAL", "textBeforeTable": "Music Click here to add a recap for The Strip Strangler Next Episode --> <-- Previous Episode Recap Captain Jim Brass As Paul Guilfoyle (1) Warrick Brown As Gary Dourdan Gil Grissom As William Petersen Catherine Willows As Marg Helgenberger Sara Sidle As Jorja Fox Nick Stokes As George Eads Main Cast Guy in Supermarket As Rainn Wilson", "textAfterTable": "Episode Quotes Catherine: When we zig, he zags. Sara: Do we have a breakfast budget, Grissom? Grissom: I believe Catherine was going to requisition one. Sara: Good, cause our plates are up, and nobody has any money. Gil: Well, look for prints. Catherine: Don't bother. There aren't any. Just like the last time. The guy's Mr. Clean. Gil: Now we just have to find the guy and hope that he hasn't done his laundry. Greg: Freaky, huh? Catherine: Freakiest semen I've seen in a while. Sara: I'm going to do it, Grissom. I want to. Gil: You want to put yourself in the path of a psychotic killer? Sara: I'm trained in weaponless defense. Gil: Too bad, because that's what turns him on -- women fighting back. Gives him a greater sense of power when he makes his final kill. Greg: You got a hot dog? Catherine: This one of your jokes, Greg? Greg: I got the ketchup. Catherine: All of which I'm sure you'll share with", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}