{"relation": [["Author", "ozwalled", "ozwalled", "ozwalled", "ozwalled", "ozwalled"], ["Title", "Dr. Andonuts Painting", "Drago vs. Flint: The Showdown", "Dragon", "Dragon", "Dramatically Lit Barbot"], ["Description", "A commissioned painting of the good Dr. Andonuts. Acrylics on 9\"x12\" canvas board.", "Epic battle. Yay experimentation! To shade this and draw Flint and the Tree, I used a majorly-on-its-deathbed brush pen. very interesting. And for the white bits, I used a white gel pen I picked up. (I'll be needing to get s'more of those). SPEAKING of getting more, it looks like the day that I use this paper I've been using will come to an end at some point, since the Green House recycled paper sketchbooks that I used to like using are no longer being carried by my local art store. :( BLEH. Why is it so difficult for me to find sketchbooks with pages that aren't bleached white. :P I have nothing AGAINST white pages, but a beige tone (and a texture like these has) can be a lot of fun to play with. Ah well. And they were cheap, too ($5 each).", "An armoured dragon-thing, based on the EB64 screenshots.", "The Dragon from Mother 1, finally awake. I was so close to completing this before, but never could bring myself to put the finishing touches on it, so here it is.", "Now with a cooler lighting effect!"], ["Date", "4/12/09", "4/12/09", "4/26/05", "4/12/09", "4/27/05"], ["Rank", "10.00", "0.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=10238&stuffPageNumber=21", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00033-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 238742394, "recordOffset": 238734192, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> Z Y W V U T S R Q P O N M L K J I H G F E D C B A < Other Submissions by ozwalled added an orange background, which I thought worked better. One of the lead EB64 characters. I later This image has been resized for your convenience. Click on it to view the full size version. Flint Flint - by ozwalled  Earthbound 64", "textAfterTable": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}