{"relation": [["Title", "Chronicle of the Pharaohs (The Reign-By-Reign Record of the Rulers and Dynasties of Ancient Egypt)", "Complete Pyramids, The (Solving the Ancient Mysteries)", "Dictionary of Ancient Egypt, The", "History of Ancient Egypt, A", "Monarchs of the Nile", "Oxford History of Ancient Egypt, The"], ["Author", "Clayton, Peter A.", "Lehner, Mark", "Shaw, Ian; Nicholson, Paul", "Grimal, Nicolas", "Dodson, Aidan", "Shaw, Ian"], ["Date", "1994", "1997", "1995", "1988", "1995", "2000"], ["Publisher", "Thames and Hudson Ltd", "Thames and Hudson, Ltd", "Harry N. Abrams, Inc., Publishers", "Blackwell", "Rubicon Press", "Oxford University Press"], ["Reference Number", "ISBN 0-500-05074-0", "ISBN 0-500-05084-8", "ISBN 0-8109-3225-3", "None Stated", "ISBN 0-948695-20-x", "ISBN 0-19-815034-2"]], "pageTitle": "Egypt: Pyramids in Egypt Just for Kids", "title": "", "url": "http://www.touregypt.net/kids/pyramidsforkids.htm", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00112-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 770190539, "recordOffset": 770172358, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{20544=1994, 28033=Copyright © 1996-2013 Tour Egypt. All Rights Reserved. Web Development & Design By AKN Solutions, 16170=Pyramids in Egypt were only one type of tomb used mostly to bury kings and sometimes queens during a specific period of time. The \"Pyramid Age\" lasted from about the 3rd Dynasty reign of Djoser (2630 BC) until the Reign of Ahmose I, which ended in about 1514 BC. However, few of the kings after the 12th Dynasty (ending in about 1759 BC) seem to have built pyramids. Before the Pyramid Age, kings were buried in tombs known as mastabas, because from a distance they look like Arabic benches, and that is the term in Arabic for a bench. After the Pyramid Age, kings were buried in rock cut tombs that they tried to hide from tomb robbers. There was no structure above ground at the tomb to give its location away., 22629=2000, 21836=1988, 21411=1995, 20981=1997}", "textBeforeTable": "    References:     Our Feature Article on Pyramids   For a complete description of the pyramids of Ancient Egypt, including links, see our Adult section on the Pyramids::   The Pyramids of Egypt are a fascinating topic that have created many controversies over the years, and which continue to do so today. They have not given up all of their secrets even after over four thousand years, and these first of mankind's large, stone buildings will probably intrigue us for many years to come.           However, after the very earliest period of Egyptian history, the tombs of kings were almost always complexes, having other buildings and structures other than the tomb itself. Almost all royal tombs, including pyramids, had a mortuary temple where priests were supposed to take care of the king's soul (known as his Ka). During the Pyramid Age, the mortuary temple was located right next to the pyramid itself, though after the Pyramid Age, the mortuary temple was separated from the tomb so that the tomb's location would be less obvious to grave robbers. Other structures usually included a valley temple, usually near the Nile River, which was sort of an entrance to the complex, a causeway, which was", "textAfterTable": "  Who are we? Tour Egypt aims to offer the ultimate Egyptian adventure and intimate knowledge about the country. We offer this unique experience in two ways, the first one is by organizing a tour and coming to Egypt for a visit, whether alone or in a group, and living it firsthand. The second way to experience Egypt is from the comfort of your own home: online. Popular Pages Egypt Pyramids Monuments & Ancient Sites Egyptian Kings Ancient Temples Pharaohs General Travel What to Take Destinations Egypt Travel Articles Budget Travel Fees to Monuments Shopping Guide Beach Vacations Interactive Pages Picture of the Day Reader Pictures Recipe of the Week Weekly Crossword Puzzle Send Postcard Hieroglyph Converter Egyptian Money Specific Activities Scuba Diving Therapy Golf Courses Fishing Lake Nasser Birding in Egypt Tour Specific", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}