{"relation": [["Title", "South of Broad", "The Guinea Pig Diaries"], ["Author", "Pat Conroy", "A.J Jacobs"], ["Published", "August 2009", "Sep 2009"], ["Descriiption", "Every bit as good as Conroy favorites such as Prince of Tides, Lords of Discipline, and The Great Santini", "Jacob's book Living Biblically is also a fun read."]], "pageTitle": "OneStop Secret Sauce", "title": "", "url": "https://blogs.oracle.com/onestop/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00330-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 853126047, "recordOffset": 853101045, "tableOrientation": "HORIZONTAL", "lastModified": "Wed, 06 Jan 2010 06:20:53 GMT", "textBeforeTable": "Daily News The tables below are on the Mike Briggs page of the READ community, categorized into Daily News, Business Related, and Fiction or Just Good Reads,  Sorry, the community is only available on the Sun internal network. Maybe Brad will do one for his large external audience. It's important to include meta information about the books, particularly date and a short description. Categorization (and soon tags) will help a lot. For this community we hope to leverage the organization, in particular roles and job titles. The assumption is that many people will care about the books a Principal Engineer is reading, at least the technical ones. I'm interested in the business books that the execs are reading. To take this a step farther, I also care about the news sources (blogs, etc.) that the people I respect consume. Isn't this a natural for some sort of community? It's not a community as per facebook or linkedin, but there should be some way to consolidate reading recommendations. Therefore, we've established a community on SunSpace called \"READ\", and we've seeded it with the reading lists from a bunch of notables.", "textAfterTable": "Business Related Title Author Published Descriiption Googled: The End of the World as We Know It Ken Auletta Oct 2009 The best google book I've read by far. Thoughtful and content full A Colossal Failure of Common Sense: The Inside Story of the Collapse of Lehman Brothers Lawrence McDonald July 2009 Learn a lot about Wall Street from a real trader. Very well written. The Accidental Billionaires: The Founding of Facebook. A Tale of Sex, Money, Genius, and Betrayal Ben Mizrich July 2009 Very simplistic. A fast read. Not Mezrich's best effort. Behind the Cloud: Untold Story of Salesforce.com. Marc Benioff Oct 2009 Awesome. Contains a catalog of how to leverage community and collaboration. Fiction or Just Good Reads Title", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}