{"relation": [["Artist", "John Lennon", "Johnny Thunders", "Opus 1", "Suicide Celebrity", "White Fence"], ["Song Title", "Instant Karma", "You Can't Put Your Arms Round a Memory", "Venetian Fog With Piano", "You're Losin It", "Down PNX"], ["Played When", "", "", "", "", ""]], "pageTitle": "Californication Season 6 Episode 1 - The Unforgiven (6x1) - Watch Online - s6 e1 Spoilers", "title": "", "url": "http://www.tvrage.com/Californication/episodes/1065171049", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00277-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 796339519, "recordOffset": 796322057, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Music Read the full recap Recap The episode begins and its shown how Hank met Karen at a bar for the first time. She is the bartender and Hank is flirting with her. He asks her for her name, but she isn’t very forthcoming. Later the two are shown having coffee together. Hank is disappointed that Karen doesn’t have a more exotic name like Sasha or Aasha. Hank turns around and sees the waitress serving them is Carrie. He then sees Carrie sitting in front of him instead of Karen. “Tell me you love me” Carrie tells him. Hank wakes up with a start and finds himself, lying on a hospital bed. He sees Karen sitting by his bedside. “Tell me what do you remember?” she asks Hank. .. Becca Moody As Madeleine Martin Charlie Runkle As Evan Handler Marcy Runkle As Pamela Adlon Karen Van Der Beek As Natascha McElhone", "textAfterTable": "Other Episode Crew Click here to add other crew for The Unforgiven Missing Information Click here to add Episode Notes Click here to add Episode Quotes Click here to add Episode Goofs Click here to add Cultural References Click here to add Episode References Click here to add Analysis   Flash Show Menu General Info Forum Episode List Episode Guide Printable Guide Cast Recurring Guests Character Guide (1) Gallery (4) Stats Links (6) Credits Contribute Submit Trivia Show Tidbits (0) Empty Sections", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}