{"relation": [["Composer", "Darius Milhaud", "Darius Milhaud", "Darius Milhaud", "Darius Milhaud", "Darius Milhaud", "Darius Milhaud", "Darius Milhaud", "Darius Milhaud"], ["Title", "La Cheminée du Roi René", "Scaramouche", "Quatre Chansons de Ronsard", "Suite d'apres Corrette", "Le Printemps Op. 18", "Suite for clarinet ,violin and Piano op.157b", "La Cheminée du Roi René", "Le boeuf sur le toit"], ["Date", "03/11/2009", "03/11/2009", "04/01/2009", "04/02/2009", "03/01/2011", "04/18/2012", "11/27/2012", "09/16/2013"], ["Action", "", "", "", "", "", "", "", ""]], "pageTitle": "Darius Milhaud, classical music composer", "title": "", "url": "http://www.classicalconnect.com/composer/Darius-Milhaud", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00031-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 367614680, "recordOffset": 367606478, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{5738=The rise of Nazism and their unstoppable march into France inevitably forced Milhaud to leave his beloved homeland in 1939. The next year, he and his family emigrated to the United States. He secured a teaching position at Mills College in Oakland, California where he would teach two of his most popular students: the jazz pianist Dave Brubeck and the songwriter Burt Bacharach. After France's liberation and the end of World War II, Milhaud secured a dual teaching post, alternating years at Mills College and the Paris Conservatoire, which he maintained until 1971., 4865=During the First World War, Milhaud served in the French delegation to Brazil where he began a lifelong association with the poet Paul Claudel, a Minister in the delegation. In later years, Milhaud provided incidental music for Claudel's plays and the poet, in return, provided libretti for many of Milhaud's works. When Milhaud returned to Paris after the war, he began an active career of composing, performing, and teaching. He was recognized as a member of Lex Six, France's version of Mily Balakirev's The Five. In 1922, during a trip to the United States, he was introduced to \"authentic\" jazz on the streets of Harlem, which had a profound impact on his music. The following year, he incorporated jazz idioms in La creation du monde (\"The Creation of the World\")., 4407=Undoubtedly one of the most prolific composers of the 20th century, Darius Milhaud was born into a Jewish family in Marseilles on September 4, 1892. As a youth, he learned to play the violin. He entered the prestigious Paris Conservatoire at the age of 17 studying composition with Charles Widor, and harmony and counterpoint with André Gedalge. In addition, he also studied privately with Vincent d'Indy., 6340=A serious, paralyzing rheumatic condition from which Milhaud suffered since the 1920s ultimately led to the decline of the composer's health. In his final years, he resorted to a wheelchair for mobility and was forced to retire from his teaching duties. On June 27, 1974, he passed away in Geneva, Switzerland., 12452=Copyright 2008-2014 Classical Connect, LLC}", "lastModified": "Fri, 31 Jul 2015 07:19:30 GMT", "textBeforeTable": "A serious, paralyzing rheumatic condition from which Milhaud suffered since the 1920s ultimately led to the decline of the composer's health. In his final years, he resorted to a wheelchair for mobility and was forced to retire from his teaching duties. On June 27, 1974, he passed away in Geneva, Switzerland. The rise of Nazism and their unstoppable march into France inevitably forced Milhaud to leave his beloved homeland in 1939. The next year, he and his family emigrated to the United States. He secured a teaching position at Mills College in Oakland, California where he would teach two of his most popular students: the jazz pianist Dave Brubeck and the songwriter Burt Bacharach. After France's liberation and the end of World War II, Milhaud secured a dual teaching post, alternating years at Mills College and the Paris Conservatoire, which he maintained until 1971. During the First World War, Milhaud served in the French delegation to Brazil where he began a lifelong association with the poet Paul Claudel, a Minister in the delegation. In later years, Milhaud provided incidental music for Claudel's plays and the poet, in return, provided libretti for many of Milhaud's works. When Milhaud returned to Paris after the war, he began an active career of composing, performing, and teaching. He was recognized as a member of Lex Six, France's version of Mily Balakirev's The Five. In 1922, during a trip to the United States, he was introduced", "textAfterTable": "Contact | Press Releases | Privacy | Terms of Use | Interesting Links Copyright 2008-2014 Classical Connect, LLC", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}