{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"], ["Name", "Paraty", "My Baby Lives In Paris", "Under the Sun", "Skipping Stones", "Summer Lover", "La Havana", "Canto de Iemanja", "The Rising Tide", "All My City", "Gracias a la Vida", "Open Your Heart"], ["Artist", "Mia Doi Todd", "Mia Doi Todd", "Mia Doi Todd", "Mia Doi Todd", "Mia Doi Todd", "Mia Doi Todd", "Mia Doi Todd", "Mia Doi Todd", "Mia Doi Todd", "Mia Doi Todd", "Mia Doi Todd"], ["Time", "3:56", "2:59", "5:05", "3:58", "4:26", "4:04", "6:32", "3:27", "3:30", "4:06", "3:32"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Cosmic Ocean Ship (Bonus Track) by Mia Doi Todd", "title": "", "url": "https://itunes.apple.com/us/album/paraty/id428747304?i=428747313", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00028-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 889688983, "recordOffset": 889663699, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{26006=Born: June 30, 1975 in Los Angeles, CA, 127352=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 03:58:21 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Mia Doi Todd Cosmic Ocean Ship (Bonus Track) iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Cosmic Ocean Ship (Bonus Track) by Mia Doi Todd, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your", "textAfterTable": "11 Songs Editors’ Notes Mia Doi Todd is, thus far, a great, overlooked talent. Her simple folk melodies and beautiful vocals are reminiscent of the early ‘60s in their purity and lack of artifice. There is an elemental joy to “My Baby Lives In Paris” that elicits feelings of first love and of springtime. There’s a Spanish undertow to many tracks including the lilting opener, “Paraty” and Violetta Parra’s “Gracias a la Vida” that easily transcends language. Baden Powell’s “Canto de lemanja” features beautifully multi-tracked vocals that accentuate the uneasy feeling of the sparse percussion. Latin percussion further emphasizes the beauty of “Under the Sun,” a cut that sounds as if it was unearthed from a Los Angeles recording studio in the early 1970s. Fans of Joni Mitchell, Judy Collins and Joan Baez will surely thrill to this unpretentious sound. Todd is classically trained and unashamed to use her knowledge. It’s a pity there aren’t more like her. But then refined talent is always at a premium. Customer Reviews Spellbindingly Bewitching           by HollywoodKen I had the opportunity to see Mia play live tonight in Silver", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}