{"relation": [["Artist", "DJ Scribble, Anthony Acid and Christian Gambella", "Jose Conde Y Ola Fresca", "Matter", "Renee van Verseveld & Kurt Farquhar", "Yucky"], ["Song Title", "Tropical Paradise", "Probando Nuevos Sabores", "Pain", "Big Bang", "Yucky Snippet 5B"], ["Played When", "Michael, Sam and Jimmy at the restaurant", "Michael sees the aurveillance man", "Michael and Jimmy repel out the window", "Michael meets Jimmy", "Michael and Jimmy cut through the floor"]], "pageTitle": "Burn Notice Season 2 Episode 1 - Breaking and Entering (2x1) - Watch Online - s2 e1 Spoilers", "title": "", "url": "http://www.tvrage.com/Burn_Notice/episodes/649523", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00085-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 797861687, "recordOffset": 797848132, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Music Michael's cover I.D \"Terry Miller\" Is the name of one of the producers who'd worked every episode up to this point. Episode Notes Click here to add a recap for Breaking and Entering Next Episode --> <-- Previous Episode Recap Madeline Westen As Sharon Gless Sam Axe As Bruce Campbell Fiona Glenanne As Gabrielle Anwar Michael Westen As Jeffrey Donovan Main Cast Security Guard As Steve Lantz", "textAfterTable": "Episode Quotes Michael: (voiceover) Once the cops pick up a call on a flagged cell, they triangulate its location. From there they organize and deploy units. A process that can take ten minutes, give or take. Michael: Hi, Fi. Fiona: I can't believe you, Michael. Forty-eight hours ago we said goodbye, possibly forever. And then I get a message from you on my cell that I should come right over because you got a job. Michael: Fi, there's a lot going on, so... Fiona: You couldn't start with \"I'm alive\"? Michael: I thought the fact that I was calling covered that. Madeline: All these years, and finally I see what you do. You tell me I have to leave town in -- in a minute's notice, I can't talk on the phone, we're being chased by men with guns, how am I supposed to deal with this? Michael: All these years you wondered why I didn't come home, why I didn't call. This is why, Mom. I never wanted this for you. I'm sorry. Madeline: Well, it still doesn't explain why you didn't write. Michael: (voiceover) When you work as a spy, it's easy to think of", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}