{"relation": [["Title", "Cup of Gold", "The Pastures of Heaven", "The Red Pony", "To a God Unknown", "Tortilla Flat", "In Dubious Battle", "Of Mice and Men", "The Long Valley", "The Grapes of Wrath", "The Forgotten Village", "Sea of Cortez: A Leisurely Journal of Travel and Research", "The Moon Is Down", "Bombs Away: The Story of a Bomber Team", "Cannery Row", "The Wayward Bus", "The Pearl", "A Russian Journal", "Burning Bright", "The Log from the Sea of Cortez", "East of Eden", "Sweet Thursday", "The Short Reign of Pippin IV: A Fabrication", "Once There Was A War", "The Winter of Our Discontent", "Travels with Charley: In Search of America", "America and Americans", "Journal of a Novel: The East of Eden Letters", "Viva Zapata!", "The Acts of King Arthur and His Noble Knights", "Working Days: The Journals of The Grapes of Wrath", "Steinbeck in Vietnam: Dispatches from the War"], ["Year", "000000001929-01-01-00001929", "000000001932-01-01-00001932", "000000001933-01-01-00001933", "000000001933-01-01-00001933", "000000001935-01-01-00001935", "000000001936-01-01-00001936", "000000001937-01-01-00001937", "000000001938-01-01-00001938", "000000001939-01-01-00001939", "000000001941-01-01-00001941", "000000001941-01-01-00001941", "000000001942-01-01-00001942", "000000001942-01-01-00001942", "000000001945-01-01-00001945", "000000001947-01-01-00001947", "000000001947-01-01-00001947", "000000001948-01-01-00001948", "000000001950-01-01-00001950", "000000001951-01-01-00001951", "000000001952-01-01-00001952", "000000001954-01-01-00001954", "000000001957-01-01-00001957", "000000001958-01-01-00001958", "000000001961-01-01-00001961", "000000001962-01-01-00001962", "000000001966-01-01-00001966", "000000001969-01-01-00001969", "000000001975-01-01-00001975", "000000001976-01-01-00001976", "000000001989-01-01-00001989", "000000002012-01-01-00002012"], ["Category", "Novel", "Short Stories", "Novella", "Novel", "Novel", "Novel", "Novella", "Short Stories", "Novel", "Film", "Non-Fiction", "Novel", "Non-Fiction", "Novel", "Novel", "Novella", "Non-Fiction", "Novella", "Non-Fiction", "Novel", "Novel", "Novel", "Non-Fiction", "Novel", "Non-Fiction", "Non-Fiction", "Non-Fiction", "Non-Fiction", "Fiction", "Non-Fiction", "Non-Fiction"], ["ISBN", "0-14-018743-X", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "13: 9780143039440", "", "", "", "", "", "", "", "", "", "", "", "", ""]], "pageTitle": "John Steinbeck - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/Steinbeck", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00260-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 849824795, "recordOffset": 849760026, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{58375=In accordance with his wishes, his body was cremated, and interred on March 4, 1969[31] at the Hamilton family gravesite in Salinas, with those of his parents and maternal grandparents. His third wife, Elaine, was buried in the plot in 2004. He had earlier written to his doctor that he felt deeply \"in his flesh\" that he would not survive his physical death, and that the biological end of his life was the final end to it.[18], 16929=When their money ran out six months later due to the market being slow, Steinbeck and Carol moved back to Pacific Grove, California, to a cottage owned by his father, on the Monterey Peninsula a few blocks outside the Monterey city limits. The elder Steinbecks gave John free housing, paper for his manuscripts, and from 1928, loans that allowed him to write without looking for work. During the Great Depression period, Steinbeck bought a small boat, and later claimed that he was able to live on the fish and crab that he gathered from the sea, as well as fresh vegetables from his garden and local farms. When that didn't work, Steinbeck and his wife were not above getting welfare, or rarely even stealing bacon from the local produce market.[10] Whatever food they had, they would share with their friends.[10] Carol became the model for Mary Talbot in Steinbeck's novel Cannery Row.[10], 33713=Although Carol accompanied Steinbeck on the trip, their marriage was beginning to suffer, and ended a year later, in 1941, even as Steinbeck worked on the manuscript for the book.[10] In 1942, after his divorce from Carol he married Gwyndolyn \"Gwyn\" Conger.[20] With his second wife Steinbeck had two sons—Thomas (\"Thom\") Myles Steinbeck (born 1944) and John Steinbeck IV (1946–1991)., 83159=In 1936, Steinbeck published the first of what came to be known as his Dustbowl trilogy, which included Of Mice and Men and The Grapes of Wrath. This first novel tells the story of a fruit pickers' strike in California which is both aided and damaged by the help of \"the Party,\" generally taken to be the Communist Party, although this is never spelled out in the book., 79384=In 1967, when he was sent to Vietnam to report on the war, his sympathetic portrayal of the United States Army led the New York Post to denounce him for betraying his liberal past. Steinbeck's biographer, Jay Parini, says Steinbeck's friendship with President Lyndon B. Johnson influenced his views on Vietnam.[12] Steinbeck may also have been concerned about the safety of his son serving in Vietnam.[citation needed], 37032=In 1943, Steinbeck served as a World War II war correspondent for the New York Herald Tribune and worked with the Office of Strategic Services (predecessor of the CIA).[22] It was at that time he became friends with Will Lang, Jr. of Time/Life magazine. During the war, Steinbeck accompanied the commando raids of Douglas Fairbanks, Jr.'s Beach Jumpers program, which launched small-unit diversion operations against German-held islands in the Mediterranean. At one point, he accompanied Fairbanks on an invasion of an island off the coast of Italy and helped capture Italian and German prisoners, using a Tommy Gun. Some of his writings from this period were incorporated in the documentary Once There Was a War (1958)., 77933=Documents released by the Central Intelligence Agency in 2012 indicate that Steinbeck offered his services to the Agency in 1952, while planning a European tour, and the Director of Central Intelligence himself, Walter Bedell Smith, was eager to take him up on the offer.[48] What work, if any, Steinbeck may have performed for the CIA during the Cold War is unknown., 52966=In September 1964, Steinbeck was awarded the Presidential Medal of Freedom by President Lyndon B. Johnson., 53237=In 1967, at the behest of Newsday magazine, Steinbeck went to Vietnam to report on the war there. Thinking of the Vietnam War as a heroic venture, he was considered a hawk for his position on that war. His sons both served in Vietnam prior to his death, and Steinbeck visited one son in the battlefield (at one point being allowed to man a machine-gun watch position at night at a firebase, while his son and other members of his platoon slept).[28], 63993=The British newspaper The Guardian, in a 2013 article that revealed that Steinbeck had been a compromise choice for the Nobel Prize, called him a \"Giant of American Letters.\" Despite ongoing attacks on his literary reputation, Steinbeck's works continue to sell well and he is widely taught in American and British schools as a bridge to more complex literature. Works such as Of Mice and Men are short and easy to read, and compassionately illustrate universal themes that are still relevant in the 21st century.[4], 21383=Steinbeck's first novel, Cup of Gold, published in 1929, is loosely based on the life and death of privateer Henry Morgan. It centers on Morgan's assault and sacking of the city of Panama, sometimes referred to as the 'Cup of Gold', and on the women, fairer than the sun, who were said to be found there.[12], 32434=In the 1930s and 1940s, Ed Ricketts strongly influenced Steinbeck's writing. Steinbeck frequently took small trips with Ricketts along the California coast to give himself time off from his writing[18] and to collect biological specimens, which Ricketts sold for a living. Their joint book about a collecting expedition to the Gulf of California in 1940, which was part travelogue and part natural history, published just as the U.S. entered World War II, never found an audience and did not sell well.[18] However, in 1951, Steinbeck republished the narrative portion of the book as The Log from the Sea of Cortez, under his name only (though Ricketts had written some of it). This work remains in print today.[19], 46365=Apparently taken aback by the critical reception of this novel, and the critical outcry when he was awarded the Nobel Prize for Literature in 1962,[25] Steinbeck published no more fiction in the next six years before his death., 73452=On December 5, 2007, California Governor Arnold Schwarzenegger and First Lady Maria Shriver inducted Steinbeck into the California Hall of Fame, located at the California Museum for History, Women and the Arts.[41] His son, author Thomas Steinbeck, accepted the award on his behalf., 73036=On February 27, 1979 (the 77th anniversary of the writer's birth), the United States Postal Service issued a stamp featuring Steinbeck, starting the Postal Service’s Literary Arts series honoring American writers.[40], 39739=After the end of the war, he wrote The Pearl (1947), already knowing it would be filmed. The story first appeared in the December 1945 issue of Woman's Home Companion magazine as \"The Pearl of the World.\" It was illustrated by John Alan Maxwell. The novel is an imaginative telling of a story which Steinbeck had heard in La Paz in 1940, as related in The Log From the Sea of Cortez, which he described in Chapter 11 as being \"so much like a parable that it almost can't be\". Steinbeck traveled to Mexico for the filming with Wagner who helped with the script; on this trip he would be inspired by the story of Emiliano Zapata, and subsequently wrote a film script (Viva Zapata!) directed by Elia Kazan and starring Marlon Brando and Anthony Quinn., 30394=Grapes was controversial. Steinbeck's New Deal political views, negative portrayal of aspects of capitalism, and sympathy for the plight of workers, led to a backlash against the author, especially close to home.[16] Claiming the book was both obscene and misrepresented conditions in the county, the Kern County Board of Supervisors banned the book from the county's publicly funded schools and libraries in August 1939. This ban lasted until January 1941.[17], 78565=Steinbeck was a close associate of playwright Arthur Miller. In June 1957, Steinbeck took a personal and professional risk by standing up for him when Miller refused to name names in the House Un-American Activities Committee trials.[33] Steinbeck called the period one of the \"strangest and most frightening times a government and people have ever faced.\"[33], 84145=Of Mice and Men is a tragedy that was written in the form of a play in 1937. The story is about two traveling ranch workers, George and Lennie, trying to work up enough money to buy their own farm/ranch. As it is set in 1930s America, it provides an insight into The Great Depression, encompassing themes of racism, loneliness, prejudice against the mentally ill, and the struggle for personal independence. Along with The Grapes of Wrath, East of Eden, and The Pearl, Of Mice and Men is one of Steinbeck's best known works. It was made into a movie three times, in 1939 starring Burgess Meredith, Lon Chaney Jr., and Betty Field, in 1982 starring Randy Quaid, Robert Blake and Ted Neeley, and in 1992 starring Gary Sinise and John Malkovich., 18512=In 1930, Steinbeck met Ed Ricketts, who became a close friend and mentor to Steinbeck during the following decade, teaching him a great deal about philosophy and biology.[10] Ricketts, usually very quiet, yet likable, with an inner self-sufficiency and an encyclopedic knowledge of diverse subjects, became a focus of Steinbeck's attention. Ricketts had taken a college class from Warder C. Allee, a biologist and ecological theorist, who would go on to write a classic early textbook on ecology. Ricketts became a proponent of ecological thinking, in which man was only one part of a great chain of being, caught in a web of life too large for him to control or understand.[10] Meanwhile, Ricketts operated a biological lab on the coast of Monterey, selling biological samples of small animals, fish, rays, starfish, turtles, and other marine forms to schools and colleges., 44358=Travels with Charley (subtitle: In Search of America) is a travelogue of his 1960 road trip with his poodle Charley. Steinbeck bemoans his lost youth and roots, while dispensing both criticism and praise for America. According to Steinbeck's son Thom, Steinbeck went on the trip because he knew he was dying and wanted to see the country one last time.[23], 62833=The award of the 1962 Nobel Prize for Literature to Steinbeck was controversial in the United States. The award citation lauded Steinbeck \"for his realistic and imaginative writings, combining as they do sympathetic humour and keen social perception\". Many critics of the award of the Nobel to Steinbeck complained that the author's best work were behind him. The New York Times ran an article by Arthur Mizener entitled “Does a Writer with a Moral Vision of the 1930s Deserve the Nobel Prize?” that claimed Steinbeck was undeserving of the prestigious prize as he was a “limited talent” whose works were “watered down by tenth-rate philosophizing\". Many American critics now consider these attacks to be politically motivated.[38], 50036=In 2012, (50 years later), the Nobel Prize opened its archives and it was revealed that Steinbeck was a \"compromise choice\" among a shortlist consisting of Steinbeck, British authors Robert Graves and Lawrence Durrell, French dramatist Jean Anouilh and Danish author Karen Blixen.[25] The declassified documents showed that he was chosen as the best of a bad lot,[25] \"There aren't any obvious candidates for the Nobel prize and the prize committee is in an unenviable situation,\" wrote committee member Henry Olsson.[25] Although the committee believed Steinbeck's best work was behind him by 1962, committee member Anders Österling believed the release of his new novel The Winter of Our Discontent in 1961 showed that \"after some signs of slowing down in recent years, [Steinbeck has] regained his position as a social truth-teller [and is an] authentic realist fully equal to his predecessors Sinclair Lewis and Ernest Hemingway.\"[25], 76178=Steinbeck's contacts with leftist authors, journalists, and labor union figures may have influenced his writing and he joined the League of American Writers, a Communist organization, in 1935.[45] Steinbeck was mentored by radical writers Lincoln Steffens and his wife Ella Winter. Through Francis Whitaker, a member of the Communist Party USA’s John Reed Club for writers, Steinbeck met with strike organizers from the Cannery and Agricultural Workers' Industrial Union.[46] In 1939, he signed a letter with some other writers in support of the Soviet invasion of Finland and the Soviet-established puppet government.[47], 26768=Of Mice and Men was a drama about the dreams of a pair of migrant agricultural laborers in California. It was critically acclaimed[12] and Steinbeck's 1962 Nobel Prize citation called it a \"little masterpiece\".[1] Its stage production was a hit, starring Wallace Ford as George and starring Broderick Crawford as George's companion - the mentally childlike but physically powerful itinerant farmhand Lennie. Steinbeck refused to travel from his home in California to attend any performance of the play during its New York run, telling director George S. Kaufman that the play as it existed in his own mind was \"perfect\" and that anything presented on stage would only be a disappointment. Steinbeck would write two more stage plays (The Moon Is Down and Burning Bright)., 59786=Steinbeck's incomplete novel based on the King Arthur legends of Malory and others, The Acts of King Arthur and His Noble Knights, was published in 1976., 71799=In Monterey, Ed Ricketts' laboratory survives (though it is not yet open to the public) and at the corner which Steinbeck describes in Cannery Row, also the store which once belonged to Lee Chong, and the adjacent vacant lot frequented by the hobos of Cannery Row. The site of the Hovden Sardine Cannery next to Doc's laboratory is now occupied by the Monterey Bay Aquarium. However, the street that Steinbeck described as \"Cannery Row\" in the novel, once named Ocean View Avenue, was renamed Cannery Row in honor of the novel, in 1958. The town of Monterey has commemorated Steinbeck's work with an avenue of flags depicting characters from Cannery Row, historical plaques, and sculptured busts depicting Steinbeck and Ricketts.[18], 15469=Steinbeck graduated from Salinas High School in 1919 and went from there to study English Literature at Stanford University in Palo Alto, leaving, without a degree, in 1925. He travelled to New York City where he took odd jobs while trying to write. When he failed to have his work published, he returned to California and worked in 1928 as a tour guide and caretaker[10] at Lake Tahoe, where he met Carol Henning, his first wife.[6][10][11] The two were married in January 1930 in Los Angeles, where, with friends, he attempted to make money by manufacturing plaster mannequins.[10], 47051=In 1962, Steinbeck won the Nobel Prize for literature for his \"realistic and imaginative writing, combining as it does sympathetic humor and keen social perception.\" The selection was heavily criticized, and described as \"one of the Academy's biggest mistakes\" in one Swedish newspaper.[25] The reaction of American literary critics was also harsh. The New York Times asked why the Nobel committee gave the award to an author whose \"limited talent is, in his best books, watered down by tenth-rate philosophising\", noting that \"[T]he international character of the award and the weight attached to it raise questions about the mechanics of selection and how close the Nobel committee is to the main currents of American writing.... [W]e think it interesting that the laurel was not awarded to a writer ... whose significance, influence and sheer body of work had already made a more profound impression on the literature of our age\".[25] Steinbeck himself, when asked on the day of the announcement if he deserved the Nobel, replied: \"Frankly, no.\"[10][25] Biographer Jackson Benson notes, \"[T]his honor was one of the few in the world that one could not buy nor gain by political maneuver. It was precisely because the committee made its judgment ... on its own criteria, rather than plugging into 'the main currents of American writing' as defined by the critical establishment, that the award had value.\"[10][25] In his acceptance speech later in the year in Stockholm, he said:, 54805=In June 1949, Steinbeck met stage-manager Elaine Scott at a restaurant in Carmel, California. Steinbeck and Scott eventually began a relationship and in December 1950 Steinbeck and Scott married, within a week of the finalizing of Scott's own divorce from actor Zachary Scott. This third marriage for Steinbeck lasted until his death in 1968.[12], 67380=His later work reflected his wide range of interests, including marine biology, politics, religion, history and mythology. One of his last published works was Travels with Charley, a travelogue of a road trip he took in 1960 to rediscover America., 28973=Steinbeck followed this wave of success with The Grapes of Wrath (1939), based on newspaper articles about migrant agricultural workers that he had written in San Francisco. It is commonly considered his greatest work. According to The New York Times, it was the best-selling book of 1939 and 430,000 copies had been printed by February 1940. In that month it won the National Book Award, favorite fiction book of 1939, voted by members of the American Booksellers Association.[14] Later that year it won the Pulitzer Prize for Fiction[15] and it was adapted as a film directed by John Ford, starring Henry Fonda as Tom Joad; Fonda was nominated for the best actor Academy Award., 3894=John Ernst Steinbeck, Jr. (February 27, 1902 – December 20, 1968) was an American author of twenty-seven books, including sixteen novels, six non-fiction books, and five collections of short stories. He is widely known for the comic novels Tortilla Flat (1935) and Cannery Row (1945), the multi-generation epic East of Eden (1952), and the novellas Of Mice and Men (1937) and The Red Pony (1937). The Pulitzer Prize-winning The Grapes of Wrath (1939), widely attributed to be part of the American literary canon,[2] is considered Steinbeck's masterpiece. In the first 75 years since it was published, it sold 14 million copies.[3], 56015=In 1966, Steinbeck traveled to Tel Aviv to visit the site of Mount Hope, a farm community established in Israel by his grandfather, whose brother, Friedrich Grosssteinbeck, was murdered by Arab marauders in 1858 in what became known as the Outrages at Jaffa.[30], 19864=Between the years 1930 to 1936, Steinbeck and Ricketts became close friends. Steinbeck's wife began working at the lab as secretary-bookkeeper.[10] Steinbeck himself began helping out on an informal basis.[10] They formed a common bond based on their love of music and art, and John learned biology and Ricketts' ecological philosophy.[10] When Steinbeck became emotionally upset, Ricketts would sometimes play music for him.[10], 81870=In a 1942 letter to United States Attorney General Francis Biddle, John Steinbeck wrote: \"Do you suppose you could ask Edgar's boys to stop stepping on my heels? They think I am an enemy alien. It is getting tiresome.\"[50] The FBI denied that Steinbeck was under investigation., 35180=Steinbeck's close relations with Ricketts ended in 1941 when Steinbeck moved away from Pacific Grove and divorced his wife Carol.[18] Ricketts' biographer Eric Enno Tamm notes that, except for East of Eden (1952), Steinbeck's writing declined after Ricketts' untimely death in 1948.[21], 36129=Steinbeck's novel The Moon Is Down (1942), about the Socrates-inspired spirit of resistance in an occupied village in Northern Europe, was made into a film almost immediately. It was presumed that the unnamed country of the novel was Norway and the occupiers the Nazis, and in 1945 Steinbeck received the Haakon VII Cross of freedom for his literary contributions to the Norwegian resistance movement., 23702=Steinbeck achieved his first critical success with Tortilla Flat (1935), a novel set in post-war Monterey, California, that won the California Commonwealth Club's Gold Medal.[12] It portrays the adventures of a group of classless and usually homeless young men in Monterey after World War I, just before U.S. prohibition. They are portrayed in ironic comparison to mythic knights on a quest and reject nearly all the standard mores of American society in enjoyment of a dissolute life centered around wine, lust, camaraderie and petty theft. In presenting the 1962 Nobel Prize to Steinbeck, the Swedish Academy cited \"spicy and comic tales about a gang of paisanos, asocial individuals who, in their wild revels, are almost caricatures of King Arthur's Knights of the Round Table. It has been said that in the United States this book came as a welcome antidote to the gloom of the then prevailing depression.\"[1] Tortilla Flat was adapted as a 1942 film of the same name, starring Spencer Tracy, Hedy Lamarr and John Garfield, a friend of Steinbeck's. With some of the proceeds he built a summer ranch-home in Los Gatos.[citation needed], 60904=At the same time, The Grapes of Wrath has been banned by school boards: in August 1939, Kern County Board of Supervisors banned the book from the county's publicly funded schools and libraries.[17] It was burned in Salinas on two different occasions.[33][34] In 2003, a school board in Mississippi banned it on the grounds of profanity.[35] According to the American Library Association Steinbeck was one of the ten most frequently banned authors from 1990 to 2004, with Of Mice and Men ranking sixth out of 100 such books in the United States.[36][37], 5395=The winner of the 1962 Nobel Prize in Literature, he has been called \"a giant of American letters\".[4] His works are widely read abroad and many of his works are considered classics of Western literature., 74269=To commemorate the 112th anniversary of Mr. Steinbeck's birthday on February 27, 2014, Google displayed an interactive doodle utilizing animation which included illustrations portraying scenes and quotes from several novels by the author.[42][43][44], 11023=John Jr. was born on February 27, 1902, in Salinas, California. He was of German, English, and Irish descent.[5] Johann Adolf Großsteinbeck, Steinbeck's paternal grandfather, had shortened the family name to Steinbeck when he emigrated to the United States. The family farm in Heiligenhaus, Mettmann, North Rhine-Westphalia, Germany, is still today named \"Großsteinbeck.\", 88958=In 1960, Steinbeck bought a pickup truck and had it modified with a custom-built camper top – which was rare at the time – and drove across the United States with his faithful 'blue' standard poodle, Charley. Steinbeck nicknamed his truck Rocinante after Don Quixote's \"noble steed\". In this sometimes comical, sometimes melancholic book, Steinbeck describes what he sees from Maine to Montana to California, and from there to Texas and Louisiana and back to his home on Long Island. The restored camper truck is on exhibit in the National Steinbeck Center in Salinas., 54400=In May 1948, Steinbeck went back to California on an emergency trip to be with his friend Ed Ricketts, who had been seriously injured when his car was struck by a train. Ricketts died hours before Steinbeck arrived. Upon returning home, Steinbeck was confronted by Gwyn, who asked for a divorce, which became final in August. Steinbeck spent the year after Ricketts' death in deep depression., 42089=In 1952 Steinbeck's longest novel, East of Eden, was published. According to his third wife, Elaine, he considered it his magnum opus, his greatest novel., 22191=After Cup of Gold, between 1930 and 1933 Steinbeck produced three shorter works. The Pastures of Heaven, published in 1932, consists of twelve interconnected stories about a valley near Monterey, which was discovered by a Spanish corporal while chasing runaway Indian slaves. In 1933 Steinbeck published The Red Pony, a 100-page, four-chapter story weaving in memories of Steinbeck's childhood.[12] To a God Unknown, named after a Vedic hymn,[10] follows the life of a homesteader and his family in California, depicting a character with a primal and pagan worship of the land he works. Although he still had not achieved the status of a well-known writer, he never doubted that he would achieve greatness.[10], 87864=Steinbeck deals with the nature of good and evil in this Salinas Valley saga. The story follows two families: the Hamiltons – based on Steinbeck's own maternal ancestry – and the Trasks, reprising stories about the Biblical Adam and his progeny. The book was published in 1952. It was made into a 1955 movie directed by Elia Kazan and starring James Dean., 42340=In 1952, John Steinbeck appeared as the on-screen narrator of 20th Century Fox's film, O. Henry's Full House. Although Steinbeck later admitted he was uncomfortable before the camera, he provided interesting introductions to several filmed adaptations of short stories by the legendary writer O. Henry. About the same time, Steinbeck recorded readings of several of his short stories for Columbia Records; despite some stiffness, the recordings provide a record of Steinbeck's deep, resonant voice., 57765=John Steinbeck died in New York City on December 20, 1968, of heart disease and congestive heart failure. He was 66, and had been a lifelong smoker. An autopsy showed nearly complete occlusion of the main coronary arteries.[12], 38453=Steinbeck returned from the war with a number of wounds from shrapnel and some psychological trauma. He treated himself, as ever, by writing. He wrote Alfred Hitchcock's Lifeboat (1944), and the film A Medal for Benny (1945) with screenwriter Jack Wagner about paisanos from Tortilla Flat going to war. He later requested that his name be removed from the credits of Lifeboat because he believed the final version of the film had racist undertones. In 1944, suffering from homesickness for his Pacific Grove/Monterey life of the 1930s, he wrote Cannery Row (1945) which became so famous that Ocean View Avenue in Monterey, the location of the book, was eventually renamed Cannery Row in 1958., 41021=In 1947, Steinbeck made the first of many trips to the Soviet Union, this one with photographer Robert Capa. They visited Moscow, Kiev, Tbilisi, Batumi and Stalingrad, some of the first Americans to visit many parts of the USSR since the communist revolution. Steinbeck's 1948 book about their experiences, A Russian Journal, was illustrated with Capa's photos. In 1948, the year the book was published, Steinbeck was elected to the American Academy of Arts and Letters., 52056=Although modest about his own talent as a writer, Steinbeck talked openly of his own admiration of certain writers. In 1953, he wrote that he considered cartoonist Al Capp, creator of the satirical Li'l Abner, \"possibly the best writer in the world today.\"[27] At his own first Nobel Prize press conference he was asked his favorite authors and works and replied: \"Hemingway's short stories and nearly everything Faulkner wrote.\"[10], 55496=In 1962 Steinbeck began acting as friend and mentor to the young writer and naturalist Jack Rudloe, who was trying to establish his own biological supply company, now Gulf Specimen Marine Laboratory in Florida. Their correspondence continued until his death.[29], 28158=Of Mice and Men was also adapted as a 1939 Hollywood film, with Lon Chaney, Jr. as Lennie (he had filled the role in the Los Angeles stage production) and Burgess Meredith as George.[13] Meredith and Steinbeck became close friends for the next two decades.[10] Another film based on the novella was made in 1992 starring Gary Sinise as George and John Malkovich as Lennie.}", "lastModified": "Wed, 29 Jul 2015 19:34:09 GMT", "textBeforeTable": "Bibliography[edit] In 1960, Steinbeck bought a pickup truck and had it modified with a custom-built camper top – which was rare at the time – and drove across the United States with his faithful 'blue' standard poodle, Charley. Steinbeck nicknamed his truck Rocinante after Don Quixote's \"noble steed\". In this sometimes comical, sometimes melancholic book, Steinbeck describes what he sees from Maine to Montana to California, and from there to Texas and Louisiana and back to his home on Long Island. The restored camper truck is on exhibit in the National Steinbeck Center in Salinas. Travels with Charley: In Search of America Main article: Travels with Charley[edit] Steinbeck deals with the nature of good and evil in this Salinas Valley saga. The story follows two families: the Hamiltons – based on Steinbeck's own maternal ancestry – and the Trasks, reprising stories about the Biblical Adam and his progeny. The book was published in 1952. It was made into a 1955 movie directed by Elia Kazan and starring James Dean. East of Eden (novel) Main article: East", "textAfterTable": "Filmography[edit] 1939—Of Mice and Men—directed by Lewis Milestone, featuring Burgess Meredith, Lon Chaney, Jr., and Betty Field 1940—The Grapes of Wrath—directed by John Ford, featuring Henry Fonda, Jane Darwell and John Carradine 1941—The Forgotten Village—directed by Alexander Hammid and Herbert Kline, narrated by Burgess Meredith, music by Hanns Eisler 1942—Tortilla Flat—directed by Victor Fleming, featuring Spencer Tracy, Hedy Lamarr and John Garfield 1943—The Moon is Down—directed by Irving Pichel, featuring Lee J. Cobb and Sir Cedric Hardwicke 1944—Lifeboat—directed by Alfred Hitchcock, featuring Tallulah Bankhead, Hume Cronyn, and John Hodiak 1944—A Medal for Benny—directed by Irving Pichel, featuring Dorothy Lamour and Arturo de Cordova 1947—La Perla (The Pearl, Mexico)—directed by Emilio Fernández, featuring Pedro Armendáriz and María Elena Marqués 1949—The Red Pony—directed by Lewis Milestone,", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}