{"relation": [["Subject", "LDrawInfoTip.dll - Does it still work?", ""], ["Author", "Owen Dive", ""], ["Views", "884", ""], ["Posted", "September 29, 2013 07:47AM", ""]], "pageTitle": "LDrawInfoTip.dll - Does it still work?", "title": "", "url": "http://forums.ldraw.org/read.php?26,10096,10096", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00059-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 101442755, "recordOffset": 101434553, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Facebook Tweet RSS Quote Reply Owen Thanks and regards, However, that thread (and the dll itself) is now over a decade and several OS versions old. Does it still do what it's supposed to do on a modern (read:64-bit) system? http://news.lugnet.com/cad/?n=9289 which at least tells me what it's supposed to do. All I could find of any use (there are a lot of posts to anti-virus forums containing this file as output of some virus scanner or other) was this LUGNET thread I was poking around in my LDraw installation this evening, and came across LDrawInfoTip.dll in %LDRAWDIR%/Apps/LDrawToolTip/. It doesn't correspond to any tool that I can recall, so I tried to find out what it was. Hi all. Registered: 3 years ago Posts: 10 September 29, 2013 07:47AM Owen Dive Print View New Topic Message List Forum List Next MessagePrevious Message } previewer.innerHTML = \" \"; previewer.style.display = \"none\"; previewhelp.style.display =", "textAfterTable": "Sorry, only registered users may post in this forum. Click here to login General Models and Parts LDraw Programs Administrative Off Topic   Recent Messages LDraw.org Announcements General LDraw.org Discussion Official File Specifications/Standards Help Wanted Help MOCs (My Own Creations) Official Models Rendering Techniques Parts Authoring Part Requests LDraw Editors and Viewers LDraw File Processing and Conversion Parts Author Tools All Other Programs. Website Suggestions/Requests/Discussion Standards Committee Off-Topic", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}