{"relation": [["Author", "EvilPuffBall", "EvilPuffBall", "EvilPuffBall", "EvilGiegue", "Erniewan", "Erniewan", "Emperor_Bambi"], ["Title", "App: Mr Saturn Time", "App: Earthbound Screensaver", "App: Ness Mouse Trailer", "Action: Mommy!", "EarthBound Crossword", "EB Crossword Solution", "Starmen Dashboard Widget"], ["Description", "SaturnTime is simply a clock program I wrote, but have no idea why I chose to write it. Anyway, Here's a sumary of all the keys that can be used in SaturnTime: H brings up key help file. E Closes SaturnTime N Disables \"Always on top\" status Y Enables \"Always on top\" status Enjoy! PS: It tells you the data if you can manage to read that as well.", "EBScreenSaver (EBScreenSaver.scr) (v1.73) ;) Okay, for some odd reason I decided that I wanted to write a screensaver. Which is why this file is here, no? I'm not gonna take credit for the Sprites, they were created by Potato and used by Spaanoft in his Seek & Tag game. (all I did was merge them all into one big file and change it's format some so it was smaller and more compressible.) You may make requests for additional functions/changes to: (read txt file) or you could send me a PM on the sm-net forums. I fixed the screensaver VerifyPassword bypass security hole, YEAH! (yeesh, that sentence was full of syllabyls) Latest Changes (From 1.43 to 1.73) - Added Runaway 5 sprites (Turn them on via the Config mode) - Improved Music quality (at the cost of memory and load time) - Added more frames of animation to the backgrounds - You're now able to turn off the sprites. (bug fix) --------- Install by right-clicking on the screensaver and choosing Install. Test by double-clicking ---------", "Fan Application - Ness follows the Cursor around on the screen with this app. Moves (and change's Ness' picture) every 0.1 seconds.", "Fan Game - Not to be confused with the Funfest Version, this is a new, full-length action game using a completely remade engine. It improves on it in every way, featuring more levels, bosses, enemies and playable characters, not to mention better controls and gameplay. Rescue the Runaway Five and help them save Venus before she is turned into a mindless zombie drone by Master Belch and his horde of music-hating undead", "It's not exactly a drawing, but hey, it's art! See if you can finish this puzzle, where you have to think with an EB-mindset.", "The solution to my EB Crossword puzzle. (Please Spoiler this)", "Here's something cool: a Dashboard widget for Mac OS X 10.4.3 and above. \"Starmen\", the name of the widget, shows you on the latest update on the site via zushiba's RSS feed. Note: if you're against MOTHER 3 spoilers, don't use this app--it shows the thumbnails of MOTHER 3 artwork WITHOUT the spoiler warning."], ["Date", "1/23/05", "1/23/05", "1/23/05", "1/23/05", "5/30/08", "5/30/08", "11/3/07"], ["Rank", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - Fan Programs", "title": "", "url": "http://starmen.net/fanprograms/gallery.php?ret=nothing&box12450=AuthDESC&box12450FirstLetter=E", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00010-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 223881381, "recordOffset": 223873179, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> Z X W T S R Q P O N M L K J H F E D C B < Fan Programs - All: News: Forums Store Super Smash Bros. Brawl Mother 1+2 Mother 3 (EarthBound 64) Mother 2 (EarthBound) View via SSL to Login _kiq.push(['identify', 'not logged in']);", "textAfterTable": "1 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day. Fan Programs Database RPG Games Action Games Minigames Applications Community Dev's Corner Tutorials Resources Game Showcase Navigation Fan Prog. Home Submission Form Rules & Guidelines SectionForum Activities:", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}