{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13"], ["Name", "ExplicitIntro", "ExplicitBurnin' (feat. Tre Nyce)", "ExplicitPhenomenon (feat. Paul Wall)", "ExplicitWhoa!", "ExplicitMagnum", "ExplicitFly Away", "ExplicitThe Party Don't Stop", "ExplicitDoin' My Thang (feat. UnderRated of Potluck)", "ExplicitGirls, Girls, Girls", "ExplicitOcean View", "ExplicitLet's Dance!", "ExplicitU Mad Bro?", "ExplicitStill the King!!!"], ["Artist", "Brokencyde", "Brokencyde", "Brokencyde", "Brokencyde", "Brokencyde", "Brokencyde", "Brokencyde", "Brokencyde", "Brokencyde", "Brokencyde", "Brokencyde", "Brokencyde", "Brokencyde"], ["Time", "0:37", "3:28", "4:02", "3:54", "2:56", "3:06", "2:52", "3:45", "2:43", "3:08", "2:35", "3:19", "4:01"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Guilty Pleasure by Brokencyde", "title": "", "url": "https://itunes.apple.com/gr/album/guilty-pleasure/id468584625", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00338-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 875129395, "recordOffset": 875104180, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{26522=Formed: 2007 in Albuquerque, NM, 121834=Copyright © 2014 Apple Inc. Με επιφύλαξη παντός δικαιώματος.}", "lastModified": "Sat, 01 Aug 2015 05:00:14 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Brokencyde Guilty Pleasure iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Guilty Pleasure by Brokencyde, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "13 Songs Album Review On their third album, Brokencyde deliver a more subdued effort that emphasizes “crunk” over “core” with Guilty Pleasure, a title that shows an odd sense of self-awareness from the band. The thing that stands out the most here is the noticeable reduction in the screamed vocals, maturing the band from a screamo/rap hybrid into more of a typical club rap group. Rest assured, though, nothing has changed lyrically. Brokencyde are just as into smoking blunts, popping bottles, and sharing their late-night freaky tales as they’ve ever been, so while the execution has changed, the content is still more or less the same as it has ever been. With songs like the hater-addressing “U Mad Bro?,” it’s clear that the bandmembers aren’t worried about making converts out of any of their naysayers, and instead are fine with making an album that’s aimed at their hardcore fans. Given how much Brokencyde seem to thrive on people hating them, that's probably exactly the way they want it. Biography Formed: 2007 in Albuquerque, NM Genre: Pop Years Active: '00s, '10s Self-described \"scene\" kids from Albuquerque, New Mexico, Brokencyde (as in \"broke inside\") mix pop-rap, dance music, and some screamo vocals into a love-it-or-hate-it brew", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}