{"relation": [["Title", "African Noel – TTB", "Agnus Dei – SATB", "Amor De Mi Alma – SATB", "And Nature Smiled – SSA", "Annie Laurie – 2 Part", "Autumn Vesper – SAB", "Baba Yetu – SATB", "Bells, The – SATB", "Confitemini Domino – 3 Part", "Cry Out and Shout – SATB", "Cum Sancto Spiritu – SAB", "Dance on My Heart – SSA", "Dark Night of the Soul – SSAATTBB", "Domine, labia mea aperies – SATB", "Ezekiel Saw the Wheel – TTBB", "Festival Sanctus – SATB", "Gallant Knight, The – TBB", "Gartan Mother’s Lullaby, The – SATB", "Hark, I Hear the Harps Eternal – SATB", "Homeward Bound – SATB", "How Can I Keep from Singing? – SATB", "I Am Not Yours – SSATBB", "I Know an Old Woman – SSA", "Instruments of Praise – SSAA", "Is it Nothing to You? (O Vos Omnes) – SATB", "Jubilate Deo – SATB", "Kyrie – SATB", "Lamb and The Tiger, The – 2 Part", "Laudate Dominum – SATB", "Night Winds – SA", "Novum Gaudia – TB", "O Rushing Wind – 2 Part", "O Sing Out Forever – SAB", "Pie Jesu – SATB", "Rise Up Shepherd and Follow – SATB", "Rock My Soul – SSAA", "Sing Me a Song of a Lad That is Gone – TTB", "Sing We Joy – SATB", "Song of the River – Unison", "Stars I Shall Find – TTBB", "Swallow, The – SSA", "Tarantella – TTBB", "Ticket to the Kingdom – SATB", "Tiger, The – 3 Part Mixed", "Torah Orah – SA", "Ubi Caritas – SATB", "Wade in de Water – SATB", "Weep No More – SSAA", "What Shall We Do with a Drunken Sailor? – TTBB"], ["Comp/Arr", "Moore, Donald; South African Folk Song", "Porterfield, Sherri", "Stroope, Z. Randall; de la Vega, Garcialso", "Koepke, Allen", "Scott, Lady John; Rentz, Earlene; Douglass, William", "Snyder, Audrey", "Tin, Christopher; Kiagiri, Chris", "Ahrold, Frank", "Gilpin, Greg", "Nystedt, Knut", "Lotti, Antonio; Liebergen, Patrick M.", "Koepke, Allen", "Gjeilo, Ola; St. John of the Cross,", "Lassus, Orlandus; Archibeque, Charlene", "Spiritual; King, Betty Jackson", "Leavitt, John", "Patterson, Mark", "Traditional Irish; Ginsberg, Neil", "Traditional; Parker, Alice", "Keen, Marta; Althouse, Jay", "Gilpin, Greg", "Stroope, Z. Randall; Teasdale, Sara", "Mills, Alan; Morton, Debra; Bonne, Rose", "Koepke, Allen", "Victoria, Tomas Luis da; Klein, Maynard", "Martinson, Joel", "Porterfield, Sherri", "Gray, Cynthia; Blake, William", "Juneau, Thomas", "Farnell, L.; Cotter, Jr., Joseph S.", "12th Century French Carol; Singh, Vijay", "Patterson, Mark", "Purcell, Henry; Liebergen, Patrick M.", "Gilpin, Greg", "Traditional African-American Spiritual; Jefferson, Robert", "Spiritual; Schallehn, Hilger", "Porterfield, Sherri", "Purcell, Henry; Liebergen, Patrick M.", "Patterson, Mark", "Dickau, David C.; Teasdale, Sara", "Newfoundland Folk Song; Schram, Ruth Elaine", "Stroope, Z. Randall", "Moore, Donald", "Porterfield, Sherri", "Hebrew folk song; Adams, Brant", "Gjeilo, Ola", "Spiritual; Koepke, Allen", "Childs, David N.", "Traditional Sea Shanty; Eddleman, David"], ["Publisher", "BriLee Music Publishing Co.", "Alfred Publishing Co., Inc.", "Walton Music Corp", "Santa Barbara Music Publishing", "BriLee Music Publishing Co.", "Alfred Publishing Co., Inc.", "Alfred Publishing Co., Inc.", "Alfred Publishing Co., Inc.", "BriLee Music Publishing Co.", "Alfred Publishing Co., Inc.", "Alfred Publishing Co., Inc.", "Santa Barbara Music Publishing", "Walton Music Corp", "Santa Barbara Music Publishing", "Alfred Publishing Co., Inc.", "Alfred Publishing Co., Inc.", "BriLee Music Publishing Co.", "Santa Barbara Music Publishing", "Alfred Publishing Co., Inc.", "Alfred Publishing Co., Inc.", "BriLee Music Publishing Co.", "Walton Music Corp", "BriLee Music Publishing Co.", "Santa Barbara Music Publishing", "GIA Publications Inc", "GIA Publications Inc", "Alfred Publishing Co., Inc.", "BriLee Music Publishing Co.", "Carl Fischer LLC.", "BriLee Music Publishing Co.", "BriLee Music Publishing Co.", "BriLee Music Publishing Co.", "BriLee Music Publishing Co.", "Alfred Publishing Co., Inc.", "Carl Fischer LLC.", "Schott Music GmbH & Co KG", "Alfred Publishing Co., Inc.", "BriLee Music Publishing Co.", "BriLee Music Publishing Co.", "Walton Music Corp", "BriLee Music Publishing Co.", "Carl Fischer LLC.", "Alfred Publishing Co., Inc.", "Alfred Publishing Co., Inc.", "Santa Barbara Music Publishing", "Walton Music Corp", "Santa Barbara Music Publishing", "Santa Barbara Music Publishing", "Carl Fischer LLC."], ["Pepper Level", "ME", "M", "MA", "M", "E", "E", "MA", "ME", "ME", "MA", "ME", "M", "MA", "MA", "ME", "ME", "E", "ME", "M", "ME", "ME", "MA", "M", "ME", "MA", "MA", "ME", "ME", "MA", "ME", "E", "ME", "ME", "ME", "MA", "M", "ME", "E", "E", "MA", "E", "MA", "ME", "ME", "ME", "M", "M", "M", "M"]], "pageTitle": "Blog - SmartMusic", "title": "", "url": "http://www.smartmusic.com/blog/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00204-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 706247875, "recordOffset": 706213984, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{94667=Mr. Rush is active as a clinician and adjudicator and has presented workshops for various universities, school districts, and conferences throughout the United States and Canada. He is the author or co-author of six highly touted books published by GIA Publications. They are: “Habits of a Successful Band Director,” “The Evolution of a Successful Band Director,” “Habits of a Successful Musician,” “Habits of a Successful Middle School Band Director,” “Habits of a Successful String Musician,” and “Quality of Life Habits of a Successful Band Director.” He has been the recipient of the National Band Association’s Citation of Excellence on five occasions and is a former board member of the NBA. In 2010, Mr. Rush was elected into the prestigious American Bandmasters Association and in 2015 was elected into the South Carolina Band Directors Association Hall of Fame., 66236=Together we plan to release a web-based SmartMusic, compatible with Chromebooks, for back-to-school 2016. To meet this ambitious time frame, existing Weezic products will be wound down over the coming months, allowing our development staff (including those in our new Paris office) to focus on the effort., 35998=I started Standing ‘O’ Marching during my time at graduate school in 2006-2007. After aging out of drum corps, I still wanted to stay as involved in the marching activity as much as possible. I was instructing numerous marching bands in my area at the time, and wanted to get more involved with writing marching band music., 32372=After my first year of high school marching band, I joined the Jersey Surf Drum and Bugle Corps, based in Mt. Holly, NJ, and spent 6 years there (’99-’04), 4 in the hornline as soprano section leader and soloist, and 2 years as drum major. After that, I finished my DCI performing career with 2 years in the Concord Blue Devils on upper lead trumpet in 2005 and 2006. “The Godfather, Part Blue” was my age out show, with finals in Madison, WI, where I started in 1999 with my first finals in the Jersey Surf. It was an incredible experience to come full circle at Camp Randall Stadium!, 19536=We hope to see you there! Stop by booth #4055 and get more information on how we’re bringing SmartMusic to Chromebook, our brand new choir repertoire, and how Texas Proclamation 2015 could fund SmartMusic in your classroom., 19363=The 2015 Southwest Summer Music Exhibition begins this Thursday on the beautiful River Walk in San Antonio, Texas., 36889=Now wrapping up the 2015 writing season, I am fortunate to have 45 bands performing my music this year., 40214=Once I saw the SmartMusic demo in 2012, I knew it would be beneficial for my program. With minimal rehearsal time and widely varying instrumentation in each grade, I typically compose or arrange the concert music myself. With SmartMusic, I am able to make SmartMusic files of all of the concert music: either the music I select is already in the SmartMusic catalog, or I can simply make my own SmartMusic files in Finale., 116913=© Copyright 2015 // MakeMusic, Inc., 42764=Band directors tell me that on the competition field, individual music scores specifically have been a strong point as a result of the work students can do with SmartMusic, which benefits every aspect of the performance. I typically have all of my marching band writing completed by mid-June before I leave for DCI, with my earliest bands receiving their full shows in February/March., 9840=[Excerpts taken from: Pearson, Bruce and Nowlin, Ryan. Teaching Band With Excellence. San Diego: Neil A. Kjos Music Company, 2011.], 8525=Establish a positive atmosphere and aura of confidence with an energetic piece that is not too difficult, such as a march., 36366=I started by building my own website, which, in 2006, was not nearly as convenient or easy as it is today. While it wasn’t the most visually appealing, I was proud to have built it myself and have something concrete to get started. Before launching the website, I wrote my first three original shows so I could have some material available. In the spring of 2007, Standing ‘O’ Marching officially hit the web, and that year I started by arranging for two local New Jersey Bands., 77953=Billy Strayhorn (1915-1967), an American composer, pianist, and arranger, composed “Take the ‘A’ Train” in 1939. Duke Ellington had offered Strayhorn a job in his orchestra and gave him money to travel from Pittsburgh to New York City. Ellington wrote directions for Strayhorn to get to his house by subway. The note started, “Take the ‘A’ train…” and Strayhorn used it as the title for his composition which was to become the theme song of Duke Ellington and his orchestra, one of their biggest hits, and one of the masterpieces of jazz repertoire., 65426=Members of the Weezic and MakeMusic teams, seen in MakeMusic’s Boulder offices in June, 2015., 38818=At The Midwest Clinic in Chicago, 2012, I was exhibiting across from the MakeMusic booth, so I had the good fortune of watching the SmartMusic demo about 20 times a day throughout the convention. The guys giving the demo were outstanding and really showcased the program practically. By the end of the week, I was hooked and ready to dive in with my students. I had a flash drive from the MakeMusic booth loaded with information about SmartMusic, as well as product information to pass on to my school administration., 93777=Scott Rush is the Director of Fine and Performing Arts for Dorchester School District Two in South Carolina. Prior to that appointment, he was Director of Bands at Wando High School in Mount Pleasant, South Carolina for 15 years. He is a graduate of the New England Conservatory of Music in Boston, Massachusetts, where he received a Master of Music degree in French Horn Performance. Under his direction, the Wando Symphonic Band performed at the 2007 Midwest International Band and Orchestra Clinic in Chicago, Illinois. In 2008, the Wando Band program received the prestigious Sudler Flag of Honor by the John Philip Sousa Foundation.}", "textBeforeTable": "Last week we added 49 SmartMusic choir titles to our continually growing collection of repertoire: July 14, 2015 | by Scott Yoho ﻿ SmartMusic Choir Repertoire Released Permalink | Comments (0) Tags: marching band > middle school. Stein > Standing 'O' Marching Educator Insights Educator Spotlight News Thanks again to Rob for taking time out of his action-packed schedule to provide his insight. Have questions about SmartMusic", "textAfterTable": "You can request a piece for a future SmartMusic release here. News Repertoire Tags: choir > choral Permalink | Comments (0) MakeMusic Acquires Weezic July 9, 2015 | by Scott Yoho ﻿ Early this morning we announced that MakeMusic has acquired Weezic, the augmented sheet music innovator. View the press release. Members of the Weezic and MakeMusic teams, seen in MakeMusic’s Boulder offices", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}