{"relation": [["Side B Titles", "1. School Of Eyes", "2. Despicable Animal", "3. Paradise", "4. I Know The Law", "5. Logic Of Color"], ["Artist", "Wye Oak", "Wye Oak", "Wye Oak", "Wye Oak", "Wye Oak"], ["Length", "04:14", "04:50", "04:21", "03:44", "02:59"]], "pageTitle": "Wye Oak - Shriek (Vinyl LP) - Amoeba Music", "title": "", "url": "http://www.amoeba.com/shriek-lp-wye-oak/albums/3129399/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00099-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 291113139, "recordOffset": 291094220, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{1747=04/28/2014, 14329=Copyright © 2015 Amoeba, All Rights Reserved. Amoeba and the Amoeba Music mark and logo are trademarks of Amoeba Music Inc.}", "lastModified": "Sat, 01 Aug 2015 03:47:33 GMT", "textBeforeTable": "Track Listing Sometimes you need a change. Baltimore duo Wye Oak have been at it for a few years, producing great albums like 2011’s Civilian, but touring for that album left the band exhausted, and they were living in different cities. With new synthesizers in the place of guitars and drums, Wye Oak’s sound is reimagined on the stunning Shriek. Jenn Wasner sounds revelatory on opener “Before,” singing over dreamy synth washes and retro computer loops. Every instrument seems to occupy its own perfect space on the title track, creating a lovely little syncopated groove, while Wasner sings beautifully with high-flying abandon. That gorgeous opening makes way for Wye Oak to experiment a bit. “Tower” sees the band employing an R&B-inspired, stuttering groove, drawing influence from the spacey krautrock of Can as well as Timbaland and Missy Elliott’s work with Aaliyah. The changes sound so thrilling because Wye Oak clearly thrive in their new territory, moving freely through the sexy, Fleetwood Mac-inspired “Glory,” in which they sound like wise, older siblings to recent pop group Haim. And in the album’s loungier second half, the band produces robotic, poolside glamour (“Despicable Animal”); intricate, jungly noise (“Paradise”) and lush, adult pop (“Logic of Color”). Playing new wave sophisticates suits Wye Oak quite well, giving them new life with brilliant results. 04/28/2014 Amoeba Review", "textAfterTable": "Side B Titles Artist Length 1. School Of Eyes Wye Oak 04:14 2. Despicable Animal Wye Oak 04:50 3. Paradise Wye Oak 04:21 4. I Know The Law Wye Oak 03:44 5. Logic Of Color Wye Oak 02:59 BUY $22.98 SHIPS FREE in U.S. 1 used from 14.99 Also available in: CD , Download", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}