{"relation": [["Time", "8pm", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""], ["Song", "String Quartet Describing the Motion of Large Real Bodies", "VII", "A Fallin Leaf", "Wreches: My Heart", "Trees in a Row", "Katsaros", "", "Sunstroke", "Sarasate: Zigeunerweisen, Op. 20", "First Reading", "Arm Dormant", "Dance No. 1", "Psycotic Orange", "Simple Geographies", "The Taur and Tame", "Let's Go Find A Quiet Place to Cool Down", "", "Four Voice Cannon #3", "Combination Pizza Hut and Taco Bell", "Ring for Endless Travel", "Hover", "Stratum Spongiosum", "Found Wanting", "Orbling"], ["Artist", "Robert Ashley", "Little Women", "Assif Tsahar, Cooper-Moore, Hamid Drake", "Microkingdon", "Hi Red Center", "Yannis Kyriakides & Andy Moor", "", "Throbbing Gristle", "Edgar Meyer with Bela Fleck and Mike Marshall", "Mike Reed's People, Places, & Things", "Marina Rosenfeld", "Marty Erhlich's Dark Woods Ensemble", "Merzbow", "LO MOdA", "Tortoise", "The Gang Font feat. Interloper", "", "Larry Polansky", "Das Racist", "David Torn", "Gerald Cleaver", "Lawrence casserley/Adam Linson", "Aram Shelton, jason Ajemian, and Timothy M. Daisy", "Scatter"], ["Album", "String Quartet Describing the Motion of Large Real Bodies", "Throat", "Lost Brother", "Wreches: My Heart/Double Abacus", "Assemble", "Rebetika", "", "Assume Power Focus", "Uncommon Ritual", "About Us", "Melatonin: Meditations On Sound In Sleep", "Just Beofre The Dawn", "Merzbox 21 Pornoise Extra", "Replica Watches", "Millions Living Will Never Die", "The Gang Font feat. Interloper", "", "Music From Mills", "Shut Up, Dude", "Prezens", "Adjust", "Integument", "Dragons 1976", "Suprising Sing Stupendous Love"]], "pageTitle": "taintradio » 2011 » May", "title": "", "url": "http://taintradio.org/2011/05/page/2/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00217-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 233991667, "recordOffset": 233974907, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{357=Posted by David Menestres on May 15, 2011 @ 8:00 pm | Post a comment, 7013=Posted by Brian Cullman on May 20, 2011 @ 10:43 pm | Post a comment, 4188=Today’s Music – Right Now!   Artist – Song Title – CD Title – Label – Year   Noon (Eastern)     Wayne Wallace – Los Gatos – To Hear From There – Patois Records – 2011 Matija Dedic – Cheekee Chicks – MD In NYC – Origin Records – 2011 The Marty Nau Group – Night In Tunisia – Mood Ebony – Summit Records – 2010 Marty Williams – Monk’s Dream – Long Time Comin’ – InMoonBay Records – 2010 Takuya Kuroda – Blue Tomato – Bitter & High – Takuya Kuroda – 2010 Bill O’Connell – Rhapsody in Blue – Rhapsody in Blue – Challenge Records – 2010 Suzanne Pittson – Out Of The Hub (One Of Another Kind) – Out Of The Hub: The Music Of Freddie Hubbard – Vineland Records – 2010 The Cannonball-Coltrane Band – Jive Samba – Things Are Getting Better – Primrose Lane Music – 2010 Dave Miller Trio – Peaches – Rapture – Summit Records – 2010   1:00     Mario Romano Quartet – Autumn Leaves – Valentina – Alama Records – 2010 Chantale Gagne – Wisdom Of The Water – Wisdom of The Water – Chantale Gagne’ – 2010 Jonas Tauber – Surfin’ On The Neck – Port Saïd Street – Origin Records – 2010 Yeahwon Shin – Aquarela Do Brasil – Yeahwon – Artist Share Records – 2010 Bob Sheppard – Brain Fog – Close Your Eyes – BFM Jazz – 2010 Brad Goode – Reaching for the Moon – Tight Like This – Delmark Records – 2010 JazzVox Presents – Blue Monk – In Your Own Backyard – OA2 Records – 2010 Jonathan Kreisberg – Stir The Stars – Shadowless – New For Now Music – 2011 Q.E.D – Soft Lights – Yet What is Any Ocean… – Origin Records – 2011   2:00     Sfjazz Collective – Lonely Woman – Live 2010: 7th Annual Concert Tour – SFJazz Records – 2010 Tom Luer – You Should Have Known – Project Popular – Origin Records – 2011 Bob Szajner – Theo – On The Bench In The Zone – Quixoitic Records – 2008 Isabel Rose – Hit Me With Your Best Shot – Swingin’ From The Hip – The Jubilee Recording Company – 2010 The DeFrancesco Brothers – Take That Off – Joey & Johnny – VectorDisc – 2011 Michael Zsoldos Quartet – The Big Head – Off The Cuff – NBJ Music – 2010 Jaimee Paul – You’ve Changed – Melancholy Baby – Green Hill – 2011 Peter Paulsen Quintet – ‘Smatter – Goes Without Saying – SquarePegWorks – 2010 Todd DelGiudice – Pencil Sketches – Pencil Sketches – OA2 Records – 2010   3:00     Joey DeFrancesco, Vito Rezza, Robi Botos & Phil Dwyer – Tenderly – One Take Volume Four – Alama Records – 2010 Leslie Pintchik – I Can’t Make You Love Me – We’re Here to Listen – Leslie Pintchik – 2010 Noah Preminger – Until The Real Thing Comes Along – Before The Rain – Palmetto – 2011 Hilary Kole – Every Time We Say Goodbye With – You Are There – Justin-Time Records – 2010 Jane Ira Bloom – Life On Cloud 8 – Wingwalker – Outline – 2011 Thomas Marriott – Diagram – Constraints & Liberations – Origin Records – 2010 Julian Yeo – ‘Round Midnight – You And The Night/Night And The Music – Julian Yeo – 2011 Matt Savage – On the Farm – Welcome Home – Savage Records – 2010 Roxy Coss – Wandering One – Roxy Coss – Roxy Coss Music – 2010, 6716=Be A Hobo 0:30 The Insect Trust Hoboken Saturday Night Bissau 3:42 Francis Bebey Akwaaba Negro Down 3:57 Hosea Hargrove Tex Golden Nugget Maktoub (short version) 3:06 Aziz Sahmoui & The University of Gnawa Hankuri – Madman Jaga 4:21 Madman Jaga Nigeria Afrobeat Special Air Dit Beni Barbar 4:16 Flûtes Gasba Du Nord-Est De l’Algérie Airs Pour Gasba Et Bendir Akwaaba (Welcome) 5:54 Francis Bebey Akwaaba Double Bells 1:52 Gonga Sarki Birgui Africa And The Blues World Chant wagogo 6:11 Hukwe Ubi Zawose Tanzanie, chants des Wagogo Tomboy 4:55 Panda Bear Tomboy Nemir i strast 2:48 Azra The Ultimate Collection Walkin’ in Our Own Shoes 4:24 Papa Grows Funk Mr. Patterson’s Hat African Soldier 5:16 Seun Kuti And Egypt 80 From Africa With Fury Funky Soul 1:55 David Batiste & The Gladiators Player You Yes You 3:33 Tune-Yards W H O K I L L Tenere (The Desert, My Home) BOMBINO Agadez Hey Warden 3:11 Orange Jefferson Texas Harmonica Judgment Day 3:26 John Hammond So Many Roads Avatar 4:14 Coco Robicheaux Revelator Blues It Takes a Lot to Laugh 4:34 Taj Mahal All Blues’d Up Just LIke Paradise 4:01 Larry John McNally & Petra Haden private recording Polanksi 2:39 Chocolate Genius Inc Swansongs Grace 3:07 Fraser Anderson Little Glass Box Your Mother And I 2:33 Loudon Wainwright III More Love Songs Arbre 3:14 Kate & Anna McGarrigle Matapedia Comment Dire 2:19 Emily Loizeau L’autre Bout Du Monde Beverley/Make No Mistake 5:25 John Martyn In Session At The BBC Mona Lisa 3:35 Michael Hurley Sweetkorn Nothing Then 3:05 Punch Brothers Punch Alto Flute Quad Delay9:49 Dickie Landry Fifteen Saxophones rugby club in spain 1:53 Patricia McMillen Patricia McMillen’s Album, 4475=Posted by Ben Boddie on May 18, 2011 @ 8:47 pm | Post a comment}", "TableContextTimeStampAfterTable": "{9444=Posted by Rafi Zabor on May 14, 2011 @ 3:38 am | Post a comment, 11044=Posted by Ben Boddie on May 12, 2011 @ 12:24 pm | Post a comment, 31448=Copyright © 2015. taintradio. All rights reserved. · Log in · RSS · Website by Low Fat Designs, 5909=Posted by Barry Everitt on May 14, 2011 @ 8:00 pm | Post a comment, 27228=Posted by Ben Boddie on May 5, 2011 @ 4:06 pm | Post a comment, 15592=Posted by Ben Boddie on May 11, 2011 @ 4:03 pm | Post a comment, 7612=Hour two In Session Groanbox 2153 – Eliza Gilkyson – (Roses At The End Of Time), 27514=TODAY’S MUSIC – RIGHT NOW!   Artist – Song Title – CD Title – Label – Year   8:00 A.M. (Eastern)     Ben Kono – The Crossing – Crossing – Nineteen-Eight Records – 2011 Noah Haidu – Soulstep – Slipstream – Posi-Tone Records – 2011 R.E.D.S. – Tuca’s Song – Sign Of Four – Origin Records – 2011 Sergio Mendes & Brasil ’66 – Night And Day – Celebration: A Musical Journey – Emarcy – 2011 Dave Le Febvre – A Nordic Tale – From Soul To Soul – Laphase Music – 2011 Eddie Mendenhall – Protocol – Cosine Meets Tangent – Miles High Records – 2011 Karrin Allyson – Spring Can Really Hang You Up The Most – ‘Round Midnight – Concord Music Group – 2011 Bobby Matos – Buena Gente – Beautiful As The Moon – LifeForce Jazz – 2011 Monty Alexander – Hope – Uplift – Jazz Legacy Productions – 2011   9:00     Brian Lynch – RoditiSamba – Unsung Heroes – Hollistic MusicWorks – 2011 Omar Hakim/Rachel Z – Lost – The Trio Of OZ – Ozmosis Records – 2010 Liam Sillery – Blues – Priorité – OA2 Records – 2011 Melvin Vines – My Heart Belongs To Daddy – Harlem Jazz Machine – Melvin Vines – 2011 Mort Weiss/Sam Most – Who Can I Turn To – Mort Weiss Meets Bill Cunliffe – SMS Jazz – 2011 Native Soul – Gift Within – Soul Step – Talking Drum Records – 2010 Audrey Silver – That’s All – Dream Awhile – Messy House Productions – 2009 Mark O’Connor – Tail Of The Sun – Suspended Reality – OA2 Records – 2011 Abstract Truth – Felony – Contagious Words – Acoustical Concepts Inc. – 2011   10:00     Irvin Mayfield – Mo’ Better Blues (with Ellis Marsalis) – A Love Letter to New Orleans – Basin Street Records – 2011 Bobby Sanabria & The Manhattan School Of Music – Ran Kan Kan – Tito Puente Masterworks Live!!! – Jazz Heads – 2011 High Time – Don’t Ask – Morning Walk – Summit Records – 2011 Mad Romance – The Thrill Is Gone – Aim High – Mad Romance Music – 2010 One For All – Open and Shut – Invades Vancouver! – Cellar Live Records – 2011 Storms / Nocturnes – Snowfall in Central Park – Via – Origin Records – 2011 Charlie Haden Quartet West – If I’m Lucky – Sophisticated Ladies – Emarcy – 2010 Jessica Williams – Paul’s Pal – Freedom Trane – Origin Records – 2011 Ben Allison – Broken – Action-Refraction – Palmetto – 2011   11:00     Hristo Vitchev Quintet – The Palace – The Perperikon Suite – First Orbit Sounds – 2011 Chuck Deardorf – Alone Together – Transparence – Origin Records – 2011 Chuck Wilson – Isfahan – Echo Of Spring – Arbors Records – 2011 Linda Eder – Living In The Shadows – Now – Masterworks – 2011 Phil Ranelin With Henry Franklin And Big Black – Song For Velader – Perseverance – Wide Hive – 2011 Dado Moroni – Ghanian Village – Live In Beverly Hills – Resonance Records – 2011 Peter Eldridge – No Tomorrow – Mad Heaven – Palmetto Records – 2011 Luis Conte – There’s Only Love – En Casa De Luis – BFM Jazz – 2010 Avery Sharpe – Running Man – Running Man – JKNM Records – 2011, 21295=Posted by David Menestres on May 8, 2011 @ 8:00 pm | Post a comment, 6205=House of Mercy radio playlist Week starting Saturday 14th May 2011 presented by Barry Marshall-Everitt www.houseofmercy.net, 19474=Posted by Rafi Zabor on May 10, 2011 @ 2:31 pm | Post a comment}", "textBeforeTable": "tone science 025 from David Menestres\">David Menestres on May 15, 2011 @ 8:00 pm | Post a comment Posted by Tone Science – 05/15/2011 Playlists Music, Filed under: Today’s Music – Right Now!   Artist – Song Title – CD Title – Label – Year   Noon (Eastern)     Wayne Wallace – Los Gatos – To Hear From There – Patois Records – 2011 Matija Dedic – Cheekee Chicks – MD In NYC – Origin Records – 2011 The Marty Nau Group – Night In Tunisia – Mood Ebony – Summit Records – 2010 Marty Williams – Monk’s Dream – Long Time Comin’ – InMoonBay Records – 2010 Takuya Kuroda – Blue Tomato – Bitter & High – Takuya Kuroda – 2010 Bill O’Connell – Rhapsody in Blue – Rhapsody in Blue – Challenge Records – 2010 Suzanne Pittson – Out Of The Hub (One Of Another Kind) – Out Of The Hub: The Music Of Freddie Hubbard – Vineland Records – 2010 The Cannonball-Coltrane Band – Jive Samba – Things Are Getting Better – Primrose Lane Music – 2010 Dave Miller Trio – Peaches – Rapture – Summit Records – 2010   1:00     Mario Romano Quartet – Autumn Leaves – Valentina – Alama Records –", "textAfterTable": "Filed under: Playlists House of Mercy – 05/14/2011 Posted by Barry Everitt on May 14, 2011 @ 8:00 pm | Post a comment House of Mercy radio playlist Week starting Saturday 14th May 2011 presented by Barry Marshall-Everitt www.houseofmercy.net In session this week Groanbox Record of the week is ‘Roses At The End Of Time’ Eliza Gilkyson – Red House Records Intro- In The Red – Tammy Rogers Looking For A Place – Eliza Gilkyson – (Roses At The End Of Time) Man Of God – Eliza Gilkyson – (Paradise Hotel) Slouching Towards Bethlehem – Eliza Gilkyson – (Roses At The End Of Time) The Hottest Spot In hell – JJ Grey & Mofro – (Georgia Warhorse) This A’way – North Mississippi All Stars – (Keys To The Kingdom) Lellzapoppin’ – Dan Baird & Home Made Sin. Kitty Wells Dresses – Laura Cantrell – (Kitty Wells Dresses) Lets Just Be Friends Tonight – Zoe Muth & The Lost High Rollers – (Starlight Hotel) It Wasn’t God Who made Honky Tonk Angels – Laura Cantrell – (Kitty Wells Dresses) Death In Arkansas – Eliza Gilkyson – (Roses At The End Of Time) See That My Grave Is Kept Clean – The Grassy Knoll Boys –", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}