{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Promise Me", "Say What You Mean", "20 Years", "Daily Dosage", "Hunt You Down", "Seeing Is Believing", "Blown Away", "Feel Like Another One", "Nobody Loves You Like I Do", "Right to Breathe"], ["Artist", "Maktub", "Maktub", "Maktub", "Maktub", "Maktub", "Maktub", "Maktub", "Maktub", "Maktub", "Maktub"], ["Time", "4:28", "4:11", "4:11", "3:38", "4:16", "3:39", "5:09", "4:31", "4:28", "5:24"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Say What You Mean by Maktub", "title": "", "url": "https://itunes.apple.com/gr/album/say-what-you-mean/id58154723?i=58154482", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00257-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 873895903, "recordOffset": 873872650, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{115561=Copyright © 2014 Apple Inc. Με επιφύλαξη παντός δικαιώματος.}", "lastModified": "Fri, 31 Jul 2015 08:19:10 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Maktub Say What You Mean iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Say What You Mean by Maktub, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "10 Songs Album Review With Say What You Mean, Seattle's Maktub ramp up their rock & roll credibility, sidestepping an overly trendy trip-hop trap the quintet might have seen coming after 2003's Khronos. The fancy footwork pays off — songs like the Al Green-reminiscent \"Say What You Mean\" and \"Daily Dosage,\" with its heavy soul crash, saw the act splintering from regional-favorites status to full-on, bring-'em-on blues-rock-soul heroes within a month of release. If credit could fall squarely on a single pair of shoulders it would, but given the enormity of frontman Reggie Watts' Afro that's an impossibility. Suffice it to say that his four-octave range and Prince-like charisma permeate every track; though fans of Sly Stone and Lenny Kravitz will climb aboard first, count on Watts pulling in listeners from musical planets across the stratosphere. Biography Formed: Seattle, WA Genre: Rock Years Active: '90s, '00s Maktub, whose name means \"it is written\" in Arabic, formed in 1996 as a pet project of four Seattle club musicians. Reggie Watts (vocals/synthesizer), Davis Martin (drums), Alex Veley (keyboards), and Kevin Goldman (bass), came together from various parts of Seattle's burgeoning soul community to create a groove-oriented, brooding R&B sound. Led by Watts' polished baritone vocals, Maktub", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}