{"relation": [["Side B Titles", "1. Ex Tropical", "2. Lose The Baby", "3. Greylands", "4. Old Lovers", "5. Sundown"], ["Artist", "Lost Animal", "Lost Animal", "Lost Animal", "Lost Animal", "Lost Animal"], ["Length", "03:09", "05:40", "04:02", "05:50", "03:57"]], "pageTitle": "Lost Animal - Ex Tropical (Vinyl LP) - Amoeba Music", "title": "", "url": "http://www.amoeba.com/ex-tropical-lp-lost-animal/albums/2809641/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00153-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 292167443, "recordOffset": 292151490, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{1822=Billy Gil, Hollywood 01/30/2013, 13776=Copyright © 2015 Amoeba, All Rights Reserved. Amoeba and the Amoeba Music mark and logo are trademarks of Amoeba Music Inc.}", "lastModified": "Sat, 01 Aug 2015 04:01:05 GMT", "textBeforeTable": "Track Listing Jarrod Quarrell’s debut record is one of the most wonderfully strange and beguiling records of the young year. With the panache and attitude of The Streets and the weirdo storytelling cues of Tom Waits, Quarrell seems to fit in perfectly with a lot of his contemporaries without really sounding like anyone else. Chintzy keyboard effects move songs like David Lynch-esque ballad “Old Lovers” along and give his hip-hop-style crooning a grimey taste in \"Say No to Thugs.\" Quarrell's lyrics and odd delivery keep Ex Tropical compelling throughout — \"get off the roof ... you'll go splat in the meadow\" he sings on \"Don't Litter\" while alien keyboard sounds surround him. Truthfully, Ex Tropical is better experienced first before I spoil everything special about it. Trust me; it'll knock your socks off. Billy Gil, Hollywood 01/30/2013 Amoeba Review Buy $7.99 Comments: Cover has light wear on the corners, shrink splits on top corners, looks brand new otherwise.  Factory Sealed Sleeve Condition: Near Mint (NM) Price Format", "textAfterTable": "Side B Titles Artist Length 1. Ex Tropical Lost Animal 03:09 2. Lose The Baby Lost Animal 05:40 3. Greylands Lost Animal 04:02 4. Old Lovers Lost Animal 05:50 5. Sundown Lost Animal 03:57 SHIPS FREE in U.S. 1 used from 7.99 Also available in: CD User Reviews Overall Rating 0", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}