{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18"], ["Name", "School's Out", "Misery", "Black Gold", "See You Later", "Without a Trace", "Losin' It", "Somebody to Shove", "Just Like Anyone", "The Tracks of My Tears", "Runaway Train", "We 3", "I Know", "Sexual Healing", "The Game", "I Can See Clearly Now", "Black Star", "To Sir With Love", "Rhinestone Cowboy (Live)"], ["Artist", "Soul Asylum", "Soul Asylum", "Soul Asylum", "Soul Asylum", "Soul Asylum", "Soul Asylum", "Soul Asylum", "Soul Asylum", "Soul Asylum", "Soul Asylum", "Soul Asylum", "Soul Asylum", "Soul Asylum", "Soul Asylum", "Soul Asylum", "Soul Asylum", "Soul Asylum", "Soul Asylum"], ["Time", "3:53", "3:38", "3:35", "4:32", "3:18", "3:02", "3:12", "2:34", "3:01", "4:31", "4:02", "3:19", "4:39", "4:31", "2:52", "3:19", "2:43", "4:53"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$1.29", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - After The Flood - Live From the Grand Forks Prom (Live) by Soul Asylum", "title": "", "url": "https://itunes.apple.com/album/runaway-train/id153440839?i=153441030&ign-mpt=uo%3D5", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00156-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 878352703, "recordOffset": 878328480, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{36206=I graduated from Central High School in Grand Forks, ND after the Red River Flood of 1997, and I attended the Prom / Soul Asylum Concert at the Grand Forks Air Force Base Hangar, along with students from Red River High School. I remember it being very loud at the Hangar (the acoustics were tinny), but the sound quality on this live album is awesome! Soul Asylum definitely rocked...and we were ALL grateful and appreciative that they performed for us for FREE! It just goes to show you that something good can definitely come out of something as devastating as the Red River Flood of 1997. This whole live album is a MUST-BUY for all Soul Asylum fans, as well as 90's Alternative Fans!, 33089=A couple of months after a disastrous flood in Grand Forks, ND, Soul Asylum came to town to play a joint prom for a couple of high schools at the Grand Forks Air Base hangar, which had been used as the refugee camp in the wake of the flood. This is the audio document of the event, and Soul Asylum's first live album — in fact, at the time of its 2004 release, it was the first Soul Asylum non-compilation album of any sort since 1998's Candy from a Stranger. As a performance, it doesn't offer many surprises: it's well-played, well-recorded music emblematic of the time when much alternative rock had moved toward mainstream hard rock. The repertoire, thankfully, is more surprising, as the 18 songs — while leaning heavily on material they recorded for their Columbia 1990s studio albums — include a number of less-traveled items, some of which the band had done only on soundtracks and compilations. There are, for instance, covers of Marvin Gaye's \"Sexual Healing,\" Lulu's \"To Sir With Love,\" Alice Cooper's \"School's Out\" (the crowd-pleasing set opener), Johnny Nash's \"I Can See Clearly Now,\" and, perhaps strangest of all, \"Rhinestone Cowboy.\" It's hardly esoteric, though, also including runs through their hits \"Runaway Train\" and \"Misery.\" As a live record, then, it succeeds in offering what both the average and more fanatical fans want, though some of Soul Asylum's most veteran followers might be disappointed by the absence of songs from the band's early career., 37784=Formed: 1983 in Minneapolis, MN, 137563=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 05:00:05 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Soul Asylum After The Flood - Live From the Grand Forks Prom (Live) iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from After The Flood - Live From the Grand Forks Prom (Live) by Soul Asylum, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator", "textAfterTable": "18 Songs Album Review A couple of months after a disastrous flood in Grand Forks, ND, Soul Asylum came to town to play a joint prom for a couple of high schools at the Grand Forks Air Base hangar, which had been used as the refugee camp in the wake of the flood. This is the audio document of the event, and Soul Asylum's first live album — in fact, at the time of its 2004 release, it was the first Soul Asylum non-compilation album of any sort since 1998's Candy from a Stranger. As a performance, it doesn't offer many surprises: it's well-played, well-recorded music emblematic of the time when much alternative rock had moved toward mainstream hard rock. The repertoire, thankfully, is more surprising, as the 18 songs — while leaning heavily on material they recorded for their Columbia 1990s studio albums — include a number of less-traveled items, some of which the band had done only on soundtracks and compilations. There are, for instance, covers of Marvin Gaye's \"Sexual Healing,\" Lulu's \"To Sir With Love,\" Alice Cooper's \"School's Out\" (the crowd-pleasing set opener), Johnny Nash's \"I Can See Clearly Now,\" and, perhaps strangest of all, \"Rhinestone Cowboy.\" It's hardly esoteric, though, also including runs through their hits \"Runaway Train\" and \"Misery.\" As a live record, then, it", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}