{"relation": [["Subject", "More Good News for Office Max !! saving of $ 65 Millionin tax!!", "Down from here.", "Office Max is a strong buy at this level .", "Office Max stock Will be $11 by Year end .", "Short SQUEEEEZE= OUCH", "Office max will be $11 before year end.", "See this OMX", "Office Max is a strong buy and will be $11 to $13 stock very soon!!", "Market Watch : OMX to get a pop on Monday !!!!!", "Do You Think OMX is a BUY, SELL, or HOLD?", "Office Max Stock Price should be $11.16 as we speak as a result of the debit clearance !!!...", "Office Max Upgraded to a BUY and raised Price target to$10", "Reiterate $20 Target", "Option to retire with cash out", "Office Max Is a golden stock with a $20 value !!!", "Buying more", "I think whoever is selling today is a loser , OMX is a golden stock !!", "Office Max Post Profit and beat wall street expectations in Q2 and declared dividends .", "ODP down size at the request of major shareholder", "untill we get some more good news They are going to take it down.", "office max turn around", "pull back offers apportunity", "Staples announces store closing", "Remember 10 years ago", "Charles Schwab, Zacks recommendations"], ["Author", "one_dogydog", "nesto_65", "one_dogydog", "one_dogydog", "pjdaustin", "one_dogydog", "leotarzk724359", "one_dogydog", "one_dogydog", "dyanray299", "one_dogydog", "one_dogydog", "estes_mt", "joinmy10church", "one_dogydog", "mowmylawn09", "one_dogydog", "one_dogydog", "joinmy10church", "one_dogydog", "joinmy10church", "myachingback09", "joinmy10church", "bladerobo", "joinmy10church"], ["Date", "2012-10-16 18:44:09", "2012-10-16 18:43:54", "2012-10-16 18:43:26", "2012-10-16 18:43:12", "2012-10-16 18:42:57", "2012-10-16 18:42:43", "2012-10-16 18:42:26", "2012-10-16 18:42:07", "2012-10-16 18:41:50", "2012-10-16 18:41:30", "2012-10-16 18:40:49", "2012-10-16 18:39:31", "2012-10-16 18:38:52", "2012-10-16 18:38:30", "2012-10-16 18:38:06", "2012-10-16 18:37:33", "2012-10-16 18:37:12", "2012-10-16 18:36:51", "2012-10-16 18:35:43", "2012-10-16 18:35:15", "2012-10-16 18:34:38", "2012-10-16 18:33:53", "2012-10-16 18:33:41", "2012-10-16 18:33:22", "2012-10-16 18:32:57"]], "pageTitle": "What is the ticker symbol for -", "title": "", "url": "http://whatisthesymbol.com/OMX?temp=2", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00223-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 263690791, "recordOffset": 263674328, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{8243=OfficeMax Incorporated, together with its subsidiaries, distributes business-to-business and retail office products. Its Contract segment markets and sells office supplies and paper, technology products and solutions, office furniture, and print and document services directly to large corporate and government offices, as well as to small and medium-sized offices through field salespeople, outbound telesales, catalogs, Internet, and office products stores. As of December 31, 2010, this segment operated 44 distribution centers in the United States, Puerto Rico, Canada, Australia, and New Zealand; 4 customer service and outbound telesales centers in the United States; and 53 office products stores in Canada, Hawaii, Australia, and New Zealand. The company\u0092s Retail segment markets and sells office supplies and paper, print and document services, technology products and solutions, and office furniture to small and medium-sized businesses and consumers through a network of retail stores. It operates 997 stores in the United States and Mexico, 3 large distribution centers in the United States, and 1 small distribution center in Mexico. The company was formerly known as Boise Cascade Corporation and changed its name to OfficeMax Incorporated in October 2004. OfficeMax Incorporated was founded in 1913 and is headquartered in Naperville, Illinois.}", "TableContextTimeStampAfterTable": "{21486=[at USA TODAY] - Amazon, Office Depot will have deals all of November., 20317=10 Apr 2015, 17707=6 Dec 2015, 18397=21 Jan 2015, 19038=4 Feb 2015, 21647=31 Oct 2015, 19661=31 Mar 2015, 20951=8 Aug 2015, 7189=OfficeMax Incorporated announced that it is accepting pre-orders of the new Kindle family of products, including the new Kindle Paperwhite, Kindle Fire and Kindle Fire HD. The updated Kindle Fire ($159) and Kindle Fire HD 16GB ($199) will be available at OfficeMax in October. The Kindle Paperwhite ($119), Kindle Paperwhite 3G ($179) and the Kindle Fire HD 32GB ($249) will be available in November, in time for the holiday shopping season. All Kindle products will be available in OfficeMax stores nationwide. Amazon's latest Kindles are among the many new technology products available at OfficeMax, where customers can enjoy a broad range of technology and accessories including lightweight laptops, tablets, e-readers and all-in-one computers from trusted brands including HP(R), Sony(R), Acer(R), Toshiba(R) and more. OfficeMax also offers MaxAssurance(R) service and protection plans to protect your device from damage and daily wear and tear.}", "textBeforeTable": "31 Oct 2015 Read More... Black Friday arriving early, on a Saturday [at USA TODAY] - Amazon, Office Depot will have deals all of November. 8 Aug 2015 Read More... Watch out for credit cards issued by retailers 10 Apr 2015 Read More... Colorado's retail real estate picks up; office and industrial steady 31 Mar 2015 Read More... Office Depot: FTC's request will not slow Staples deal 4 Feb 2015 Read More... Shares of Staples fall on $6.3B bid for Office Depot 21 Jan 2015 Read More... Office Depot-Staples merger could face 2 hurdles, analyst says", "textAfterTable": "Buy Sell Hold 2 0 0 Get our Stock Market & Financial Investment news alerts in your inbox Read our full disclaimer and privacy policy The information contained herein does not suggest or imply and should not be construed, in any manner, a guarantee of future performance and/or investment advice.whatisthesymbol.com is not a registered financial advisor or otherwise qualified as investment professional. The content posted here are only the opinion of the poster and should not be taken as recommendations to buy or sell any security or financial instrument. Trading and investing inherently involves the risk of significant loss of money, and can involve the risk of loss of more than the amount invested. Before executing any trade readers are strongly cautioned to consult with a financial adviser of their choosing. whatisthesymbol.com,", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}