{"relation": [["Title", "Finding George Orwell in Burma", "Under the Dragon: A Journey through Burma", "The River of Lost Footsteps: Histories of Burma", "From the Land of Green Ghosts: A Burmese Odyssey", "Burmese Days", "Burma: The Longest War 1941-1945"], ["Author", "Emma Larkin", "Rory MacLean", "Thant Myint-U", "Pascal Khoo Thwe", "George Orwell", "Louis Allen"]], "pageTitle": "Burma (Myanmar) Tours & Travel | Intrepid Travel", "title": "", "url": "http://www.intrepidtravel.com/burma-myanmar", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00159-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 526373468, "recordOffset": 526312467, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{624=Beautiful Burma is stepping out of a chequered past into a new era of hope and optimism. In the nation also known as Myanmar, visitors can expect to be dazzled by shimmering cities of gilded temples, enlivened by emerald green landscapes and humbled by the warm smiles of gracious villagers. Now is the time to contribute to Burma's blossoming future - peaceful pagodas, sacred sites, ancient towns and monasteries await., 86077=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 186631=Review submitted 24 Jul 2015, 87396=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan...}", "TableContextTimeStampAfterTable": "{45112=Myanmar is beautiful. The trip very well organized. The guide very kind., 74409=By 1886, Britain claimed Burma as a province of India, with Rangoon being named capital. This period of British rule impacted on Burmese society greatly, with the culture, religion, economy and society vastly changing at the hands of the British. The local population saw little of the economic benefits flowing from increased trade and agriculture cultivation, and with many villages being destroyed, this period of history marks a difficult time for the Burmese. World War II saw Burma's movements towards independence grow, and by 1948 Burma was granted independence. Decades of change and political instability followed, with an unstable parliament and several military coups creating uncertainty around the newly Socialist country. Burma seemingly lurched from crisis to crisis, plagued by corruption, inflation and volatility from the 1960s to 1990s. With increasing trade embargoes, protests, sanctions and international pressure, the military government was forced to cease the imprisonment of democratically elected Aung San Suu Kyi and instate democracy to the country once again. With elections being held in 2010, Burma could finally be on the road to restoring democracy, peace and prosperity to the population., 69714=Burma has three distinct seasons, with the hottest and driest running from February to May. During this time, temperatures can reach up to 40 degrees Celsius, although relief can be found in the highland areas which, on average, clock cooler temperatures. The monsoon season runs from May to October, while milder and drier weather usually prevails from October to February., 73213=It has been estimated that the land now known as Burma has been inhabited since 11,000 BC. Archaeological evidence garnered from burial sites indicates early settlements were largely concentrated near the Ayeyarwaddy River, with agriculture and animal husbandry prevailing by 1500 BC. Later, larger settlements or city states were created by the peaceful Pyu people, who migrated from the north sometime around 1 BC, bringing Buddhism to Burma. With the Mon people entering from the south during the 6th century, and sustained attacks from the north occurring up to the 9th century, the Pyu people became absorbed into the general population to shape the face of future Burmese ethnicity. The Bagan Empire ruled Burma from 1044 to 1287 and with a burgeoning agriculture and trade economy, was able to build thousands of Buddhist temples, many of which are still present today. By the 13th century, the Bagan Empire had begun to decline due to economic mismanagement and foreign invasion from the Mongols and the Mon people. Burma's seesawing fortunes continued for centuries, with war, invasion and changes in rule commonplace over the years., 32517=Travel to Burma, formally known as Myanmar. Explore the mystic regions of Yangon, Mandalay and Bagan on a small group...}", "textBeforeTable": "Recommended reading Further reading 11. When on community visits or homestays, refrain from giving gifts or money to locals. 10. Please ask and receive permission before taking photos of people, including children. 9. Refrain from supporting businesses that exploit or abuse endangered animals. 8. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 7. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 6. When bargaining at markets, stay calm, be reasonable and keep a smile on your face. It's meant to be fun! 5. Always dispose of litter thoughtfully, including cigarette butts. 4. For environmental reasons, try to avoid buying bottled water. Instead fill a reusable water bottle or canteen with filtered water. 3. Burma's political situation is sensitive. Respect the wishes of locals at all times and avoid starting conversations involving politics or the government. Seemingly innocuous questions or comments could cause offence. 2. Dress modestly and respectfully. Shoulders to knees should be covered, especially when entering places of worship. 1. Be considerate of Burma’s customs, traditions, religion and culture. Top responsible travel tips for Burma (Myanmar) Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment.", "textAfterTable": "Handy links www.lonelyplanet.com/myanmar-burma www.worldtravelguide.net/myanmar www.networkmyanmar.org/travel-and-tourism × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovo", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}