{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"], ["Name", "Tempting Time", "Soraya", "Thoroughly At Home", "On Impulse", "Tessitura", "Behaving Badly", "The Price of Everything and the Value of Nothing", "CAFO", "Inamorata", "Point to Point", "Modern Meat", "Song of Solomon"], ["Artist", "Animals As Leaders", "Animals As Leaders", "Animals As Leaders", "Animals As Leaders", "Animals As Leaders", "Animals As Leaders", "Animals As Leaders", "Animals As Leaders", "Animals As Leaders", "Animals As Leaders", "Animals As Leaders", "Animals As Leaders"], ["Time", "5:23", "4:27", "4:02", "6:09", "1:06", "4:26", "5:32", "6:41", "6:08", "1:44", "2:06", "4:16"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Animals As Leaders by Animals As Leaders", "title": "", "url": "https://itunes.apple.com/ca/album/song-of-solomon/id311508492?i=311508707", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00122-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 868389903, "recordOffset": 868359160, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{28407=Formed: 2008 in Washington, D.C., 25848=This album is by far one of the best albums of 2009.. Even if you're not into instrumental music, put aside your prejudices only for this album cause this is nothing like you've ever heard before.. this is no Steve Vai or Joe Satriani shredding endlessly, it is a completely different and an original sound! amazing riffs, crazy solos and a completely new experience..., 126132=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 09:12:02 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Animals As Leaders Animals As Leaders iTunes for Mac + PC Already have iTunes? Click I have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Animals As Leaders by Animals As Leaders, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store…", "textAfterTable": "12 Songs Album Review And now for something completely different...at least for fans of Washington, D.C., metalcore also-rans Reflux, whose rather ignominious demise after just one critically acclaimed but poor-selling LP wound up freeing resident guitar virtuoso Tosin Abasi to accept an offer from Prosthetic Records to deliver his first solo album. That album, like the pseudonym adopted to mask the ostensible solo nature of Abasi's new project, was Animals as Leaders, and it proceeded to showcase the guitarist's formidable mastery of his instrument through a wholly instrumental, daringly progressive, and, perhaps most surprisingly, oftentimes mellow and ambiently new agey collection of songs. Of course, Abasi's heavy metal proving ground inevitably takes charge on more aggressive, maniacally intense workouts like \"Tempting Time,\" \"Thoroughly at Home,\" and \"CAFO\" — all of which make reference to extreme explorers like Cynic and Meshuggah. But kinder ruminations like \"Soraya,\" \"On Impulse,\" and \"Point to Point\" take a different approach by weaving cascading melodies and fleet-fingered tapping (somewhere between Joe Satriani and two-hand-tap trailblazer Stanley Jordan) out of his customized seven- and eight-string guitars. Meanwhile, overt electronics are kept to a bare minimum aside from the programmed drums and occasional electronic hiccups (\"On Impulse\"), fluttering synth patterns (\"Song of Solomon\"), and overdriven synthetic percussion runs (\"The Price of Everything and the Value of Nothing\") that", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}