{"relation": [["", "1", "2", "3"], ["Name", "Carry Me Back to Virginia (from \"Carry Me Back\")", "Ain't It Enough (Alternate Version)", "Dixieland Delight"], ["Artist", "Old Crow Medicine Show", "Old Crow Medicine Show", "Old Crow Medicine Show"], ["Time", "2:40", "4:02", "4:54"], ["Price", "$1.29", "$1.29", "$1.29"], ["", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Carry Me Back to Virginia EP by Old Crow Medicine Show", "title": "", "url": "https://itunes.apple.com/us/album/carry-me-back-to-virginia-ep/id660337751", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00144-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 871017435, "recordOffset": 870990527, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{112106=Copyright © 2014 Apple Inc. All rights reserved., 7015=Though Old Crow Medicine Show are seemingly ever present on the recording scene, they have released only four studio albums in their eight-year career, in addition to a couple of live offerings. They have often filled the gap with singles and EPs, and this entry is no exception. Carry Me Back to Virginia (not to be confused with the album of the same name) contains three tracks. There is the stomping title track arranged as a sprinting bluegrass-cum-fiddle tune. It's a dance number that almost no group of floor denizens could keep up with, and has more in common with the attack of the Pogues than it does Bill Monroe. Second up is an alternate version of \"Ain't It Enough\" from the same album. It's five seconds longer than the original, and driven more by its pronounced bassline than by guitars and banjos, though they still figure prominently. It's louder, less sweet, and more effective than the album cut. The last track amounts to an addition to the band's catalog, even if it is a cover: \"Dixieland Delight\" first appeared on the excellent High Cotton: A Tribute to Alabama, released earlier in 2013 on the independent Lightning Rod Records. This is as close as Old Crow Medicine Show gets to straight country, led by banjo, strummed acoustic guitars, and a whining dobro. While the vocal harmonies aren't as rich as Alabama's, they don't need to be; this is far less polished, more direct than the original (which doesn't mean the same thing as being superior to it), and is as heartfelt an homage to a great song as one is likely to hear. It does contain a nice twist in its speedy rush to the close, turning a back porch country love song into a barnstormer. This EP is obviously aimed at the group's hardcore following, and getting the cover track to those who might not otherwise make that purchase., 11400=Formed: 1998 in Harrisonburg, VA, 10171=The verison of \"Ain't it Enough\" on this EP sounds a little to country-fied and isn't as good as the 2012 \"Carry Me Back\" bluegrass/folk version. But I guess they're making a push to become more country radio friendly. That being said, this EP is still better than all country music out today.}", "lastModified": "Fri, 31 Jul 2015 08:03:53 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Old Crow Medicine Show Carry Me Back to Virginia EP iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Carry Me Back to Virginia EP by Old Crow Medicine Show, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon", "textAfterTable": "3 Songs Album Review Though Old Crow Medicine Show are seemingly ever present on the recording scene, they have released only four studio albums in their eight-year career, in addition to a couple of live offerings. They have often filled the gap with singles and EPs, and this entry is no exception. Carry Me Back to Virginia (not to be confused with the album of the same name) contains three tracks. There is the stomping title track arranged as a sprinting bluegrass-cum-fiddle tune. It's a dance number that almost no group of floor denizens could keep up with, and has more in common with the attack of the Pogues than it does Bill Monroe. Second up is an alternate version of \"Ain't It Enough\" from the same album. It's five seconds longer than the original, and driven more by its pronounced bassline than by guitars and banjos, though they still figure prominently. It's louder, less sweet, and more effective than the album cut. The last track amounts to an addition to the band's catalog, even if it is a cover: \"Dixieland Delight\" first appeared on the excellent High Cotton: A Tribute to Alabama, released earlier in 2013 on the independent Lightning Rod Records. This is as close as Old Crow Medicine Show gets to straight country, led by banjo, strummed", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}