{"relation": [["Artist", "Aerosmith", "Jethro Tull"], ["Song Title", "Back in the Saddle", "New Day Yesterday"], ["Played When", "opening recap", "Sam and Dean discuss Dean's homelife"]], "pageTitle": "Supernatural Season 6 Episode 12 - Like a Virgin (6x12) - Watch Online - s6 e12 Spoilers", "title": "", "url": "http://www.tvrage.com/Supernatural/episodes/1065000697", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00306-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 791197611, "recordOffset": 791180848, "tableOrientation": "VERTICAL", "textBeforeTable": "Music Read the full recap Recap Stan is flying his girlfriend Penny Dessertine in his two-seater plane and a storm comes up. She panics and begs him to land, and Stan says that they’re close. As Penny looks out the window, she sees something huge fly by. Stan dismisses it as a bird and tells her to close her eyes as relax She does so, but there’s a crash as something rips through the windshield and pulls Stan out. Penny screams in horror as the plane plummets toward the ground... Castiel As Misha Collins Dean Winchester As Jensen Ackles Sam Winchester As Jared Padalecki Main Cast Dragon #2 As Lee Tichon Virgin Prisoner #1 As Kristy Dinsmore", "textAfterTable": "Episode Quotes Bobby Singer: Like my daddy always, said, \"Just 'cause it kills your liver don't mean it ain't medicine.\" Bobby Singer: You two enjoy catching up, okay? (walks away) Sam: What was that? Dean: One part age, three parts liquor. Sam: Well, looks like those other two missing girls both baked cookies for the Lord. Dean: What is that? Code? Dean: Penny's diary. Sam: Did you steal that from her room? Dean: I love that you even ask me that. Sam: And why wouldn't I? Dean: No reason. (reading) Dean: \"I've decided I'm going to give Stan my most precious gift.\" Sam: Wow, that sounded really creepy coming out of your mouth. Dean: I think I delivered it. Sam: So, what, you think Batman tried to rape her? Dean: Well, he does carry a lot of rage. Sam: So what kind of thing likes virgins and gold? Dean: P Diddy? Sam: You know, it's comforting. Dean: What's that? Sam:", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}