{"relation": [["No.", "01", "02", "03", "04", "05", "06", "07", "08", "09", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19"], ["Track Title", "Let’s Take A Trip", "I Used To Love H.E.R. (The Bear & The Sea Remix) [Nueva Forma]", "Midnight Sun", "De Platicas Incompletas", "Neon Beams (Dibiase Remix)", "Minus 613", "Senorita", "Half Empty", "Fall In Love (Chief Remix)", "A River Entered The Classroom", "Blaster [Nueva Forma]", "Fleur", "Prophet", "R.I.P. Robin The Cat", "Laughing Stock [Nueva Forma]", "Ode To Bear", "Rooney In Space", "Mind Grapes [Circle Into Square]", "Run Up To Canada"], ["Artist", "Nueva Forma", "Common Sense", "Galapagoose", "Beatcasso", "Take", "OL", "Actress", "Futuristic", "Slum Village", "Nueva Forma", "A Gap Between", "Sepalcure", "Datahowler", "Cosmic Sound (Stephen Farris)", "Masmöd", "Mount Kimbie", "Solderboy", "Big Spider’s Back", "Nueva Forma"]], "pageTitle": "August 2011 Archives - Nueva Forma", "title": "", "url": "http://nuevaforma.com/blog/2011/08/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00288-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 178447964, "recordOffset": 178434982, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{30416=This entry was posted on Friday, August 12th, 2011 at 12:41 am and is filed under Artists, Music, Podcasts. You can follow any responses to this entry through the RSS 2.0 feed. You can leave a response, or trackback from your own site., 3140=You are currently browsing the blog archives for August, 2011., 14680=This entry was posted on Tuesday, August 23rd, 2011 at 9:34 pm and is filed under Artists, Music, Releases, remix. You can follow any responses to this entry through the RSS 2.0 feed. You can leave a response, or trackback from your own site.}", "textBeforeTable": "It’s been a little while since the last Listening Pleasures as we’ve been gearing up for our second volume of our label compilation, Nueva Forma Social Club. This episode of listening pleasures is definitely an ode to our love of hip hop, grime, heavy beats, warm bass, and a nostalgic backdrop that’s a perfect soundtrack to the remainder of this beautiful summer. And with some wonderfully bucolic and nostalgic beats from The Bear & The Sea, A Gap Between, and Masmöd, along with some beautiful gems from Datahowler, Galapagoose, Big Spider’s Back, and a plethora of others, you’re sure to enjoy the hell outta this episode. So cue up your stereo, and bump some Listening Pleasures from here to the coast. Monthly podcast: Nueva Forma Listening Pleasures Nueva Forma™ by August 12th, 2011 Listening Pleasures Episode 17", "textAfterTable": "Subscribe to our podcast Subscribe with iTunes Subscribe with Zune Subscribe with Zencast Subscribe with My Yahoo Subscribe with Google Reader Subscribe to RSS Podcast: Download (53.1 MB) 43:56 Tags: a gap between, Ambient, Big Spider's Back, breakcore, cosmic sound, dance, datahowler, downtempo, drum & bass, dubstep, Electronica, Futuristic, Galapagoose, HIP HOP, IDM, J-Dilla, listening pleasures, Masmod, mount kimbie, Nueva Forma, pop, Sepalcure, Slum Village, Slumvillage, Solderboy, stephen farris, techno, the bear and the sea This entry was posted on Friday, August 12th, 2011 at 12:41 am and is filed under", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}