{"relation": [["#", "1", "2", "3", "4", "5"], ["Artist", "Bryan Adams", "Michael Jackson", "Roxette", "Scorpions", "R.E.M."], ["Title", "(Everything I Do) I Do it For You", "Black Or White", "Joyride", "Wind of Change", "Losing My Religion"], ["Year", "1991", "1991", "1991", "1991", "1991"], ["Country", "", "", "", "", ""], ["Chart Entries", "UK 1 – Jun 1991, US BB 1 of 1991, US CashBox 1 of 1991, Holland 1 – Jul 1991, Sweden 1 – Aug 1991, Austria 1 – Aug 1991, Switzerland 1 – Jul 1991, Norway 1 – Jul 1991, Poland 1 – Jul 1991, Germany 1 – Jan 1992, Éire 1 – Jul 1991, New Zealand 1 for 8 weeks Aug 1991, Australia 1 for 11 weeks Oct 1991, US BB 3 of 1991, Australia 3 of 1991, POP 3 of 1991, Europe 5 of the 1990s, TOTP 6, Global 7 (10 M sold) – 1991, Italy 9 of 1991, Germany 9 of the 1990s, Scrobulate 30 of ballad, Virgin 60, Party 70 of 2007, RYM 73 of 1991, Poland 96 of all time, OzNet 121, Belgium 150 of all time", "UK 1 – Nov 1991, US BB 1 of 1991, Sweden 1 – Nov 1991, Switzerland 1 – Nov 1991, Norway 1 – Nov 1991, Poland 1 – Nov 1991, Éire 1 – Nov 1991, New Zealand 1 for 8 weeks Nov 1991, Australia 1 for 8 weeks Feb 1992, Austria 2 – Nov 1991, Germany 2 – Jan 1992, Holland 3 – Nov 1991, Italy 3 of 1991, US BB 19 of 1991, POP 19 of 1991, Australia 24 of 1992, US CashBox 29 of 1992, RYM 96 of 1991, Germany 115 of the 1990s", "US BB 1 of 1991, Holland 1 – Mar 1991, Sweden 1 – Mar 1991, Austria 1 – Mar 1991, Switzerland 1 – Mar 1991, Norway 1 – Mar 1991, Germany 1 – Mar 1991, Australia 1 for 3 weeks Jul 1991, Poland 3 – Apr 1991, UK 4 – Mar 1991, France 7 – Apr 1991, Australia 13 of 1991, Italy 24 of 1991, Germany 24 of the 1990s, US CashBox 33 of 1991, US BB 35 of 1991, POP 37 of 1991", "Holland 1 – Apr 1991, Sweden 1 – Mar 1991, Austria 1 – Jun 1991, Switzerland 1 – Feb 1991, Norway 1 – Apr 1991, Poland 1 – Mar 1991, Germany 1 of the 1990s, Germany 1 – Apr 1991, UK 2 – Sep 1991, US BB 4 of 1991, Scrobulate 9 of ballad, France 10 – Dec 1990, US BB 24 of 1991, Europe 26 of the 1990s, POP 26 of 1991, RYM 142 of 1990", "Holland 1 – Mar 1991, Poland 1 – Apr 1991, Europe 1 of the 1990s, US BB 4 of 1991, Norway 4 – Jun 1991, Sweden 5 – Mar 1991, RYM 5 of 1991, Austria 7 – Aug 1991, Switzerland 11 – Oct 1991, Belgium 12 of all time, UK 19 – Mar 1991, US BB 28 of 1991, Virgin 30, US CashBox 39 of 1991, 39 in 2FM list, Poland 44 of all time, Acclaimed 44, POP 61 of 1991, Scrobulate 69 of rock, Italy 70 of 1991, OzNet 90, WXPN 106, RIAA 143, Rolling Stone 169"]], "pageTitle": "1991 in music - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/1991_in_music", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 8, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00142-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 858265779, "recordOffset": 858199287, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{158171=The following songs achieved the highest chart positions in the charts of 1991., 6080=List of notable events in music that took place in the year 1991.}", "lastModified": "Sat, 25 Jul 2015 10:24:18 GMT", "textBeforeTable": "The following songs achieved the highest chart positions in the charts of 1991. Biggest hit singles[edit] World Outside – The Psychedelic Furs World on a String – Red Allen Watershed - Grant McLennan War Master – Bolt Thrower Volume One – Sleep Voices – Kenny Thomas Unsane – Unsane Tossing Seeds – Superchunk Themes and Dreams – The Shadows (compilation) Surprise – Crystal Waters Suit suit...hehehe – Slank Struck by Lightning – Graham Parker Stranger in This Town – Richie Sambora Stars Crash Down – Hue and Cry Spirit Electricity (EP) – Bad Brains Soul Show: Live at Delta 88 – Joan Osborne (live) Silver Lining – Nils Lofgren Sexplosion! – My Life with the Thrill Kill Kult", "textAfterTable": "Top hits[edit] This section contains embedded lists that may be poorly defined, unverified or indiscriminate. Please help to clean it up to meet Wikipedia's quality standards. Where appropriate, incorporate items into the main body of the article. (June 2015) \"3 a.m. Eternal\" – The KLF \"A Better Love\" - Londonbeat \"À nos actes manqués\" – Fredericks, Goldman, Jones \"Addams Groove\" – MC Hammer \"Alive\" – Pearl Jam \"All the Man That I Need\" – Whitney Houston \"All This Time\" – Sting \"Always Look on the Bright Side of Life\" - Monty Python \"Always on the Run\" – Lenny Kravitz \"Always There\" – Incognito & Jocelyn Brown \"American Music\" – Violent Femmes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}