{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Hold My Breath", "Remember The Good Things", "Another Day", "The World", "Warm Waters", "Gentle Samui", "Awful Game", "Below", "Leaving Samui", "Wrapped Round My Ways"], ["Album", "iii", "iii", "iii", "iii", "iii", "iii", "iii", "iii", "iii", "iii"], ["Time", "5:06", "5:53", "3:59", "6:50", "2:39", "4:58", "4:27", "6:10", "3:15", "5:05"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Jetlag by Milosh", "title": "", "url": "https://itunes.apple.com/us/album/jetlag/id723565201", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00110-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 866144875, "recordOffset": 866117874, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{18793=After a number of critically lauded albums, Michael Milosh hooked up with Robin Hannibal, half of Denmark’s Quadronto—an R&B duo—to record as Rhye. Their sultry 2013 debut, Woman, lit passions everywhere, with critics tagging Milosh’s silky, androgynous voice as a Sade for the new millennium. But longtime fans of the musician have been reduced to quivering pools of surrender since his 2004 debut, You Make Me Feel. Jet Lag confidently filters all that’s come before into a pure and flawless mix. Creating a murky, languorous atmosphere, Jet Lag moves into an R&B sea of desire and physical expression that stays just this side of the Sade line. It feels both celebratory and declarative. Knowing Milosh recently married, songs like “Don’t Call It” and “Do You Want What I Need” exude a different kind of longing (his wife’s belly provides some percussion on the latter). Here we are, the artist seems to proclaim; let’s ride it when we can and work it when needed. Moments of unabashed flame-lighting, as on “Hold Me” and “Jet Lag,” are a sensual thrill, and two of many reasons this collection could do double duty as an aphrodisiac., 122379=Copyright © 2014 Apple Inc. All rights reserved., 20658=I discovered Mike Milosh in 2012 with the Rhye single \"Hungry\" and for the longest time I thought it was a female voice, until I went to write a review of the band for my blog and discovered he's a dude. If you can get past that, you'll find his solo work to be electric and sensual in a way that is so much classier and professional than the top 40 stuff dominating the charts. Keep an eye on him}", "lastModified": "Fri, 31 Jul 2015 07:51:21 GMT", "textBeforeTable": "View In iTunes You Make Me Feel 5. View In iTunes Remember the Good Things - EP 4. View In iTunes Meme 3. View In iTunes iii", "textAfterTable": "Listeners Also Bought EP One The Neon Lights View In iTunes Salton Sea Tomas Barfod View In iTunes Late Night Tales: Bonobo Bonobo View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}