{"relation": [["Title", "Black Lamb and Grey Falcon: A Journey Through Yugoslavia", "A Tomb for Boris Davidovic", "Blood of Montenegro", "The Hidden Europe: What Eastern Europe Can Teach Us", "Realm of the Black Mountains: A History of Montenegro"], ["Author", "Rebecca West", "Danilo Kiš", "Bajram Angelo Koljenovic and James Nathan Post", "Francis Tapon", "Elizabeth Roberts"]], "pageTitle": "Montenegro Tours & Travel | Intrepid Travel CA", "title": "", "url": "http://www.intrepidtravel.com/ca/montenegro", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00136-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 528170331, "recordOffset": 528113893, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{111931=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 110612=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o...}", "TableContextTimeStampAfterTable": "{4012=Much like the tourists who descend on the country’s beaches during July and August, these curious and cheeky critters can sometimes be spotted breaching the surface of Montenegro’s freshwater lakes or basking by their shores. So well liked are these little guys that in 2011, the Montenegrin Ministry of Culture launched ‘Otter Fest 2011’: a festival promoting the development of Skadar Lake’s local communities, which draws attention to its endangered otter population., 976=Party to both Mediterranean summers and Balkan winters, the question of when to visit Montenegro really depends on what you’re after. The months of July and August, referred to locally - and somewhat dramatically - as ‘the Season’ sees coastal tourism at full-throttle with beaches, hotels and restaurants packed out by Europe’s summer sun seekers. As a result, either side of this period is the best time for a visit - with May, June, September and October still enjoying balmy days, pleasant evenings and warm waters. November through to April is the winter period when inland temperature can drop to below freezing, but it also marks the opening of the country’s ski runs and the coast can present a scenic - and quiet - getaway for the less adventurous.}", "textBeforeTable": "Recommended reading Further reading 7. Please ask and receive permission before taking photos of people, including children. 6. Refrain from supporting businesses that exploit or abuse endangered animals. 5. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive and supports the local community. 4. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 3. Always dispose of litter thoughtfully, including cigarette butts. 2. For environmental reasons, try to avoid buying bottled water. Montenegro has some of the purest water in Europe. 1. Be considerate of Montenegrin customs, traditions, religion and culture. Top responsible travel tips for Montenegro Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this in mind while travelling. Montenegro Travel Tips Responsible Travel also provides useful health information: Go to: http://www.who.int/en/ The World Health Organisation Go to: http://www.fco.gov.uk/en/ From UK? Go to: http://travel.state.gov/ From US? Go to: http://www.voyage.gc.ca/ From Canada? Go to: http://www.safetravel.govt.nz/ From New Zealand?", "textAfterTable": "Handy links www.lonelyplanet.com/montenegro www.worldtravelguide.net/montenegro www.destination-montenegro.com/ www.visit-montenegro.com/ × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}