{"relation": [["Topic", "The axis of rotation for rolling motion", "Antimatter html pdf", "Ballistocardiogram", "Basal Metabolism", "Bell's Theorem html pdf", "Barometer", "Big Bang Cosmology html pdf", "Birth of Physics in the Rennaisance", "Black Holes html pdf", "Black Hole Thermodynamics html pdf", "Blackboards, PowerPoint, and Tablet PCs in the Classroom", "The Bohr Model of the Atom", "Classroom Examples and Precious Class Time", "Clickers: A study of Classroom Response System use at the University of Toronto", "Chaos html pdf", "Complementarity & Copenhagen Interpretation html pdf", "Compressed-Format Compared to Regular-Format In a First Year University Physics Course", "Correlating student interest and high school preparation with learning and performance in an introductory university physics course", "The development of a laboratory data analysis curriculum for physics and engineering students.", "The Development of Quantum Mechanics html pdf", "Diffraction", "Dimension html pdf", "Double Slit: html pdf", "Education", "Education", "Education", "Education", "Effective Teams for Collaborative Learning in an Introductory University Physics Course", "Electricity and Magnetism", "Electricity and Magnetism: History", "Energy", "Entanglement", "Entropy html pdf", "Error Analysis:html pdf", "Error Propagation", "The Extended Mind", "Factors correlated with students’ scientific reasoning ability in an introductory university physics course", "Fitting Techniques", "Flash Animations for Physics", "The Force Concept Inventory and Adult Learners html pdf", "Fourier Transform, A Brief Introduction", "General Theory of Relativity: html pdf", "General Theory of Relativity", "Gravitational Time Dilation, a Derivation html pdf", "Heat Equation", "Hip Forces html pdf", "Horsepower of an Engine", "High Energy Physics html pdf", "An Introduction to Physics Education Research", "Inertial Frames of Reference html pdf", "Innovative Teaching Techniques and U.S.-Developed Materials", "Laboratory Experiments, On Good and Bad Ones", "The Laboratory Notebook", "LabVIEW Tutorials", "Learning UNIX-GNU/Linux", "Least-Squares Fitting", "Life, Emerging Structures, and the Second Law of Thermodynamics", "Locality and Quantum Mechanics html pdf", "The Mach-Zehnder Interferometer", "Magic Through Two Millenia", "Maple Libraries html pdf", "Manometers", "Mass-Energy Equivalence html pdf", "Mass-Energy Equivalence - technical", "Micrometer", "Microprocessor Interfacing Techniques", "Mirror Symmetry html pdf", "Monte Carlo Simulation", "Newtonian Mechanics", "Nuclei and Particles", "On Resistance to Implementing Physics Education Research Results in Physics Courses", "The Oscilloscope", "Physics Education Research - A Comprehensive Study", "Physics Practicals", "The Poetry of Physics", "Polarisation", "Quantum Interference", "Quantum Mechanics: a Poor Person's Guide", "Quantum Mechanics: Interpretation", "Quantum Teleportation", "Deterministic Quantum Teleportation", "Schrödinger's Cat html pdf", "Science as a Language", "The Science of Hawking", "Special Theory of Relativity: html pdf", "Special Theory of Relativity", "Spectra", "Standing Waves html pdf", "Stern-Gerlach Experiment html pdf", "Studying Physics", "Subatomic Physics", "Team Teaching", "Team Teaching Survey", "Time Series Analysis", "Two analogies to Bell's Theorem html pdf", "Tutorial Attendance and Student Performance", "Uncertainty in Physical Measurements", "The Uncertainty of Grades in Physics Courses Is Surprisingly Large", "Vernier, Reading a", "Visualisation and Transformation of Data", "Waves and Wave Motion", "Wave-Particle Duality", "What is the Universe Made Of?"], ["Description", "Analysing and teaching about the actual axis of rotation for a rolling object. June 2015). (524k)", "Course notes from a one-hour class on antimatter for upper-year liberal arts students. (172k/203k)", "A small application of Newton's Laws to the measurment of the acceleration of the blood. (52k)", "A small introduction to the basal metabolism and allometry.", "A derivation of the theorem and a discussion of the consequences. A somewhat subtle topic, but here it is treated in a non-technical fashion. It assumes knowledge of wave-particle duality such as can be found in the Double Slit or the Wave-Particle Duality documents; also assumed is considerable knowledge of the Stern-Gerlach Experiment, for which there is also a document here. (150k/ 151k)", "An introduction to using a Mercury Barometer, also known as a Fortin Barometer. Requires Flash; uses videos in RealMedia, QuickTime or mpeg format. (137k)", "A brief discussion of the Standard Hot Big Bang Model of cosmology. (70k/90k)", "A brief summary of the birth of physics from Bacon through Young, from a first year physics course that uses minimal mathematics; the entire set of materials from the course is available by clicking here. (152k)", "Course notes from a one-hour class on black holes for upper-year liberal arts students. (78k/90k)", "Course notes from a one-hour class on black hole thermodynamics for upper-year liberal arts students. (25k/47k)", "Three case studies of the delivery of visual information in the classroom. Much of the discussion is guided by the results of research into the study of eye movements when subjects are reading. December 2005. (390k)", "A very brief introduction, originally designed for upper-year liberal arts students. (30k)", "Using a Tablet PC to deliver examples and problem solutions on the web as an alternative to doing them in class.", "An examination of the use of classrom response systems in various lecture-based course at the University of Toronto. Over 30 U of T instructors were interviewed about their use of clickers in classes with a total enrolment of over 5,000 students. Students in these classes were also surveyed about their perception of the value of this technology.", "A non-technical introduction to chaotic systems, based on a one-hour class given to undergraduate students at a variety of levels. (164k/115k)", "A discussion of Bohr's Principle of Complementarity and its extension to the Copenhagen Interpreation of Quantum Mechnics. Based on a discussion for an upper-year liberal arts course in modern physics without mathematics. (89k/115k)", "Comparing a 6-week summer version to a 12-week fall version of a first year physics course for life science students. (2013, 512k)", "We studied the correlation of student performance in a large 1st year university physics course with motivation for taking the course and whether or not the student took a senior-level high-school physics course. Performance was measured both by the Force Concept Inventory and by the marks on the Final Examination.", "Techniques from physics education research are used to design, implement, and evaluate a curriculum module for data analysis in a third and fourth year undergraduate physics laboratory. (408k)", "A brief survey of the development of Quantum Mechanics in the 1920's by Schrödinger and Heisenberg. Some of the material is non-traditional. Based on a discussion in an upper year liberal arts course in physics without mathematics. (13k/16k)", "A small little document discussing some qualitative aspects of diffraction. (200k)", "A brief non-technical discussion of measuring dimensionality, including non-integer dimensionality. Also linked to from the Chaos document. (26k/45k)", "A discussion of the \"Feynman double slit,\" which forms the basis of many discussions of Quantum Mechanics. The topic is quite subtle, but the document is equally accessible to students at all levels. (183k/216k)", "How Does the Delivery of Information Help Students to Learn?, a discussion of the delivery of information both via the web and in the classroom. (63k)", "The Personal Fonemate & Other Cautionary Tales, a discussion of appropriate and inapproriate uses of computers in teaching. This is the text of a paper delivered to the 22nd International Conference on Improving University Learning and Teaching, Rio de Janeiro, Brazil, July 1997. (43k)", "The Physical Pendulum in an Advanced Undergraduate Course in Mechanics, a paper that appeared in the journal Computers in Physics 8, 416-419 (1995). It discusses studies of the pendulum and computer algorithms to solve the equations of the pendulum. (69k)", "Test Design, a small document of opinion and observation relating to tests and exams. (11k)", "We compared teams sorted by student ability to teams with students of mixed ability, comparted teams with 3 students to teams with 4 students, and examined female students in teams with only one female student and the rest male. (1.6M)", "A brief overview of electricity, magnetism and electromagnetic waves, from a first year physics course that uses minimal mathematics; the entire set of materials from the course is available by clicking here. (5k)", "A brief summary of the history of electricity and magnetism from the Greeks through Maxwell, from a first year physics course using minimal mathematics; the entire set of materials from the course is available by clicking here. (131k)", "A brief introduction to the concept of energy. It includes a small discussion of whether the energy is real. (37k)", "A handout that accompanied a talk on Entanglement to the Canadian Association of Natural Philosophers, a group of amateurs interested in science.", "Course notes from a one-hour class on entropy for upper-year liberal arts students. (44k/92k)", "A series of documents on error analysis in the experimental physical sciences. The discussion is at a beginning University level. (The first document size is 4.5k, the full set of documents in pdf format is a single file of size 440k). This series of documents was written in 2001. A new series of documents written in 2013 is based on the GUM and is available below under the title Uncertainty in Physical Measurements.", "Propagation of errors of precision using Mathematica and the Experimental Data Analyst package. This brief discussion is suitable for students at all levels who need to do a fair amount of error propagation calculations. (8k)", "Subtitled \"Understanding Language and Thought in Terms of Complexity and Chaos Theory\", this document shows that the origins of speech and the human mind have emerged simultaneously as the bifurcation from percepts to concepts. (42k)", "We examined correlations in student performance on Lawson's Classroom Test of Scientific Reasoning with factors related to the students, their background, and their reason for taking an introductory university physics course. June 2014 (777k)", "A brief introduction to fitting data to models. The emphasis is on least-squares techniques. The level is somewhat beyond what we expect from a typical first year student. (43k)", "An index to various Flash animations for physics. (12k).", "A small report on the performance of a small group of adult learners on the Force Concept Inventory diagnostic instrument. (html 10k, pdf 21k)", "A brief introduction to Fourier series, Fourier transforms, discrete Fourier transforms of time series, and the Fourier transform package in the Python programming langauge. (174k)", "Similar to the two Special Relativity documents, there are two General Relativity documents in the bookshelf. This one concentrates more on the worldview demanded by the theory, while Professor Key's concentrates more on the effects predicted by the theory. (121k/170k)", "A discussion of the general theory of relativity, from a first year physics course that uses minimal mathematics; the entire set of materials from the course is available by clicking here. (216k)", "A non-mathematical derivation of the fact that clocks in gravitational fields run slow. (23k/37k)", "Solving partial differential equations (PDEs) by computer, particularly the heat equation. The emphasis is on the explicit, implicit, and Crank-Nicholson algorithms. Other types of PDE's are discussed, including the Schrödinger equation. Used by upper-year physics majors and specialists. (45k)", "A small document analysing the forces acting on the hip. (89k/55k)", "The relationship between the horsepower and torque of an engine, focusing on car and motorcycle engines. The level is intended to be suitable for first year Physics courses. Requires Flash 5 or better. (316k)", "An overview of high energy physics at a non-technical level. Some of the material is non-traditional. (172k/161k)", "A very brief introduction to Physics Education Research and how the results of the research are used in physics teaching. January 2010. (24k)", "A brief summary of the concept of Inertial Frames of Reference in Newtonian and Einsteinian Physics. (25k/35k)", "A report on using U.S.-developed materials for innovative teaching techniques in introductory Physics courses. January 2005. (52k)", "An analysis of a survey of first year Physics lab students asking about the best and worst experiments they performed (34k)", "Extracts of a top-quality laboratory notebook. (3k)", "LabVIEW is a software tool from National Instruments for data acquisition and process control. The link to the left provides access to a 10-part tutorial in using LabVIEW and a one-page summary document.", "The link to the left provides access to five Modules on the UNIX-GNU/Linux computing environment. Each Module has been used as class notes for a 2 hour discussion on this computing environment.", "A discussion of the design principles for a least-squares fitter suitable for use in analysing data from the physical sciences and engineering. (228k)", "A discussion of issues of life and the Second Law of Thermodynamics. Includes a section on cellular automata, and a section on sustainable energy sources. (255k)", "A brief introduction to the conflict between local cause and effect and Quantum Mechanics. Based on a discussion in an upper year liberal arts course in physics without mathematics. (24k/39k)", "A detailed description of the phase shifts of the Mach-Zehnder interfereometer. (11k)", "The Dept. of Physics offers a first year course with minimal mathematics, titled The Magic of Physics. Documents from that course appear throughout this virtual bookshelf. The link to the left gives access to these 14 documents in a more coherent order.", "A tutorial on library creation and maintenance for the Maple programming language. (70k/39k).", "A small document on using a manometer to measure a pressure. (64k)", "A \"small\" document discussing how E = mc2 arises in the Special Theory of Relativity.", "This document discusses much of the same material as the previous one, but is written for physicists. (66k)", "Using a Micrometer. Requires Flash. (86k)", "The link to the left provides access to a thirteen-part set of lecture notes from a course in microprocessor interfacing; the course is taken by upper year students and by graduate students.", "Course notes from a one-hour class on mirror symmetry for upper-year liberal arts students. (399k/148k)", "Discusses the computer generation of events obeying some statistical model using Monte Carlo simulation. Brief reviews of Special Relativity and High Energy physics are also provided, and a small discussion of the generation of pseudo-random numbers is included. Used by upper year physics majors and specialists. (47k)", "A brief summary of Newtonian mechanics, from a first year physics course that uses minimal mathematics; the entire set of materials from the course is available by clicking here. (5k)", "Course notes, problems sets with answers, and tests from an introductory 3rd year course. (2k)", "A brief note of personal observation and opinion on the resistance of many physics teachers to implementing research-based pedagogy in their classes. (2013, 150k)", "An introduction to the basic use of an oscilloscope to measure voltages as a function of time. Requires Flash. (42k)", "An overview of PER and a small study of first year students. May 2005. (515k)", "A progress report on the development of new Physics Practicals for 1st Year Physics instruction (350k)", "This is a 20 chapter book on the ideas of physics, explained without mathematics. It also examines the role of physics in shaping both our thinking and the structure of our society. (671k in total, but the link to the left provides an index to pairs of chapters; each pair has a total filesize of about 66k.)", "A very brief and simple introduction to the polarisation of light. This document is also linked to from the Stern-Gerlach one. (17k)", "A brief summary of quantum interference and the uncertainty principle, from a first year physics course that uses minimal mathematics; the entire set of materials from the course is available by clicking here. (39k)", "An overview of quantum mechanics, from a first year physics course that uses minimal mathematics; the entire set of materials from the course is available by clicking here. (13k)", "An overview of quantum mechanics, from a first year physics course that uses minimal mathematics; the entire set of materials from the course is available by clicking here. (10k)", "A discussion of Quantum Teleportation, Information, and Cryptography. Based on a presentation to an upper-year course in modern physics without mathematics. (41k)", "A report of a measurement of quantum teleportation. One of the authors, D.F.V. James, is now at the University of Toronto.", "A very brief introduction, originally designed for upper-year liberal arts students. (31k/34k)", "A linguisitic analysis and a formal mathematical proof is presented to show that science can not prove the truth of a proposition but can only formulate hypotheses that continually require empirical verification for every new domain of observation. (27k)", "An overview of Stephen Hawking's contributions to black hole thermodynamics and cosmology. Originally written for a non-technical audience, it also includes a Primer on General Relativity and Cosmology. (32k)", "The Special Relativity document by Professor Key that is the next listing largely concentrates on the effects predicted by the theory, such as time dilation, length contraction, etc. This document is considerably longer than Professor Key's, and tends to concentrate more on the worldview suggested by the theory. (157k/310k)", "A discussion of the postulates of special relativity and their consequences, from a first year physics course that uses minimal mathematics; the entire set of materials from the course is available by clicking here. (119k)", "A very brief introduction, originally designed for upper-year liberal arts students. (107k)", "Vibrations on strings and drum heads, plus a brief discussion of Fourier analysis. The document is course notes from an upper-year liberal arts course. (189k/195k)", "This classic experiment introduces the notion of quantum spin; it is a vital introduction to many treatments of the \"Einstein-Podolsky-Rosen\" paradox and to Bell's theorem. This document is equally accessible to students at all levels. (76k/106k)", "Advice to first year University students on studying Physics. (300k)", "Lecture notes, problem sets (including answers), and tests for an introductory course on nuclear and particle physics for 3rd year students. The link to the left provides access to the 86 documents in this set.", "A report of a survey of 50 courses at the University of Toronto that have more than one instructor.", "A followup on the Team Teaching document just above, this report includes surveys of students on their attitudes towards Team Teaching.", "The link to the left provides access to a series of lecture notes on time series analysis from a course taken by upper year students.", "Two analogies to Bell's Theorem. They are both somwhat simpler than the Bell's Theorem docuement that appears above on this list.(62k/74k)", "A study of the correlation between tutorial attendance and final marks for two Physics courses. May, 2006. (24k)", "The link to the left provides access to a series of documents on uncertainty in physical measurements. They are intended for beginning university students in the physical sciences, and are based on the Guide to the Expression of Uncertainty in Measurement (GUM). They were written in 2013. An earlier effort at teaching this material is the Error Analysislink above.", "A study of the uncertainty in test, final exam, and course marks. (2013, 201k)", "A small document on reading a Vernier scale. (56k)", "A brief discussion of techniques for exploration of data with visualisation and transformation. Not terribly technical, but does examine techniques often considered to be advanced. (51k)", "A brief summary of waves, from a first year physics course using minimal mathematics; the entire set of materials from the course is available by clicking here. (27k)", "A brief summary of wave-particle duality, from a first year physics course that uses minimal mathematics; the entire set of materials from the course is available by clicking here. (14k)", "A discussion of the role of elementary particle physics in the study of cosmology. This are slides of a talk given to University of Toronto summer research undergraduate students in 1999. (2.5M)"], ["Author", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "Anthony W. Key", "David M. Harrison", "David M. Harrison", "Jason Harlow, David M. Harrison and Ruxandra Serbanescu", "David M. Harrison", "David M. Harrison", "Jason Harlow, Lena Paulo Kushnir, Charly Bank, Scott Browning, Jim Clarke, Anne Cordon, David Harrison, Karen Ing, Cecilia Kutas, and Ruxandra Serbanescu", "David M. Harrison", "David M. Harrison", "Jason J.B. Harlow, David M. Harrison, and Eli Honig", "Jason J.B. Harlow, David M. Harrison, and Andrew Meyertholen", "David F. Wong", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "Solomon C. Douglas, David M. Harrison and Theodore G. Shepherd", "David M. Harrison", "Jason. J.B. Harlow, David M. Harrison, and Andrew Meyertholen", "Anthony W. Key", "Anthony W. Key", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "Robert K. Logan", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "Anthony W. Key", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison and Stephen W. Morris", "David M. Harrison and Ruxandra M. Serbanescu", "Richard E. Azuma and David M. Harrison", "James R. Drummond", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "Anthony W. Key", "David M. Harrison and Solomon R.C. Douglas", "David M. Harrison", "David M. Harrison", "Jason Harlow and David M. Harrison", "David M. Harrison", "James R. Drummond", "David M. Harrison", "David M. Harrison", "Anthony W. Key", "David Bailey", "David M. Harrison", "David M. Harrison", "Jonathan Hillel", "David M. Harrison", "Robert K. Logan", "David M. Harrison", "Anthony W. Key", "Anthony W. Key", "Anthony W. Key", "David M. Harrison", "M. Reibe et al.", "David M. Harrison", "Robert K. Logan", "Pekka K. Sinervo", "David M. Harrison", "Anthony W. Key", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David C. Bailey", "Melody Neumann et al.", "Melody Neumann et al.", "David M. Harrison", "Daivd M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "David M. Harrison", "Anthony W. Key", "Anthony W. Key", "Robert S. Orr"], ["Format", "pdf", "html and pdf", "html", "html", "html and pdf", "html", "html and pdf", "html", "html and pdf", "html and pdf", "pdf", "html", "pdf", "pdf", "html and pdf", "html and pdf", "pdf", "pdf", "pdf", "html and pdf", "html", "html and pdf", "html and pdf", "pdf", "pdf", "pdf", "html", "pdf", "html", "html", "html", "pdf", "html and pdf", "html and pdf", "html", "html", "pdf", "pdf", "html", "html and pdf", "pdf", "html and pdf", "html", "html and pdf", "pdf", "html and pdf", "html", "html and pdf", "html", "html and pdf", "pdf", "pdf", "html", "pdf", "html", "html", "html", "html and pdf", "html", "html", "html and pdf", "html", "html and pdf", "pdf", "html", "pdf", "html and pdf", "pdf", "html", "html", "pdf", "html", "pdf", "pdf", "html", "html", "html", "html", "html", "html", "pdf", "html and pdf", "html", "html", "html and pdf", "html", "html", "html and pdf", "html and pdf", "pdf", "html", "pdf", "pdf", "pdf", "html and pdf", "pdf", "html", "pdf", "html", "html", "html", "html", "pdf"]], "pageTitle": "Physics Virtual Bookshelf: All Contents", "title": "", "url": "http://www.upscale.utoronto.ca/GeneralInterest/All.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00215-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 807391277, "recordOffset": 807375639, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{47406= Copyright © 2000 David M. Harrison, 47278= This page was last revised on $Date: 2015/06/20 18:34:45 $ (y/m/d UTC)}", "lastModified": "Sat, 20 Jun 2015 18:35:03 GMT", "textBeforeTable": "All Contents", "textAfterTable": " This page was last revised on $Date: 2015/06/20 18:34:45 $ (y/m/d UTC)  Copyright © 2000 David M. Harrison", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}