{"relation": [["Diary", "Wisconsin Preview", "Post Week 11: Yardage Analysis and Predictions + Score Predictor", "Week #11 National Statistics and Predictions for Wisconsin", "Preview: Wisconsin 2010"], ["Author", "The Mathlete", "tpilews", "Enjoy Life", "Brian"], ["Method", "PAN-fried", "Weighted YPG", "Sagarin, Fremeau", "fear, surprise, ruthless efficiency, an almost fanatical devotion to the Pope, and nice red uniforms"], ["Prediction", "Wis, 38-37", "M, 42-38", "Wis, 41-30 (FEI) or W-4.5", "Wis, 34-27"], ["Kick-Ass Graphic", "", "", "", ""]], "pageTitle": "Dear Diary: A Tragedy, or Just a Comedy of Errors? | mgoblog", "title": "", "url": "http://mgoblog.com/content/dear-diary-tragedy-or-just-comedy-errors?quicktabs_1=0", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00051-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 161876135, "recordOffset": 161831493, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{96292=2. James Kamoku- You son of a bitch! You think you can put your god damn hands on Steve Breaston and get away with it? DO YOU!? This amateur during a 2006 UM vs UW punt return decided to try and rip Steve's ankle off. It was caught on TV. Karma is a bitch since last I saw you played for some fake football team called the \"Wolf Pac\". Guess what happened to this dirt ball for his bush league act? NOTHING!, 86955=Adorable children have a way of appearing when Brian's about to hurl profanities, so I marched to Michigan's last home game of 2010 with an army of them. It does help with the profanity –- the worst thing I did at a game full of perfect exclamatory moments was to face the sky after the batted interception and yell \"I thought you hated Wisconsin!\", 189930=http://courtflush.blogspot.com/2010/11/frosty-snowman.html, 91289=But here's this kid who's 14 years old, knows what \"Ndamukong\" means, pulls up rushing stats on SportsTap more than I do, and he doesn't remember Chris Perry because he was fucking SEVEN the last time we beat Ohio State. I don't expect the 2010 Michigan team to play defense like '97, because they're not that good, the same way that this column will never be written as well as the Brian's post-game the next day, and that post-game won't be as good as DFW's tennis coverage was, and DFW's genius was not that of the bard., 151318=So it's not like the \"Lloyd's guys were soft\" meme just sprang up during the 2008 season. Really, it got a major head of steam when the guys were losing in the 4th quarter all over 2005, and the TV talking heads were peppering us with that meme after the start to 2007. True or not, its nascence was not in RR defensism; it was a thing that grew in volume over Carr's career.}", "lastModified": "Fri, 31 Jul 2015 08:24:13 GMT", "textBeforeTable": "The Grid of Expectation: Much Ado About Nothing For him, for the moppets who made the banner, for the seniors, for the fans, for the coach, for the team, to go into Columbus this year and beat Ohio State, well, that would just be awesome. But here's this kid who's 14 years old, knows what \"Ndamukong\" means, pulls up rushing stats on SportsTap more than I do, and he doesn't remember Chris Perry because he was fucking SEVEN the last time we beat Ohio State. I don't expect the 2010 Michigan team to play defense like '97, because they're not that good, the same way that this column will never be written as well as the Brian's post-game the next day, and that post-game won't be as good as DFW's tennis coverage was, and DFW's genius was not that of the bard. The injuries sustained today – Roh, Rodgers, Stonum, Smith – may make it impossible, but there's still a chance for awesome. That's why playing for Michigan is different than for every other school, because no matter how the season goes, that chance for awesome is always going to be right there at the end of it. For the seniors, it's the last one. For my 14-year-old cousin, there will be so many more that one loss to Wisconsin is nothing next to years of Denard Robinson and whatever amazing things are ahead. Those kids: Greg Banks, James Rogers, Steve Schilling, Adam Patterson,", "textAfterTable": "The Taming of the Overgrown Shrew MonuMental's Weekly Wallpaper In the last week of the normal Big Ten season the Diarists had to dig deep (get it?) to get up for a visit from the 10-1 Badgers. First, the Shred Dude, and his remake of Shakespeare's section title-referenced play: 10 Things I Hate About The F-ing Badgers. Whats that shit on your face? 2. James Kamoku- You son of a bitch! You think you can put your god damn hands on Steve Breaston and get away with it? DO YOU!? This amateur during a 2006 UM vs UW punt return decided to try and rip Steve's ankle off. It was caught on TV. Karma is a bitch since last I saw you played for some fake football team called the \"Wolf Pac\". Guess what happened to this dirt ball for his bush league act? NOTHING! Other things Shredder hates: suffocatingly boring, anti-points white-guy basketball, green giants, band camp, dirty campgrounds, letter people, candy canes, trucks, and the cast of That '70s Show except Red. Also: guys who switch positions mid-Paint: Meanwhile, Coach Schiano visualized a motivational post-Wisconsin speech by Rich Rod. Denard, Kelvin Grady, et al. respond in a telling reminiscent of the random heroism of", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}