{"relation": [["", "1.", "2.", "3.", "4.", "5."], ["Date", "04 Jan 2010", "10 Jul 2009", "05 Apr 2008", "19 Dec 2007", "31 Aug 2007"], ["Author", "Ken Biron", "Anonymous", "Richard Range", "Anonymous", "Shelton"], ["Subject", "(0) THANK YOU!", "(0) source", "(0) blank display", "(0) It Works", "(1) Radio Shack Pro-2055 Mods"], ["", "View article", "View article", "View article", "View article", ""]], "pageTitle": "mods.dk - Articles for Radio Shack 'PRO-2055'", "title": "", "url": "http://www.mods.dk/index.php?ModelId=976&RadioId=1-radio_shack&ModelRec=pro-2055", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 13, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00263-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 579469184, "recordOffset": 579460982, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{21924=Click here to see the article list for PRO-2055., 17185=This forum message list include all message for that is related to PRO-2055, this include message that also is related to articles. If the message is relate to an article, the article can be selected next to each message.}", "textBeforeTable": "This forum message list include all message for that is related to PRO-2055, this include message that also is related to articles. If the message is relate to an article, the article can be selected next to each message. Note that page can take a while to load, if there are many modifications. Click here to view all the ABOVE modifications for pro-2055 in one page. PRO-2055 keypad startup options 05 May 2007 Display failure: Common problem, easy fix 05 May 2007 Discriminator tap for PRO-2055 21 Oct 2008 Edit the Pro-2055 Welcome Message for Radio Shack PRO-2055 23 Nov 2008 Up date: on display problom for PRO-2055 15 Nov 2011 Description Uploaded Articles for Radio Shack 'PRO-2055'", "textAfterTable": "Click here to write a new message or comment for PRO-2055 Note that the message is not related to any article. Click here to see the article list for PRO-2055. Do you have any tricks, modifications or constructions for homebrewed equipment that are not on mods.dk, please send the information to mods.dk. If you prefer to be anonymous write it in the message.   Radio Shack Menu Manuals Pictures", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}