{"relation": [["Title", "Maricopa County Attorney Will Not Charge Sheriff's Deputy In Deadly Crash", "EPA Head Talks Climate Change With Western Governors", "Do Arizonans Have An Accent?", "American Legion To Open Crisis Center In Phoenix", "Theater Group To Perform Plays On The Light Rail", "Mesa Looking At Another Light Rail Extension", "Comicon, Cosplay And Consent", "Board Calls For Overhaul Of Public Safety Pension Fund", "Avondale City Council Appoints New Mayor", "The Homes Are Built, But Buyers Aren't Moving In. Why?", "Author Recounts Journey From Somali Civil War To Arizona", "Resurgence In Infill Development Evident In Phoenix", "Arizona Supreme Court: Expert Witnesses Don't Need to Know About Specific Case", "Avondale Mayor Resigns To Run For County Board Of Supervisors", "Lawmaker Says New Child Welfare Agency Will Be Different", "Casa Grande Students Make Big Discovery At Utah Dig", "Mountain Preserve Rescues Have Doubled This Year", "Celebrating 25 Years Of 'Bust A Move'", "Arizona Gas Prices Up Slightly This Memorial Day", "Some Fireworks Go On Sale Tuesday", "Trouble Swirls Around Tom Horne", "Valley Has High Percentage Of 'Disconnected Youth'", "It's Children's Book Week, And Literature Has Come A Long Way", "Telling The Stories Of Neighbors In The Garfield District", "Arizona Unemployment Rate Down In April"], ["Author", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie", "Mark Brodie"], ["Publication Date", "June 11, 2014", "June 10, 2014", "June 06, 2014", "June 06, 2014", "June 06, 2014", "June 06, 2014", "June 06, 2014", "June 05, 2014", "June 04, 2014", "May 30, 2014", "May 30, 2014", "May 30, 2014", "May 29, 2014", "May 27, 2014", "May 23, 2014", "May 23, 2014", "May 23, 2014", "May 23, 2014", "May 22, 2014", "May 20, 2014", "May 16, 2014", "May 16, 2014", "May 16, 2014", "May 16, 2014", "May 15, 2014"]], "pageTitle": "| KJZZ", "title": "", "url": "http://kjzz.org/staff/14?page=17", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00232-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 137238667, "recordOffset": 137222273, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1561=Brodie won a 2005 Associated Press award for a story about real estate flipping and shared in a 2003 Public Radio News Directors Inc. award with Steve Goldstein for a story about ticket scalping at Arizona Cardinals games. The New York State Broadcasters Association, RTNDA, and other journalism organizations have recognized his work as well., 1113=Brodie began his tenure with KJZZ in 2002, after reporting and hosting for NPR member stations WAER in Syracuse, NY and WAMC in Albany, NY.  He received his Broadcast Journalism and Political Science degrees from Syracuse University., 2962=On primary and election nights, Mark anchors KJZZ’s coverage, interviewing candidates, reporters and people on all sides of ballot measures. Covering government and politics in Arizona has led Brodie to report on the legislative and legal battles over immigration law SB 1070, the recall election of former Arizona Senate President Russell Pearce and Presidential visits, among many other stories.}", "lastModified": "Fri, 31 Jul 2015 07:19:30 GMT", "textBeforeTable": "  Contact Mark Brodie at 480-774-8239 or mbrodie@rioradio.org, or on Twitter @markwbrodie. In his free time, Brodie enjoys photography. He’s also a big fan of the New York Yankees, New York Giants, and the late, great Hartford Whalers. Brodie began his tenure with KJZZ in 2002, after reporting and hosting for NPR member stations WAER in Syracuse, NY and WAMC in Albany, NY.  He received his Broadcast Journalism and Political Science degrees from Syracuse University. Brodie won a 2005 Associated Press award for a story about real estate flipping and shared in a 2003 Public Radio News Directors Inc. award with Steve Goldstein for a story about ticket scalping at Arizona Cardinals games. The New York State Broadcasters Association, RTNDA, and other journalism organizations have recognized his work as well. While Brodie spends most of his time covering the state capitol, other aspects of politics and government in Arizona, he also reports non-political stories.  Brodie also serves as an emcee and moderator for special station events and community forums. Brodie’s reporting on Arizona government and politics has been featured on national programs, including All Things Considered and Marketplace. He’s also been heard on radio programs in Arizona, Los Angeles and elsewhere, and is a regular", "textAfterTable": "Pages « first ‹ previous … 14 15 16 17 18 19 20 21 22 … next › last »", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}