{"relation": [["Author", "kenisu3000", "kenisu3000", "kenisu3000", "kenisu3000", "kenisu3000"], ["Title", "Aww, Phoot!", "Buzz-Buzz", "Chapter 1 - Page 25: Meet Ninten", "Chapter 1 - Page 26: When Lamps Attack", "Chapter 1 - Page 27: Lampy's Little Setback"], ["Description", "We've all been there, at least either on the giving or the receiving end.", "A Buzz-Buzz drawing done for the Interpretation dealie that Mystic Pyro Freak has set up. That's the Sound Stone he's... umm, levitating (note the sound wavelength spanning the stone's main face), although this was before I became aware that the stone is supposed to look like a rainbow-colored conch shell (a'la the EB Zero Magicant houses or the God's Tail rocks). Big deal, I guess... I've always thought of it as a flat, shale-like stone, so that's how I'm presenting it.", "kenisu - #25 Ah, it's good to begin Chapter 1 at last. I pulled a genuine, classic college all-nighter to finish this one. Anyway, it's anyone's guess as to why Ninten, an all-American boy, is reading a Japanese-language manga. Also, I'm beginning to question if it really was a good idea to give Mick (the family dog) the ability to stand on his hind legs as his sprite in the game seems to suggest.", "kenisu - #26 Sorry about how pale the colors are and everything... up until now, I've been using the superb scanners at my university, but now that I'm home from college, my so-so standard scanner will have to do. My winks to the 80's continue. Basically, I'm giving Ninten the sort of fandom that I was into back then (although I was 6 in 1988, whereas Ninten is supposed to be 12, so I have to take each medium's target age into account), and Garfield and ALF were just two of the things I remember the 80's for. As for the San Francisco Giants, I've never been much of a sports fans at all, but I'm really milking the Encyclopedia MOTHER for all it's worth to bring out Ninten's personality.", "kenisu - #27 I tried a different approach to shading this time: up until now, I did all the shading with my Dark Brown colored pencil, regardless of the value of the color I'd be shading. Since that has proven to be a rather ineffective method, I got several suggestions to shade using a darker value of the color I'm shading. Since I don't have that big of a variety of colored pencils, I instead did all the shading on the computer by using the \"darken\" tool. Please feel free to give me your responses on this so that I know whether to continue with it or what."], ["Date", "3/24/10", "3/12/09", "12/9/06", "12/18/06", "1/2/07"], ["Rank", "0.00", "0.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=26636&stuffPageNumber=3", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00275-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 228427178, "recordOffset": 228418976, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> W T S Q P N M I G F D C B A < Other Submissions by kenisu3000 I hate having to research history. But THEN, I worried that a Model-T Ford might not have been powerful enough to kill anyone. So I looked it up, and apparently that model was capable of going at excesses of 30 mph, which I don’t doubt is fast enough for a reckless drunk driver to plow over a helpless pedestrian. That whole business about Suzannah getting run over by a drunk driver… well, I worried about that. Not because I thought it was too “adult” a theme, but because I suddenly remembered about Prohibition (even though there was still a lot of bootlegging going on during that time anyway), but then I did the math, and chalked up the accident to take place in 1918, two years", "textAfterTable": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}