{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13"], ["Name", "Microphone Song", "Firenze", "Slow Down Chicago", "Impostors", "Shadowcat", "An Apology", "Heads Hurt Better", "Just a Star", "Sympathetic Vibrations", "Busride", "Money Making Money", "The Things You Don't See", "All This Dust"], ["Artist", "Canasta", "Canasta", "Canasta", "Canasta", "Canasta", "Canasta", "Canasta", "Canasta", "Canasta", "Canasta", "Canasta", "Canasta", "Canasta"], ["Time", "4:20", "4:17", "4:04", "5:31", "7:28", "3:25", "5:41", "5:16", "4:00", "5:39", "3:47", "4:09", "3:26"], ["Price", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - We Were Set Up by Canasta", "title": "", "url": "https://itunes.apple.com/gb/album/busride/id125043736?i=125044227", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00152-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 872094855, "recordOffset": 872067515, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{121002=Copyright © 2014 Apple Inc. All rights reserved., 25905=Formed: 2002 in Chicago, IL}", "lastModified": "Fri, 31 Jul 2015 08:31:51 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Canasta We Were Set Up iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from We Were Set Up by Canasta, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "13 Songs Album Review Chicago sextet Canasta can be called an indie pop band for good enough reasons, but on their debut album, We Were Set Up, they display both an ambition and a sense of range that any number of early 21st century American groups described in similar terms would be wise to follow. This doesn't mean in the overblown art statement sense either — there's a brisk, wired tension from the start with the quick clip of \"Microphone Song,\" but it's the subtle shifts throughout the song from quiet piano and crisp drums to a violin-led waltz and back, so much more than simple loud/soft/loud dynamics, that make it a real winner. The hourlong album moves in a similar vein overall, thanks in large part to the depth of the ensemble — possessing both a keyboardist and a pianist gives the bandmembers a chance for interplay at many points (check out the introduction to the winning \"Slow Down Chicago,\" perhaps the album's standout number), while clarinet and trombone also pop up, and that's not even counting the various guest performers' work (including Edith Frost, who appears on the mesmerizing cosmic country twang of \"Just a Star\"). It's rare that a rock band piling on the feedback can suddenly seem stunning in context, but when Canasta do that in", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}