{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14"], ["Name", "Grace Kelly", "Lollipop", "My Interpretation", "Love Today", "Relax, Take It Easy", "Ring Ring", "Any Other World", "Billy Brown", "Big Girl (You Are Beautiful)", "Stuck In the Middle", "Erase", "Happy Ending", "Over My Shoulder", "Grace Kelly (Acoustic Version)"], ["Artist", "MIKA", "MIKA", "MIKA", "MIKA", "MIKA", "MIKA", "MIKA", "MIKA", "MIKA", "MIKA", "MIKA", "MIKA", "MIKA", "MIKA"], ["Time", "3:07", "3:03", "3:35", "3:55", "3:44", "3:37", "4:19", "3:14", "4:08", "4:08", "3:38", "4:36", "4:45", "3:05"], ["Price", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29", "$1.29"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Life In Cartoon Motion by MIKA", "title": "", "url": "https://itunes.apple.com/us/album/life-in-cartoon-motion/id219949350?i=219949366", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00261-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 872671063, "recordOffset": 872639177, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{31920=Born: August 18, 1983 in Beirut, Lebanon, 131686=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 07:32:08 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist MIKA Life In Cartoon Motion iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Life In Cartoon Motion by MIKA, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "14 Songs Editors’ Notes No less an authority than Sex Pistol-cum-DJ Steve Jones has opined he finds the aught-something UK pop scene a dizzying, trend-challenged stew, a notion this cocky debut by Lebanon-born/Paris conservatory trained Mika reinforces with high-flying glee. Deconstruct it and you’ll find some familiar ‘70s sonic touchstones at its core, specifically Elton John’s pop-craft smarts and Freddie Mercury’s flair for over-the-top showmanship, right down to the delicious, campy abandon with which the musician delivers his soaring falsetto on the impossibly effervescent opener/Euro-breakout single “Grace Kelly.” “Relax” suggests the Scissor Sisters with a serious Abba jones, while “Interpretation” spotlights a solid, more traditional ballad instinct and the Broadway-ready “Billy Brown” showcases an artist who knows how to employ the copious surplus brass he carries between his musical legs. Customer Reviews Fresh and Retro At Once           by Here Comes Treble Mika's debut album will draw (and has drawn) comparisions to artists before him. However, his songs are unique, quirky confections. Indulge in this album. The songs are easy to get lost in, but listen for the serious spoken bits between some of them. My one", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}