{"relation": [["Author", "Elobo", "Elobo", "Elobo", "Elobo", "Elobo"], ["Title", "It's a Dog eat Dinosaur eat Dog World", "Grinning Devil", "Uproarious Upchucking", "Desperation", "Worshiped Idol"], ["Description", "Out in the desert, a mighty buffalo slumps. Old and worn, it is quickly dropped by the roving pack of Crested Booka. But such an easy bounty is not so easily kept in these wind-scarred lands. The Desert Wolves move in on the Booka pack. It seems the rights to this kill will take some real conflict after all.", "Ousted by the stone idols of a fallen tribe, the remnants of both Agrillan tribes remained covetous of their homeland. Progress shifted towards malice, and constructs such as these were a result. Simple in design, deadly in execution. It came wearing a toothy grin on its face and carrying a belly full of fire. They were meant to be expended, but they were beyond precious – made from some of the last meager resources the tribes could pull together. They should have entangled the idols with chain, hook, and magnetic clasp. But they were changed by the spiritual discord of the land, became autonomous. and the homeland slipped farther from the people’s grasp.", "Our sources say that when the Master Belch takes on too much fly honey, he merely needs to open his mouth and issue forth a river of putrescent barf. The stench is permanent, it's great for decorating the base! And while he uses some of his body mass, he frees himself up for more fly honey and generate a whole host of new minions! (ebfgp 2009)", "Our consciousness streams inwards, crushing itself. Our mind barely has strength enough to stitch this world together anymore. It tears apart at the seam. The dark recesses of our mind bleed through. Nightmare tendrils reach down to strangle the colour from our form. We grew overconfident, riding high on the devastation of the guardians. But now, we are simply alone on a pile of battered corpses, they have no more energy to give. Our courage has been rent in twain again and again, and we simply do not have the fortitude for it anymore. All that is left is Desperation. All that is left is to blindly flail at the encroaching nightmares while we cling desperately to the decadence of our memories of former conquest. But we are alone now, courage left us a long time ago.", "Oral tradition tells of two tribes in Agrilla. Two tribes born of the same sun. They lived and worked in peace. One tribe began to worship an unseen pantheon. Massive stone idols were erected in their honour. The worshiping tribe grew vainglorious of their faith and scornful of the other. They were obsessed with the adulation of their pantheon and rapidly consumed the resources of the land for offerings and material to build and move their idols. The other tribe could take no more and slaughtered the worshipers – weak from their exhausting and constant rituals. In spite, they toppled the idols, smashing them in the canyon. The spirits of their enemies were still zealous and bound themselves to the great stone heads of their monoliths. They struggled to move, but crushed their killers. But they could not give chase without toppling, and the remaining Agrillans fled the land to start anew. The idols were left with a taste for blood in a barren land, wailing in anguish over their lost vengeance."], ["Date", "5/26/09", "11/9/09", "8/15/09", "8/18/09", "11/8/09"], ["Rank", "0.00", "0.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=27050&stuff=DescDESC&stuffFirstLetter=O", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00261-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 228223384, "recordOffset": 228215182, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> Y W V U T S R P O N M L K I H F E D C B A < Other Submissions by Elobo There are many fungal monsters, but few are as vile as the Zombieshroom. Its vast, undead network strangles its small island home. Whenever someone washes up on shore, it must slake its thirst for violence and need to propagate. The hapless victim is beaten, then slowly and painfully engulfed and changed by fungal growth. Finally, the brain is eaten by the Zombieshroom, and replaced with a new Zombieshroom core. The new zombie will either try to set out to flex its sickly influence elsewhere, or become yet another piece of the organism that just killed it.", "textAfterTable": "1 2 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day. Activities:", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}