{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Rock and Roll, Hoochie Koo", "Cat On a Hot Tin Roof", "Something Inside of Me", "Rock and Roll, Hoochie Koo", "Rock and Roll, Hoochie Koo (Re-Recorded)", "Rock and Roll, Hoochie Koo (Live)", "Jazzy Koo (Rock & Roll Hoochie Koo)", "Hot & Cool", "Celestial Love", "Free Ride"], ["Album", "The Best of Rick Derringer - Rock and Roll, Hoochie Koo", "Knighted By the Blues", "Collection: The Blues Bureau Years", "All American Boy", "Greatest & Latest (Re-Recorded Versions)", "Live At Cheney Hall", "Free Ride", "Free Ride", "Free Ride", "Free Ride"], ["Time", "3:43", "3:20", "9:27", "3:42", "3:42", "6:03", "3:58", "4:07", "4:12", "4:16"], ["Price", "0,99 €", "1,29 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Free Ride by Rick Derringer", "title": "", "url": "https://itunes.apple.com/gr/album/jump-jump-jump/id5575667?i=5575663", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00285-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 865514127, "recordOffset": 865489074, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{23225=Born: 05 August 1947 in Celina, OH, 21146=An instrumental jazz-pop album from Rick Derringer? That isn't the sort of project that one ordinarily expects from the singer/guitarist who is best known for his hard-rocking 1974 smash, \"Rock & Roll, Hoochie Koo,\" but in fact, Free Ride is primarily an album of instrumental jazz-pop. Derringer doesn't get into any crunching hard rock guitar on this 2002 release; instead, his guitar playing brings to mind George Benson's more commercial work. Blending jazz, funk, and pop, Derringer takes dead aim at the smooth jazz market. But for the most part, he maintains his integrity and avoids outright elevator music — someone who appreciates Benson's Breezin' but finds Kenny G and Dave Koz boring will likely find Free Ride to be generally pleasant, if slightly uneven. Most of the songs are Derringer originals, although he puts an instrumental spin on three '70s classics: \"Rock & Roll, Hoochie Koo,\" Edgar Winter's \"Frankenstein,\" and the title song (which Dan Hartman wrote when he was with Winter). The latter is the most disappointing of the three; \"Free Ride\" ends up being turned into elevator music, while Derringer's remakes of \"Rock & Roll, Hoochie Koo\" and \"Frankenstein\" have more bite. The only tracks that find Derringer singing are \"Hold\" and the melancholy \"Big City Loneliness,\" both of which are likable adult contemporary items à la Gino Vannelli. Free Ride isn't the masterpiece that it could have been; Derringer has killer chops, and from a creative standpoint, he would have been better off providing an album that has more blowing, more improvisation, and less production — not necessarily hard bop, but perhaps something along the lines of the jazz-funk that Grant Green gave listeners in the early '70s. Nonetheless, Free Ride is generally decent, and it is superior to most of the stuff that smooth jazz stations are quick to play., 119634=Copyright © 2014 Apple Inc. Με επιφύλαξη παντός δικαιώματος.}", "lastModified": "Fri, 31 Jul 2015 08:49:29 GMT", "textBeforeTable": "View In iTunes The Best of Rock 'n' Roll Hoochie Coo (Re-Recorded Versions) 5. View In iTunes Live At Cheney Hall 4. View In iTunes Free Ride 3.", "textAfterTable": "Listeners Also Bought Dan on the Moon Dr. Dan View In iTunes Just Enough Roger Smith View In iTunes Sausalito Common Cause View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}