{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "First Day of My Life", "A Perfect Sonnet", "Four Winds", "Old Soul Song (For the New World Order)", "Lua", "Lover I Don't Have to Love", "We Are Nowhere and It's Now", "Take It Easy (Love Nothing)", "Easy / Lucky / Free", "At the Bottom of Everything"], ["Album", "I'm Wide Awake It's Morning", "Every Day and Every Night - EP", "Cassadaga", "I'm Wide Awake It's Morning", "I'm Wide Awake It's Morning", "LIFTED or the Story Is in the Soil, Keep Your Ear to the Ground", "I'm Wide Awake It's Morning", "Digital Ash In a Digital Urn", "Digital Ash In a Digital Urn", "I'm Wide Awake It's Morning"], ["Time", "3:08", "3:41", "4:12", "4:29", "4:31", "4:00", "4:12", "3:20", "5:31", "4:34"], ["Price", "¥150", "¥150", "¥250", "¥150", "¥150", "¥150", "¥150", "¥150", "¥150", "¥150"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - LIFTED or the Story Is in the Soil, Keep Your Ear to the Ground by Bright Eyes", "title": "", "url": "https://itunes.apple.com/jp/album/lifted-or-story-is-in-soil/id6939392?l=en", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00215-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 886619027, "recordOffset": 886587138, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{25595=When Bright Eyes brainchild Conor Oberst issued Lifted or The Story Is in the Soil, Keep Your Ear to the Ground in August 2002, he was 22 years old. Critics were already calling him the \"indie Bob Dylan,\" but the new millennium had seen a lot of those introverted, intelligent types (Ryan Adams, Beck). Bright Eyes, though, delivered a solid, intricately produced album without the majors' monotony. Immediately, one can sense Oberst's literate approach. His vocal curdle is abrasive yet warm. It's similar to the cooing of Robert Smith, but lush in heartache like Paul Westerberg, leaving the storybook of Lifted or The Story to earn massive praise. \"Waste of Paint\" is rough-cut with edgy acoustics, while \"From a Balance Beam\" glows with pop-like optimism. Chimes and simple drumming keep the story of personal insecurity and the fear of the unknown coming alive in a dreamy sort of way. Even when he's aching his way through the pop rumble of \"Method Acting,\" Bright Eyes convincingly lures one into his eclectic musical world. Oberst obviously has the talent to support the hype. \"Lover I Don't Have to Love\" is a dark number with its Radiohead-like doom and gloom; however, the piano swirl of \"A Bowl of Oranges\" offers a brighter reflection. On Lifted or The Story Is in the Soil, Keep Your Ear to the Ground, Bright Eyes has mixed badness with beauty for a sonic storybook that relates to everyone. It's slightly overwhelming at first, but one must allow a grace period to fully absorb the abstract desire behind this album., 132437=Copyright © 2014 Apple Inc. All rights reserved., 28111=Formed: February 15, 1980 in Omaha, NE}", "lastModified": "Sat, 01 Aug 2015 04:52:06 GMT", "textBeforeTable": "View In iTunes Digital Ash In a Digital Urn 5. View In iTunes The People's Key 4. View In iTunes LIFTED or the Story Is in the Soil, Keep Your Ear to the Ground 3.", "textAfterTable": "Listeners Also Bought One Jug of Wine, Two Vessels (Remastered) Bright Eyes & Neva Dinova View In iTunes Elevator Hot Hot Heat View In iTunes You Are Free Cat Power", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}