{"relation": [["Author", "IcyAntoid", "IcyAntoid", "IcyAntoid", "IcyAntoid", "IcyAntoid"], ["Title", "25 DP", "25 DP Alternate", "444", "5 DP", "5 DP Alternate"], ["Description", "To think such a small circular object could cause such destruction for the world. Modelled after the Canadian coin.", "An object that represents monetary value for some strange reason. Save enough of them and you can buy that bicycle in the store window that you had your eye on. Or...whatever else tickles your fancy.", "Four's my favorite number.", "Based off the canadian coin, just like the others.", "The Dragon Point coin interpretations are back! This time, everything is based off of the American coins. I should point out right now that if anyone feels offended with these, just know that it is not my intention to do so. I'm just doing this for fun and I don't mean for anything to be taken seriously. Fun Fact: As a replacement for \"E Pluribus Unum\", I had originally thought of putting in \"Spankety, Spankety, Spankety\", but then, that didn't make me feel very good, at least from a moral standpoint, so I instead settled on another catchy, familiar jingle. Enjoy!"], ["Date", "7/19/09", "9/1/09", "5/15/10", "8/3/09", "8/29/09"], ["Rank", "9.00", "0.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=24865&stuffPageNumber=3", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00186-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 229411207, "recordOffset": 229403005, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> Z Y X W V U T S R Q P O N M L K J I H G F E D C B A 8 5 4 2 1 < Other Submissions by IcyAntoid All they wanted to do was celebrate the New Year, but it seems there was a slight miscalculation in the fireworks. No, I don't hate Lucas. Happy 2009, everybody! This image has", "textAfterTable": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}