{"relation": [["File Name", "SLDataText Guild", "SLDataText Friends", "SLDataText StatLine", "SLDataText ItemTracker", "SLDataText CombatMonitor"], ["Version", "1.1.0", "1.0.5", "1.0.2", "1.0.3", "1.0.1"], ["Size", "5kB", "5kB", "7kB", "3kB", "7kB"], ["Author", "Taffu", "Taffu", "Taffu", "Taffu", "Taffu"], ["Date", "10-06-12 05:41 AM", "09-02-12 05:12 PM", "09-01-12 03:42 AM", "06-27-12 03:50 PM", "01-14-12 06:34 AM"], ["Type", "Addon", "Addon", "Addon", "Addon", "Addon"]], "pageTitle": "SLDataText : Other : World of Warcraft AddOns", "title": "", "url": "http://www.wowinterface.com/downloads/fileinfo.php?id=8539&so=&page=28", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00295-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 843899443, "recordOffset": 843870714, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{16365=Simple Light Data Text v6.0.01 SLDataText is a lightweight addon based on text based modules, which can be moved & customized independently or globally. It includes LibSharedMedia support for expanded font selection, and various degrees of mouse click interaction on various module frames. It also supports user-created plug-ins to expand on the module selection beyond what is included in this package. Plug-ins can be as vast or as tiny as desired. Included is are custom libraries (LibSL-1.0 and LibSLTip-1.0) that are used for module configuration menu management and interactive tooltips. Each module can be positioned independently via dragging and placement can be fined tuned via the configuration menu. Fine tuning includes manual frame anchoring, text justification, X/Y value tweaking, and frame strata value. Each module has an independent configuration menu, and the AddOn has a global menu to handle unified font types & sizes. The following modules are contained in this package:}", "textBeforeTable": "Optional Files (5) -Added localization for classes in the Color.lua file, and a localization check in the Friend & Guild List tooltip to avoid errors thrown when retrieving class colors for the tooltip lists. -Tooltip adjustments on Memory module to attempt to stem off lag problems -Click functionality on Guild List fixed when columns are hidden -\"Profiles\" added - buggy and needs tweaking, but functioning -Core adjustments for new Colors.lua -Colors.lua table adjustments to support client information -Additional locale information added for plugins April 10th, 2008 - v1.02 -Applied Digmouse's fixes for the zhCN and zhTW Colors.lua file -Added ZoneText and Coords plugins April 11th, 2008 - v1.10 and v1.11 -Fixed problem with ZoneText not properly updating April 11th, 2008 - v1.12 -Updated Abacus to fix parsing for currency May 13th, 2008 - v1.13 -Attempt to fix Memory glitch by using gcinfo() instead of collectgarbage(\"count\") -Removed dependency of Abacus library June 2nd, 2008 - v1.14 -Memory module will update on load now, instead of requiring a mouseover July 14th, 2008 - v1.15 -SLDT full release for 3.0/WotLK compatibility", "textAfterTable": "Archived Files (35) File Name Version Size Author Date   SLDataText 5.0.41 81kB Taffu 10-21-12 08:27 AM   SLDataText 5.0.4 81kB Taffu 10-21-12 12:27 AM   SLDataText 5.0.3 81kB Taffu 10-15-12 05:18 AM   SLDataText 5.0.2 78kB Taffu 09-02-12 05:11 PM   SLDataText 5.0.1 78kB Taffu", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}