{"relation": [["Author", "Aangie", "Aangie", "Aangie", "Aangie", "Aangie"], ["Title", "Calm", "Lucas", "Snowman", "Melodic Enemies", "Star Spoken"], ["Description", "Even though her two sons are complete opposite personalities, they both can keep her calm.", "boring title, generic fanart!!", "MOTHER", "herp derp", "PK Starstorm"], ["Date", "9/7/10", "4/21/12", "4/20/11", "4/20/11", "11/3/09"], ["Rank", "0.00", "0.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=34085&stuff=RankASC&stuffPageNumber=18", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00187-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 236225116, "recordOffset": 236216914, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> 9 8 1 0 < Other Submissions by Aangie And thus, that fateful afternoon when a little boy with a baseball bat and strange powers ventured into the police station... The day to prove themselves. Then one fateful night, everything changed for all the residents in town. People began acting strangely, the Sharks were running amok, and things were just in utter chaos! But, voices spoke in the cops' heads. They were told that a new, exciting thing to take care of was coming along! An opportunity to prove that they were the Best Cops In The Country! All they had to do was rid of a strange local boy wearing a red hat. He possessed a power that this ordinary town didn't want! The voice spoke to them in velvety tones. They would do it. Yes. Even at the most drastic of measures. The town was slowly being brainwashed to turn against one another. All the people, all the animals. The cops would put a stop to this nonsense! The cops of Onett live simple lives. Their humble home of these men is right", "textAfterTable": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}