{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"], ["Name", "Seven Days of Falling", "Dodge the Dodo", "Believe Beleft Below", "Tuesday Wonderland", "Elevation of Love", "Pavane \"Thoughts of a Septuagenarian\"", "Good Morning Susie Soho", "Eighthundred Streets By Feet", "When God Created the Coffebreak", "Shining On You", "Viaticum"], ["Artist", "Ulf Wakenius", "Ulf Wakenius", "Ulf Wakenius", "Ulf Wakenius", "Ulf Wakenius", "Ulf Wakenius", "Ulf Wakenius", "Ulf Wakenius", "Ulf Wakenius", "Ulf Wakenius", "Ulf Wakenius"], ["Time", "6:39", "5:50", "4:28", "5:20", "5:52", "6:19", "5:24", "6:23", "6:16", "4:10", "6:18"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Love Is Real by Ulf Wakenius", "title": "", "url": "https://itunes.apple.com/fi/album/shining-on-you/id283721824?i=283721919", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00162-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 877703871, "recordOffset": 877676360, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{118702=Copyright © 2014 Apple Inc. Kaikki oikeudet pidätetään.}", "lastModified": "Fri, 31 Jul 2015 07:45:29 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Ulf Wakenius Love Is Real iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Love Is Real by Ulf Wakenius, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "11 Songs Album Review Guitarist Ulf Wakenius is known for his recordings as a sideman with both Oscar Peterson and Niels-Henning Ørsted Pedersen, but this session is a bit different from his earlier efforts as a leader. Focusing exclusively on the compositions of the late Esbjörn Svensson, Wakenius is removed from typical bop/post-bop settings. Joined by bassist Lars Danielsson (who doubles on cello), pianist Lars Jansson, and drummer Morten Lund, plus guests including the Radio String Quartet Vienna, trumpeters Till Brönner and Paolo Fresu, trombonist Nils Landgren, and guitarist Eric Wakenius, the leader does a remarkable job putting his own stamp on the music of his late countryman. The tense \"Dodge the Dodo\" gives Wakenius room to show off some Gyspy-like chops on acoustic guitar, though in a setting that blends elements of rock and modern jazz, with Eric Wakenius wrapping the piece with a piercing electric guitar solo. The gentle ballad \"Believe, Beleft, Below (Love Is Real)\" has a country air, while \"Eighthundred Streets by Feet\" incorporates classical guitar and elements of tango. Fans of E.S.T. will enjoy this tribute to the late Esbjörn Svensson. Top Albums and Songs by Ulf Wakenius", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}