{"relation": [["", "1", "2"], ["Name", "Shut It Down", "Shut It Down (Extended Version)"], ["Artist", "Coach Rob Murphy", "Coach Rob Murphy"], ["Time", "2:55", "3:18"], ["Price", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Shut It Down by Coach Rob Murphy", "title": "", "url": "https://itunes.apple.com/us/album/shut-it-down/id335998949", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00166-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 874606699, "recordOffset": 874588339, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{71179=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 08:27:44 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Coach Rob Murphy Shut It Down iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Shut It Down by Coach Rob Murphy, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "2 Songs Customer Reviews Shut It Down           by VS This track is bangin'! Coach Rob Murphy is puttin' it down and representin' Detroit and Syracuse basketball to the fullest! Murph's got some skillz on the microphone! The lyrics are smart and the beat is hot. All proceeds of the album go to the Jim Boeheim Foundation. So if you buy the album you will be contributing to a very worthy cause! Grammy           by Nordcuse Murph should win a Grammy for this song. If (when) The Cuse win the national championship this year, they should play 'Shut It Down' instead of 'One Shining Moment'. Great           by Bigsyracusefan44 This is a great song 4 a great cause", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}