{"relation": [["Side D Titles", "1. Better Save Yourself [Movie Mix, 2012]", "2. I Am The Cosmos [Movie Mix, 2012]", "3. All We Ever Got From Them Was Pain [Movie Mix, 2012]", "4. September Gurls [Movie Mix, 2012]"], ["Artist", "Chris Bell", "Chris Bell", "Alex Chilton", "Big Star"], ["Length", "04:43", "03:56", "03:23", "02:46"]], "pageTitle": "Big Star - Nothing Can Hurt Me (Vinyl LP) - Amoeba Music", "title": "", "url": "http://www.amoeba.com/nothing-can-hurt-me-lp-big-star/albums/2932037/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00073-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 288460479, "recordOffset": 288441205, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1290=Jon, Hollywood 09/01/2013, 873=Praise be to whichever non-denominational deities watch over the hopes and dreams of the power-popping masses. Nothing Can Hurt Me, a documentary about the tragic life and times of America's ultimate power-pop masters, came out in 2012 and was filled with new and unheard mixes of classic songs from the Big Star catalogue along with never before released recordings, demos, and tracks from the tangential solo albums of the band's members. Originally released as a 2013 Record Store Day exclusive, this compilation makes those songs available for the first time and should appeal to both Big Star completists and newcomers, offering stunning versions of canonized favorites to woo anyone bitten by the Big Star bug., 944=06/24/2013}", "TableContextTimeStampAfterTable": "{16655=Copyright © 2015 Amoeba, All Rights Reserved. Amoeba and the Amoeba Music mark and logo are trademarks of Amoeba Music Inc.}", "lastModified": "Sat, 01 Aug 2015 03:59:49 GMT", "textBeforeTable": "Track Listing Praise be to whichever non-denominational deities watch over the hopes and dreams of the power-popping masses. Nothing Can Hurt Me, a documentary about the tragic life and times of America's ultimate power-pop masters, came out in 2012 and was filled with new and unheard mixes of classic songs from the Big Star catalogue along with never before released recordings, demos, and tracks from the tangential solo albums of the band's members. Originally released as a 2013 Record Store Day exclusive, this compilation makes those songs available for the first time and should appeal to both Big Star completists and newcomers, offering stunning versions of canonized favorites to woo anyone bitten by the Big Star bug. 06/24/2013 In all its spavined, deshabille, and perma-faded glory. Like all stellar phenomena, their incandescence directly proportional to their evanescence; their image more renowned from pallid reflections than direct inspection. Jon, Hollywood 09/01/2013 Amoeba Review CD Also available in: SHIPS FREE in U.S. $24.98 BUY Big Star Nothing Can Hurt Me (LP)", "textAfterTable": "5. Studio Banter [1972] Big Star 00:42 6. Try Again [Movie Mix, 2012] Big Star 03:37 Side B Titles Artist Length 1. My Life Is Right [Alternate Mix, 1972] Big Star 03:30 2. The Ballad Of El Goodo [Alternate Mix, 1972] Big Star 04:29 3. Feel [Alternate Mix, 1972] Big Star 03:35 4. Don't Lie To Me [Alternate Mix, 1972] Big Star 02:56 5. Way Out West", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}