{"relation": [["Title", "Travels with a Tangerine", "A House in Fez", "The Caliph's House", "Hope and Other Dangerous Pursuits", "Allah's Garden"], ["Author", "Tim Makintosh-Smith", "Suzanna Clarke", "Tahir Shah", "Laila Lalami", "Thomas Hollowell"]], "pageTitle": "Morocco Tours & Holidays | Intrepid Travel AU", "title": "", "url": "http://www.intrepidtravel.com/au/morocco", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00082-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 518383215, "recordOffset": 518317462, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{188090=Review submitted 25 Jul 2015, 87564=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan..., 86245=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o...}", "TableContextTimeStampAfterTable": "{114348=With the signing of the Treaty of Fez, Morocco was declared a protectorate of France in 1912 with Spain being allocated control of parts of Morocco, mainly in the north and south. European control was generally opposed by Moroccans citizens, with the people of Rif attempting to establish a separatist republic in 1921. Decades of opposition continued, with rioting and protests leading to increased political tension. In 1955, the road to Moroccan independence was paved by Mohammed V who negotiated reforms and restoration of independence. By 1956, France had relinquished its protectorate of Morocco and in 1957, Mohammed V became king. In 1961, Hassan II assumed the title of King of Morocco and continued to rule until his death in 1999. His son, Mohammed VI, took over the mantle of king in 1999, and continues to rule today., 113245=The land now known as Morocco has been inhabited for centuries, with Moroccan civilisation being known for its richness in history and culture. Centuries of foreign trade, invasion and dynastic rule have given Morocco the many different cultural influences that are evident in today's society. From the Phoenicians who entered Morocco via the Mediterranean in the 6th century BC, to the Roman influence of 40 AD and the formation of Islamic Morocco in the years after, Morocco has evolved with the rise and fall of dynasties, formation and dissolution of empires and birth of new governments, movements and ways of living. Reaching its height under the Berber Dynasties of the 11th and 12th centuries (the Almoravids, Almohads, Marinids and Wattasids), Morocco subsequently fell to Arab tribes in 1559. The current royal family are descendants of the Alaouite Dynasty who have largely ruled since the 1600s, despite enduring a few crises in the 18th and 19th centuries, mainly in relation to European influence in the area and surrounding countries., 143353=Helping thousands of handicapped Moroccans since 1994, this organisation builds prosthetics and wheelchairs for physically handicapped people in addition to training local artisans in metalwork, pottery and weaving. Image supplied by Project Handicapped Horizon., 103388=The climate in Morocco varies wildly according to the season and area of travel. In the lowlands, the cooler months from October to April are popular among visitors. This time of year is pleasantly warm to hot (around 30°C) during the day and cool to cold (around 15°C) at night. Winter in the higher regions often brings snow and can therefore get seriously cold, particularly at night. Tourists flock to the coastline from June to September for fun in the sun, with warm mostly rain-free days. Further inland it can get hot and rain is rare, which makes the best times to travel March to June and September to December. As a Muslim country, Morocco observes Ramadan. If you are planning to go on holiday in Morocco during Ramadan, it is important to consider that many restaurants and shops will either be closed or operating on reduced hours during this time.}", "textBeforeTable": "Recommended reading Further reading To learn more or donate, go to: www.theintrepidfoundation.org Helping thousands of handicapped Moroccans since 1994, this organisation builds prosthetics and wheelchairs for physically handicapped people in addition to training local artisans in metalwork, pottery and weaving. Image supplied by Project Handicapped Horizon. Project Handicapped Horizon In Morocco, The Intrepid Foundation proudly supports: The Intrepid Foundation provides travellers with an opportunity to give something back to the many wonderful communities we travel to. By donating to The Intrepid Foundation you can make a difference in local communities - in health care, education, human rights, child welfare and the protection of wildlife and the environment. The Intrepid Foundation 11. Ramadan is the fasting month for all Muslims. During this month no food, drink or smoking is permitted during daylight hours. While non-Muslims aren't expected to fast, it's recommended to try to avoid eating, drinking or smoking in public during daylight hours. 10. When on community visits or homestays, refrain from giving gifts or money to locals. 9. Please ask and receive permission before taking photos of people, including children. 8. Refrain from supporting businesses that exploit or abuse endangered animals. 7. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 6.", "textAfterTable": "Handy links www.lonelyplanet.com/morocco www.worldtravelguide.net/morocco www.visitmorocco.com × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}