{"relation": [["", "201", "202", "203", "204", "205", "206", "207", "208", "209", "210", "211", "212", "213", "214", "215", "216", "217", "218", "219", "220", "221", "222", "223", "224", "225"], ["Name", "No Time", "The Woman Dem a Log In", "Burn Dem Down", "So Fine", "The People", "Judgement", "Level Your Heart", "Mankind", "Mass Media", "Movements", "Live Up", "Wine Mek U Wiggle", "Never Die", "Bun Dem", "A So We Stay", "Bun Dem", "Let's Go (Africa)", "Source Of Life", "Murderation", "Chattin (feat. Sizzla)", "Roughest King", "All Is Well", "Roughest King (Diwali Mix)", "Jah Kingdom", "Tun Up"], ["Album", "The People Dem", "The People Dem", "The People Dem", "The People Dem", "The People Dem", "The People Dem", "The People Dem", "The People Dem", "The People Dem", "The People Dem", "Best of Golden House Productions, Vol. 1", "Night Vision Riddim", "Live On Riddim", "Ride the Riddim, Vol. 6", "Got To Survive - Single", "Bun Dem - Single", "Let's Go Africa - Single", "Reggae Mania Vol. 1", "Everything Old Is New Again", "Glock 19 Riddim", "Maximum Ragga, Vol. 2", "Vineyard Town Riddim - EP", "Maximum Ragga, Vol. 3", "Xterminator Productions Presents: Luciano Duets", "Tun Up Loud!!! Riddim"], ["Time", "3:31", "3:45", "3:18", "3:42", "3:57", "3:44", "4:00", "3:41", "3:58", "3:31", "3:37", "3:29", "3:52", "3:39", "3:38", "3:39", "4:01", "3:18", "3:56", "3:12", "3:10", "4:27", "3:26", "4:02", "3:06"], ["Price", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.99", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.79", "£0.99", "£0.99", "£0.99", "£0.79", "£0.79"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Capleton", "title": "", "url": "https://itunes.apple.com/gb/artist/capleton/id380370?trackPage=9", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00194-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 861651123, "recordOffset": 861622475, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{36010=Capleton's first single was the risqué \"Bumbo Red,\" which was banned from Jamaican radio for its sexually explicit lyrics, but became a huge word-of-mouth hit. He made a well-received appearance at the 1990 Reggae Sunsplash Festival, and issued a series of popular — and often slack — singles for various producers, the biggest of which were \"Number One Pon the Look Good Chart\" and \"Lotion Man.\" The 1991 LP Capleton Gold gathered some of these early recordings, and he also appeared on several split albums, the most notable of which was 1992's Double Trouble, shared with General Levy. By 1992, a distinct cultural consciousness was becoming apparent in Capleton's work, starting with the landmark hit single \"Alms House.\" An album of the same name was issued in 1993, collecting further singles in the same vein like \"Matie a Dead,\" \"Unnu No Hear,\" and \"Make Hay,\" among others., 34030=Capleton subsequently returned his focus to the Jamaican market, and although his music was now rootsier than ever, he began to temper his Rasta obsessions with more romantic lyrics. 1999's One Mission gathered some of his work, but a better chronicle of his highly consistent output over 1999-2000 was More Fire, which contained all of his biggest hits of the period: the rootsy-sounding \"Who Dem?,\" the antiviolence anthem \"Jah Jah City,\" the female-positive \"Good in Her Clothes.\" 2002's Still Blazin' gathered much of his best work from the next two years., 35022=During this era, Capleton was truly coming into his own; still recording prolifically in 1993, he scored several signature hits with \"Everybody Needs Somebody,\" \"Cold Blooded Murderer,\" and \"Buggering.\" Those tracks all appeared on the 1994 album Good So. By that point, Capleton's conversion to Rastafarianism was complete and now dominated his music to a greater degree than ever before. His success also earned him a shot with an American major label, Def Jam, for which he debuted with the album Prophecy in 1995. Hip-hop remixes of \"Tour\" and \"Wings in the Morning\" (the latter of which featured a guest spot from Method Man) made Capleton a significant crossover success on the rap and dance singles charts, and Prophecy sold quite respectably in the U.S. Def Jam also issued the follow-up album, 1997's I Testament, which continued in a similar vein: R&B accessibility fused with Rastafarian militancy., 37157=Along with Buju Banton and Sizzla, Capleton spearheaded dancehall's return to reggae tradition, tackling Rastafarian spiritual themes and using classic roots reggae as a musical foundation. Capleton was born Clifton George Bailey III on April 13, 1967, in the rural town of Islington, in Jamaica's St. Mary parish. Capleton's namesake was a prominent local lawyer, and young Clifton earned that nickname as a verbally gifted youth with a similar talent for logical argument. He also loved music, counting both Bob Marley & the Wailers and dancehall DJ Papa San as early favorites, and sneaking into sound system shows at age 12. At 18, he moved to Kingston in hopes of starting a music career, and performed with several small sound systems before catching on with Stewart Brown's African Star, a combination sound system and label with connections in both Jamaica and Toronto. Visiting the latter in 1989, Capleton shared a concert bill with the hugely popular Ninjaman, and impressed enough that he was offered the chance to record with major producer Philip \"Fatis\" Burrell upon his return to Jamaica.}", "TableContextTimeStampAfterTable": "{63029=Copyright © 2014 Apple Inc. All rights reserved., 54985=13 April 1967 in Islington, St. Mary, Jamaica}", "lastModified": "Fri, 31 Jul 2015 08:29:00 GMT", "textBeforeTable": "Top Songs Next 5 4 3 2 1 View In iTunes The People Dem 20. View In iTunes Reggae Masterpiece: Capleton 19. View In iTunes Toe2Toe 18.", "textAfterTable": "Previous 4 5 6 7 8 9 10 11 12 13 Next Top Music Videos 1. Fiesta Rasta feat. Capleton View In iTunes Birth Name: Clifton George Bailey III Born: 13 April 1967 in Islington, St. Mary, Jamaica Genre Reggae Years Active: '90s, '00s Influencers Peter Tosh Followers Nosliw Contemporaries Tanto Metro Mad Cobra Sizzla Eek-A-Mouse Bounty Killer Ini Kamoze Turbulence Jah Mason", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}