{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Night of the Mexican Goat Sucker", "Forbidden By Rule", "Lost, But Not Forgotten", "Lights Over Roswell", "Myth of a White Jesus", "The River of No Return", "Room 40", "The Indian Problem", "The Pinzler Method", "Old Soldiers' Disease"], ["Artist", "Djam Karet", "Djam Karet", "Djam Karet", "Djam Karet", "Djam Karet", "Djam Karet", "Djam Karet", "Djam Karet", "Djam Karet", "Djam Karet"], ["Time", "7:07", "5:57", "7:46", "6:48", "4:21", "8:51", "8:41", "5:37", "4:52", "11:06"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "Album Only"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - The Devouring by Djam Karet", "title": "", "url": "https://itunes.apple.com/sk/album/the-devouring/id390291009", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00288-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 883411548, "recordOffset": 883389679, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{116167=Copyright © 2014 Apple Inc. Všetky práva vyhradené.}", "lastModified": "Sat, 01 Aug 2015 04:22:38 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Djam Karet The Devouring iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from The Devouring by Djam Karet, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "10 Songs Album Review You like Floyd and King Crimson? Add a dash of vintage Blue Öyster Cult and Captain Beyond tradin' extended jams without distracting vocals. \"Night of the Mexican Goat Suckers\" clears out your head's slow lane and cements a brick to the accelerator while cutting the brake lines. \"Forbidden by Rule\" unleashes warrior cyborgs bursting through the asphalt to decimate oncoming traffic with a monster bassline. The earth falls away beneath you as a Gilmour-ic lead break splits the stratosphere. All about you mellotrons careen across the great chasm of Time, lifting the spirits of Nostalgia up from the Abyss. This band shows what the mellotron is really capable of. King Crimson's walls of noise bury you in black velvety repose. \"Lost But Not Forgotten\" gets back to the '70s roots of prog rock with Tangerine Dream-like, Yes-ish passages gilded with crisp Floyd riffs and leads. \"Lights Over Roswell\" is what end-of-the-millennia 1990s polished rock is all about. You can hear a Stu Hamm and Michael Manring-like bass precision with U.K. jazz-rock fusion packaging by Eddie Jobson. \"Myth of a White Jesus,\" \"River of No Return,\" \"Room 40,\" \"The Indian Problem,\" \"The Pinzler Method,\" and \"Old Soldier's Disease\" finish out over 70 minutes of well-honed prog rock that explores the realms of Dreamtime. File Devouring between Pink", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}