{"relation": [["", "1", "2", "3", "4", "5", "6", "7"], ["Name", "Zero", "Luna", "Cool T.", "Donkey Dust", "Portraits", "Felicité", "Loves I Once Knew"], ["Artist", "Arthur Blythe, Lester Bowie, Chico Freeman, Leaders, Kirk Lightsey & Cecil McBee", "Arthur Blythe, Lester Bowie, Chico Freeman, Leaders, Kirk Lightsey & Cecil McBee", "Arthur Blythe, Lester Bowie, Chico Freeman, Leaders, Kirk Lightsey & Cecil McBee", "Arthur Blythe, Lester Bowie, Chico Freeman, Leaders, Kirk Lightsey & Cecil McBee", "Arthur Blythe, Lester Bowie, Chico Freeman, Leaders, Kirk Lightsey & Cecil McBee", "Arthur Blythe, Lester Bowie, Chico Freeman, Leaders, Kirk Lightsey & Cecil McBee", "Arthur Blythe, Lester Bowie, Chico Freeman, Leaders, Kirk Lightsey & Cecil McBee"], ["Time", "7:55", "6:35", "5:18", "7:08", "8:00", "6:01", "5:52"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Out Here Like This by The Leaders", "title": "", "url": "https://itunes.apple.com/ca/album/cool-t./id318373786?i=318373988", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00035-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 857680863, "recordOffset": 857660011, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{108203=Copyright © 2014 Apple Inc. All rights reserved., 16488=Formed: 1985}", "lastModified": "Fri, 31 Jul 2015 07:30:40 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist The Leaders Out Here Like This iTunes for Mac + PC Already have iTunes? Click I have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Out Here Like This by The Leaders, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store…", "textAfterTable": "7 Songs Album Review The all-star band accurately called the Leaders (trumpeter Lester Bowie, altoist Arthur Blythe, Chico Freeman on tenor, soprano and bass clarinet, pianist Kirk Lightsey, bassist Cecil McBee, and drummer Don Moye, although he was always a sideman) developed its own group sound. Performing inside/outside music, the band's Black Saint release features originals by Freeman, Lightsey, McBee, and Bowie, plus an obscurity. The trumpeter's straight-ahead \"Zero\" is a high point, and all of the musicians play up to their potential. It is particularly interesting to hear Bowie and Blythe excel in this fairly conservative (for them) setting. Biography Formed: 1985 Genre: Jazz Years Active: '80s, '90s The Leaders was a veritable supergroup of leftward-leaning, mid-'80s jazz stars. Its front line was comprised of three of the era's important personalities — trumpeter Lester Bowie, from the decade's most critically acclaimed band, the Art Ensemble of Chicago; alto saxophonist Arthur Blythe, whose Columbia albums of the time almost (but not quite) brought free jazz a measure of popular acceptance; and tenor saxophonist Chico Freeman, who made a series of records that melded the best of mainstream... Full bio", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}