{"relation": [["Artist", "John Cale & Terry Riley", "John Cale & Terry Riley", "Karlheinz Stockhausen", "Roger Meyers", "Randall McClellan", "Joel Chadabe", "Roger Meyers", "Karlheinz Stockhausen", "Ruth Anderson"], ["Title", "Church of Anthrax", "The Hall of Mirrors in the Palace at Versailles", "Ceylon", "after \"The Pond\" (Charles Ives)", "Distant Voices", "Carnival", "Silver Screen", "Bird of Passage", "I Come Out of Your Sleep"], ["Album", "Church of Anthrax", "Church of Anthrax", "Ceylon/Bird of Passage", "Roger Meyers/Ruth Anderson", "McClellan/Chadabe", "Rhythms", "Roger Meyers/Ruth Anderson", "Ceylon/Bird of Passage", "Roger Meyers/Ruth Anderson"], ["Label", "Columbia LP [1971]", "Columbia LP [1971]", "Chrysalis LP [1976]", "Opus One LP [1979]", "Opus One LP [1974]", "Lovely Music LP [1981]", "Opus One LP [1979]", "Chrysalis LP [1976]", "Opus One LP [1979]"]], "pageTitle": "A Different Nature | KBOO", "title": "", "url": "http://kboo.org/ADifferentNature?page=0%2C6%2C0%2C0%2C11", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00288-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 131655260, "recordOffset": 131619047, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{65825=Richard's Records.  This time on A Different Nature, we delve into the program's past, and play gems from founder Richard Francis' own record collection.  It's KBOO's spring membership drive, so A Different Nature listeners will have the opportunity to pledge their support for the station during the program. We have special thank-you gifts to offer new or renewing members: copies of the CD \"Hendrix Uncovered: New Music Inspired by Jimi Hendrix\", donated by March Music Moderne & Bob Priest., 82569=In 1998, Richard Francis, the original host of A Different Nature, organized a 24-hour radio marathon on KBOO, during which we played nothing but sounds from the natural world.  It was the first time that several of the current members of DNC worked together., 47469=3- HALLEY (for Magnetic Tape), 1984, 96311=A Different Nature was founded in the late Seventies by Richard Francis, who fearlessly championed new music and the unheard Avant Garde. His programs went into exhaustive detail on individual artists, labels and musical disciplines. He also spearheaded many important events on the air, such as the 2001 and 2008 Dada and Surrealism festivals that dominated the airwaves for days on end and involved many in the local avant garde community as well as many KBOO programmers. Richard passed away in 2009 but it's our hope to carry on with his mission of introducing listeners to unheard new music as a collective of his collaborators and listeners. Long live Papa Dada!, 86628=This monday, on A Different Nature, we'll be listening to some Mexican Electroacustic Music, recordings from 1964 to 1989., 47903=1- TRES DE DOS (for magnetic tape), 1984, 47148=6- ESPACIOS II, 1984, 52040=March Music Moderne founder & organizer, composer Bob Priest joins host Andy Hosch for an overview of this month's events. March Music Moderne features 32 concerts and events in and around Portland, happening at 18 venues over the course of 17 days. It all gets started this Thursday, March 7th with \"Ears Wide Open\". Tune in for all the details ---ands lots of great sounds too!, 56869=Yes, Thollem returns playing ELECTRIC, giving us a LIVE preview of his show this Wed at BACKSPACE. Also, at around 9:30 pm, DIANE CHAPLIN, cellist extraordinaire and co-director of Northwest New Music, will perform Esa-Pekka Salonen's intense and difficult cello piece \"YTA III\", WITHOUT A NET!, 47585=2- HORSES, 1984, 13754=ADN 9/17/2012 CAGE CENTENARY PROGRAM 3 / host: dj what the!@#%*! , 57078=TONIGHT-- more March Madness Moderne, with LIVE PERFORMANCE by THOLLEM MCDONAS \"TSIGOTI in the Valley of the Dreambuilder\", 23998=This time on A Different Nature, we delve into the program's past, and play gems from founder Richard Francis' own record collection.  It's KBOO's spring membership drive, so A Different Nature listeners will have the opportunity to pledge their support for the station during the program. We have special thank-you gifts to offer new or renewing members: copies of the CD \"Hendrix Uncovered: New Music Inspired by Jimi Hendrix\", donated by March Music Moderne & Bob Priest., 61556=We are proud to broadcast a live performance of Igor Stravinsky's A Soldiers Tale in collaboration with March Music Moderne A Soldier's Tale March 18, 2013 7:30 p.m., St. Anne's Chapel Free and open to the public Igor Stravinsky's iconic masterpiece is featured in this evening's program. Composed in 1918, Stravinsky based The Soldier's Tale on a Russian folk story, a parable about a soldier who swaps his violin in a deal with the devil for a book that predicts the future., 47203=5- TAÑIDOS, 1983, 47339=4- RITUAL (for Magnetic Tape), 1984}", "TableContextTimeStampAfterTable": "{28993=We closed with a performance of Conduction #5 from WNYC's Americathon 1987 Festival, featuring Jason Kao Hwang- violin, Bill Horvitz - guitar electronics, Wayne Horvitz - piano electronics, Carol Emmanuel- harp, Zeena Parkins- harp, Wilber Morris- bass, Tom Cora- cello, and a Philly group called Relache., 26660=-(excerpt from) The Rites -- Burnt Sugar the Arkestra Chamber - (2004, featuring Pete Cosey- guitar, Melvin Gibbs- bass, Vijay Iyer- piano, Okkyung Lee- cello) , 107203=Copyright © 2012 KBOO Community Radio | Copyright Policy | Community Guidelines | Website Illustration & Design by: KMF ILLUSTRATION, 98791=Latest newsletter: May 2015, 77321=2.  Planetary Sine Wave Organ by Derek Ecklund  30:30, 40125=He was a founding member of the surreal soundscape group Points of Friction (1981-present), recorded and released solo sound work as Agog, and took part in many many collaborations over the past 30 years. He leaves behind a great legacy of friendships and large amounts of recorded sound art and truly unique visual art, speaking of the 6000+ photos he took recently of various naturally eroded materials while hiking, strange arrangements of objects and other various abstractions, as he always had the exquisite skill of channelling the fascinating and odd through any number of mediums. Whether it was with mud, paint and found objects, scissors, magazines, trash and glue, hallucinogenic photo manipulations on a computer, or an amplified birdcage tickled with a gigantic comb, Damian was endlessly enthralled by creating. He was a collector of junk materials and built his own instruments and sculptures. The music of Agog was homemade musique concrete - amazing tape collages. It was really outstanding work that stood above a lot of what was coming out of the cassette culture at that time. Damian's work was superbly recorded and edited, and lovingly packaged. His own cassettes reached fewer and fewer people over the years as his packaging grew more and more elaborate. Damian's music and art remains little heard and known for the most part. (Edited texts by Eric Lanzillotta, Mitchell Brown, and Tim Alexander). A Different Nature thanks Points of Friction members Mitchell Brown, and Tim Alexander for this humble but sincere homage to Damian Bisciglia's creativity., 23258=February 10, 1947 - January 29, 2013, 25038=Butch Morris died of lung cancer on January 29, 2013. Yesterday (Feb 10) was his birthday. He would have turned 66. Tonight's host was daniel, with help from Wayne Horvitz and Andy Hosch. Here is his obit from The Guardian: http://www.guardian.co.uk/music/2013/feb/04/butch-morris, 77502=3.  Referent  by Scott Goodwin  24:00, 67544= String Quartet No. 2 (1959) (which earned him his first of two pulitzers. The 2nd one was in 1971 for String Quartet No 3). -- both performed here by the Arditti String Quartet, 12393=March Music Moderne founder & organizer, composer Bob Priest joined Andy and Daniel for an overview of this month's events. March Music Moderne features 32 concerts and events, happening at 18 venues over the course of 17 days. It all gets started this Thursday, March 7th with \"Ears Wide Open\".  Info at: marchmusicmoderne.org, 77152=1.  Air Objects by John Berendzen   24:30}", "lastModified": "Sat, 01 Aug 2015 03:51:55 +0000", "textBeforeTable": "03/25/2013 Air date:  A Different Nature Program name:  Experimental Electronic Eclectic Categories: A Different Nature playlist for 03/25/2013 Playlists Download audio file Login or register to post comments Format: MP3 Stereo 44kHz 128Kbps (CBR) Length: 23:31 minutes (21.53 MB) Title: Edward Ka-spel interview Kathy, Dr Zomb & Rolf interviewed Edward Ka-Spel of the Legendary Pink Dots for A DIFFERENT NATURE. We conducted the interview at the Doug", "textAfterTable": "Richard's Records.  This time on A Different Nature, we delve into the program's past, and play gems from founder Richard Francis' own record collection.  Login or register to post comments A Different Nature playlist for 03/04/2013 Categories: Eclectic Electronic Experimental Program name:  A Different Nature Air date:  03/04/2013 Artist Title Album Label Jonathan Harvey Mortuos Plango, Vivos Voco (excerpt) VA - Musicworks 87 Musicworks Stefan Goldmann Part II: Le Sacrifice: Dance Sacrale Igor Stravinsky: Le Sacre Du Printemps - Stefan Goldmann Edit Macro Recordings MMM discussion part 1 Esa-Pekka Salonen YTA III Salonen: YTA Finlandia Witold Lutoslawski String Quartet-Main Movement (excerpt) LaSalle Quartet: String Quartets Deutsche Grammophon MMM discussion part 2 Shostakovich", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}