{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"], ["Name", "Ryder Intro", "Wearing My Rolex (Radio Edit)", "I Need to Be", "Summertime (Radio Edit)", "See Clear Now (feat. Kano & Scorcher)", "Cash In My Pocket (feat. Daniel Merriweather)", "5AM (feat. Scorcher)", "Step By Step (feat. Hot Chip)", "Turn It Up", "Can't Stop Thinking", "I Am the Sea (feat. Peter Raeburn)"], ["Artist", "Wiley", "Wiley", "Wiley", "Wiley", "Wiley", "Wiley", "Wiley", "Wiley", "Wiley", "Wiley", "Wiley"], ["Time", "1:29", "2:50", "3:16", "3:20", "3:19", "2:59", "3:35", "3:48", "3:29", "3:50", "2:51"], ["Price", "0,99 €", "1,29 €", "0,99 €", "0,99 €", "0,99 €", "1,29 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - See Clear Now by Wiley", "title": "", "url": "https://itunes.apple.com/cz/album/wearing-my-rolex-radio-edit/id298111039?i=298111053", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00293-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 857689067, "recordOffset": 857664623, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{23782=Born: 19 January 1979 in London, England, 20785=Pre-dating Dizzee Rascal's chart-topping reinvention by a mere couple of weeks, Wiley, the self-proclaimed Godfather of Grime, was the U.K. hip-hop genre's first artist to successfully embrace the commercial dance-pop scene which has since become ubiquitous among his peers' recent material. The number two success of breakthrough single \"Wearing My Rolex,\" a heady mix of dirty house beats and chunky, grinding basslines based on Steve Hurley's remix of DSK's \"What Would We Do,\" appears to have spawned the blueprint for the Roll Deep founder's fifth studio album, See Clear Now. Armed with an array of hotshot collaborators and cleverly chosen samples, its 11 tracks, produced by the likes of Mark Ronson, DaVinche (Tinchy Stryder), and Arthur Baker (New Order) provide a hip-pop alternative to his much more abrasive and urban-edged 2008 counterpart Grime Wave, which he describes as \"elements of everything wrapped in something new.\" It's a statement he more than lives up to on the likes of \"I Need to Be,\" which blends kaleidoscopic synths and urgent breakbeats with the soulful melody from Goldie's jungle classic \"Inner City Life\"; \"Can't Stop Thinking,\" which borrows the anthemic guitar hook from Republica's \"Ready to Go\" and adds it to some warped synth-bass and electro-clash-rhythms, and the Kanye West-aping \"Summertime,\" where Wiley showcases his trademark, breakneck-speed MC delivery over a looped sample of Daft Punk's \"Aerodynamic.\" But even away from this cut-and-paste approach, Wiley still serves up an intriguing melting pot of sounds. \"Cash in My Pocket\" is an ironic take on the banking crisis, featuring the impassioned vocals of Daniel Merriweather, a hint of '60s retro-soul thanks to some doo wop backing vocals, vintage Hammond organs, and a singalong chorus that wouldn't sound out of place in a West End musical. Elsewhere, the hypnotic industrial disco of \"Step by Step\" is exactly the kind of inspired chaos you'd expect from a collaboration with left-field dance act Hot Chip; the title track is an unashamedly poppy affair featuring U.K. rapper Kano which evokes the '80s soul-funk of the Fatback Band, while the melancholic and fingerclicking, piano-led \"5 AM\" even sees the former pirate radio stalwart convincingly attempt a chilled-out R&B ballad. Closing track \"I Am the Sea,\" a derivative and doom-laden nu-metal/hip-hop hybrid, proves Wiley isn't infallible, but it's the only notable misstep on an album which backs up its ambition with a stream of hook-laden tunes. Wiley may have since dismissed See Clear Now due to a lack of creative control, but as it's by far his most inventive and consistent album to date, he might be better off relinquishing more input in the future. ~ Jon O'Brien, Rovi, 123737=Copyright © 2014 Apple Inc. Všechna práva vyhrazena.}", "lastModified": "Fri, 31 Jul 2015 08:22:35 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Wiley See Clear Now iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from See Clear Now by Wiley, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "11 Songs Album Review Pre-dating Dizzee Rascal's chart-topping reinvention by a mere couple of weeks, Wiley, the self-proclaimed Godfather of Grime, was the U.K. hip-hop genre's first artist to successfully embrace the commercial dance-pop scene which has since become ubiquitous among his peers' recent material. The number two success of breakthrough single \"Wearing My Rolex,\" a heady mix of dirty house beats and chunky, grinding basslines based on Steve Hurley's remix of DSK's \"What Would We Do,\" appears to have spawned the blueprint for the Roll Deep founder's fifth studio album, See Clear Now. Armed with an array of hotshot collaborators and cleverly chosen samples, its 11 tracks, produced by the likes of Mark Ronson, DaVinche (Tinchy Stryder), and Arthur Baker (New Order) provide a hip-pop alternative to his much more abrasive and urban-edged 2008 counterpart Grime Wave, which he describes as \"elements of everything wrapped in something new.\" It's a statement he more than lives up to on the likes of \"I Need to Be,\" which blends kaleidoscopic synths and urgent breakbeats with the soulful melody from Goldie's jungle classic \"Inner City Life\"; \"Can't Stop Thinking,\" which borrows the anthemic guitar hook from Republica's \"Ready to Go\" and adds it to some warped synth-bass and electro-clash-rhythms, and the Kanye West-aping \"Summertime,\" where Wiley showcases his trademark, breakneck-speed MC delivery", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}