{"relation": [["File Name", "ForteXorcist [Alae's Fan Update]", "ForteXorcist Localization"], ["Version", "1.985", "v1.976.1.0"], ["Size", "591kB", "114kB"], ["Author", "tonyis3l33t", "Xus"], ["Date", "12-27-13 12:45 PM", "06-21-12 08:33 AM"], ["Type", "Patch", "Addon"]], "pageTitle": "ForteXorcist : Buff, Debuff, Spell : World of Warcraft AddOns", "title": "", "url": "http://www.wowinterface.com/downloads/info7532-399509.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00250-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 830976183, "recordOffset": 830932903, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Optional Files (2) Mainly a fix to the problems raiding ppl were having due to the maximum of 40 debuffs being displayed v0.999.9 Many other small fixes Option to display remaining dot ticks on the spell timer Support for shared media Added a Shaman module v1.00 Other Bug fixes Drain spells now display the proper remaining time An option to only show the next tick on the spell timer (instead of all remaining ticks) v1.01 Some other fixes. Fixed options dropdowns being duplicated on zoning A 'Vehicle Module' has been added. Currently it's only an attempt to track Wyrmrest Skytalon abilities, but more may be added to it. Buffs without a duration can be shown now (like Desecration). Friendly target proccs can get detected now. Some additions to the class modules. Some changes to the totem code to make the bars behave in a more similar way to the other ones regarding their expiration and removal. You can now change the color of the 'dot ticks' and your 'sparks'. The drain timers are now properly fixed for 'interruption'. There's a similar bug in the standard UI in case of these drain updates, as with Corruption or SW:P refreshes. The timer now compensates for this and removes the excess time. v1.02 Some small fixes The summon assistant should work properly with Northrend now Added more proccs and spells to", "textAfterTable": "Archived Files (98) File Name Version Size Author Date   ForteXorcist v1.980.7 626kB Xus 09-24-12 04:11 PM   ForteXorcist v1.980.6 623kB Xus 09-13-12 02:28 PM   ForteXorcist v1.980.5 623kB Xus 09-11-12 01:51 PM   ForteXorcist v1.980.4 623kB Xus 09-03-12 07:28 AM   ForteXorcist v1.980.3 623kB Xus", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}