{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19"], ["Name", "Intro", "Lip Gloss", "One Hit Wonder", "Get Loose Request", "Shawty Get Loose (feat. Chris Brown & T-Pain)", "What It Is (Strike a Pose) [feat. T-Pain]", "G-Slide (Tour Bus) [Radio Version]", "Gotta Go Deeper Skit", "Stand Up", "L.I.F.E.", "College (feat. Yirayah)", "Emotional Rollercoasters Skit", "Broken Pieces", "Swim", "Truly In Love (feat. Peter Toh)", "Look At My Life Skit", "Make It Hot", "Pick It Up", "Girlfriend (feat. Lil Mama) [Dr. Luke Mix ] {Bonus Track}"], ["Artist", "Lil Mama", "Lil Mama", "Lil Mama", "Lil Mama", "Lil Mama", "Lil Mama", "Lil Mama", "Lil Mama", "Lil Mama", "Lil Mama", "Lil Mama", "Lil Mama", "Lil Mama", "Lil Mama", "Lil Mama", "Lil Mama", "Lil Mama", "Lil Mama", "Avril Lavigne"], ["Time", "1:08", "4:04", "3:27", "0:11", "3:29", "3:58", "3:31", "0:14", "3:36", "3:57", "4:00", "0:28", "3:47", "4:22", "4:07", "1:01", "3:13", "3:44", "3:25"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - VYP - Voice of the Young People (Bonus Track Version) by Lil Mama", "title": "", "url": "https://itunes.apple.com/ro/album/vyp-voice-young-people-bonus/id278197852", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00093-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 882733975, "recordOffset": 882708980, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{39512=Born: 04 October 1989 in New York, NY [Harlem], 35747=Lil Mama (née Niatia Kirkland) broke out in a big way in spring 2007 with \"Lip Gloss,\" a Top Ten novelty single built around an astoundingly simple but effective beat and some legitimately impressive rapping about an unabashedly frivolous subject. Despite that track's earworm resilience and Kirkland's guest turns on high-profile remixes for several of the year's biggest singles (Avril Lavigne's \"Girlfriend\" and Rihanna's \"Umbrella\"), it took almost a year for her debut album to appear, by which time her rising star had lost a good deal of momentum. That's a shame because VYP: Voice of the Young People presents Lil Mama as one of the most promising female rappers in years; a likable and amply talented performer with a refreshingly open-ended, still-developing approach that lets her flit convincingly from goofy, hook-heavy pop to heavier, more introspective material, although all the stylistic and thematic hopscotch results in a somewhat unwieldy album and a persona that's complex but a little naggingly undefined. The album's also over-long, even if it has little truly weak material, but — aptly suited to the iTunes age — it's helpfully compartmentalized, with brief explanatory skits serving to separate the opening set of upbeat, crossover-ready tunes from segments focused on socially conscious story-telling (\"Gotta Go Deeper\") and relationship issues (\"Emotional Rollercoaster\"), before a final pair of club jams cap it all off., 37268=The opening section is easily the breeziest, featuring the lighthearted but infectiously cocky swagger that earned Lil Mama her fame, though its pop-happy attitude is occasionally complicated by confusing grasps at an ambiguously defined credibility. Perhaps to shore up the hip-hop realness she asserts on the intro, the album version of \"Lip Gloss\" is bizarrely interrupted partway through by the bare-bones, out of tempo \"No Music\" freestyle, while the belatedly preemptive hater-baiting \"One Hit Wonder\" awkwardly (if accurately) asserts her status as \"one of the fewest female MCs of the century.\" On the other hand, she beefs up the youth-repping claim of the album title with the very silly \"Wheels on the Bus\"-quoting \"G-Slide (Tour Bus)\" and a recording of some cute tykes requesting \"Shawty Get Loose,\" the infectious lite-R&B/dance banger which saved her from one-hit-wonder status by going Top Ten in early 2008 (thanks in part to the presence of guaranteed chart-greasers T-Pain and Chris Brown.) Later album standouts include \"L.I.F.E.,\" an inspirational anthem of hope in the face of ghetto-life adversity, the emotional \"College,\" about a four-year-old visiting her father in prison, and, on a different tip entirely, the jaunty duet \"Truly in Love.\" Over the course of the proceedings a bevy of 2000's production heavyweights (among them Luke Gottwald, Cool & Dre, the Runners, and Scott Storch) contribute dependable if rarely revelatory beats that ensure Lil Mama's lips aren't the only thing that's popping. Although she deftly and admirably captures much of the struggle and contradiction that accompanies young adulthood, Lil Mama is a little too old, at 18, to bill herself as \"the voice of young people\" for too much longer — but it hardly matters, as she's clearly well on her way to developing a strikingly original and versatile voice of her own. [The CD was also released with a bonus track, the Dr. Luke remix of Avril Lavigne's \"Girlfriend.\"] ~ K. Ross Hoffman, Rovi, 136666=Copyright © 2014 Apple Inc. Toate drepturile rezervate.}", "lastModified": "Sat, 01 Aug 2015 05:00:12 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Lil Mama VYP - Voice of the Young People (Bonus Track Version) iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from VYP - Voice of the Young People (Bonus Track Version) by Lil Mama, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If", "textAfterTable": "19 Songs Album Review Lil Mama (née Niatia Kirkland) broke out in a big way in spring 2007 with \"Lip Gloss,\" a Top Ten novelty single built around an astoundingly simple but effective beat and some legitimately impressive rapping about an unabashedly frivolous subject. Despite that track's earworm resilience and Kirkland's guest turns on high-profile remixes for several of the year's biggest singles (Avril Lavigne's \"Girlfriend\" and Rihanna's \"Umbrella\"), it took almost a year for her debut album to appear, by which time her rising star had lost a good deal of momentum. That's a shame because VYP: Voice of the Young People presents Lil Mama as one of the most promising female rappers in years; a likable and amply talented performer with a refreshingly open-ended, still-developing approach that lets her flit convincingly from goofy, hook-heavy pop to heavier, more introspective material, although all the stylistic and thematic hopscotch results in a somewhat unwieldy album and a persona that's complex but a little naggingly undefined. The album's also over-long, even if it has little truly weak material, but — aptly suited to the iTunes age — it's helpfully compartmentalized, with brief explanatory skits serving to separate the opening set of upbeat, crossover-ready tunes from segments focused on socially conscious story-telling (\"Gotta Go Deeper\") and relationship issues (\"Emotional Rollercoaster\"), before a", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}