{"relation": [["Author", "melata", "SixxDiamondGlitteRos", "SunTyger"], ["Message", "HelloI don't know where I got this link from, but I've noticed that this is one of the better-functioning multifandom archive around. I transferred stuff here from my fandom lj and ff.net, because I am annoyed with how ff.net has become extremely difficult to upload stories to, and this site seems a lot friendlier and less restricting. I'm a multifandom kind of girl, and you can probably see that from the stories I've uploaded. Anything more can me found at my profile and then at my lj. grins and waves Posted at 2005-08-28 4:42", "hello and welcome to the site. :-) Posted at 2005-08-28 23:11", "I'm way behind on greeting people here...hi melata, and welcome to the site! I'll almost definitely be reading your stuff eventually--I'm a multi-fandom kind of girl myself. ^_^ Posted at 2005-10-02 21:15"]], "pageTitle": "FicWad: fresh-picked original and fan fiction", "title": "", "url": "http://ficwad.com/forum/topic/155", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00145-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 91586653, "recordOffset": 91578451, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{1679=Site design Copyright 2005, K&D Lynch. All stories contained in this archive are the property of their respective authors, and the owners of this site claim no responsibility for their contents.}", "textBeforeTable": "Home > Introductions > Hello Lost password Register Log in Remember me Log in ▼ Sign up to adjust the filter You won't see stories with a lower score when you browse or search. Filter Filter: 0 Help Forum Search Browse FicWad", "textAfterTable": "Site design Copyright 2005, K&D Lynch. All stories contained in this archive are the property of their respective authors, and the owners of this site claim no responsibility for their contents. Page created in 0.0779 seconds", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}