{"relation": [["TITLE", "Albert of Adelaide (d)", "The Impeachment of Abraham Lincoln", "The Investigation", "The White Devil (h2tp)", "Lord Tyger (ri)", "Shadow of Night", "The Mysterious Wu Fang: The Case of the Suicide Tomb (ri)", "Some Kind of Fairy Tale", "West of Want", "A Once Crowded Sky (d)", "Blood of the Demon (ri)", "Tempting the Gods: The Selected Stories of Tanith Lee Volume 1", "V Wars", "House of Shadows", "The Prankster: A Novella", "No Peace for the Damned (d)", "Year Zero (fiction d)", "Geekomancy (d) (e)", "The Thackery T. Lambshead Cabinet of Curiosities: Exhibits, Oddities, Images, and Stories from Top Authors and Artists (h2tp)", "Shadow Show: All-New Stories in Celebration of Ray Bradbury", "Zone One (h2tp)", "The Last Policeman", "The Prisoner of Heaven"], ["AUTHOR", "Howard Anderson", "Stephen L. Carter", "Philippe Claudel", "Justin Evans", "Philip Jose Farmer", "Deborah Harkness", "Robert J. Hogan", "Graham Joyce", "Laura Kaye", "Tom King", "Rosalie Lario", "Tanith Lee", "Jonathan Maberry (ed)", "Rachel Neumeier", "James Polster", "Megan Powell", "Rob Reid", "Michael R Underwood", "Ann VanderMeer (ed) Jeff VanderMeer (ed)", "Sam Weller (ed) Mort Castle (ed)", "Colson Whitehead", "Ben Winters", "Carlos Ruiz Zafon"], ["SERIES", "F", "AH", "Satire/Dystopian", "Th/P/H", "F", "UF - All Souls Trilogy 2", "H", "SF", "PNR - Hearts of the Anemoi 2", "F", "PNR - Demons of Infernum 1", "F - Collection", "F", "F", "SF/Humor", "UF - Damned 1", "SF/Humor", "UF", "F/SP/SF - Anthology", "SF/F - Anthology", "H", "F/M", "M/Su/G - Cemetery of Forgotten Books 3"]], "pageTitle": "The Qwillery: June 2012", "title": "", "url": "http://qwillery.blogspot.co.uk/2012_06_01_archive.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00241-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 196818135, "recordOffset": 196699762, "tableOrientation": "HORIZONTAL", "lastModified": "Sat, 01 Aug 2015 02:43:05 GMT", "textBeforeTable": "July 1, 2012 Here is The Qwillery's list of books being published in July 2012. If there is something that I've missed, please leave a comment below. Any genre mistakes are mine. Leave a comment below if you feel that the genre is wrong. Also note that this list is always under revision. Publication dates change. I try to keep this as accurate as possible. The most accurate lists can be found for each week in The View From Monday posts. July 2012 Book Releases Friday, June 29, 2012 Share to Pinterest Share to Facebook Share to Twitter BlogThis! Email This Labels: Debris, giveaway, Interview, Jo Anderton, Suited. The Veiled Worlds Links to this post", "textAfterTable": "Samurai Game Christine Feehan PNR - GhostWalkers 10 Night Seeker Yasmine Galenorn UF - Indigo Court 3 Heaven's War David S. Goyer Michael Cassutt SF - Heaven's Shadow 2 Alliance Forged Kylie Griffin FR - Light Blade 2 Stalking the Others Jess Haines UF - H&W Investigations 4 Assignment in Eternity (ri) Robert A. Heinlein SF Citadels of the Lost (h2mm) Tracy Hickman F - Annals of Drakis 2 The Legend of Jig Dragonslayer Jim C. Hines F - Jig the Goblin Omnibus Thieftaker D. B. Jackson F - Thieftaker Chronicles 1 This Dark Earth John Hornor Jacobs H The Dragon Reborn (ri) Robert Jordan F - Wheel of Time 3 Goddess in the Middle Stephanie Julian PER - Forgotten Goddesses 3 Fire Kissed Erin Kellison PNR - Shadow Kissed 1 A Sinister Sense Allison Kingsley PCM - Raven's Nest Bookstore 2 Dragon Rule (tp2mm) E.E. Knight F - Age of Fire 5 The Unincorporated Woman (h2tp) Dani Kollin Eytan Kollin SF - Unincorporated 3 Lethal Outlook Victoria Laurie PCM - Psychic Eye 10 God Save the Queen Kate Locke UF - Immortal Empire 1 The Immorality Engine (h2tp) George Mann F/M/SP - Newbury & Hobbes Investigations 3 Liquid Lies (d) Hanna Martine PNR -  Elementals 1", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}