{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14", ""], ["Name", "Bruise On the Sky", "Adios", "Caribbean Time", "Please", "Beneath the Underdog", "Dispossessed", "The Portal", "¡Bodega!", "Coosada Blues", "No Equality", "Absolute Elsewhere", "Unknown Reggae", "Bluebird", "Caribbean Light", "BookletDigital Booklet - Home Sweet Mobile Home"], ["Artist", "Nellie McKay", "Nellie McKay", "Nellie McKay", "Nellie McKay", "Nellie McKay", "Nellie McKay", "Nellie McKay", "Nellie McKay", "Nellie McKay", "Nellie McKay", "Nellie McKay", "Nellie McKay", "Nellie McKay", "Nellie McKay", "Nellie McKay"], ["Time", "4:27", "2:13", "4:18", "3:10", "4:59", "3:53", "3:53", "3:37", "4:32", "4:35", "3:50", "4:31", "3:10", "4:20", "--"], ["Price", "$1.79", "$1.79", "$1.79", "$1.79", "$1.79", "$1.79", "$1.79", "$1.79", "$1.79", "$1.79", "$1.79", "$1.79", "$1.79", "$1.79", "Album Only"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Home Sweet Mobile Home by Nellie McKay", "title": "", "url": "https://itunes.apple.com/nz/album/coosada-blues/id397340684?i=397340745", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00219-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 877525187, "recordOffset": 877495038, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{29929=Born: 13 April 1982 in London, England, 127183=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 07:36:55 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Nellie McKay Home Sweet Mobile Home iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Home Sweet Mobile Home by Nellie McKay, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "15 Items Album Review Nellie McKay's first album of new material in three years returns her to the stylistically scattershot, lyrically ingenious nature of Obligatory Villagers. As she admits herself (\"I have no idea how this album happened\"), McKay is working on instinct, which helps preserve not only her many idiosyncrasies but also the charming and witty nature of her songwriting. She did gain guidance from two elder sources, one being her mother Robin Pappas (a co-producer) and the other David Byrne, who recruited McKay to appear on his Imelda Marcos concept album Here Lies Love and then returned the favor by making compilations and recommending people for Home Sweet Mobile Home. Byrne's help is intriguing, since the album has all the sounds of the post-millennial global village: reggae rhythms and vocal inflections for several tracks (including \"Caribbean Time\"), a New Yorker's version of Latin-ized tradition for \"¡Bodega!,\" and, as before, plenty of the good-time, slightly New Orleans-influenced jazz she's floated in the past. The album also has slightly more guitar than any since her debut. Guitars were expected on her first record, since it was produced by Geoff Emerick, but here McKay and her group appear to be attempting an adult-alternative pop crossover of some type. Lyrically, she continues the incisive satire and parody heard on her earlier material.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}