{"relation": [["#", "1.", "2.", "3.", "4.", "5.", "6.", "7.", "8."], ["Track (click for lyrics)", "Trouble in Paradise (Variation on a Theme) - Carl Craig C2 Remix", "Hold My Hand - Innervisions Orchestra Dub Mix", "Hold My Hand - Innervisions Orchestra Instrumental Mix", "Heaven - King Unique Remix", "Heaven - King Unique Bass Bliss Remix", "Heaven' - King Unique Accapella Remix", "Trouble in Paradise (Variation on a Theme) - Fergie Excentric Mix", "Keys to the Kingdom - Lee Coombs Remix"], ["Artist", "", "", "", "", "", "", "", ""]], "pageTitle": "Remix Stories (Volume 2) by UNKLE", "title": "", "url": "http://playlists.net/artists/UNKLE/album/Remix+Stories+(Volume+2)-23255", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00033-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 201616567, "recordOffset": 201606899, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{372=This album consists of 1 release and was originally released in 2009}", "TableContextTimeStampAfterTable": "{11985=© 2015 ShareMyPlaylists.com Ltd.}", "textBeforeTable": "Create a Playlist Based on UNKLE Play Now This album consists of 1 release and was originally released in 2009 Remix Stories (Volume 2) by UNKLE « Back to Artist", "textAfterTable": "Playlists We Love UK TOP 40 CHART Listen to the top-selling singles in the UK, updated regularly. UK New Music Fridays Each week we will update this playlist with the latest new releases from the UK USA TOP 40 CHART Listen to the best-selling singles in the United States, updated regularly. Hip-Hop Monsters! The very latest Hip-Hop releases in one playlist. Updated regularly, subscribe for updates. Focus The Mind Carefully curated to focus the mind and sharpen your concentration. Modern classical, instrumental film scores & more. Most Chilled Songs Ever This is the perfect playlist to unwind & relax to Feel Good Indie A hand picked selection of new indie music chosen to put a lift in your step & a smile on your face. Topsify Biggest Songs Right Now The biggest hits in the world right now", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}