{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Dead", "Suicide", "I've Got Nothing", "Earth Girls", "Things I Said", "Another Day (In The Death Of America)", "2Heads2Faces", "F**k The Rock", "727", "It's Alright"], ["Artist", "Pretty Boy Floyd", "Pretty Boy Floyd", "Pretty Boy Floyd", "Pretty Boy Floyd", "Pretty Boy Floyd", "Pretty Boy Floyd", "Pretty Boy Floyd", "Pretty Boy Floyd", "Pretty Boy Floyd", "Pretty Boy Floyd"], ["Time", "2:12", "4:02", "2:31", "3:18", "5:17", "2:45", "4:46", "4:24", "5:21", "3:25"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Size Really Does Matter by Pretty Boy Floyd", "title": "", "url": "https://itunes.apple.com/gr/album/things-i-said/id128649099?i=128649217", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00042-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 891815043, "recordOffset": 891786523, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{116143=Copyright © 2014 Apple Inc. Με επιφύλαξη παντός δικαιώματος., 19043=\"Suicide\" on Pretty Boy Floyd's Size Really Does Matter CD harkens back to the days of hard rock that could break through on pop radio. It's got the Guns N' Roses-meets-Alice Cooper snarl and enough dynamics to make it jump off of the disc as the standout. That's perhaps the most in-the-pocket tune on the album, though \"Earth Girls\" comes close with its science fiction overtones and cool hook. The ten songs are written by Steve Summers, Lesli Sanders, T'Chad, and Dish, the four members of Pretty Boy Floyd, and they have lots to offer on Size Really Does Matter. \"F**k the Rock\" turns the group Reunion's 1974 hit \"Life Is a Rock (But the Radio Rolled Me)\" on its head — \"sell your soul to rock & roll radio.\" As frustrating for the fans as it is for Pretty Boy Floyd (a name made famous on the radio as a line from Andy Pratt's classic \"Avenging Annie\" ) is the fact that music this good doesn't have much of a chance on the manufactured play lists of 2004. Thus, it is up to the faithful to take decent tracks like \"727\" and the very strong \"2Heads2Faces\" and get them out there via word of mouth. There's lots of classic pop/metal elements in this mix, and that's what makes Size Really Does Matter so very special. You need to play this disc about nine or ten times before it makes its point — that Pretty Boy Floyd know how to concoct a definitive mix of hooks/guitars/keys and vocals to bring back a sound that mattered. It is an album that deserves your attention, revealing all sorts of clever tricks and a faithful adherence to the things that bring out the best in this genre. Marilyn Manson should try covering some of this to get back into the groove. Four stars, easily.}", "lastModified": "Sat, 01 Aug 2015 04:22:45 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Pretty Boy Floyd Size Really Does Matter iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Size Really Does Matter by Pretty Boy Floyd, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop.", "textAfterTable": "10 Songs Album Review \"Suicide\" on Pretty Boy Floyd's Size Really Does Matter CD harkens back to the days of hard rock that could break through on pop radio. It's got the Guns N' Roses-meets-Alice Cooper snarl and enough dynamics to make it jump off of the disc as the standout. That's perhaps the most in-the-pocket tune on the album, though \"Earth Girls\" comes close with its science fiction overtones and cool hook. The ten songs are written by Steve Summers, Lesli Sanders, T'Chad, and Dish, the four members of Pretty Boy Floyd, and they have lots to offer on Size Really Does Matter. \"F**k the Rock\" turns the group Reunion's 1974 hit \"Life Is a Rock (But the Radio Rolled Me)\" on its head — \"sell your soul to rock & roll radio.\" As frustrating for the fans as it is for Pretty Boy Floyd (a name made famous on the radio as a line from Andy Pratt's classic \"Avenging Annie\" ) is the fact that music this good doesn't have much of a chance on the manufactured play lists of 2004. Thus, it is up to the faithful to take decent tracks like \"727\" and the very strong \"2Heads2Faces\" and get them out there via word of mouth. There's lots of classic pop/metal elements in this mix, and", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}