{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14"], ["Name", "Winston's Atomic Bird", "Brown Submarine", "You Satisfy Me", "Ate It Twice", "Two Girl Area", "North 11 A.M.", "Zero Fix", "Psych Threat", "Andy Playboy", "Rat Trap", "Soggy Beavers", "Ready to Pop", "Still In Rome", "Go for the Exit"], ["Artist", "Boston Spaceships", "Boston Spaceships", "Boston Spaceships", "Boston Spaceships", "Boston Spaceships", "Boston Spaceships", "Boston Spaceships", "Boston Spaceships", "Boston Spaceships", "Boston Spaceships", "Boston Spaceships", "Boston Spaceships", "Boston Spaceships", "Boston Spaceships"], ["Time", "1:48", "1:21", "3:04", "1:55", "2:30", "2:35", "2:44", "3:38", "1:30", "2:21", "1:34", "2:33", "2:57", "2:22"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Brown Submarine by Boston Spaceships", "title": "", "url": "https://itunes.apple.com/lu/album/north-11-a.m./id289414015?i=289414027", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00313-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 875741367, "recordOffset": 875718036, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{26864=After two years of treading water following the break-up of Guided by Voices, Robert Pollard finally seems to be reconnecting with his muse in a real way. Robert Pollard Is Off To Business, his first album after parting ways with Merge Records and launching his own label, was the strongest and most consistent set he's released since going solo, and four months later Pollard has returned with a new band, Boston Spaceships, featuring John Moen of the Decemberists and the Dharma Bums and Chris Slusarenko of the Takeovers and Sprinkler. Teaming up with some fresh collaborators seems to have done Pollard a world of good after recording the bulk of his post-GBV work with Todd Tobias handling all the instruments; Moen and Slusarenko don't bring a striking level of chops to Brown Submarine, Boston Spaceships' debut album, but their work has an organic feel and a natural energy that helps these sessions sound like the work of a real band, and Pollard has thankfully focused on quality rather than quantity in his songwriting, with most of these 14 tunes suggesting the vitality of GBV's peak period without sounding as if he's rewriting his old work, which was the case with too much of his work in 2006 and 2007. Pollard and his partners don't sound as if they're breaking much new ground on Brown Submarine, but that doesn't seem to be the point with this album — it doesn't reinvent the wheel but it lets it roll very well indeed, and hopefully this is a sign that Pollard is ready to make up for lost time after an unexpected fallow period., 28534=Formed: July, 2008, 127455=Copyright © 2014 Apple Inc. Tous droits réservés.}", "lastModified": "Sat, 01 Aug 2015 04:23:02 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Boston Spaceships Brown Submarine iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Brown Submarine by Boston Spaceships, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "14 Songs Album Review After two years of treading water following the break-up of Guided by Voices, Robert Pollard finally seems to be reconnecting with his muse in a real way. Robert Pollard Is Off To Business, his first album after parting ways with Merge Records and launching his own label, was the strongest and most consistent set he's released since going solo, and four months later Pollard has returned with a new band, Boston Spaceships, featuring John Moen of the Decemberists and the Dharma Bums and Chris Slusarenko of the Takeovers and Sprinkler. Teaming up with some fresh collaborators seems to have done Pollard a world of good after recording the bulk of his post-GBV work with Todd Tobias handling all the instruments; Moen and Slusarenko don't bring a striking level of chops to Brown Submarine, Boston Spaceships' debut album, but their work has an organic feel and a natural energy that helps these sessions sound like the work of a real band, and Pollard has thankfully focused on quality rather than quantity in his songwriting, with most of these 14 tunes suggesting the vitality of GBV's peak period without sounding as if he's rewriting his old work, which was the case with too much of his work in 2006 and 2007. Pollard and his partners don't sound as", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}