{"relation": [["Disc 1 Titles", "1. Do the Strand", "2. Love is the Drug", "3. Don't Stop the Dance", "4. Just Like You", "5. Avalon", "6. The Bogus Man", "7. Slave to Love", "8. This is Tomorrow", "9. The Only Face", "10. I Thought", "11. Reason or Rhyme", "12. Virginia Plain", "13. This Island Earth"], ["Artist", "Bryan Ferry", "Bryan Ferry", "Bryan Ferry", "Bryan Ferry", "Bryan Ferry", "Bryan Ferry", "Bryan Ferry", "Bryan Ferry", "Bryan Ferry", "Bryan Ferry", "Bryan Ferry", "Bryan Ferry", "Bryan Ferry"], ["Length", "02:10", "03:14", "02:51", "03:24", "02:23", "02:07", "02:38", "02:27", "02:57", "02:35", "04:15", "02:14", "04:26"]], "pageTitle": "Bryan Ferry - The Jazz Age (CD) - Amoeba Music", "title": "", "url": "http://www.amoeba.com/the-jazz-age-cd-bryan-ferry/albums/2843803/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00124-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 284476161, "recordOffset": 284459767, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1790=02/11/2013}", "TableContextTimeStampAfterTable": "{11658=Copyright © 2015 Amoeba, All Rights Reserved. Amoeba and the Amoeba Music mark and logo are trademarks of Amoeba Music Inc.}", "lastModified": "Sat, 01 Aug 2015 03:48:40 GMT", "textBeforeTable": "Track Listing Bryan Ferry is always up there at the country house cooking up some new way of delivering you the lush life, and this time he literally blows the roof off! Here are thirteen songs from the breadth of his career, from Roxy Music to recent solo albums, arranged and interpreted by a hard-swingin' 1920s style jazz orchestra, and presented in gloriously crackly mono. At first hearing tunes like \"Do the Strand\" come at you as a vigorous Dixieland stomp practically makes you laugh out loud -- then you realize the guy is serious. From \"Love Is the Drug\" to \"Avalon,\" these tunes get sent back in the way-back machine, only to return with plenty of trombone charts, clarinet solos, muted trumpets and even coconut percussion fills. Members of the Pasadena Roof Orchestra execute this vintage fantasia, with some arranging help from UK TV composer Colin Good. Each reinterpretation is imaginatively and slyly suited to the original, whether bringing out a latent samba shuffle or hinting at the original darkness of tone behind a zany rhythm. Of course, Bryan Ferry has always been besotted with the Jazz Age, going back to his first solo album, These Foolish Things, in which he crooned classic 1930s ballads in his proto-new wave style. Even then he had a true knack for classic sounds (a knack not shared by just anybody, as one notices whenever Rod Stewart barfs up", "textAfterTable": "BUY $16.98 SHIPS FREE in U.S. Also available in: LP User Reviews Overall Rating 0 Submissions RATE & REVIEW Who We Are Amoeblog Buy Sell Trade News & Contests Gift Certificates Contact Us Support & FAQ Sign-up for email news, sales alerts & more:", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}