{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"], ["Name", "Seattle", "Chutzpan", "Lo Baiom Velo Balyla", "Pinzin Kinzin", "Puncha Puncha", "Eleven Wives", "Gentle Disturbed", "The Ever Evolving Etude", "Variations In G Minor", "Umray", "Structure In Emotion", "Young Maestro (Bonus Track)"], ["Artist", "Avishai Cohen Trio", "Avishai Cohen Trio", "Avishai Cohen Trio", "Avishai Cohen Trio", "Avishai Cohen Trio", "Avishai Cohen Trio", "Avishai Cohen Trio", "Avishai Cohen Trio", "Avishai Cohen Trio", "Avishai Cohen Trio", "Avishai Cohen Trio", "Avishai Cohen Trio"], ["Time", "2:50", "5:10", "5:25", "6:30", "3:53", "5:16", "3:48", "6:16", "5:33", "5:42", "6:20", "5:31"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Gently Disturbed (Bonus Track Version) by Avishai Cohen Trio", "title": "", "url": "https://itunes.apple.com/us/album/gently-disturbed-bonus-track/id279396076", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00218-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 872496983, "recordOffset": 872472473, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{27690=Born: April 20, 1971 in Israel, 126885=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 03:56:18 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Avishai Cohen Trio Gently Disturbed (Bonus Track Version) iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Gently Disturbed (Bonus Track Version) by Avishai Cohen Trio, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your", "textAfterTable": "12 Songs Editors’ Notes A number of Israeli jazz musicians have come into their own in the early 21st century. Bassist Omer Avital, pianist Anat Fort, clarinetist Anat Cohen, and numerous others have made a big splash in New York, Israel, and elsewhere. Anat’s brother, the bassist Avishai Cohen, has played with Danilo Perez, Joshua Redman, Brad Mehldau, and others, and has released a number of his own albums since the late 1990s. Cohen has a warm tone on his instrument, and can say a lot with a handful of notes. On Gently Disturbed he’s joined by the young Israeli pianist Shai Maestro and his longtime rhythm cohort, the American drummer Mark Guiliana, and the trio’s distinctive approach draws from a number of sources. Two traditionals, “Lo Baiom Velo Balyla” and “Puncha Puncha,” are just a couple of the tracks that display the influence of classical music, while “Eleven Wives” possesses the grandeur of a pop anthem by Radiohead or Coldplay. (It’s easy to imagine Maestro playing keyboards in a rock group.) The off-kilter chug of “Pinzin Kinzin” points to an abstracted but far from bloodless take on funk. The album’s highlight might be the title track, where a mysterious piano melody is intriguingly shadowed by Cohen’s bass. Customer Reviews The", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}