{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14"], ["Name", "Sing My Heart", "This Time the Dream's On Me / Hit the Road to Dreamland", "Let's Take a Walk Around the Block", "Little Drops of Rain / Right As Rain", "Ill Wind / I Gotta Right to Sing the Blues", "Fun to Be Fooled", "A Sleepin' Bee", "Two Ladies In de Shade of de Banana Tree", "Out of This World", "My Shining Hour", "I Wonder What Became of Me", "If I Only Had a Brain", "Don't Like Goodbyes", "The Silent Spring / It's a New World"], ["Artist", "KT Sullivan", "KT Sullivan", "KT Sullivan", "KT Sullivan", "KT Sullivan", "KT Sullivan", "KT Sullivan", "KT Sullivan", "KT Sullivan", "KT Sullivan", "KT Sullivan", "KT Sullivan", "KT Sullivan", "KT Sullivan"], ["Time", "3:23", "3:35", "3:34", "3:57", "6:38", "4:26", "6:06", "2:59", "4:36", "3:34", "2:59", "3:15", "3:44", "5:23"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Sing My Heart - The Songs of Harold Arlen by KT Sullivan", "title": "", "url": "https://itunes.apple.com/ee/album/out-of-this-world/id40743249?i=40743237", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00340-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 866752111, "recordOffset": 866724222, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{125910=Autoriõigus © 2014, Apple Inc. Kõik õigused on reserveeritud.}", "lastModified": "Fri, 31 Jul 2015 08:36:14 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist KT Sullivan Sing My Heart - The Songs of Harold Arlen iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Sing My Heart - The Songs of Harold Arlen by KT Sullivan, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open,", "textAfterTable": "14 Songs Album Review For her second release for the DRG label, K.T. Sullivan directs her shimmering, scintillating soprano to the works of one of America's most prolific and successful songsmiths, Harold Arlen. She has selected tunes that Arlen wrote for stage and film. Not limited to just his better-known gems, the play list is dotted with samples of his less-familiar, but still bewitching, works. One of the more captivating tracks is one that comes from the less-familiar category, the medley of\"Little Drops of Rain\"and \"Right As the Rain,\" which Arlen wrote with one of his more frequent collaborators, E.Y. \"Yip\" Harburg. The title song, \"Sing My Heart,\" was originally an aria written for the operatic voice of movie star Irene Dunne for her role in Love Affair. On the other end of the spectrum, Sullivan deals with the quasi-novelty tune \"If I Only Had a Brain\" with a flick-of-the-wrist air. Sullivan has the capacity to handle familiar and obscure, ballad and up-tempo with equanimity, as if she has been doing these songs forever. This happy state of affairs comes from an early exposure to the singing art, albeit as part of the religion-oriented Sullivan Family Gospel Singers. And talking about family, Stacy Sullivan makes an appearance to help on \"Two Ladies in de Shade of de Banana Tree.\" The", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}