{"relation": [["Author", "ozwalled", "ozwalled", "ozwalled", "ozwalled", "ozwalled"], ["Title", "Criminal Caterpillar", "Mighty Bear Seven", "Bubble Monkey", "Electro Swoosh", "Electro Specter Emerges"], ["Description", "\"Don't get the gray swirl!\". A Criminal Catepillar on a desert background (which was fun to draw). I still can't believe that I forgot to draw his arms. x_x", "After I'd done the Wooly Shambler and made it look hairy, I decided to try to do it more on purpose this time with another subject. Enter Might Bear Seven (an enemy with one of the more intriguing names in EB, I'd say -- what ever DID happen to the other Might Bears?... Plus, his fur is bluish green. What 's up with THAT?!). I even tried to keep the bulish purple from the original sprite in there. And I've got to say, I really like how this one turned out in the end. :D", "The cute little Bubble Monkey!", "In doing a lot of drawing based on the EB characters and enemies, I spend a good deal of time looking through the original sprites for inspiration and reference. There are some though, that I figure I'll never get to, just because they're not as visually exciting as others. The Electro Swoosh fit into the \"not interesting enough to draw\" category for me for a good, long time, before I decided to send a little love and affection its way. I tried to re-think it a bit, had some fun and come up with this, and I'm glad that I did.", "Electro Specter emerging from a pile of liquid metal. The Electro Specter is another enemy that I'd not had a lot of interest in drawing for a good while. It wasn't until I was reading through the Player's Guide one day and read that it was \"a lethal combination of energy and molten metal\" that I was inspired to do this, one of my very favorite pieces of my EB art. In my mind, I pictured a pool of liquid metal (a la Terminator 2) running uphill and morphing up into the Electro Specter, electricity arcing from it as it solidified. I also envisionned vein-like tunnels of the liquid rushing up, not unlike lava tubes. I feel that I'd captured all of that pretty successfully. I also opted for axe-like and hammer-like \"hands\", to illustrate a \"morphing\" type ability."], ["Date", "4/27/05", "4/27/05", "4/27/05", "4/27/05", "4/27/05"], ["Rank", "8.00", "7.00", "0.00", "0.00", "8.58"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=18029&stuff=DateDESC&stuffPageNumber=96", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00238-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 220206123, "recordOffset": 220197921, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> 1 < Other Submissions by ozwalled One of the Tessie watchers spying the Loch Tess Monster. Hands down, that has to be THE worst title for a piece of EB fanart ever. This image has been resized for your convenience. Click on it to view the full size version. I'm Still Tessie From the Loch I'm Still Tessie From the Loch - by ozwalled  Mother2 Go Back! --> } } } ThisImgResized.style.display = \"\"; //alert (ThisImgResized.style.display); ThisImgResized = document.getElementById('ImgResized') what.width=(winW-275); what.style.cursor = \"pointer\"; saveWidth = what.width; { else what.width=saveWidth; if (what.width==(winW-275)) if (what.width>(winW-275) || saveWidth>(winW-275)) { what = document.getElementById(what); function scaleImg(what){ } winW = document.body.offsetWidth; if (navigator.appName.indexOf(\"Microsoft\")!=-1) { winW = window.innerWidth; if (navigator.appName==\"Netscape\") //what = document.getElementById(what); //function scaleImg(what){ var saveWidth = 0;", "textAfterTable": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 29 30 31 32 33 34 35 36 37 38 39 40 41 42 43 44 45 46 47 48 49", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}