{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Fins", "Volcano", "Treat Her Like a Lady", "Stranded on a Sandbar", "Chanson Pour Les Petits Enfants", "Survive", "Lady I Can't Explain", "Boat Drinks", "Dreamsicle", "Sending the Old Man Home"], ["Artist", "Jimmy Buffett", "Jimmy Buffett", "Jimmy Buffett", "Jimmy Buffett", "Jimmy Buffett", "Jimmy Buffett", "Jimmy Buffett", "Jimmy Buffett", "Jimmy Buffett", "Jimmy Buffett"], ["Time", "3:27", "3:39", "4:20", "3:11", "4:07", "4:51", "2:44", "2:40", "2:19", "3:27"], ["Price", "$1.29", "$1.29", "$1.29", "$0.99", "$0.99", "$1.29", "$0.99", "$1.29", "$0.99", "$1.29"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Volcano by Jimmy Buffett", "title": "", "url": "https://itunes.apple.com/album/fins/id96007?i=95987&ign-mpt=uo%3D5", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00123-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 884418755, "recordOffset": 884389298, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{23810=Born: December 25, 1946 in Pascagoula, MS, 125700=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 05:00:06 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Jimmy Buffett Volcano iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Volcano by Jimmy Buffett, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "10 Songs Album Review After breaking into the mainstream with his hit \"Margaritaville\" two years earlier, Jimmy Buffett stuck to his formula of mixing fun, up-tempo songs with slower, reflective ones. Although the album contains concert favorites including the playful \"Fins\" and the Caribbean-flavored title track, it seems as if Buffett doesn't have as many deep insights to share on this release. The vocal help from James Taylor on \"Treat Her Like a Lady\" adds to the singalong chorus, but overall the ballads are uninteresting. As a result, this album marks a low point for Jimmy Buffett in a decade in which he delivered one solid album after another. However, Volcano is notable for its inclusion of a wonderful children's song (\"Chanson Por les Petits Enfantes\"), complete with nursery rhyme lyrics. This album is for Parrotheads only, as most of the popular tracks are available on compilations like Songs You Know By Heart. Customer Reviews One of his best!           by Savvy Music Listener The \"professional\" reviewer blew it here. . . as well as proving his incompetence in all things Jimmy Buffett. True, most of", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}