{"relation": [["", "1.", "2.", "3.", "4."], ["Date", "22 Dec 2011", "16 Feb 2008", "31 Aug 2006", "15 Feb 2004"], ["Author", "marino wilson", "Laurence Collins", "Harry Downs", "Pascal Stevenhaagen [PB1SAM]"], ["Subject", "(0) other mods for the bc9000xlt", "(0) 9000XLT schematic", "(0) reversed squelch control on us model 9000xlt", "(0) Re: Lineout mod"], ["", "", "", "View article", "View article"]], "pageTitle": "mods.dk - Articles for Uniden 'BC-9000XLT'", "title": "", "url": "http://www.mods.dk/index.php?ModelId=694&RadioId=", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 13, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00183-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 605522010, "recordOffset": 605513808, "tableOrientation": "HORIZONTAL", "textBeforeTable": "This forum message list include all message for that is related to BC-9000XLT, this include message that also is related to articles. If the message is relate to an article, the article can be selected next to each message. Note that page can take a while to load, if there are many modifications. Click here to view all the ABOVE modifications for bc-9000xlt in one page. BC-9000XLT Discriminator Output 08 Nov 1998 Uniden Bearcat BC9000XLT Tricks 12 Jan 2000 Light-mod Uniden BC-9000-XLT 10 Mar 2001 Keypad Tricks for the BC-9000XLT Scanner 10 Mar 2001 BC9000XLT 'line out' modification 06 Jan 2003 UBC9000XLT 07 Jan 2003 Tips and modification for BC-9000xlt 08 Dec 2003 Description Uploaded Articles for Uniden 'BC-9000XLT'", "textAfterTable": "Click here to write a new message or comment for BC-9000XLT Note that the message is not related to any article. Click here to see the article list for BC-9000XLT. Do you have any tricks, modifications or constructions for homebrewed equipment that are not on mods.dk, please send the information to mods.dk. If you prefer to be anonymous write it in the message.   Uniden Menu Manuals Pictures", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}