{"relation": [["Year", "1989", "1990", "1991", "1992", "1993", "1994", "1995", "1996", "1997", "1998", "1999", "2000", "2001", "2002", "2003", "2004", "2005", "2006", "2007", "2008", "2009", "2010", "2011", "2012", "2013"], ["Book", "Ka Lungkham", "Hmangaihzuali", "Zoram Khawvel-I", "Ṭhangthar Taitesena", "Mizo Literature", "Kum za Kristian Zofate hmabâk", "Ram leh i tan chauh", "Bible leh Science", "Pasalṭha Khuangchera", "Anita", "Tlawm ve lo Lalnu Ropuiliani", "Chawngmawii leh Hrangchhuana", "Ka khualzin kawng", "Runlum Nuthai", "Kan Bible hi", "Zorinpari", "Damlai thlipui", "Pasalṭhate ni hnuhnung", "Zofate zinkawngah zalenna mei a mit tur a ni lo", "Chun chawi loh", "Rintei zùnléng", "Beiseina Mittui", "Zodinpuii (posthumously awarded)", "Sihlipui", "Thinglubul"], ["Author", "B. Lalthangliana", "C. Laizawna", "L. Keivom", "Romawia", "B. Lalthangliana", "Bangalore Mizo Christian Fellowship", "H. Lallungmuana", "P.C. Biaksiama", "Laltluangliana Khiangte", "C. Laizawna", "Lalsangzuali Sailo", "R. Rozika", "Robuanga", "L.Z. Sailo", "Zairema", "H. Lalngurliana", "Lalhriata", "C. Lalnunchanga", "R. Zamawia", "Lalhriata", "Lalrammawia Ngente", "Samson Thanruma", "Lalchhantluanga", "Romuanpuii Zadeng", "Lalpekkima"], ["Comments on the book", "", "Novel", "Contemporary Mizo history", "", "", "", "", "Creationism", "Drama", "Novel", "Mizo history", "Novel", "", "Eulogy", "Theology", "Novel", "Novel", "Historical adventure novel", "Factual description and idealization of Mizo uprising", "Novel", "Novel", "Novel", "Novel", "Novel", "Novel"]], "pageTitle": "Mizo language - Wikipedia, the free encyclopedia", "title": "", "url": "https://en.wikipedia.org/wiki/Mizo_language", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 21, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00213-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 869062787, "recordOffset": 869023101, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{108672=The Mizoram Press Information Bureau lists some twenty Mizo daily newspapers just in Aizawl city, as of March 2013.[25] The following list gives some of the most well-known newspapers published in Mizo language., 102972=The Mizo language has a thriving literature with Mizo departments in Mizoram University and Manipur University . The governing body is the Mizo Academy of Letters, which awards the annual literary prize MAL Book of the Year since 1989. The books awarded so far and their authors are tabulated below along with the years:[23], 113438=There are around 700,000 speakers of Mizo language: 674,756 speakers in India (2001 census); 1,041 speakers in Bangladesh (1981 census); 12,500 speakers in Burma (1983 census)., 107498=This award is only for books originally written in Mizo and not for translations, and it has been awarded every year since 1989. The award has been given to books on history and religion, but most of the winners are novels. Each year, the academy examines about a hundred books (in 2011, 149 books were examined),[24] out of which it selects the top 20, and then first shortlistling it further to top 10, and then to top 5, then top 3, finally chooses the winner., 6291=The Mizo language, or Mizo ṭawng, is spoken natively by the Mizo people in the Mizoram state of India, Chin State in Burma, and the Chittagong Hill Tracts of Bangladesh. The language is also known as Lushai, a colonial term, as the Lushei people were the first to have external exposure. Though still common, Lushai (or Lusei, or Lushei) is considered incorrect by the Mizo themselves.[3] Much poetic language is derived from Pawi, Paite, and Hmar, and most known ancient poems considered to be in the Mizo language are actually in Pawi.[3], 36367=Mizo language is related to the other languages of the Sino-Tibetan family.[7] The Kukish languages (which native Mizo speakers call Zohnahthlâk ṭawngho/Mizo ṭawngho) have a substantial amount of words in common,[8] and Hmar and Mizo language are especially similar; they are close to being mutually intelligible at the spoken level, and they are mostly mutually intelligible at the poetic level.}", "lastModified": "Fri, 31 Jul 2015 00:48:44 GMT", "textBeforeTable": "The following table illustrates the similarity between Mizo ṭawng and some other members of the Sino-Tibetan family.[9] The words given are cognates, whose origins could be traced back to the proto-language Proto-Sino-Tibetan (given in the first column of the table). Mizo and Sino-Tibetan languages[edit] Mizo language is related to the other languages of the Sino-Tibetan family.[7] The Kukish languages (which native Mizo speakers call Zohnahthlâk ṭawngho/Mizo ṭawngho) have a substantial amount of words in common,[8] and Hmar and Mizo language are especially similar; they are close to being mutually intelligible at the spoken level, and they are mostly mutually intelligible at the poetic level. Relation with other languages[edit] A circumflex ^ was later added to the vowels to indicate long vowels, viz., â, ê, î, ô, û, which were insufficient to fully express Mizo tone. Recently,[when?] a leading newspaper in Mizoram, Vanglaini, the magazine Kristian Ṭhalai, and other publishers began using á, à, ä, é, è, ë, í, ì, ï, ó, ò, ú, ù, ü to indicate the long intonations and", "textAfterTable": "*[ph]ra ṭha - - - - - - - good *chēŋ (be blue, green) hring (green) 青 (qīng) (green) chieŋ shēŋ - - - *ch[ē]t sât 切 (qiē, qiè) chiet shīt zed ćhać - - to cut References for the above table: [10] [11] Mizo and Burmese[edit] The following few words suggest that Mizo and the Burmese are of the same family: kun (\"to bend\"), kam (\"bank of a river\"), kha (\"bitter\"), sam (\"hair\"), mei (\"fire\"), that (\"to kill\"), ni (\"sun\") hnih (\"two\") li (\"four\") nga (\"five\") Phonology[edit] Vowels[edit] Monophthongs[edit] Mizo language has eight tones and intonations for each of the vowels a, aw, e, i and u, four of which are reduced tones and the other four long tones. The vowel o has only three tones, all of them of the reduced type; it has almost exactly the same sound as the diphthong /oʊ/ found in American English. However, the vowels can be represented as follows:[12] Front Central Back Close", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}