{"relation": [["Role/Title", "Colorist for Worst", "Colorist for Saint Seiya: Next Dimension - The Myth of Hades", "Illustrations for Les Chroniques de Sillage Vol. 5", "Colorist for Baki the Grappler", "Colorist for Grappler Baki: Scarface", "Colorist for The Strongest Introduction to Philosophy in History", "Eguzamurai CG Lithograph", "Colorist for Garouden Vol. 25", "Co-author and illustrator for Contes cruels du Japon"], ["Release date", "2002-05-30", "2006-04-27", "2008-04-25", "2007-12-07", "2009-05-08", "2010-04-14", "2010", "2010-12-22", "2011-08-24"], ["Publisher", "Akita Shoten", "Akita Shoten", "Delcourt", "Akita Shoten", "Akita Shoten", "Magazine•Magazine", "Shueisha", "Kodansha", "Delcourt"]], "pageTitle": "Naoki Saito - Bulbapedia, the community-driven Pokémon encyclopedia", "title": "", "url": "http://m.bulbapedia.bulbagarden.net/w/index.php?title=Naoki_Saito&mobileaction=toggle_view_mobile", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00324-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 144628476, "recordOffset": 144620274, "tableOrientation": "HORIZONTAL", "lastModified": "Wed, 29 Jul 2015 23:08:02 GMT", "textBeforeTable": "Games Works Saito's style is vibrant and surreal, and often juxtaposes or merges the organic with the geometric. He also puts emphasis on texture to give subjects character. His work within the TCG is similar but subtler, instead using highlights and contrasting colors to make Pokémon stand out. For a list of cards he has illustrated, go here. In addition to card illustrations, Saito provided the packaging art for the Garchomp and Hydreigon Half Decks, and the box art for Everyone's Exciting Battle. He also illustrated the Pokémon Tales book Crustle's Moving, available to read on the Pokémon Daisuki Club website. Naoki Saito (Japanese: 齋藤直葵) is a digital illustrator who has provided art for the Pokémon Trading Card Game since the HeartGold & SoulSilver expansion, as well as art for a couple of Pokémon games. Saito is a graduate of Tama Art University and previously worked at Konami Digital Entertainment Co., Ltd. before becoming freelance. In addition to the Pokémon TCG, he has also provided illustrations for several other trading card franchises: Duel Masters, Monster Hunter, Juushinden: Ultimate Beast Battlers, and Eternal Wheel. An example of Saito's artwork", "textAfterTable": "2009-05-08 Akita Shoten Colorist for The Strongest Introduction to Philosophy in History 2010-04-14 Magazine•Magazine Eguzamurai CG Lithograph 2010 Shueisha Colorist for Garouden Vol. 25 2010-12-22 Kodansha Co-author and illustrator for Contes cruels du Japon 2011-08-24 Delcourt External link Chirarism, Saito's personal website (Japanese) Read in another language Bulbapedia Mobile Desktop Content is available under Attribution-NonCommercial-ShareAlike 2.5 unless otherwise noted. Privacy", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}