{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"], ["Name", "Country Soul Brother", "All Because of You", "Ain't Grace Amazing", "Just What I Needed", "Daily Ritual", "Jesus Pick Me Up", "It Won't Always Be Like This", "Tall Walkin' Texas Trash", "Just to Get You Off My Mind", "Moravia", "One of Them Days", "Talkin' Bobby Dale's Hard Luck Blues"], ["Artist", "Jesse Dayton", "Jesse Dayton", "Jesse Dayton", "Jesse Dayton", "Jesse Dayton", "Jesse Dayton", "Jesse Dayton", "Jesse Dayton", "Jesse Dayton", "Jesse Dayton", "Jesse Dayton", "Jesse Dayton"], ["Time", "3:11", "3:10", "3:42", "3:14", "3:09", "2:42", "2:59", "3:57", "3:48", "3:06", "3:03", "5:28"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Country Soul Brother by Jesse Dayton", "title": "", "url": "https://itunes.apple.com/si/album/just-what-i-needed/id21996586?i=21996568", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00328-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 880177607, "recordOffset": 880149987, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{122367=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 04:39:21 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Jesse Dayton Country Soul Brother iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Country Soul Brother by Jesse Dayton, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "12 Songs Album Review One doesn't necessarily think of country and soul as two complementary styles, but anyone with a long memory will know that country — at its outset — worked hand in hand with the blues. So Jesse Dayton's idea of combining Southern fiddles and B-3 organ on a dozen songs isn't all that radical after all. He kicks off the album with the title track, a rollicking fun song about life on the road. As with the tracks that follow, Dayton and the band keep things tight and focused, seldom venturing beyond the three-minute mark. The arrangements, while delivering something one might call \"country-soul,\" vary enough from song to song to keep the album from becoming predictable. There's accordion on \"All Because of You,\" acoustic fingerpicking on \"Jesus Pick Me Up,\" and harmonica on \"Ain't Grace Amazing.\" Dayton also shows how easy it is to turn a rock song like the Cars' \"Just What I Needed\" into a bluesy bit of country. With the exception of \"Just What I Needed,\" Dayton has written all of the material, and to top everything else off, he's a solid, versatile singer. For anyone interested in a soulful country album that never seems alternative, but likewise wouldn't be confused with contemporary Nashville, Country Soul Brother will fit the bill. ~ Ronnie", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}