{"relation": [["", "1", "2", "3", "4", "5", "6", "7"], ["Name", "Intro", "Inhume", "The Clearing", "Diotima", "Litany of Regrets", "Telluric Rings", "Dust and Light"], ["Artist", "Krallice", "Krallice", "Krallice", "Krallice", "Krallice", "Krallice", "Krallice"], ["Time", "2:06", "6:53", "12:05", "12:27", "13:39", "12:08", "9:35"], ["Price", "$0.99", "$0.99", "Album Only", "Album Only", "Album Only", "Album Only", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Diotima by Krallice", "title": "", "url": "https://itunes.apple.com/us/album/the-clearing/id429583153?i%3D429583162%26uo%3D4%26at%3D11l79Y", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00301-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 869615215, "recordOffset": 869589341, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{114309=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 03:59:23 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Krallice Diotima iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Diotima by Krallice, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "7 Songs Editors’ Notes Krallice is known for being a technically proficient group that exercises more restraint than bravado. But with its third album, Diotima, the New York black metal band gives fans what they want by letting its collective talent run wild. Here Krallice explores more sonic topography, starting with the two-minute instrumental intro, where guitars birth a glaciered soundscape shrouded in a dark, aural atmosphere. This bleeds into “Inhume,” where some of Krallice’s most intricate (and punishing) guitar work drives the arrangements into ever-changing progressive territories. Spanning more than 12 minutes, “The Clearing” almost recalls early-'90s British shoegazing, with walls of blissed-out guitar noise and regal marching rhythms; then bassist Nick McMaster screams like a man pleading for his life. The lengthy “Litany of Regrets” contrasts brutal sonic pulverizing with beautifully intricate arrangements. Customer Reviews It's Free           by That Guy That Reviews Things This album is 100% free at their bandcamp. Chech em out. I'm ok with this....          ", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}