{"relation": [["Side B Titles", "1. Year Zero", "2. Body And Blood", "3. Idolatrine", "4. Depth Of Satan's Eyes", "5. Monstrance Clock"], ["Artist", "Ghost B.C.", "Ghost B.C.", "Ghost B.C.", "Ghost B.C.", "Ghost B.C."], ["Length", "05:50", "03:43", "04:23", "05:25", "05:53"]], "pageTitle": "Ghost B.C. - Infestissumam (Vinyl LP) - Amoeba Music", "title": "", "url": "http://www.amoeba.com/infestissumam-lp-ghost-b-c/albums/3274219/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00077-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 284463240, "recordOffset": 284446846, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1684=04/15/2013}", "TableContextTimeStampAfterTable": "{10748=Copyright © 2015 Amoeba, All Rights Reserved. Amoeba and the Amoeba Music mark and logo are trademarks of Amoeba Music Inc.}", "lastModified": "Sat, 01 Aug 2015 03:36:38 GMT", "textBeforeTable": "Track Listing Swedish metal band Ghost B.C.’s second album might be confused for choir music on its outset, before epic solos and crushing drums usher in Infestissumam with much fanfare. The band, known for its doom metal riffs and sacrilegious (in a fun way) stage attire, actually makes their genre, scary to outsiders, as accessible as anyone. “Infestissumam Per Aspera Part 2” has chuggin’ riffs and creepy, breathy vocals, but lead singer Papa Emeritus II (LOL) actually has a really nice voice, making lyrics like “Satan devours all” go down a lot easier than some of their screamier brethren (to be fair, the song also features perhaps misleading lyrics like “all your dreams will come true”). Because the music isn’t terribly over-the-top or prohibitively complex, their anti-religious lyricism actually has a more profound effect than scaring the living daylights out of people — “you know that the fog is here” they sing on “Secular Haze” over Anton Lavey-esque organs. As much as anything, the band channels forefathers of metal like Blue Oyster Cult and Black Sabbath, especially on songs like “Giggalo,” and they’ve got a nice ear for melody — even as “Ghuleh” begins with creepy whispers and ventures into dark territory lyrically, it’s a piano-laden power ballad sung sweetly. Fans of melodic metal who don’t mind the darker stuff lyrically will flock to Infestissumam like lambs to the slaughter. 04/15/2013 Amoeba Review", "textAfterTable": "Side B Titles Artist Length 1. Year Zero Ghost B.C. 05:50 2. Body And Blood Ghost B.C. 03:43 3. Idolatrine Ghost B.C. 04:23 4. Depth Of Satan's Eyes Ghost B.C. 05:25 5. Monstrance Clock Ghost B.C. 05:53 BUY $19.98 SHIPS FREE in U.S. User Reviews Overall Rating 0 Submissions", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}