{"relation": [["Artist", "Hall and Oates", "John Farnham"], ["Song Title", "Man Eater", "Playing to Win"], ["Played When", "when Hammer plays Lana", "when Hammer plays Lana"]], "pageTitle": "Sledge Hammer! Season 1 Episode 16 - The Color of Hammer (1x16) - Watch Online - s1 e16 Spoilers", "title": "", "url": "http://www.tvrage.com/sledge-hammer/episodes/157181", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00178-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 788817535, "recordOffset": 788807434, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Music Read the full recap Recap Hammer is dropping off a suspect and wants to catch an interview with hardline Judge Liam Jackson. He doesn’t disappoint, chasing down a litterbug. Hammer is also impressed with the judge’s hard line. Later, Doreau takes Hammer for a walk on the part during lunch and spot Jackson sitting on a bench. Hammer expresses his admiration for the judge in person and asks for an autograph on an ice cream cone napkin... Captain Trunk As Harrison Page Officer Dori Doreau As Anne-Marie Martin Det. Insp. Sledge Hammer As David Rasche Main Cast Lana Body Double As Deborah Rodgers Recurring Coroner Norman Blates As Kurt Paul", "textAfterTable": "Episode Quotes Mayjoy: Inspector, you can’t arrest someone before they commit a crime. Hammer: Hey, this is Crime Prevention Week, remember? Trunk: Hammer, I haven’t seen you this excited about TV since they colorized World War II footage. Brianne O'Brian: You’ve got a reputation as a hardliner. You’ve even been referred to as “The Hanging Judge.” When did you get that name? Judge Jackson: At my baptism. Brianne O'Brian:: We know how you feel about the death penalty. Where do you stand on the electric chair? Judge Jackson: Right next to the switch. Doreau: It must be a great responsibility being a judge. Judge Jackson: It’s all in the execution. Hammer: Long live the death penalty. Trunk: I just got off the phone with the Commissioner. He’s been yelling at me every hour on the hour. Hammer: Now you know how it feels like. Lana: Don’t whine. If I wanted a man who whined, I’d date Dick Cavett. Hammer: Didn’t your mother ever teach you pool hall etiquette? Lana: I never", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}