{"relation": [["", "1", "2", "3"], ["Name", "Elevator (feat. Timbaland)", "Gotta Eat", "Jealous (Ray Seay Mix)"], ["Artist", "Flo Rida", "Flo Rida", "Flo Rida"], ["Time", "3:50", "3:52", "4:03"], ["Price", "1,29 €", "Album Only", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Elevator (feat. Timbaland) - EP by Flo Rida", "title": "", "url": "https://itunes.apple.com/bg/album/elevator-feat.-timbaland-ep/id284520231", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00115-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 884873839, "recordOffset": 884850891, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{6424=Born: 17 September 1979 in Opa-Locka, FL, 109272=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 04:57:05 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Flo Rida Elevator (feat. Timbaland) - EP iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Elevator (feat. Timbaland) - EP by Flo Rida, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop.", "textAfterTable": "3 Songs Biography Born: 17 September 1979 in Opa-Locka, FL Genre: Hip-Hop/Rap Years Active: '00s, '10s Flo Rida, unsurprisingly a native Floridian, is an MC who toured as a teenager with 2 Live Crew's Fresh Kid Ice and began popping up on high-profile mixtapes by 2006, most notably DJ Khaled's We the Best — on \"Bitch I'm from Dade County,\" he appeared with the likes of Rick Ross, Trick Daddy, Trina, and Dre (of Cool & Dre). Signed to the Atlantic-distributed Poe Boy that year, he recorded Mail on Sunday, which was released in March of 2008. \"Low,\" featuring T-Pain, was the album's lead single;... Full bio Top Albums and Songs by Flo Rida 1. My House View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}