{"relation": [["Artist", "Woody Moran", "DonnaLynn", "John Roy Zat", "Andina and Rich", "Laura Golden", "Kwame Copeland", "Zach", "Vicki and Joe Price", "Larry Murante", "Berkley Hart", "Colleen Raney", "Jere Canote", "Dave Morrison", "The Lovebirds", "Pancake Breakfast", "Dan Frechette", "Danny Barnes", "Springhouse", "Dan Weber"], ["Title", "Walking on a Saturday Night", "Lookin' for a Miracle", "Crazy Glue", "Caffeine", "Now That I'm Home", "Back to You", "Manifest", "Second Best", "More Than He Knows", "She's So Beautiful", "I Know My Love", "Turtle's Dream", "Back to Zero", "Ring Around the Roses", "Good Morning Ladies", "Where the Water Tastes Like Wine", "Popcorn and Wine", "I Saw Her Tattoo", "Hank and Jesus"], ["Album", "Going Somewhere?", "Butterfly Effect", "Solo", "Two Guitars, A Dulcimer and An Attitude", "Demo CD", "Simple Things", "Demo CD", "A Brand New Place", "Point of Entry", "Las Vegas", "Lark", "Uke Life", "Shout at the Moon", "Demo CD", "The 3 EP Collection", "Lucky Day", "Dirt on the Angel", "Colville", "Self-Titled CD"]], "pageTitle": "Folk Espresso | KBOO", "title": "", "url": "http://www.kboo.org/FolkEspresso?page=0%2C9", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00064-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 546555883, "recordOffset": 546332252, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{352820=Yikes! Only today did I see your kind email from September 22 that you left on the KBOO website. I wasn't expecting any \"fan mail\" here at kboo.fm so I didn't thing to check...until a friend told me about the hundreds, nay, thousands of emails piling up at this website all about my show. Oddly enough, only one (yours) was positive. All the others said something to the effect of \"what the *&^!%&# is SHE doing on this venerable radio station!\", 353410=So, Mr. Randy, you liked my quirky music? Hope you heard my show yesterday morning (October 27). It, too, was filled with a wide variety of, uh, good stuff. I'm on again on Monday, November 24th. I do hope you'll tune in. I'll play a randy tune, just for you., 19819=Lotsa local music, too--so much talent here!  Colleen Raney, Betsy Branch, Mark Douglass, John Standefer, Haris Blackwood, Blvd Park, Lincoln's Beard, Great Wilderness, and a new favorite of mine, Dan Weber.  Listen in again on Monday, February 6, when I have Dan in the studio to give us a live performance.  I, for one, can't wait!, 28684=My warmest wishes for a musical 2012--and believe me, wishes don't get any better than ones for more music in your life.  I'm bringing you a whole stackful of my favorites this morning in an effort to usher your new year in with just the right tone.  There's a set or two more or less related to \"time\" since at this time of year, the passing of time is on our minds, and one with a river theme as I resolve to get in a big dose of river kayaking this year--so good for the soul., 368721=Copyright © 2012 KBOO Community Radio | Copyright Policy | Community Guidelines | Website Illustration & Design by: KMF ILLUSTRATION, 360309=Latest newsletter: May 2015, 62896=Folk Espresso Special: Annual Gales of November Show}", "lastModified": "Sat, 01 Aug 2015 04:24:25 +0000", "textBeforeTable": "02/20/2012 Air date:  Folk Espresso Program name:  Folk Categories: Folk Espresso playlist for 02/20/2012 Playlists last » next › … 9 8 7 6 5 4 3 2 1 Early morning folk music to get your week started. A different host each week. Short Description: ", "textAfterTable": "Mike Eckstein Lluvia del Sur Far West Day Dream Dear Listeners, I'm happy to be sitting in for Jeff this morning while he's out gallivantin' about.  I hope faithful listeners of his show found something to enjoy among my selections this morning. I opened the show with a set of terrific music from Guinea, Ghana, and Mali.  That was to honor my sweet little niece, Taylor, who just arrived in her new home in a tiny village in Ghana--beginning her two-year stint in the Peace Corps.  I'm one helluva proud aunt... Threw in some Mardi Gras music, a train set, and music touching on themes presidential (it is President's Day afterall!).  I hope you caught the lyrics to Let'em Eat Moose.....too funny! Keep listening....and thanks for keeping up your support of this magical radio station. Warmly, Diane Login or register to post comments Folk Espresso playlist for 02/06/2012 Categories: Folk Program name:  Folk Espresso Air date: ", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}