{"relation": [["Author", "Somewareman", "Sith", "tree", "Pimpshi", "YumeMaxx", "Krennthief", "b40677", "señor saturno", "bstring", "señor saturno", "luigiman77", "Mise", "mr.emu", "earthdyedred", "Katon", "Somewareman", "Zafum", "Pitch", "Renard", "Claus' Twin", "Henry Midfields", "random_encounter", "Minyobi", "Embezzle", "Reverend", "matilda_caboose", "LeonardoGolden", "eb0ebm3", "Batheround dlysxeci", "Batheround dlysxeci", "bstring", "bstring", "Ranger", "DEDEDEJr", "MasterZ", "Penguinguy", "Mise", "Mise", "Unlimited Lumpia", "JamesPicard_007", "matilda_caboose", "matilda_caboose", "matilda_caboose", "señor saturno", "Carbon Dog", "Dougertous", "Nutsjesmoar", "GlaciesofPacis", "señor saturno", "AlbinoPiglet", "Yves", "viewtifulday", "Yokuba", "xfisjmg1", "Psychodelic", "Joseph Collins", "Mise", "(Kumatora)", "Bubblewrap", "CodyTheChosen", "CodyTheChosen", "CodyTheChosen", "bmoney", "Revariance", "Skotein", "Gauntlet", "JakeRose", "DEDEDEJr", "Craide2A03", "GyrowolfenZ", "Master Chicken", "3R2", "Monobrow", "PKSkyler", "3R2", "IWontGetOvertheDam", "qpringle1", "DoniMusic", ".GamerBluePK", "señor saturno", "xfisjmg1", "Voetozeto", "TMF128", "aurilliux", "matilda_caboose", "luigiman77", "YumeMaxx", "CoolHandTim", "nesstj", "DEDEDEJr", "Chippychan", "Mystic Pyro Freak", "Pepsicola", "Pepsicola", "Pepsicola", "Pepsicola", "Pepsicola", "Pepsicola", "Pepsicola", "Pepsicola", "Pepsicola", "Pepsicola", "Pepsicola", "Pepsicola", "Onionman", "Deezer", "Onionman", "Onionman", "lewahi", "OnionManX", "chujelly94", "Zafum", "MrNameless", "apollokioku", "Z-Row", "FierceDeity", "Cheeseits", "Mise", "PKdekunut", "HuskyInDenial", "bstring", "matilda_caboose", "ThePhotoGuy", "Ness", "PKSkyler", "slicemasterflex", "onionthe3rd", "Tansunn", "SoniK Traveler", "TheReverendAG", "Somewareman", "iceman", "Chippychan", "TheReverendAG", "daxxglax", "Master Chicken", "KingDarian", "Unlimited Lumpia", "onionthe3rd", "(Kumatora)", "DEDEDEJr", "PsiHeroNess", "Chippychan", "Zafum", "Katon", "Somewareman", "Amstrauz", "Unlimited Lumpia", "Mise", "Onionman", "Onionman", "Onionman", "Dougertous"], ["Title", "Soundstone Evolution", "Sith's 8 Melodies", "Ness' intergalactic adventure(final mix)", "Monster of the Tempest", "This Letter's For You", "Mountain Number 1,101", "Naming Characters", "Hi hi hi (Saturn Valley)", "Dance of the Moon Kangaroo", "Battle with a weird opponent", "Eight Melodies", "Onett Theme", "16 Melodies (orchestrated)", "Out of the Frying Pan", "Twoskan", "Broken Childhood", "Boy Meets Girl - Orchestrated", "We Miss You - Theme of Love (English Ver.)", "The Might Of Four", "Giygas' Lullaby", "Welcome Home!", "Poltergeist Panzer Pandemonium", "National Song Of Ham And Crown", "Epic Melodies", "Mother - Intro", "Hometown Rhythm!", "Dangerous Onett", "Mother (EarthBound) 8 Melodies Ocarina", "All That I Needed Redone", "All That I Needed", "Freedom Song of the Moon People", "Dance of the Moon Kangaroo", "The Shortest Mother Mashup Ever", "Beach-Calming-Mother 3", "Eight Melodies In Your Deepest Memories", "MOTHER EARTH accordion", "Twoson tab", "Twoson tab", "Defeated Courage", "Because I Love You...", "Threedy Theme", "Through Smiles and Tears", "Bustlin' Fourside!", "Home ... Sweet Home", "The Azure Abyss", "Reading TAB", "The Sound Stone", "Pollyanna on Piano", "Cave Jazz", "Destroy The Demons", "Out of Zombie Paper", "Sound Stone", "King of The World", "Hey There Andonuts", "Shark Tooth Pile", "Field 3 - \"The Desert Between\"", "Chaos Theatre Tab", "Green Trains", "Sound Stone", "Chosen Boy Meets Girl", "SoundStone [Acoustic Version]", "SoundStone", "ZombieThreed", "Sound Stone/Twoson Melody", "Raise Your Voices", "Money (That's What I Want)", "Wonderin' (Boy Meets Girl)", "Mother 3 Title Rock", "This is Intense, Guys!", "Destroyer Anthem (Reorchestrated)", "Welcome to Threed", "MOTHER - Pollyanna (Remix)", "Monobrow - Last Day Together (Love Theme Remix)", "Snowman`s Winter", "Pollyanna Christmas", "You're Such a Hero", "Cease to Exist", "Earthbound - Hospital, Friendly Neighbor's House, Choose a File (Doni's Reggae Remix)", "Eight Melodies (MOTHER 2)", "A Flash of Memory", "I Am Earthbound", "Fun Naming!", "Mother 3 - Theme of Love (Piano)", "Threed, Freed of Worry", "The Modster Mash", "Sound Stone", "Twist the Summer Away", "Journey Through Threed", "Runaway Five Dance", "Mother 3 Piano Medley", "Lullaby for The Lonely Boy", "MOTHER 1 3 in 1", "Superintendent's House", "Spooky Cave", "Pollyanna", "Pollyanna", "Ninten's House", "Magicant", "Magicant Cave", "Magicant Cave", "Live House", "Healer Itoi", "EarthBound Zero Medley", "Pollyanna (slow)", "Poltergeist Bass Tab MIDI", "Pollyanna Guitar Tab MIDI", "Paradise Line Bass Tab MIDI", "Merrysville School Bass Tab MIDI", "Eight Melodies", "Christmas In Onett", "Sound Stone", "Life of a Trumpeter", "Sunrise Over Eagleland", "Giygas Battle Remixed", "Giygas Drum Mix", "Theed Live Guitar", "The Saturn Valley Beat", "Wisdom of the World", "Magicant Remix", "Zombie78", "Freedom Song of the Moon People", "~Because I Love You~", "Midnight in Fourside", "Winter in Summers", "Metropolis Onett!", "Smaaaaaaaaash Sumthin!", "EB0 - Credits Mix", "Pollyanna (guitar)", "Hotel Morning", "Fourside (Less Crappy Version)", "Bothersome Beat", "Tenda Village (Gummi Remix)", "Misplaced Revenge- Orchestra Remix", "Onett (Timing Resolved)", "Summers: The Eternal Tourist Trap", "Christmas in Eagleland", "A Night in Threed", "Home of the Zombie Circus", "EB0 - Creepy Mix", "Bells of Earthbound", "Giygas used PSI Rockin'!", "Fake Snow", "Mother 3 Orchestra Collection", "Phantasmagoric - Orchestrated", "The Halloween Funfest 2007", "Porky's Palace", "Lonely Mountains", "A Minor Holiday Scuffle", "Nightmare on the Mountain", "Poltergeist Bass Tab", "Paradise Line Bass Tab", "Merrysville School Bass Tab", "Battle Bass Tab"], ["Description", "As the name implies, this is a recreation of the Sound Stone theme. There's also a little hint of the Eight Melodies hidden in there. See if you can find it.", "As sung by Eduard Khil (not really, it was me)", "as much as i hate to submit pretty much the same song again, i wasn't pleased with how the first one turned out. so i fixed a bunch of stupid stuff in this version, and there is one VERY IMPORTANT, if small, update that adds to the song.~Tree", "As funny as the Toto sailor is, the gripping truth was that the battle with Kraken wasn't exactly a bundle of laughs.", "Arrangement of 'Letter From You, My Sweet'. One of my favorites! Also, my first (hopefully of many) Fan Music submission! =D", "Another wing-song. This time, I play piano. Mount Itoi. Please Enjoy. :D", "another midi", "Another good song :)", "Another entry by bstring. This one is a little more elaborate and shows my affection for FX. Please enjoy!", "another battle song. I hope you like it :P", "Another \"not so\" reinactment", "An overview of the theme from Onett, written for electric guitar with a few a acoustic suggestions.", "An orchestrated version of 16 Melodies from mother 3", "An Orbital/Black Dog inspired remix of 'Paula's Theme' and 'Battle Against a Weird Opponent.' OCRemix turned it down immediately and I have no clue why (feel free to edit album because of that), but it should find a home here. This was also my first noodling with my software synth (I've since used it to complete my fifth album). Let me know what you think: [email protected] Thanks! Brandon Isleib/earthdyedred", "An old song that I'll probably never finished, this was intended to have vocals over it by myself, with a rap in the middle by other folks, but that fell apart. Here's what came of it, and maybe I'll toss vocals on it one day.", "An experimentation with some different piano soundfonts. Its a remake of Youngtown/Paula's theme", "An epic orchestration of Ness' adventure, particularly his journey to Twoson.", "An English version of Mother 3's ending song. Sung by EileMonty, lyrics adapted by me.", "An electronic arrangement of Pokey Means Business, flowing into the Giygas battle... uh, music? Audio? Whatever it is, here is my rendition of the last few intense minutes of battle, more terrifying and daunting than ever. :]", "An eerie-sounding song I made just the other night. It's very outer-spacish.", "An attempted orchestral remix of Ness'/Paula's Home theme (EB version of Pollyana's theme).", "An ambient/metal remix of the cemetery, tank and poltergeist themes from MOTHER", "An alternate take on the Pigmen Anthem from Mother 3...At least it eventually gets there. My Second submission.", "An action-y remix of the Eight Melodies of Mother!", "An acoustic verion of Earthbound Zero's Intro.", "An Acapella of the Onett theme.", "An a capella I made just a few days ago.", "Also uploaded to YouTube, this is what you get when you mix and ocarina and mother :D. Please ignore the scratching noise..that would be my dog, though it kinda fit in so I left it there. The echo effect was done in GarageBand", "All That I Needed from Mother 1, redone.", "All That I Needed (Live House music, in Ellay)", "AKA: Winters. Me on drums, guitar, and fake bass. Entry into Holiday Funfest 06. Actually got me 2nd/Stylish.", "AKA: Apple Kid's House Theme Yeah. With Guitars, drums and fake bass. Enjoyeth.", "aka The Hippie Plays Snake Rattle n' Roll", "Ahh, this relaxing beach song is mellow, calming, and slightly sad. One of my favourite tracks from the game. Sounds much better with headphones on!", "Ahh the memories.", "accompanied with a slow bass switchemup. need someone else to acompany me for some more killer parts.", "A ye old tab I never finished till now.", "A ye old tab I never finished till now.", "A wintery and somewhat sorrowful blend of the 'Flying Man' and 'Game Over' themes.", "A winter-themed remix of the classic Earthbound town music.", "A vocalized version of Threed.", "A vocalized version of 'Smiles and Tears'.", "A vocalized Fourside theme.", "A very nostalgic song...", "A twisted remix of sorts, from Happy Happy Village. :)", "A tutorial on reading TAB", "A trippy version of the 8 melodies recorded on the sound stone. Warning: may cause slight seasickness? Heh, it's weird I know, but I figured the sound stone is such a strange and alien artifact, and it caused Ness to get lost in his own mind, so it must've been really something strange to hear. Well, anyway it's a different take on it I guess.", "A take of Pollyanna, kinda a different feel every now and then.", "A sweet version of 'save the miners', but a jazz version ^^U . Enjoy.", "A spooky yet melodious blend made using only earthbound/mother sounds! Enjoy!", "A spooky development of one of Earthbound's most overlooked and unloved themes, with some little extras sprinkled on the side.", "A soothing choir rendition of the Sound Stone melody.", "A song I made for a PK Hack of mine using the Earthbound music engine.", "A song from Tony's perspective. Parody of 'Hey There Delilah' by Plain White T's.", "A small mix I made using some sound clips from Earthbound. I'm still in the process of developing it, hopefully to a longer track.", "A slight S3M arrangement of the apparently overlooked \"Field 3\" theme from Mother. Truth be told, I'd never played the game through, but this theme is used as a basis for the \"Dusty Dunes Desert\" in Mother 2/Earthbound, so I figured I'd just call it \"The Desert Between Two Towns\" myself.", "A simple, little blues piece. Good for beginners, and enjoyable for everyone!", "A simple remix of the green train song in MOTHER 3.", "A simple remake of the sound stone eight melodies. Not too complex.", "A simple guitar instrumental of \"Boy Meets Girl\" (Twoson).", "A shortened combination of the 'SoundStone' and 'Smiles & Tears' themes.", "A shortened combination of the \"SoundStone\" and \"Smiles & Tears\" themes.", "A short version of the Zombie Threed theme done with drums, bass, and guitar. Drums so I could keep tempo. It's nothing special as I lack proper recording equipment, but oh well :)", "A short all guitar arrangement of the Sound Stone Melody leading into the Twoson theme. I'll finish the whole thing eventually, but at the time I was having difficulties.", "A short 8 Melodies arrangement from MOTHER/EarthBound Zero. I've taken some time off from reorchestrating Pokémon music to focus on school work, but I recently sat down and arranged this to practice some self-restraint (in using fewer melodies in a song, ironically). Who knows? I might do some full-fledged MOTHER songs in the future. :)", "A Runaway Five song. Enjoy my foolishly-written sax solos.", "A rockin' cover of \"Boy Meets Girl\" with original lyrics by Jake Rose. Check out more at http://jakerose.bandcamp.com", "A rock version of the music that plays when the MOTHER 3 title appears before chapter 1.", "A rock cover of Intense Guys.", "A reorchestration of one of my favorite tunes from Mother 3, Destroyer Anthem. Enjoy!", "A rendition of Threed's music, somewhat in the style of Ikana Canyon from The Legend of Zelda: Majora's Mask.", "A remix version of Pollyanna from MOTHER on FC [Original Melody © Nintendo]", "A remix of the Love Theme from Mother 3. I also made a video and put it on [url=http://www.youtube.com/watch?v=WEC1koqh53I]YouTube[/url] I love Mother 3, I made this song a couple days ago to capture the innocence and joy on the last day Lucas, Claus, and Hinnewa spent together. If only Flint had been there... Mother 3 is a beautiful game, and I thank Shigisato Itoi for making it, and the wonderful people that spent years translating it to English. You are wondeful people!", "A remix of snowman and winters themes, all in one. Techno, as usual. The drums are used to bring the pieces together, cause i couldnt megre them otherwise ;^_^ Enjoy....", "a remix of Pollyanna merry christmas", "A remix of Mother 2's Eight Melodies. Meh.", "A remix of \"Pokey Means Business\" from EarthBound that I made in an hour and a half. Made in FL Studio and Audacity.", "A reggae mix of the tracks \"Hospital\", \"Friendly Neighbor's House\", and \"Choose a File\". Enjoy! You can also find this on Youtube @ http://www.youtube.com/watch?v=1gwwUiXd6lE", "A recreation of the MOTHER 2 (EarthBound) Eight Melodies theme. Enjoy.", "A realy nostalgic song", "A rap song I wrote and recorded for the 2006 Winter Funfest. You can view the lyrics here or watch the music video here.", "A quick little arrangement that I made. One of my favorite MOTHER3 songs, too.", "A piano version of the Love theme (strings not included.)", "A piano arrangement of Threed's theme, once the zombies are destroyed and the sun shines once more. DISCLAIMER: Piano isn't my primary instrument, and there are a handful of wrong notes in there, but it's still a good tune.", "A parody of the famous Halloween song 'The Monster Mash'.", "a not so good reinact ment of the sound stone", "A nice acoustic guitar version of the Mr. Batty Twist! I find it to sound almost Indian at times... Kinda short though... sorry.", "A musical journey up to, during, and after the liberation of Threed.", "a music that is like runaway 5's music!", "A Mother 3 Piano medley with some of the better songs. Over 6 Minutes Long! I could have made it much longer...but I thought 6 minutes was pushing it. :P Listen and see if your favourite song is played! Or just read the list... Theme of Love Mother 3 Logo Piggy Guys Unfounded Revenge Strong One 'Final' Battle-King P's Theme Duster's Theme Magypsy's Tea Party Monkey's Delivery Service Etude for Ghosts Mr. Batty 'You Call This a Utopia?!' Victory/Level Up ------------------------- Please Enjoy!", "A Mother 3 Orchestration of the Love Theme. Enjoy.", "A MOTHER 1 Medley featuring Bein' friends, Wisdom of the World, and All I needed was you. I WROTE NONE OF THE MUSIC. I JUST SING. XP", "A module of the Superintendent's House music.", "A module of the spooky cave jingle.", "A module of the Pollyanna theme.", "A module of the Pollyanna theme.", "A module of the music in Ninten's house.", "A module of the Magicant theme.", "A module of the Magicant Cave theme.", "A module of the Magicant Cave theme.", "A module of the Live House music.", "A module of the Healer Itoi theme.", "A module of the 8 melodies and the Pollyanna theme mixed together.", "A module of a slow rock version of the Pollyanna theme.", "A MIDI that accompanies \"Poltergeist Bass Tab\" by Onionman.", "A MIDI that accompanies \"Pollyanna Guitar Tab\" by Deezer.", "A MIDI that accompanies \"Paradise Line Bass Tab\" by Onionman.", "A MIDI that accompanies \"Merrysville School Bass Tab\" by Onionman.", "A MIDI of the original Eight Melodies from Mother with an original counter thrown in. This is my first Mother MIDI.", "A MIDI mix of the Onett theme with a Winters feel.", "A Midi I made.", "A medley of the trumpeter's theme from Onett.", "A medley I produced for a Music Tech class. I noticed a lack of orchestral versions of Mother songs, so I made my own in Reason 4.", "A lovingly remixed version of EarthBound's final battle!", "A long, creepy remix of Giygas's theme with added percussion effects.", "A live rendition of the Threed theme, with guitar and percussion.", "A little tune I created a while back, I thought it turned out pretty well for my first time using FL Studios.", "A little serene piece of music from the original Mother, that plays during Ninten's visit to the castle in Magicant.", "A little musical arrangment of Magicant I did on a Roland HP207 electronic piano.", "A little hip hop beat I made for fun out of samples from Earthbound music :D I plan to do a rap over it later, but for now, here's the beat! Music: Husky In Denial (www.huskyindenial.com) Samples from Earthbound", "A late entry into the funfest. Hope it is of useable quality. Made by bstring with a cheap 5-piece drum set and 2 electric guitars, one with a bass string to simulate a bass. It's my personal take on the Winters BGM. Enjoy!", "A kinda sorta wishy-washy sung version of the ending theme.", "A jazzy version of the Fourside theme.", "A holiday take on the Summers Midi", "a hard hitting remix of the onett theme. contains lots of bass. techno, trance, hip-hop style!", "A halloweeny parody of Redmans Smash Sumthin.", "A Halloween-themed remix of the credits music from Earthbound Zero.", "A guitar version of the Pollyanna theme.", "A guitar TAB for the morning hotel music! Please post!! Tabbed by myself", "A guitar only version of my Fourside track. Better than the other one times 100.", "A funky fresh remix of the first battle theme in MOTHER 3.", "a fun remix of the tenda village bgm", "A fun little remix I made of one of my favorite battle themes from Mother 3. 8D Hope you guys enjoy it.", "A fixed version.. sorry, I keep jumping the gun! Anyway, here's Onett with a banjo and guitar.", "A first attempt, weird suave tones abound. Warning: May induce the urge to recklessly spend cash on kitschy tourist goods.", "A festive piece; a medley of the EarthBound town themes and other songs, with a Christmas carol embedded in each. Try to find them all!", "A dramatic reading of the poem by KingDarian", "A dark, evil circus remake of the zombie Threed theme.", "A creepy remix of music from Earthbound Zero.", "A couple tracks from Earthbound holidayized!", "A cool, jamming intro to Giygas' Battle, and then BOOM! Heavy Freaking Metal at 0:54!", "A cool synth remix of winters, inspired by Digital Winters.", "a compliment of a few Mother 3 pieces that I translated into orchestra format. Taking 3 weeks of hard work so that it could be released with the fan translation, but I'm a few days behind. xD Hopefully the peeps at Starmen.net will enjoy it Songs: Love theme Porky's theme Gentle Rain Memory of Mother 18 melodies 8 melodies", "A complete orchestration of the Mother 3 song, Phantasmagoric.", "A commercial made for Radio PSI for the funfest. :D Props to Mazedude, Cromkayer, and Unlimited Lumpia for music.", "A combination of Porky's Theme, New Pork Cinema, and the song that plays in Porky's room full of women and a centaur.", "A collab piece recorded by Mikerophone and myself (Amstrauz) for the 2012 Halloween Funfest! Inspired by the \"Somewhere, Someday\" track from Mother 3. Credit goes to Mikerophone for the trumpet, drums and post-processing. All other instruments and sounds were played by myself on an electric keyboard that ran into ProTools.", "A blend of \"Deck the Halls\" and an Earthbound battle BGM!", "A battle theme from Mother.", "A bass tab for the poltergeist music.", "A bass tab for the Paradise Line theme.", "A bass tab for the Merrysville School theme.", "A bass tab for the battle music."], ["Date", "12/13/12", "7/22/13", "3/11/09", "10/16/08", "10/22/08", "8/18/09", "6/2/07", "3/23/08", "1/14/07", "4/13/08", "1/14/08", "5/4/08", "3/12/12", "4/9/08", "3/3/08", "5/1/12", "12/18/10", "7/1/09", "10/14/08", "6/26/08", "10/8/06", "11/1/08", "5/15/07", "4/11/10", "5/18/08", "3/3/08", "6/26/08", "4/5/09", "9/30/06", "8/22/06", "2/14/07", "2/14/07", "5/30/09", "8/5/10", "4/9/08", "8/15/08", "12/4/09", "12/4/09", "12/27/06", "3/27/05", "6/19/08", "6/19/08", "11/16/08", "5/3/08", "10/9/07", "3/17/05", "7/6/08", "1/15/12", "3/23/08", "10/25/07", "10/16/08", "7/31/08", "12/10/08", "7/26/09", "7/2/08", "1/20/07", "10/5/08", "1/12/09", "5/31/08", "8/4/10", "10/26/08", "10/28/06", "10/12/07", "3/25/08", "5/22/10", "7/9/08", "12/5/11", "6/26/08", "1/8/09", "2/6/09", "10/28/08", "8/25/08", "10/8/11", "12/11/08", "12/7/08", "3/6/09", "3/27/12", "7/28/10", "2/17/10", "6/22/08", "4/4/07", "10/10/08", "9/20/09", "10/10/11", "10/7/08", "1/14/08", "11/13/08", "10/21/07", "12/17/06", "11/6/08", "2/26/11", "11/3/08", "2/12/05", "2/12/05", "2/12/05", "2/12/05", "2/12/05", "2/12/05", "2/12/05", "2/12/05", "2/12/05", "2/12/05", "2/12/05", "2/12/05", "2/12/05", "2/12/05", "2/12/05", "2/12/05", "2/22/07", "3/26/05", "4/20/07", "12/18/10", "11/5/11", "3/6/06", "3/26/05", "3/26/05", "10/16/08", "10/11/08", "9/11/10", "8/9/12", "1/7/07", "8/13/08", "11/5/10", "12/24/07", "12/2/08", "11/1/08", "3/26/05", "2/12/05", "6/2/06", "9/29/06", "5/1/12", "3/6/07", "12/9/08", "10/3/06", "3/25/09", "12/14/08", "10/13/07", "3/21/07", "3/26/05", "1/6/09", "6/26/08", "1/6/08", "10/18/08", "12/18/10", "10/8/07", "7/9/13", "11/5/12", "1/10/08", "1/3/09", "2/12/05", "2/12/05", "2/12/05", "2/12/05"], ["Rank", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "10.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - Fan Music Gallery", "title": "", "url": "http://starmen.net/fanmusic/gallery.php?ret=nothing&box49481FirstLetter=A&box49481PageNumber=1&box49481=DescDESC", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00303-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 224570991, "recordOffset": 224550846, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> Y W V U T S R P O N M L K J I H G F E D C B A 9 8 3 2 < Fan Music: News: Forums Store Super Smash Bros. Brawl Mother 1+2 Mother 3 (EarthBound 64) Mother 2 (EarthBound) View", "textAfterTable": "1 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day. Fan Music Guidelines Submit Galleries Music Sheet Music Guitar TAB Bass TAB Drum TAB Features Podcasts Fan Forum Misc. Rock Candy Bound Together OC Remix: Earthbound Activities:", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}