{"relation": [["Artist", "Reverend & The Makers", "(Unknown artist)"], ["Song Title", "Bassline", "Dancing With The Devil"], ["Played When", "Ava and Jeremiah arrive at the nightclub.", ""]], "pageTitle": "Royal Pains Season 4 Episode 11 - Dancing With The Devil (4x11) - Watch Online - s4 e11 Spoilers", "title": "", "url": "http://www.tvrage.com/Royal_Pains/episodes/1065201808", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00263-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 785317499, "recordOffset": 785296421, "tableOrientation": "VERTICAL", "textBeforeTable": "Music Ava is suffering from an adverse reaction to glycyrrhizic acid, contained within licorice that is used to flavor tobacco products. Carlos is suffering from Ankyloglossia, commonly known as tongue tie. Episode viewers (millions, Live + Same Day): 3.78 Episode Notes Read the full recap Recap Hank, Divya and Jeremiah are being briefed by Evan via video-conference about their new client, Ava, a pop singer with a diva personality. Jeremiah comments to Divya that she appears to be wearing the same clothes as the previous day, but she denies it. Hank notices a piece of straw stuck in her hair, just as he leaves to see about a page he received from Boris' estate... Paige Adele Collins As Brooke D'Orsay Divya Katdare As Reshma Shetty Evan Roth Lawson As Paulo Costanzo", "textAfterTable": "Episode Quotes visual: Divya pushes a button on the laptop, muting Evan. Divya: If only Evan came with a mute button in real life. Hank: That's genius. Hank: Well, you just exhausted my pediatric rotation. Marisa Then, who's the best pediatrician in the Hamptons? Hank: I don't know, but I'm gonna find out for you. Paige: I can totally handle this by myself. Evan: I know. I'm here to support you, as you handle it by yourself. Paige: All right. Okay, this is it. Evan: This is, this is what? Paige: Oh my God, I'm so nervous. Evan: Is that a bulletin board? Did we go back in time to the '80s? Divya: Uh, Jeremiah... are you free tonight? Dr. Jeremiah Sacani: Yes, uhh, completely free. Divya: Great! Could you cover for me? I am supposed to be on call, but my plans for tomorrow just became my plans for tonight. Dr. Jeremiah Sacani: You're covered. Ava: This is actually my grandma's recipe. Harper: What's in it? I've never tasted anything with flavors like this.", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}