{"relation": [["File Name", "Bobmedia", "Old BobUI Icons"], ["Version", "1.1", "1.0"], ["Size", "173kB", "16MB"], ["Author", "10leej", "10leej"], ["Date", "01-01-13 03:38 PM", "12-31-12 08:22 AM"], ["Type", "Addon", "Addon"]], "pageTitle": "BobUI : Minimalistic Compilations : World of Warcraft AddOns", "title": "", "url": "http://wowinterface.com/downloads/fileinfo.php?id=19502&so=&page=3", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 9, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00291-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 268399831, "recordOffset": 268365603, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Optional Files (2) Added minimap and nameplate addons (caelnameplates and pocketplot) Dominos Bar4 is now on a fader and will showup if you mouseover it (poor attempt to make the UI look a bit less buttony) Menubar moved to above the minimap and chatbox is now on the bottom of the screen. 1.1.0 (The Original UI) After discovering how very uncustomizable pocketplot is I switch it to qMinimap, layout change to tukui added, removed half a million addons. Memory should run significantly lower now. 1.1.1 (The Original UI) removed: tellmewhen 2.0.0 (The TukUI) tuk ui updated, added Basicbuffs, Basicchatmods, Genie, Power Auras, Tidyplates (removed uneeded themes and only kept neon and hub), tuk ui dbm skin, and I readded omen. Updated to current UI not gonna list allt he changes, still playing around with stuff though so don't be suprised you might see more updates soon) 2.1.0 (The TukUI) Another complete overhaul Should run at less than 2mb of memory now (yeah roughly 1.3 mb is actually just Aurora and Masque alone) 3.0 (The Fancy UI) Removed Addon Control Panel (felt it was unnecessary) 4.0 (The lumen UI) Minor bug fixes if any at all swapped Postal for OpenAll(fan update) I only really used the Openall option for postal anyway. Added auto sell grey and auto repair to BobUI-tweaks.lua dumped BobUI-Aruas.lua", "textAfterTable": "Archived Files (1) File Name Version Size Author Date   BobUI 6.0.6.1 1MB 10leej 10-24-14 12:26 AM Comment Options Page 3 of 11 < 1 2 3 4 5", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}