{"relation": [["Number", "IDEC10-04", "IDEC10-03", "IDEC10-02", "IDEC10-01"], ["Author", "David Vanzetti Nur Rakhman Setyoko Ray Trewin Risti Permani", "Daniel Spring Oscar Cacho Craig Jennings", "To Dieu-Hang Tom Kompas", "R. Quentin Grafton Tom Kompas Ngo Van Long"], ["Paper Title", "Home grown: cattle and beef self-sufficiency in Indonesia [PDF, 317 KB]", "The Use of Spread Models to Inform Eradication Programs: Application to Red Imported Fire Ants [PDF, 879 KB]", "Purchasing Power Parity: Evidence from a New Testing Procedure in the Nonlinear Modified ESTAR Framework [PDF, 247 KB]", "Do Biofuel Subsidies Reduce Greenhouse Gas Emissions? [PDF, 374 KB]"]], "pageTitle": "Paper Series - Crawford School - ANU", "title": "", "url": "https://crawford.anu.edu.au/research/papers/index.php?t=sps&op_year=06", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042987127.36/warc/CC-MAIN-20150728002307-00060-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 870170823, "recordOffset": 870154915, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{10696=» September 2006 Edition, 10474=» September 2007 Edition, 8490=As part of its commitment to research, the Crawford School will be releasing a biannual Research and Impact newsletter outlining the achievements and impacts made by our staff. Below are excerpts from our latest newsletter, September 2009., 10365=» March 2008 Edition, 9143=» Researcher Focus - Kaliappa Kalirajan, 10141=» March 2009 Edition, 10251=» September 2008 Edition, 24558=Updated:  13 March 2015/ Responsible Officer:  Crawford School Marketing/ Page Contact:  CAP Web Team, 18156=» 11: A Statistical Analysis of Government Responses to Committee Reports: Reports Tabled between the 2001 and 2004 Elections - Monk » 10: In the Eye of the Beholder? A Framework for Testing the Effectiveness of Parliamentary Committees - Monk » 9: Can We Account for Parliamentary Committees? A Survey of Committee Secretaries - Grant » 8: Opportunities for Greater Consultation? House Committee Use of Information and Communication Technology - Baczynski » 7: Senate Committees and the Legislative Process - Holland » 6: A Conceptual Framework for the Development of Parliamentary Institutions - Boulin » 5: Factors that Affect Participation in Senate Committee Inquiries - Morris & Power » 4: The Senate, Accountability and Government Control - Evans » 3: Scrutinising Budget Estimates in the House of Representatives - Worthington » 2: Patterns of Change: Parliamentary Privilege - Wright » 1: Rules of Procedure for National Assemblies - Bach, 10587=» March 2007 Edition}", "textBeforeTable": "2010 2009 2008 2007 2006 2005 2004 Policy and Governance Discussion papers School paper series   » view latest publications 2011 Crawford School Research Paper series Keywords Title Author Broad Topic Search online papers Crawford School papers", "textAfterTable": "2003 2004 2005 2006 2007 2008 2009 2010 Number Author Paper Title IDEC10-04 David Vanzetti Nur Rakhman Setyoko Ray Trewin Risti Permani Home grown: cattle and beef self-sufficiency in Indonesia [PDF, 317 KB] IDEC10-03 Daniel Spring Oscar Cacho Craig Jennings The Use of Spread Models to Inform Eradication Programs: Application to Red Imported Fire Ants [PDF, 879 KB] IDEC10-02 To Dieu-Hang Tom Kompas Purchasing Power Parity: Evidence from a New Testing Procedure in the Nonlinear Modified ESTAR Framework [PDF, 247 KB] IDEC10-01 R. Quentin Grafton Tom Kompas Ngo Van Long Do Biofuel Subsidies Reduce Greenhouse Gas Emissions? [PDF, 374 KB] Environmental Occasional papers 2002 2003 2004 2005 2006 2009 2010 Number Author Paper Title OP-#12 Noel Wai Wah Chan Consumer Demand for Sustainable Wild-caught and Cultured Live Reef Food", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}