{"relation": [["Title", "The Last Flight of the Scarlet Macaw", "Belize Survivor: A Darker Side of Paradise", "In the Heat", "Lonesome Point", "Understanding Belize: A Historical Guide"], ["Author", "Bruce Barcott", "Nancy R Koerner", "Ian Vasquez", "Ian Vasquez", "Alan Twigg"]], "pageTitle": "Belize Tours & Travel | Intrepid Travel ZA", "title": "", "url": "http://www.intrepidtravel.com/za/belize", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00062-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 525870663, "recordOffset": 525807456, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{86117=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 187996=Review submitted 08 Jul 2015, 87436=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan...}", "TableContextTimeStampAfterTable": "{63936=Belize enjoyed relative economic prosperity up until the Great Depression of the 1930s, which caused wide-scale unemployment and hardship due to falling timber prices, and subsequent collapse of the industry. Further to this, a damaging hurricane hit the colony in 1931 causing loss of life and infrastructure. In 1964, Belize was granted the right to self-govern, with George Price becoming the country’s first Prime Minster. Nine years later, British Honduras was officially renamed Belize and in 1981, Belize was granted its independence. More recently, Belize elected its first black Prime Minister when Dean Barrow was sworn in to office in 2008., 64653=Once part of the great Mayan Empire, Belize was occupied for centuries before the Spanish arrived. The Spanish colonists were largely unsuccessful when first trying to colonise Belize as they were repelled by local inhabitants. However, the British arrived in the 17th century and Belize soon became a part of the British Empire under the name of British Honduras (after many battles with Spanish settlers). Prior to the abolition of the slave trade in 1838, many African slaves were sent to Belize to work in the timber industry, namely mahogany extraction. Conditions were tough and fraught with danger, but many slaves chose to stay in this line of work after their emancipation due to their inability to receive work elsewhere or own land. Belize’s current population reflects the rich African culture that the slaves brought to the area centuries ago., 55824=Belize’s subtropical climate sees high temperatures and humidity most of the year, but the fresh sea breezes generally make life more comfortable. The dry season is from December to May, and this is the best time to visit Belize if you’re looking for sunshine and warm temperatures. The wet season is from June to November where rain is more frequent. Belize can get quite busy during the main holidays of Christmas and Easter so be prepared to share the beaches with other travellers during this time., 74282=Starting in the first week of September, Belize National Day kicks off a three-week period of raucous festivities featuring parades, parties, fireworks and feasts in celebration of Belize’s independence. All night beach parties and dancing all round!}", "textBeforeTable": "Recommended reading Further reading 7. The precious reefs of Belize need to be preserved and protected. By all means, admire the coral, but never touch or remove coral from reefs. Also, avoid buying souvenirs that have been illegally removed from the reef. 6. Please ask and receive permission before taking photos of people, including children. 5. Refrain from supporting businesses that exploit or abuse endangered animals. 4. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 3. Always dispose of litter thoughtfully, including cigarette butts. 2. For environmental reasons, try to avoid buying bottled water. Fill a reusable water bottle or canteen with filtered water instead. 1. Be considerate of Belize’s customs, traditions, religion and culture. Top responsible travel tips for Belize Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this in mind while travelling. Belize Travel Tips Responsible Travel also provides useful health information: Go to: http://www.who.int/en/ The World Health Organisation Go to:", "textAfterTable": "Handy links www.lonelyplanet.com/belize www.worldtravelguide.net/belize www.travelbelize.org × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}