{"relation": [["Publisher", "American Phytopathological Society", "American Society for Clinical Pharmacology and Therapeutics", "American Society of Nephrology", "Association for the Sciences of Limnology and Oceanography", "Atreya Ayurveda Publications", "Berghahn Journals", "Equinox", "Equinox", "INFORMS", "Project Hope", "Scuola Internazionale Superiore di Studi Avanzati (SISSA", "WIT Press"], ["Change Made", "Removed PDF use and added Paid OA", "Updated policy and policy url", "Updated policy, deposit in IR allowed. White to Blue", "Reviewed policy, no update required", "Added Pre-print use", "Added Paid OA", "White to Yellow", "Pre-print deposit location updated", "Removed PDF use and added Author’s version use", "Updated Policy URL and Added Requirement to ask permission if not an NIH author", "Added Paid OA", "Added Paid OA Option"], ["Date Updated", "09-January-2015", "16-January-2015", "28-January-2015", "28-January-2015", "12-January-2015", "21-January-2015", "12-January-2015", "21-January-2015", "08-January-2015", "14-January-2015", "21-January-2015", "06-January-2015"]], "pageTitle": "SHERPA Services Blog", "title": "", "url": "http://romeo.jiscinvolve.org/wp/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 25, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00019-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 199459439, "recordOffset": 199438218, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{60418=Portuguese, Spanish and Hungarian versions of RoMEO were released in 2010, 2011 and 2012 respectively, and SHERPA is working on further language versions for release in the future. Please contact us if you are interested in any specific languages and would like to help with translations., 23258=Total publishers: 1903 [26/6/15], 79670=Total publishers: 1812, 3549=RoMEO, JULIET, FACT and OpenDOAR will be offline between the hours of 6am to 6pm UK time on Saturday 11th July, in order for essential maintenance to be carried out at the Data Centre hosting our servers., 66812=Total publishers: 1822 [31/3/15], 90059=Total publishers: 1790 [22/1/14], 50542=Total publishers: 1830 [27/4/15]}", "lastModified": "Thu, 30 Jul 2015 23:59:43 GMT", "textBeforeTable": "Added new publishers: No Comments » JULIET, Monthly Update, RoMEO RoMEO and JULIET Updates for June 2015 01 Jul We apologize for any inconvenience that this causes. RoMEO, JULIET, FACT and OpenDOAR will be offline between the hours of 6am to 6pm UK time on Saturday 11th July, in order for essential maintenance to be carried out at the Data Centre hosting our servers. No Comments » FACT, JULIET, OpenDOAR, RoMEO Essential Maintenance 09 Jul We will add new groups as and when they are needed. – Europe PubMed Central Funders – Charity Open Access Fund – REF – Research Councils UK We currently have lists for: For example here is the REF group of funders [http://www.sherpa.ac.uk/juliet/index.php?fPersistentID=1060] These groups will now be searchable in their own right, and will provide a list of the participating agencies. Each agency will continue to have its own policy entry, so users can search for the group and then select their specific", "textAfterTable": "Green 2-June-2015 MB 10 University of Zagreb, Faculty of Mechanical Engineering and Naval Architecture Green 2-June-2015 MB 11 Wydawnictwo Naukowe Uniwersytetu Pedagogicznego Green 2-June-2015 MB 12 Addleton Academic Publishers Green 4-June-2015 JA 13 Instituto de Investigacions Marinas y Costeras Green 10-June-2015 JA 14 Library Leadership and Management Association Green 10-June-2015 JA 15 University of Leicester, School of Museum Studies Green 11-June-2015 JA 16 ALTEX Edition Blue 11-June-2015 JA 17 Pediatric Urology Case Reports Blue 11-June-2015 JA 18 Yildiz Technical University Blue 11-June-2015 JA 19 University of Graz Green 11-June-2015 JA 20 Kuratorium fuer Technik und Bauwesen in der Landwirtschaft Green 11-June-2015 MB 21 KAD International Green 11-June-2015 MB 22 European Association for Transactional Analysis Green 11-June-2015 MB 23 Asociación Cientifica ICONO 14 Green 11-June-2015 MB 24 Sumy State University, Economic Theory Department Green 11-June-2015 MB 25 IMA-Press", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}