{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", "13", "14"], ["Name", "True Crime", "Don't Bury Me...I'm Still Not Dead Yet", "Biz Loves Sluts", "The Song We Used To Call \"Wasting Time\"", "On Again Off Again", "The Gamblers Try Their Hand At International Diplomacy", "Walk Around Me", "Unicorn Shave Your Horn", "The Art Of Getting F#@%ed", "Year Of The Rooster", "The Curse Of The Ivory Coast", "Rent Is Due", "Uh Oh!", "Black Nothing Of A Cat"], ["Artist", "Riverboat Gamblers", "Riverboat Gamblers", "Riverboat Gamblers", "Riverboat Gamblers", "Riverboat Gamblers", "Riverboat Gamblers", "Riverboat Gamblers", "Riverboat Gamblers", "Riverboat Gamblers", "Riverboat Gamblers", "Riverboat Gamblers", "Riverboat Gamblers", "Riverboat Gamblers", "Riverboat Gamblers"], ["Time", "2:36", "2:46", "2:26", "1:58", "3:14", "1:45", "2:23", "0:34", "2:04", "3:14", "3:12", "2:19", "2:30", "3:37"], ["Price", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69", "$1.69"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - To The Confusion Of Our Enemies by Riverboat Gamblers", "title": "", "url": "https://itunes.apple.com/au/album/on-again-off-again/id331917943?i=331918449", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00298-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 870355703, "recordOffset": 870325807, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{124939=Copyright © 2014 Apple Inc. All rights reserved., 28452=Formed: 1997 in Denton, TX}", "lastModified": "Sat, 01 Aug 2015 04:03:42 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Riverboat Gamblers To The Confusion Of Our Enemies iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from To The Confusion Of Our Enemies by Riverboat Gamblers, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes application icon in your Dock or on your", "textAfterTable": "14 Songs Album Review The second track on To the Confusion of Our Enemies is titled \"Don't Bury Me...I'm Still Not Dead.\" But with all the reckless punk fury the Riverboat Gamblers have been dishing since their inception, well, they probably should be. Thankfully for listeners, the guys are not only alive and kicking, but they've also not yet lost their gritty edge or irrepressible exuberance. For their Volcom debut, they've simply developed their manic approach to one that is slightly more sober and aware. After all, having dealt with insincere A&R reps who appeared at their door in the wake of 2003's Something to Crow About — reflected upon in wry songs like the punchy \"Biz Loves Sluts\" — the guys are hardly naïve upstarts. But while the Gamblers may initially seem more sharply polished than on prior efforts, there is absolutely no dilution of the volatile energy they've been raucously discharging over the years (check them out live if you want further proof). Things are still very much fun and dirty, just not the all-encompassing filthy sweat of before. If anything, the better production that bolsters To the Confusion of Our Enemies just means that listeners are now able to actually understand the band's spirited lyrics (um, mostly) instead of just shouting along incoherently with a raised fist", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}