{"relation": [["SONG", "1", "2", "3", "4", "5"], ["TITLE Composer/Lyricist", "DON’T HOLD ON Patricia Roe", "THE MOVIE SONG Karl Broderick", "HEARTBEAT Hazel Kaneswaran, Jonas Gladnikoff, Rasmus Palmgren & Patrizia Helander", "BE MINE Cormac Battle", "YOU DON’T REMEMBER ME Don Mescall & Lucie Silvas"], ["PERFORMER(S)", "Patricia Roe mentor: Valerie Roe", "Eoghan Quigg mentor: Mark Murphy", "Can-Linn (feat. Kasey Smith) mentor: Hazel Kaneswaran", "Andrew Mann mentor: Cormac Battle", "Laura O’Neill mentor: Billy McGuinness"]], "pageTitle": "Mooney, Monday February 24th 2014 - Mooney Goes Wild - RTÉ Radio 1", "title": "", "url": "http://www.rte.ie/radio1/mooney/programmes/2014/0224/506342-mooney-monday-february-24th-2014/?clipid=1425232", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00233-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 686380963, "recordOffset": 686346945, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{45914=Two Eurovision Song Contest semi-finals will take place – on Tuesday May 6th, and Thursday May 8th.  There are already six direct finalists – the 'Big Five' countries: United Kingdom, Spain, France, Germany, Italy, plus last year's winners Denmark, will proceed directly to the Eurovision 2014 Final on Saturday, May 10th.  The contest will take place in Copenhagen, the Danish capital, where the Contest has been hosted twice before, in 1964 at the Tivoli Concert Hall (won by 16-year-old Gigliola Cinquetti for Italy), and in 2001 in Parken Stadium (won by Estonia’s Tanel Padar, Dave Benton & 2XL).  The remaining 31 countries will compete in one of the semi-finals in order to win a place in the aforementioned Final.  Ireland will compete in the second semi-final on Thursday, May 8th.  Live coverage will be on RTÉ Two for the semi-finals, and on RTÉ 1 for the Eurovision 2014 Final, with commentary provided – as ever – by Marty Whelan., 30283=Join Mooney in our Eurovision Green Room at the Bord Gáis Energy Theatre on Saturday, May 10th 2014. The party takes place in the Circle Club., 50039=9th place: twice – 1975, 1998, 49765=4th place: 3 times – 1966, 1968, 1986, 42538=We'll start today with a woman who has history when it comes to this competition. Patricia Roe was part of the group Roe-Mance who took part in the 1980 Irish National Final. 1980 was of course the year Johnny Logan went on to win the Eurovision with What’s Another Year. In 1992 Patricia Roe competed again in the National competition and her song Your Love came second. 1992 was of course the year that Linda Martin went on to win the Eurovision with Why Me. A year later, in 1993, Patricia came 3rd in the National contest with a song called If I Changed Your Mind” - and of course that was the year Niamh Kavanagh went on to win the entire Song Contest with the song In Your Eyes., 51661=Now we’re in the 2010s, and former winner Niamh Kavanagh went to Oslo with a strong ballad, It’s For You, but finished way down the field.  Former The X Factor contestants from Lucan, John & Edward Grimes, aka Jedward, won the national selections in 2011 and 2012 – mainly due to the huge under-16 female vote.  The first of their entries, Lipstick, gave us a worthy eighth place in Düsseldorf two years ago.  And the following year in Baku, Azerbaijan, the twins fared even worse, when Waterline plunged to nineteenth place on the night.  As for 2013 in Malmö, Ryan Dolan plunged to last place in the Final with Only Love Survives., 45636=The Late Late Show Eurosong Special will be broadcast on Friday, February 28th and hosted by Ryan Tubridy, with the winner being announced at the end of the show after the national televote results and the verdicts of the five regional juries., 49722=3rd place: once – 1977, 49481=Since Ireland’s first participation in 1965, we have finished as follows:, 63195=Hedgerows: It is an offence to 'cut, grub, burn or otherwise destroy hedgerows on uncultivated land during the nesting season from 1 March to 31 August, subject to certain exceptions'. For more information, click here., 50089=10th place: 4 times – 1973, 1976, 1991, 2006, 64137=If you find an injured animal or bird, please contact the National Parks & Wildlife Service on 1890 20 20 21, or BirdWatch Ireland, on 01 281-9878, or visit www.irishwildlifematters.ie, 49409=IRELAND’S EUROVISION RECORD 1965 – 2013, 50154=Note that all of Ireland’s Top Five placings occurred between 1966 and 1997., 63579=To contact your local wildlife ranger, click here for contact details. To read the Wildlife (Amendment) Act 2000, click here., 38573=If you have something that may be of interest to the Museum, contact them directly: phone 01 661-1000 or e-mail bureau@littlemuseum.ie., 50549=The best placing was at the start, in 2000, when Millennium Of Love, finished sixth., 49939=7th place: twice – 1969, 1974, 88806=© RTÉ 2015-RTÉ Commercial Enterprises Ltd, Registration No: 155076, Donnybrook, Dublin 4, Ireland., 49658=2nd place: 4 times – 1967, 1984, 1990, 1997, 20293=From Sunday, July 26th, for five weeks, Mooney Goes Wild will be broadcast live between 10am and 11am. A new five-part series, Mooney Goes Wild - Habitats, will be broadcast on Sunday nights from 10pm-11pm., 47092=Born in Enniskerry, Co Wicklow, Patricia already has a relationship with Eurovision, having placed runner-up with her own songs to both Linda Martin and Niamh Kavanagh in consecutive Eurosongs in 1992 (2nd with Your Love) and 1993 (3rd with If You Changed Your Mind), both of the former went on to win the Eurovision outright in their respective years.  Patricia also provided backing vocals for Malta in the Eurovision Song Contest in 1994.  When approached by Eurosong 2014 mentor Valerie, after a 20-year break from the competition, it was an easy decision.  Few people will remember that Patricia and Valerie were members of the band Romance, who participated in the 1980 National Song Contest, placing fifth with the Ken Stewart-penned Love Is All There Is – the winning song that year also went on to win Eurovision (Johnny Logan singing Shay Healy's What's Another Year?), 49570=1st place: 7 times – 1970, 1980, 1987, 1992, 1993, 1994, 1996 , 49989=8th place: twice – 1988, 2011, 49881=6th place: 3 times – 1965, 1985, 2000, 50663=2001 saw our entry Without Your Love finished third last, and put Ireland out of the 2002 contest.  Ten years ago, the You’re A Star format of selecting a Eurovision entry for Ireland was introduced, and Mickey Harte gave us a credible eleventh (joint) position in Riga in 2003.  Chris Doran (2004) and Donna & Joe McCaul (2005) were less successful – the latter performers did not even qualify for the final.  Brian Kennedy temporarily restored fortunes in Athens, 2006, when his own composition finished tenth in the Final.  In 2007, the trad band Dervish, however, gave us our first bottom placing!  Dustin won the national heat in Limerick in 2008, and went to Belgrade hoping to make it eight victories – it was not to be, especially as he didn’t make it past the semi-final stage.  2009 saw the girl band Sinéad Mulvey & Black Daisy narrowly miss a place in the final in Moscow with Et Cetera., 49823=5th place: 3 times – 1978, 1979, 1981}", "lastModified": "Sat, 01 Aug 2015 04:49:28 GMT", "textBeforeTable": "--> Google RTE.ie Feedback Century Ireland RTÉ Archives TRTÉ RTÉjr Shop About Jobs Lotto Performing Groups RTÉ Mobile RTÉ Digital Blog Homes Travel Motors Food Fashion Weather RTÉ Apps RTÉ Aertel RTÉ Radio Player RTÉ News Now RTÉ Live More Orchestras Radio Television RTÉ Player Life & Style Business Entertainment Sport News RTÉ.ie", "textAfterTable": "RTÉ Radio One RTÉ 2fm RTÉ Lyric fm RTÉ RnaG RTÉ Pulse RTÉ 2XM RTÉ Rtejr RTÉ Gold RTÉ Extra RTÉ Radio 1 Home Find a Show Listen Live Schedules Podcasts Playlist Close [X]", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}