{"relation": [["Artist", "8:02--Ruth Anderson--", "8:14--Susan Stone--", "8:17--Maggi Payne--", "8:28--Susan Frykberg--", "8:42--Dajuin Yao/Jerlian Tsao--", "9:06--Hiromi Ishii--", "9:20--Inge Morgenroth--", "9:37--Heldegard Westerkamp--", "9:52--Annea Lockwood--"], ["Title", "SUM--State of the Union Message--", "Ruby's Story--", "She Began Cutting The Situation Into Sections--", "Astonishing Sense--", "Garden of Memory--", "Dreaming Stones--", "Requim fur ein Schwein--", "Cricket Voice--", "World Rhythms--"], ["Album", "Lesbian American Composers--", "Melody Sumner Carnahan's \"The Time Is Now\"--", "The Time Is Now--", "An Astonishing Sense--", "Cinnabar Red Drizzle--", "Imaginare Landschaften--", "Imaginare Landschaften--", "Transformations--", "New Music for Electronic And Recorded Media: Women in Electronic Music - 1977 --"], ["Label", "CRI/WDR", "Frog Peak/Burning Book", "", "Earsay Productions", "Juxiang", "CYBELE", "", "empreintes DIGITALes", "CRI"]], "pageTitle": "A Different Nature | KBOO", "title": "", "url": "http://www.kboo.org/ADifferentNature?page=0%2C19", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 6, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00173-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 544638515, "recordOffset": 544605974, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{90740=A Different Nature was founded in the late Seventies by Richard Francis, who fearlessly championed new music and the unheard Avant Garde. His programs went into exhaustive detail on individual artists, labels and musical disciplines. He also spearheaded many important events on the air, such as the 2001 and 2008 Dada and Surrealism festivals that dominated the airwaves for days on end and involved many in the local avant garde community as well as many KBOO programmers. Richard passed away in 2009 but it's our hope to carry on with his mission of introducing listeners to unheard new music as a collective of his collaborators and listeners. Long live Papa Dada!, 12746=ADN 9/17/2012 CAGE CENTENARY PROGRAM 3 / host: dj what the!@#%*! , 23014=This time on A Different Nature, we delve into the program's past, and play gems from founder Richard Francis' own record collection.  It's KBOO's spring membership drive, so A Different Nature listeners will have the opportunity to pledge their support for the station during the program. We have special thank-you gifts to offer new or renewing members: copies of the CD \"Hendrix Uncovered: New Music Inspired by Jimi Hendrix\", donated by March Music Moderne & Bob Priest.}", "TableContextTimeStampAfterTable": "{105965=Copyright © 2012 KBOO Community Radio | Copyright Policy | Community Guidelines | Website Illustration & Design by: KMF ILLUSTRATION, 20135=MUSIQUE CONCRETE:  LUC FERRARI  (Paris, 1929-2006) began his musical career as a pianist but after a battle with tuberculosis, participation in the \"Internationale Ferienkurse Darmstadt\" and an overwhelming exposure to Edgard Varese's \"Deserts\", he developed a keen interest in musique concrete which drove him out of the recording studio and into the world with his tape recorder., 5743=CLASSICS, ANTIQUES AND CURIOS: CONLON NANCARROW (Texarkana, 1912-1997) . Living most of his life in relative isolation and not becoming widely known until the 1980s, Nancarrow's compositions for piano became too complex to be played by human hands prompting him to punch out his compositions, note by note, on giant paper rolls for player piano., 54030=THE LEAGUE OF AUTOMATIC MUSIC COMPOSERS and THE HUB. The two bands not only shared two major members (John Bischoff and Tim Perkis) along with featuring many major West Coast composers (Chris Brown, David Behrman, Paul DeMarinis, Rich Gold, Scot Gresham-Lancaster, Phil Stone and Mark Trayle); they also strongly represent the West Coast tradition of composer as instrument builder, using the newly available microcomputers of the '70 (in the case of LAMC) plus electronic and digital systems of their own devising (in both) to create networks of interacting computers and circuits with an eye to eliciting surprising and new “musical artificial intelligences.” Some of the most imaginative and compelling electric music created since 1977 and the music of Musica Elettronica Viva. Rescheduled from earlier pre-emptions., 76075=2.  Planetary Sine Wave Organ by Derek Ecklund  30:30, 75906=1.  Air Objects by John Berendzen   24:30, 97553=Latest newsletter: May 2015, 59463=CLASSICS, ANTIQUES AND CURIOS:  MUSICA ELETTRONICA VIVA  broke new ground as a live instrument & found object, acoustic/electronic, improvisational group.  Formed in Rome in 1966 they were Allan Bryant, Alvin Curran, Steve Lacy, Jon Phetteplace, Carol Plantamura, Frederic Rzewski, Richard Teitelbaum, and Ivan Vandor.  Through the '60s and '70s they performed throughout Europe and generatd riots with their performances in Italy., 76256=3.  Referent  by Scott Goodwin  24:00}", "lastModified": "Sat, 01 Aug 2015 03:36:20 +0000", "textBeforeTable": "06/15/2009 Air date:  A Different Nature Program name:  A Different Nature playlist for 06/15/2009 Playlists Download audio file Login or register to post comments Format: MP3 Stereo 44kHz 128Kbps (CBR) Length: 23:31 minutes (21.53 MB) Title: Edward Ka-spel interview Kathy, Dr Zomb & Rolf interviewed Edward Ka-Spel of the Legendary Pink Dots for A DIFFERENT NATURE. We conducted the interview at the Doug Fir a couple hours before they performed and aired it on ADN that night. Also thanks to Crystal for digital audio editing before the interview aired. Mon, 11/22/2010 program date: ", "textAfterTable": "8:41-- #40a-- 8:45-- #40b-- 8:50-- #41c-- 8:58-- #24-- 9:02-- #25-- 9:08-- #41b-- 9:15-- #26-- 9:19-- #22-- 9:23-- #27-- 9:30-- #48b-- 9:36--- #44-- 9:46-- #6-- 9:57-- #21-- CLASSICS, ANTIQUES AND CURIOS: CONLON NANCARROW (Texarkana, 1912-1997) . Living most of his life in relative isolation and not becoming widely known until the 1980s, Nancarrow's compositions for piano became too complex to be played by human hands prompting him to punch out his compositions, note by note, on giant paper rolls for player piano. Login or register to post comments A Different Nature playlist for 06/08/2009 Categories: Eclectic Program name:  A Different Nature", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}