{"relation": [["Title", "Out of the Transylvania Night", "Leaving: Memories of Romania", "The Seamstress", "The Land of Green Plums", "Under a Red Sky"], ["Author", "Aura Imbarus", "Mihai Grunfeld", "Sara Tuvel Bernstein", "Herta Muller", "Haya Leah Molnar"]], "pageTitle": "Romania Tours & Travel | Intrepid Travel", "title": "", "url": "https://www.intrepidtravel.com/romania", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00042-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 935491715, "recordOffset": 935436243, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{214912=Review submitted 20 Jul 2015, 113084=2013 has been a big year for Intrepid’s Project SAMA. We have been busy, reaching out to o..., 10914=Fortunately for those who have skipped a Eurotrip so far, 2015 is looking like the year of the shoestring., 7917=In Romania Women’s Day on 8 March is celebrated much like Mother’s Day or Valentine’s Day in other parts fo the world. But in the town of Viscri they have […], 114406=March 20 is proclaimed as the UN International Day of Happiness. The day recognises the importan...}", "TableContextTimeStampAfterTable": "{973=July and August are the busiest months for tourists all over Europe because the weather is at its warmest. May and June are some of the best months to visit Romania, followed by September and early October as the weather is usually fine and the sites are less crowded than during peak season. Spring and autumn are considered optimal times for birdwatching in the Danube Delta. Romania has harsh winters, with most tourists choosing to travel to the ski resorts. Snow lingers as late as mid-May, and the hiking season doesn't begin in earnest until June. The resorts along the Black Sea coast get busy in late June and stay packed until mid-August. It tends to rain more in March, April, October and November.}", "textBeforeTable": "Recommended reading Further reading 8. When on community visits or homestays, refrain from giving gifts or money to locals. 7. Please ask and receive permission before taking photos of people, including children. 6. Refrain from supporting businesses that exploit or abuse endangered animals. 5. Shop for locally made products. Supporting local artisans helps keep traditional crafts alive. 4. Learn some local language and don't be afraid to use it - simple greetings will help break the ice. 3. Always dispose of litter thoughtfully, including cigarette butts. 2. For environmental reasons, try to avoid buying bottled water. Instead, fill a reusable water bottle or canteen with filtered water. 1. Be considerate of Romania’s customs, traditions, religion and culture. Top responsible travel tips for Romania Intrepid is committed to travelling in a way that is respectful of local people, their culture, local economies and the environment. It's important to remember that what may be acceptable behaviour, dress and language in your own country, may not be appropriate in another. Please keep this in mind while travelling. Romania Travel Tips Responsible Travel also provides useful health information: Go to: http://www.who.int/en/ The World Health Organisation Go to: http://www.fco.gov.uk/en/ From UK? Go to: http://travel.state.gov/ From US? Go to: http://www.voyage.gc.ca/ From", "textAfterTable": "Handy links www.lonelyplanet.com/romania www.worldtravelguide.net/romania www.romaniatourism.com × Welcome to Intrepid. Select your country of residence. AfghanistanAland IslandsAlbaniaAlgeriaAmerican SamoaAndorraAngolaAnguillaAntarcticaAntiguaAntigua And BarbudaArgentinaArmeniaArubaAustraliaAustriaAzerbaijanBahamasBahrainBangladeshBarbadosBarbudaBelarusBelgiumBelizeBeninBermudaBhutanBoliviaBorneoBosnia And HerzegovinaBotswanaBouvet IslandBrazilBritish Indian Ocean TerritoryBrunei DarussalamBulgariaBurkina FasoBurundiCambodiaCameroonCanadaCape VerdeCayman IslandsCentral African RepublicChadChileChinaChristmas IslandCocos (Keeling) IslandsColombiaComorosCongoCongo, Democratic Republic Of TheCook IslandsCosta RicaCote D'ivoireCroatiaCubaCyprusCzech RepublicDenmarkDjiboutiDominicaDominican RepublicEcuadorEgyptEl SalvadorEquatorial GuineaEritreaEstoniaEthiopiaFalkland Islands (Malvinas)Faroe IslandsFijiFinlandFranceFrench GuianaFrench PolynesiaFrench Southern TerritoriesGabonGambiaGeorgiaGermanyGhanaGibraltarGreeceGreenlandGrenadaGuadeloupeGuamGuatemalaGuernseyGuineaGuinea-BissauGuyanaHaitiHeard Island And McDonald IslandsHoly See (Vatican City State)HondurasHong KongHungaryIcelandIndiaIndonesiaIranIraqIrelandIsle Of ManIsraelItalyJamaicaJapanJerseyJordanKazakhstanKenyaKiribatiKorea, Democratic People's Republic OfKorea, Republic OfKosovoKuwait", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}