{"relation": [["Title", "BioHazard", "Resident Evil", "Resident Evil"], ["Publisher", "Capcom", "Capcom", "Capcom"], ["Region", "Japan", "North America", "Europe"], ["Date", "22nd March 2002", "30th April 2002", "13th September 2002"], ["Distribution", "Retail", "Retail", "Retail"]], "pageTitle": "Resident Evil (GameCube) - Sales, Wiki, Cheats, Walkthrough, Release Date, Gameplay, ROM on VGChartz", "title": "", "url": "http://www.vgchartz.com/game/71005/resident-evil/", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 3, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00001-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 809605575, "recordOffset": 809597540, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{4248=Resident Evil, also known as BioHazard, is a remake of the 1996 survival horror of the same name. The game, made as part of an exclusivity agreement between Capcom and Nintendo, was part of a three game deal that included a remake of the 1996 Resident Evil, the prequel Resident Evil Zero, and Resident Evil 4., 5320=Often called Resident Evil: Remake or Resident Evil: Rebirth, abbreviated REmake and REbirth, was originally intended as a Gamecube exclusive until it was rereleased in 2009 for the Wii, titled Resident Evil Archives., 16041=About Us | Terms of Use | Privacy Policy | Advertise | Staff | Contact © 2006-2015 VGChartz Ltd. All rights reserved. US}", "textBeforeTable": "Release History 1.42m = Global 3.8% 0.05m + Rest of the World: 25.0% 0.35m + Japan: 26.5% 0.38m + Europe: 44.7% 0.63m North America: Total Units Comments Japan Summary Genre: Action Developer: Capcom Also on: Wii, PlayStation 3 Platform: GameCube 1.42m Global Total as of 27th Jun 2015 (units): Resident Evil //--> document.write('');", "textAfterTable": "Game Overview Resident Evil, also known as BioHazard, is a remake of the 1996 survival horror of the same name. The game, made as part of an exclusivity agreement between Capcom and Nintendo, was part of a three game deal that included a remake of the 1996 Resident Evil, the prequel Resident Evil Zero, and Resident Evil 4. Often called Resident Evil: Remake or Resident Evil: Rebirth, abbreviated REmake and REbirth, was originally intended as a Gamecube exclusive until it was rereleased in 2009 for the Wii, titled Resident Evil Archives. Resident Evil Wiki on Gamewise Overview Release Dates Credits Walkthrough Achievements Cheats Discussion Similar Games Resident Evil 4 (1.69m) The Legend of Zelda: Twilight Princess (1.59m) LEGO Star Wars: The Video Game (1.41m) Resident Evil Zero (1.29m)", "hasKeyColumn": true, "keyColumnIndex": 2, "headerRowIndex": 0}