{"relation": [["Page", "02", "04", "07", "12", "14", "15", "15", "18", "24", "36", "47", "51", "52", "55", "56", "59", "60", "62", "66", "67", "68", "70", "80"], ["Author", "", "Dan Wotherspoon", "Gael D. Ulrich", "Richard H. Cracroft", "Vicke Stewart Eastman", "Bruce Smith", "", "Boyd Peterson", "Lavina Fielding Anderson", "Hugo Olaiz", "Kevin Smith", "Stephen Frech", "Todd Robert Petersen", "Gerald R. Wheeler", "D. Jeff Burton", "Anita Tanner", "", "Robert H. Briggs", "Lisa Tensmeyer Hansen", "Clayton Hansen", "Snja Farnsworth", "", ""], ["Title", "Letters", "From the Editor: Saving the Whole World", "Guitars in Church?: 2002 Eugene England Memorial Personal Essay Contest Winner", "CORNUCOPIA: The Naked Truth: A Widow from Scipio", "CORNUCOPIA: Righteous Dominion: The Ward Christmas Wreath", "CORNUCOPIA: Called to Serve: A Father’s Advice", "CORNUCOPIA: Alternate Voices: Main Street Mania: Projects That Didn’t Make It", "Truth Is Stranger Than Folklore: Hugh Nibley- The Man and the Legend", "Immediately Irresistible Ideas': Sunstone and Peggy Fletcher, 1980-1986", "One Lord, One Faith, Many Chat Rooms: Mormons, The Internet, and the Complexities of Open Spaces", "The Book of Orme or High Adventure on the Open Seas or A Supposedly Fun Thing I’ll Never Do Again until Next Year", "Who’d Have Thought the Owl So Fierce?", "Redeeming the Dead: 1998 Brookie & D.K. Brown Fiction Contest Winner", "Cello Player", "Braving the Borderlands: Explorations In Openness", "What I Wanted from Snow", "NONSTANDARD DEVIATIONS: A Lamentation for Peace", "Wrestling Brigham : Blood of the Prophets: Brigham Young and the Massacre at Mountain Meadows, by Will Bagley", "Coincidence with Potential: Consider the Butterfly: Transforming Your Life through Meaningful Coincidence, by Carol Lynn Pearson", "Three Visits", "Getting ‘Real’?: Women And Authority: Re-Emerging Mormon Feminism, ed. by Maxine Hanks", "Defeated in Court, Church Launches Vigorous Public Campaign for Temple Square Plaza; Several LDS Authors ‘Called in’ to Defend Challenging Writings; Church Disciplines Authors, Leads to Family Break-up", "AN OLIVE LEAF: Gravely and Heroically Choose a Better Course of Life"], ["", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", "", ""]], "pageTitle": "Sunstone Magazine | Issue Details", "title": "", "url": "https://www.sunstonemagazine.com/issue-details/?in=125", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 1, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00292-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 942542495, "recordOffset": 942530468, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{18513=HELP DESK HOURS 11:00 to 6:00, Monday-Friday}", "textBeforeTable": "Download Table of Contents PDF Download Entire Issue PDF Listed below are the articles from this issue. Topics included in this issue: Violence, Internet, Mountain Meadows Massacre, Music, Personal Essay, Review, Sunstone, Humor, In Memoriam, Spirituality, Church Activity, Missionary Work, Fiction, Censorship, Biography, Contemporary Mormonism, Cultural Studies, Cyberspace, Faith, Family, Feminism, BYU . December 2002 Click to View Cover", "textAfterTable": "About Sunstone Sunstone is a magazine published by the Sunstone Education Foundation, Inc., a 501(c)(3) nonprofit corporation, that discusses Mormonism through scholarship, art, short fiction, and poetry. Please consider supporting Sunstone by making a donation. Mission The mission of The Sunstone Education Foundation is to sponsor open forums of Mormon thought and experience. We examine and express the rich spiritual, intellectual, social, and artistic qualities of Mormon history and contemporary life. We encourage humanitarian service, honest inquiry, and responsible interchange of ideas that is respectful of all people and what they hold sacred. Contacting Sunstone ADDRESS 343 North Third West Salt Lake City, Utah 84103 HELP DESK HOURS 11:00 to 6:00, Monday-Friday OFFICE HOURS By appointment. PHONE", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}