{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10"], ["Name", "Kicking My Heels", "Prince of Nothing Charming", "Loaded Gun", "You'll Ask for Me", "Jenny", "Can't Stop Now", "Ain't No Fooling Me", "Leave Him", "I Belong", "Hey Jesus"], ["Artist", "Tyler Hilton", "Tyler Hilton", "Tyler Hilton", "Tyler Hilton", "Tyler Hilton", "Tyler Hilton", "Tyler Hilton", "Tyler Hilton", "Tyler Hilton", "Tyler Hilton"], ["Time", "4:17", "3:58", "3:40", "4:02", "3:52", "4:05", "3:47", "4:36", "3:54", "2:25"], ["Price", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Forget the Storm by Tyler Hilton", "title": "", "url": "https://itunes.apple.com/gr/album/forget-the-storm/id514997778", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00195-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 883785799, "recordOffset": 883760655, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{115264=Copyright © 2014 Apple Inc. Με επιφύλαξη παντός δικαιώματος.}", "lastModified": "Fri, 31 Jul 2015 07:38:52 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Tyler Hilton Forget the Storm iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Forget the Storm by Tyler Hilton, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "10 Songs Album Review Following an eight-year gap since his last proper album, actor/songwriter Tyler Hilton returns with his third full-length, Forget the Storm. Hilton has long intertwined his work as a musician with his acting career — he's best known for his role as a cocky songwriter on the CW network's drama One Tree Hill, as well as his portrayal of Elvis Presley in Walk the Line. Forget the Storm comes on the heels of a series of EP releases, and showcases Hilton's heartfelt and often soul-searching contemporary pop/rock style. Standout tracks include single \"Loaded Gun\" and \"Jenny,\" a duet with Elizabeth Huett., Rovi Biography Genre: Pop Years Active: '90s, '00s Singer and songwriter Tyler Hilton started in music early, the product of a musical family that kept him curious about playing guitar, singing, and performing. By seventeen he was writing his own songs, and had become an open mic fixture in his hometown of Palm Springs, California. In 2000 Hilton wrote, recorded and released an eponymous debut and began to shop it, but it was a chance opportunity that brought his talent to the record execs' attention. That same year an impromptu performance over... Full bio", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}