{"relation": [["Publication", "CMS Family Guide", "CMS Family Album"], ["Publisher", "UNEP/CMS Secretariat", "UNEP/CMS Secretariat"], ["Type", "Leaflets & Brochures", "Leaflets & Brochures"], ["Published Date", "10 2011", "08 2011"]], "pageTitle": "South Andean Huemul | CMS", "title": "", "url": "http://www.cms.int/fr/node/27", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 4, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00332-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 379094935, "recordOffset": 379050776, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{5273=The Huemul moves up and down the South American Andes with the seasons, including transboundary areas between Argentina and Chile. Also known as the South Andean Deer, the Huemul is part of the Chilean Coat of Arms and is not only culturally, but also ecologically and economically of considerable value. It is the only large herbivore to inhabit sub-Antarctic Patagonia. However, the future of the Huemul is far from certain after suffering a 99% decline in population size and a 50% decline in its range. Today less than 1500 animals remain in small and fragmented populations, with the majority occurring in Chile. As a result the Huemul has been classified as Endangered on the IUCN Red List and is listed under both CMS and CITES on Appendix I since 1997 and 1975 respectively., 5786=In order to conserve the last remaining Huemul populations and their habitats the Memorandum of Understanding (MOU) on the Conservation of the Southern Huemul (Hippocamelus bisulcus) was concluded by Argentina and Chile under CMS auspices in 2010. The MOU provides a legal framework for the last two remaining range states, NGOs, scientists, local people and other stakeholder to jointly conserve this endangered migratory deer. }", "TableContextTimeStampAfterTable": "{19470=This site is maintained by the UNEP/CMS Secretariat © 2013  | Disclaimer UNEP/CMS Secretariat, Platz der Vereinten Nationen 1, 53113 Bonn, Germany Tel. (+49 228) 815 2401, Fax. (+49 228) 815 2449, Contact}", "lastModified": "Sat, 01 Aug 2015 03:01:31 GMT", "textBeforeTable": "South & Central America & The Caribbean Completed Fundacion Vida Silvestre Argentina (FVSA) design and construction of an observatory for the study and observation of the Huemul Deer (Hippocamelus bisulcus) Region Status Implementing Agency End date Start date Project 1997 / - Cervidae Artiodactyla Mammalia Huemul, South Andean Deer Hippocamelus bisulcus Appendix (App. I / App. II) Family Order Class Common name Scientific name", "textAfterTable": "News News Media Watch Notifications Op-ed Press releases Education & Awareness Capacity Building Campaigns Meetings & Events Standing Committee Related Meetings Related Links The CMS Family E-community login CMS ScC Workspace Contact Secretariat Focal Points Standing Committee members Scientific Council members CMS newsletter E-mail *", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}