{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9"], ["Name", "Don't Hang Up Those Dancing Shoes", "Shake It", "Sundown of Fools", "The War Was Over", "Shame", "Hey Papa", "Where Are You Hiding", "Rain King", "Trains"], ["Artist", "Terence Boylan", "Terence Boylan", "Terence Boylan", "Terence Boylan", "Terence Boylan", "Terence Boylan", "Terence Boylan", "Terence Boylan", "Terence Boylan"], ["Time", "3:28", "3:41", "2:40", "4:17", "4:37", "3:56", "4:02", "3:35", "5:18"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Terence Boylan by Terence Boylan", "title": "", "url": "https://itunes.apple.com/us/album/terence-boylan/id322090558", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00250-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 874387387, "recordOffset": 874361748, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{20431=I was in a record store in Albany, NY around 1976 when this record was playing. I assumed it was a Jackson Browne album but when I asked about learned it was Terence Boylan. Bought it on the spot plus several unopened sealed albums since. Every song is excellent and still resonates today, 2014. All that TB missesd was time on the radio otherwise he would have hit it big. He was dialed in, all you need to look at are the artists that performed on this album. Best of the best., 113254=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Sat, 01 Aug 2015 03:33:44 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Terence Boylan Terence Boylan iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Terence Boylan by Terence Boylan, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "9 Songs Album Review On his eponymous debut for Asylum, Terence Boylan gave the label everything it could possibly have wanted from one of its artists in 1977: confessional singer-songwriter ballads, slick Steely Dan-style L.A. jazz-pop, Eagle harmonies, and a bevy of L.A. session heavyweights. Boylan doesn't really offer anything particularly new here, but he is capable of writing tight, catchy, thoughtful California pop. Lyrically, he covers much of your basic singer-songwriter territory (love lost, coming of age, reflection), as well as tales of life in the tropics and even a song about a witch. Boylan may not quite be in the same class as the cream of Asylum's 1970s crop (Jackson Browne, the Eagles, Joni Mitchell), but Terence Boylan stands up well next to most records of its ilk. Customer Reviews Acoustic at its best...           by Marco 183 Lyrical, melodic, memorable.... encompasses all that the 70's had to offer in the realm of soft rock. Boylan was up to the task of keeping with the likes the Eagles, Jackson Brown and others.... only the issue of longevity kept him from a place on the", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}