{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12"], ["Name", "Unspoken", "Ginnie", "Family Gathering", "Nor'Easter Girl", "Old Toys", "My Secret Life", "Unspoken Interlude", "Dream Catcher", "This Moment Lasts a Lifetime", "Invocation", "The Machine in the Basement", "Unspoken Coda"], ["Artist", "Rich Stein", "Rich Stein", "Rich Stein", "Rich Stein", "Rich Stein", "Rich Stein", "Rich Stein", "Rich Stein", "Rich Stein", "Rich Stein", "Rich Stein", "Rich Stein"], ["Time", "3:27", "3:59", "4:47", "4:59", "3:47", "4:08", "1:32", "5:10", "3:08", "1:23", "3:36", "2:30"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Unspoken by Rich Stein", "title": "", "url": "https://itunes.apple.com/ee/album/noreaster-girl/id6292473?i=6292455", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00065-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 859912925, "recordOffset": 859896531, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{68194=Autoriõigus © 2014, Apple Inc. Kõik õigused on reserveeritud.}", "lastModified": "Fri, 31 Jul 2015 08:42:42 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Rich Stein Unspoken iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Unspoken by Rich Stein, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes Store.", "textAfterTable": "12 Songs Album Review When one thinks of instrumental rock guitar, a variety of styles come to mind. One is fingerpicker music — that is, acoustic folk-rock guitarists like Leo Kottke, John Fahey, Peter Lang, Michael Gulezian, Stefan Grossman, and Robbie Basho. Another is the Steve Vai/Joe Satriani/Randy Coven school of electric hard rock shredders — flamboyant, ostentatious, high-voltage axemen with a hell-bent-for-chops virtuosity. And there is also '60s surf guitar. So where does guitar-playing instrumentalist Rich Stein fit in? Actually, Unspoken cannot really be lumped in with any of those three guitar schools. The guitar playing that Stein offers on this CD is neither surf rock nor hard rock, and even though one hears some of that Fahey/Kottke/Lang influence in his folk-rock approach, Stein is not a true picker, either. Stein moves back and forth between acoustic and electric guitar on this CD, and a real picker would not be playing so much electric guitar — the acoustic guitar is the instrument that makes authentic picker music what it is. So when all is said and done, Unspoken manages to bring something that is fairly fresh-sounding to instrumental folk-rock guitar music — something that is picker-influenced but is not true state-of-the-art picker music, either (certainly not if one is an acoustic purist when it comes to that style). Yes,", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}