{"relation": [["Artist", "Blackfire", "Walela", "Floyd Red Crow Westerman", "Walela", "Buffy Saint-Marie", "Charle Littleleaf", "Floyd Red Crow Westerman", "Johnny Cash", "Charles Littleleaf", "Johnny Cash", "Michael Bucher", "Stephen Kakfwi", "Buffy St. Marie", "Charles Littleleaf", "Walela", "Various Artists", "Tha Tribe"], ["Title", "American Indian Movement song", "I'll turn my radio on", "Custer died for your sins", "The Whipporwill", "My country tis of thy people are dying", "Trail fo Tears/Amazing Grace", "The land is your Mother", "As long as the grass shall grow", "Stick Indian", "Drums", "Mountain top removal", "Chief Johnny Charlie", "Take my hand for a while", "Who am I", "Cherokee Morning song", "Eagle Dance", "Heart and Soul"], ["Album", "Think Global", "Walela", "Custer died for your sins", "Walela", "The best of Buffy St. Marie", "Ancient Reflections", "The Land is your Mother", "Bitter Tears", "Ancient Reflectionas", "Bitter Tears", "Believe", "New strings on an old guitar", "Best of Buffy St Marie", "Ancient Reflections", "Walela", "American Indian Dances", "Round Dance songs"], ["Label", "time:1:30pm", "1:35pm", "1:39pm", "1:42pm", "1:54pm", "2:00pm", "2:05pm", "2:08pm", "2:14pm", "2:18pm", "2:23pm", "2:27pm", "2:34pm", "2:36pm", "2:39pm", "2:51pm", "5:54pm"]], "pageTitle": "KBOO | Community Radio for Portland and beyond", "title": "", "url": "http://kboo.org/playlists/2708?page=533", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 9, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00213-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 132732787, "recordOffset": 132700584, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{84168=Xerophonics - Matrix 12510-12 - from Xerophonics - 4:15 David Slusser - Creaks - from Delight at the End of The Tunnel - 0:59  here's a closer look at this work, Slusser's first album on Tzadik: http://www.furious.com/perfect/slusser.html and here is an article about Slusser's amazing life (where your eyebrow will likely raise at least once per paragraph): http://articles.sfgate.com/2007-08-17/music/17255450_1_saudi-princess-ro... Stomp - Waterphonics - from Orbitones, Spoon Harps and Bellowphones - 2:20 Raymond Scott - Backward Beeps - from Manhattan Research Inc - 1:05        performed on Scott's \"Circle Machine\" - Around 1959, Scott designed and built the Circle Machine, a more compact electronic sequencer. Dr. Thomas Rhea, music synthesis professor at the Berklee College of Music, visited Scott many times in the early '70s and remembers the Circle Machine as \"an analog waveform generator that was this crazy, whirling-dervish thing. It had a ring of incandescent lamps, each with its own rheostat, and a photo-electric cell on a spindle that twirled in a circle above the lights.\" Each bulb's intensity was individually adjustable, as was the rotation speed of the photocell. As the lights brightened, the pitch ascended. Arm rotation speed governed the rhythm. The lights could be stag-gered in brightness, and depending on the pattern, the tone sequence generated would change. The Circle Machine was capable of a wide range of unearthly sounds, as heard in numerous commercial jingles Scott recorded during the late 1950s and early 1960s (many of them are included on Manhattan Research Inc.).  SPIN: ''Paranoiac, visionary, misanthrope, and machine fetishist, the late composer Raymond Scott was also an electronic music pioneer and inventor geek who had Madison Avenue paying him to soundtrack its vision of postwar American futurism. The music on MANHATTAN RESEARCH INC. is both archaic and tres moderne. It reveals the fears and fantasies of a nation in boom-time denial. And Scott mischievously spikes almost every one with a dystopian mickey: could give a kid nightmares for years.'' (written by Senior Editor, Will Hermes) Check out more about Raymond Scott's Manhattan Research here:     http://www.raymondscott.com/mripr.html The User  - }.}@}.@.}@}. - from Symphony #2 for Dot Matrix Printers - 5:59 This is where Dot matrix printers are turned into musical ‘instruments’, while a computer network system, typical of a contemporary office, is employed as the ‘orchestra’ used to play them. The orchestra is ‘conducted’ by a network server which reads from a composed ‘score’. Each of the printers plays from a different ‘part’ comprised of rhythms and pitches made up of letters of the alphabet, punctuation marks and other characters. [The User] uses ASCII textfiles to compose, orchestrate, and synchronize sonorous and densely textured, rhythmically-driven music.  Hans Reichel - For Those Who love Propellers - from Lower Lurum - 2:56 Hans Reichel's Lower Lurum is perhaps the record that introduced the world to his invention, the daxophone, a box playing a long, thin altered board that produces so many tones and sounds they are virtually limitless. Add to this Reichel's homemade guitars, which are truly exotic pieces of art as well as functional instruments, and you have an orchestra from another dimension. Which is what Lower Lurum is pretty much all about. Being subtitled as a \"guitar and daxophone\" operetta, in Reichel's mind there is probably a concept here. But that concept for the listener -- especially since there are no notes explaining what the \"plot\" of this operetta is supposed to be -- is tonal. Given how technical Reichel is about everything in the booklet, it is -- for those who've never heard Reichel's music -- shocking to hear its emotional warmth, depth, and humor. There is very little manipulation of sound with overdubs occurring in very few places, and even they are used sparingly. This is music that comes straight through the microphone without effects. In large part this is because it doesn't need any. Reichel's operetta and his music in general are more musical than music because they integrate the entire human being -- physical, psychological, emotional, spiritual -- into the way in which a composition or improvisation is executed and ultimately sounds. On Lower Lurum, Reichel has created a light body (or, from the Buddhist perspective, a rainbow body) of sound. Its clarity and spirit are one in the same, expressed as resonances from the heart through the hands and moving beyond them both into a sonic architecture that expresses emotions and thoughts that occur just beyond the field of language, and that achievement is far greater that the faculty of language this reviewer possesses. ~ Thom Jurek, All Music Guide <announce> Maryanne Amacher - Synaptic Island - from Sound Characters - 8:36, 93134=Her major pieces have almost exclusively been site specific, often using many loudspeakers to create what she called \"structure borne sound\", which is a differentiation with \"airborne sound\", the paradox intentional. By using many diffuse sound sources (either not in the space or speakers facing at the walls or floors) she would create the psychoacoustic illusions of sound shapes/\"precense\". Amacher's early work is best represented in the three series of multimedia installations produced in the United States, Europe, and Japan: the sonic telepresence series, \"CITY LINKS\" 1-22 (1967- ); the architecturally staged \"MUSIC FOR SOUND JOINED ROOMS\" (1980- ) and the \"MINI-SOUND SERIES\" (1985- ) a new multimedia form which she created, that is unique in its use of architecture and serialized narrative., 46217=Audio for this broadcast can be found at: http://laruletaradio.wordpress.com/2010/12/21/mask-enciso-briseno-stockh..., 92395=While in residence at the University of Buffalo, in 1967, she created City Links: Buffalo, a 28-hour piece using 5 microphones in different parts of the city, broadcast live by radio station WBFO. There were several other pieces in the \"City Links\" series, though many details are not yet known. A common feature was the use of telephone lines to connect the sound environments of different sites into the same space, a very early example of what is now called \"telematic performance\" and preceded much more famous examples of this by Max Neuhaus and others., 37400=Regulations –  In 1945, 151085=Copyright © 2012 KBOO Community Radio | Copyright Policy | Community Guidelines | Website Illustration & Design by: KMF ILLUSTRATION, 142662=Latest newsletter: May 2015, 90785=Maryanne was born in 1938 in Kane, Pennsylvania, to an American nurse and a Swiss freight train worker. Amacher left Kane to attend the University of Pennsylvania where she received a B.F.A in 1964. Subsequently, she did graduate work in acoustics and computer science at the University of Illinois at Urbana-Champaign.  While there she studied composition with George Rochberg and Karlheinz Stockhausen., 63261=PLAYLIST: Pastures of Plenty June 30, 2010, Wednesday, 5:30 to 7:00 AM KBOO Portland, OR: 90.7 Corvallis/Albany, OR: 100.7 Hood River/Columbia Gorge: 91.9 Host: Don Jacobson Posted to: Folkdj-l Webcast on  http://www.kboo.fm (VA) = Various Artists.  All media are CDs unless otherwise stated. Artist: \"Selection\" ALBUM TITLE [Label] (VA) Will Geer: Excerpt from This Land Is Your Land \"I Hate A Song That ...\" A TRIBUTE TO WOODY GUTHRIE [Warner Bros.] ((Intro)) ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Sandy Rothman/Steve Pottier: \"In The Pines\" BLUEGRASS GUITAR DUETS [Sierra] ((Music Bed)) ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Ann Hills: \"Pennsylvania\" POINTS OF VIEW [Appleseed] David Goodman: \"Canyon Sunrise\" LIGHT IN THE TUNNEL [Self] 3 Penny Acre: \"I Ain't Blind\" HIGHWAY 71 [Self] Jenny & Billy: \"I Saw A Man At the Close of Day\" LONGING FOR HEAVEN [Jewell Ridge] Gordon Bok: \"The Beaches of Lukannon\" OTHER EYES [Timberhead] ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ The John Hartford Stringband: \"Homer the Roamer\" MEMORIES OF JOHN [Compass] Si Kahn: \"Hunter\" COURAGE [Strictly Country] ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Robin Greenstein: \"Come Al You Fair And Tender Maidens\" IMAGES OF WOMAN Vol. 2 [Windy] (VA) Geoff Muldaur & the Texas Sheiks: \"The World Is Going Wrong\" THINGS ARE COMIN' MY WAY [Black Hen] Suzy Thompson & Del Rey: \"Mongoose Hop\" HEN PARTY [Hobeman] David Rawlings Machine: \"It's Too Easy\" A FRIEND OF A FRIEND [Acony] Mick Ryan & Pete Harris: \"Voices From the Past\" THE LONG ROAD [Wild Goose] ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Lisa Ornstein & Andre Marchand: \"Quadrille de Ancestres/Quadrille des Laurentides\" ONE FINE SUMMER'S DAY [Self] Gabe McVarish: \"Polkas\" ECLECTION [Greentrax] Lunasa: \"The Shore House\" LA NUA [Self] ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ John McCutcheon: \"Survivor/Well May the World Go\" UNTOLD [Appalseed] John McCutcheon: \"Boys In Green\" UNTOLD [Appalseed] ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ The Haints Old Time Stringband: \"Riley the Furniture Man\" SHOUT MONAH [Self] Red Molly: \"Tear My Stillhouse Down\" JAMES [Self] Red Molly: \"Wayfaring Stranger\" LOVE AND OTHER TRAGEDIES [Self] ~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~~ Questions & comments are welcome.}", "lastModified": "Sat, 01 Aug 2015 03:57:51 +0000", "textBeforeTable": "06/30/2010 Air date:  Ital Vibes Program name:  Ital Vibes playlist for 06/30/2010 view full schedule To be determined 10:00pm-12:00am One Two, One Two Mobile Support Archives Listen Schedule Programs   Audio Options Listen Now! Events Donate Today", "textAfterTable": "Don Corleon Da Professor Low We Bank Robbers Riddim Don Corleon Savage Neatest Bank Robbers Riddim Don Corleon Merital Style & Pattern Bank Robbers Riddim Don Corleon Timberlee/Ward 21 Top Dweller Instrumental Ward 21 Timberlee Wanna Be On Top Ward 21 DwaJay Exit 21 Riddim Instrumental Exit 21 Riddim DwaJay Demarco Turn Him On Exit 21 Riddim DwaJay Demarco Turn Him On (Remix) Exit 21 Riddim DwaJay Lazeme Virgin Riddim Instrumental Virgin Riddim Lazeme Jah Wayne Best Rider Virgin Riddim Lazeme Black Ryno Gimmi Some Virgin Riddim Lazeme Ward 21 Cosa Nostra Riddim Instrumental Cosa Nostra Riddim Ward 21 Natel Like A Clock Cosa Nostra Riddim Ward 21 Da Professor Too Rich Cosa Nostra Riddim Ward 21 Tifa Reject Cosa Nostra Riddim Ward 21 Natalie Storm Nuh Tekki Back Cosa Nostra Riddim Ward 21 Lady Saw Tighta Cosa Nostra Riddim Ward 21 Kirkledove Jump Drive Riddim Instrumental Jump Drive Riddim Kirkledove Busy Signal Call The Police Jump Drive Riddim Kirkledove Natel One Foot Jump Drive Riddim Kirkledove", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}