{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11", "12", ""], ["Name", "Carry the Broken", "ExplicitToo Little Too Late", "XO Skeleton", "ExplicitConscience Is a Killer", "Ex Marks the Spot", "The Cali Buds", "Your Mistake", "ExplicitF**k the System", "500 Days of Bummer", "ExplicitTempt Me, Temptation", "ExplicitIdentity On Fire", "If You Lived Here You'd Be Home", "BookletDigital Booklet - Identity On Fire"], ["Artist", "A Skylit Drive", "A Skylit Drive", "A Skylit Drive", "A Skylit Drive", "A Skylit Drive", "A Skylit Drive", "A Skylit Drive", "A Skylit Drive", "A Skylit Drive", "A Skylit Drive", "A Skylit Drive", "A Skylit Drive", "A Skylit Drive"], ["Time", "1:23", "3:11", "3:30", "3:55", "4:35", "3:38", "3:48", "2:57", "4:22", "3:29", "4:18", "4:10", "--"], ["Price", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "1,29 €", "Album Only"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Identity On Fire by A Skylit Drive", "title": "", "url": "https://itunes.apple.com/cy/album/identity-on-fire/id414487267", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00304-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 878249935, "recordOffset": 878225874, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{126510=Copyright © 2014 Apple Inc. All rights reserved.}", "lastModified": "Fri, 31 Jul 2015 08:28:16 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist A Skylit Drive Identity On Fire iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Identity On Fire by A Skylit Drive, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes", "textAfterTable": "13 Items Album Review Released less than two years after Adelphia, Identity on Fire offers more of the familiar A Skylit Drive formula: emotional, weighty alt-rock anthems punctuated by guttural growls, screams, electronics, and the occasional synthesizer. Like many screamo bands, A Skylit Drive put most of their energy into making volatile (but melodic) music, saving Brian White’s screams for key moments and giving most of the spotlight to lead vocalist Michael Jagmin. Much has been made of Jagmin’s similarity to Geddy Lee, and these 12 songs do little to dispel that connection. He sings in an impossibly high register, with a touch of nasality and drama-kid theatricality adding some color to the melodies. The other bandmates don’t take such unique approaches to their own instruments, but they do know how to keep things varied, whether they’re launching into half-time during a bridge or sprinkling some dark, atmospheric electronica into an otherwise straightforward rock song. At times, the guys resemble a rap-free Linkin Park; elsewhere, they’re indistinguishable from millennial metalcore acts like We Came as Romans. A Skylit Drive have a rare frontman in Michael Jagmin, though, and they’d do well to stretch more boundaries on their future albums. Biography Formed: Lodi, California Genre: Rock Years Active:", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}