{"relation": [["Artist", "Blue Foundation", "Dragonette", "Duke Ellington", "Felicia Carter", "Fort Lean", "Junior Prom", "Morning Parade", "Pj Parker", "Tvd Nola Band", "Tvd Nola Band"], ["Song Title", "Eyes On Fire", "Let it Go", "It Don't Mean a Thing ft. Ivie Anderson", "Hooray For You", "The Mall", "Take It Back", "Speechless", "So What Do You Say", "Stop Breaking Down", "It Don't mean a Thing (If It Ain't Got That Swing"], ["Played When", "Damon and Elena wake up together in the morning.", "Elena, Bonnie and Charlotte dance and drink.", "Damon and Charlotte at the bar in New Orleans.", "Lexi tells Damon not to go to war with Stefan.", "Tyler and the hybrids play pool at the Grille.", "Elena, Bonnie and Caroline start drinking.", "Damon and Elena talk at the end of the episode.", "Lexi and Stefan find Damon at the bar.", "Damon and Stefan walk through New Orleans.", "Damon and Charlotte meet up at the bar."]], "pageTitle": "The Vampire Diaries Season 4 Episode 8 - We'll Always Have Bourbon Street (4x8) - Watch Online - s4 e8 Spoilers", "title": "", "url": "http://www.tvrage.com/The_Vampire_Diaries/episodes/1065244974?vote=3", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 5, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00234-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 784919780, "recordOffset": 784903836, "tableOrientation": "HORIZONTAL", "textBeforeTable": "Music Trivia: Bourbon Street is New Orleans is famous for its many bars and restaurants. Casting: Main cast members Steven McQueen (Jeremy Gilbert), Zach Roerig (Matt Donovan), and Joseph Morgan (Klaus) do not appear in this episode. Ratings: 2.42 Million Viewers Episode Notes Read the full recap Recap The episode begins and Damon wakes up Elena is still there, in her underwear. He's happy. Caroline wants to go to Tyler for advice on the sire bond. Tyler, Hayley and Kim, who broke her bond, oversee Adrian's attempts to break the sire bond to Klaus. At his house, Damon tries to convince Elena to wait to tell Stefan about them, just for one day. She agrees. At school, Elena invites Caroline and Bonnie over to the Salvatores. Bonnie has some new small spells from Shane she wants to try. Shane comes back to his office to find Hayley rooting through his stuff. Once she brings him 12 unsired hybrids, he'll give her information on her biological parents. .. Tyler Lockwood As Michael Trevino", "textAfterTable": "Episode Quotes Elena: What is that face? Damon: What face? Elena: That face! Damon: I'm happy. Damon: Is it impossible to think that she can have feelings for me? Stefan: No, it's impossible for her to be so blind that she doesn't see how wrong you are for her. Damon: You doing what's best for her, or what's best for you? Elena: Do you girls have any plans tonight? I'm in desperate need of some girl talk. Bonnie: Yeah, I'm in! Shane taught me some small spells I've been wanting to try. Caroline: Oh, creepy professor guys is Shane now. Bonnie: He's not...he's not creepy. Elena: We're not judging. Caroline: I am. Caroline: Ok, if you don't start hugging me back this is gonna get really awkward really fast. Elena: You've got my hands pinned down. Lexi: Stefan is better off alone, than with you. Damon: What makes you think I'm not balanced and restrained? Lexi: The fact you never have been. Stefan: You know, prove me you're wrong. Tell her", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}