{"relation": [["Author", "kenisu3000", "kenisu3000", "kenisu3000", "kenisu3000", "kenisu3000"], ["Title", "Prologue - Page 22: The Sentence is Passed", "Prologue - Page 23: Welcome to the First Day of the Rest of Your Life", "Prologue - Page 24: George Knows", "Prologue - Page 2: The Shadow from Above", "Prologue - Page 3: Escape into the Woods"], ["Description", "kenisu - #22 This is one of those times when I kinda wish I had gone with the EB Zero town/area names instead of the names from MOTHER. \"Holy Loly Mountain\" sounds just plain silly, and doesn't convey the sense of horror and majesty that \"Mt. Itoi\" does.", "kenisu - #23 Yeesh, that musta been one heck of a backhand the sheriff delivered, to keep George out cold ALL THE WAY to and halfway up Holy Loly Mountain. Anyway, I love that last panel. I grabbed my copy of the MOTHER 1+2 official guidebook and illustrated the map layout of the lake section of the mountain; and that off in the distance is the mountain peak. A severely important thing will happen on that peak in the distant future...", "kenisu - #24 I had been looking forward to this page ever since I started the prologue. It's all about the plot buildup!!", "kenisu - #02 This whole bit with George using British dialect (\"oh pooh\" , \"what a bother\")... I'm not too familiar with the EXACT way people spoke back in 1906, but I knew it was more proper and people had much more respect for others and their elders than today, so I subsituted the only proper dialect I'm anywhere near familiar with. You'll see more of this \"British\" dialect later on in the prologue. By the way, the game simply states that all this happened in the \"beginning of the 1900's\", not a specific year. I only chose 1906 because it IS stated that George returned two years later - in this case, that would be 1908 - and EarthBound Zero states that when the game, which IS officially stated to take place in 1988, begins, it is 80 years after George and Maria's time. So in case you were wondering, there is indeed a method to my madness.", "kenisu - #03 For those who haven't played the game, or have a very good memory of it, you'll find out, much MUCH later, exactly WHAT it is that is above George and Maria's house (or you can just play Mother and it'll tell you right there in the two paragraphs in the opening narration). What I'm most proud of in this page is the fifth panel (the long one that dives under Maria's \"What is THAT above our house?!\" panel and juts out a bit under the third) - I absolutely nailed what I had in my head for that shot, and it also gives a glimpse at what I love so much about the landscapes of Mother. If you don't pay much attention to the detail anywhere else on this page, study this panel carefully. At the left end you can see George and Maria in the distance entering the forest, and at the right end is a pair of mysterious legs and a tail descending slowly in front of their home. The dialogue of the panic-stricken couple was quite touch-and-go for me. I wasn't exactly sure what direction I wanted them to escape, but I wanted Mothersday Town to be mentioned, so I made that their planned route (BTW, I found out recently that the holiday Mother's Day didn't even exist in 1906, much less a town named after it...). Then I needed an outlet for the couple, someONE they could run to. So, using the concept of simple names like \"George\", I had him mention, in passing, some guy named \"James\". At first, James only existed for the sake of George mentioning someone they could run to, but as I was illustrating page 7, I found a way to use James further as not only as an outlet, but as THE outlet to represent a family friend's reaction to all that's about to happen. Yes, we'll get to see James in person later, and he'll come strongly into play."], ["Date", "12/1/06", "12/1/06", "12/1/06", "9/24/06", "9/24/06"], ["Rank", "0.00", "0.00", "0.00", "0.00", "0.00"]], "pageTitle": "STARMEN.NET - EarthBound / Mother 3 Goodness.", "title": "", "url": "http://starmen.net/vote/vote.php?id=27443&stuffPageNumber=25", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042990112.50/warc/CC-MAIN-20150728002310-00059-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 220538548, "recordOffset": 220530706, "tableOrientation": "HORIZONTAL", "textBeforeTable": "> W T S Q P N M I G F D C B A < Other Submissions by kenisu3000 ...Though I still wonder what I was thinking when I chose _lost_ as a \"translation\" of _wasuremono_. In that case, _left behind_ would still have worked. As for the password, it was only recently, when I went to draw over the sketch, that I finally realized the connection between the two parts of the code: _Where is God's Tail?_ is the prompt, and _Lost on the ship that sails the heavens_ is the answer. The second part isn't clarifying _what_ God's Tail is (my old translations read \"The item left behind\" instead of \"Lost\"), it's clarifying _where_ the Tail is. One of the most annoying things about trying to make a fleshed-out story of MOTHER: most of the characters don't have a last name. So I", "textAfterTable": "1 2 3 4 5 6 7 8 9 10 11 12 13 14 15 16 17 18 19 20 21 22 23 24 25 26 27 28 Junk: Weird Junk: Earthbound Thing of the Day. Awesome Fan Thing of the Day.", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}