{"relation": [["", "51", "52", "53", "54", "55", "56", "57", "58", "59", "60", "61", "62", "63", "64", "65", "66", "67", "68", "69", "70", "71", "72", "73", "74", "75"], ["Name", "On ne change pas", "You Shook Me All Night Long (Duet with Anastacia-Live from VH1 Divas)", "I Believe In You (Je crois en toi) [English French Version]", "River Deep, Mountain High (Live)", "On ne change pas (Live)", "I Hate You Then I Love You", "Eyes On Me", "Taking Chances", "Ziggy (Un garçon pas comme les autres)", "Tout l'or des hommes", "Then You Look At Me", "On ne change pas", "What a Wonderful World (Live)", "Come to Me", "Sous le vent", "Stand By Your Side", "One Heart", "Love Is All We Need", "The Prayer", "Ave Maria", "Another Year Has Gone By", "O Holy Night", "Let's Talk About Love", "Just a Little Bit of Love", "Treat Her Like a Lady"], ["Album", "D'eux / S'il suffisait d'aimer", "You'll Never Be Alone - Single", "Voices from the FIFA World Cup", "Céline Dion : Live à Paris", "Au cœur du stade (Live)", "Best of Pavarotti & Friends - The Duets", "Taking Chances (Deluxe Version)", "Taking Chances (Deluxe Version)", "The Collector's Series, Vol. 1", "1 Fille & 4 types", "Bicentennial Man", "On ne change pas", "A New Day... Live In Las Vegas", "Miracle", "Seul", "One Heart", "One Heart", "One Heart", "These Are Special Times", "These Are Special Times", "These Are Special Times", "These Are Special Times", "Let's Talk About Love", "Let's Talk About Love", "Let's Talk About Love"], ["Time", "4:08", "3:50", "4:00", "3:29", "6:03", "4:48", "3:53", "4:02", "2:56", "2:58", "4:22", "4:07", "4:44", "4:33", "3:31", "3:33", "3:24", "3:49", "4:28", "4:55", "3:24", "5:20", "5:12", "4:06", "4:05"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "1,29 €", "0,99 €", "0,69 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "1,29 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Céline Dion", "title": "", "url": "https://itunes.apple.com/lt/artist/celine-dion/id63729?trackPage=3", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00255-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 863634183, "recordOffset": 863605316, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{40513=Her appearance on VH1's Divas Live special with Aretha Franklin, Gloria Estefan, Mariah Carey, and Shania Twain proved popular as well, and helped solidify Dion's position — not only among contemporary female pop singers but historical greats like Franklin. The continuing popularity of her recordings and live performances made her 1999 sabbatical seem like a tragedy to her fans, but Dion needed a break after more than a decade and a half at a breakneck pace. In 1999, her husband Angélil was diagnosed with throat cancer. While the disease responded well to treatment and went into remission, the illness was a wake-up call for Dion, who decided to put a new emphasis on her family life and announced a temporary retirement so that she could spend more time at home and have a child. After undergoing fertility treatments, she gave birth to a son in January 2001. The Collector's Series, Vol. 1 was released during Dion's hiatus; it featured many of her best-loved songs, as well as a Spanish-language version of \"All by Myself.\", 44763=Born in Charlemagne, Quebec, Dion was the youngest in Adhemar and Therese Dion's family of 14 children. She was raised in a household filled with love for children and music, and her parents and siblings were important figures in the early development of her singing career. Celine began singing in her parents' piano bar when she was just five years old. By age 12, she had written one of her first songs, \"Ce N'etait Qu'un Rêve\" (It Was Only a Dream), which she recorded with the help of her mother and brother and shipped to a manager named René Angélil, whose name they found on the back of an album by Ginette Reno, a popular Francophone singer. When the 12-year-old eventually performed for Angélil, he cried and set in motion the process of making her a Québécois, and later, an international, star. He mortgaged his house to pay for her first two albums, producing a local number one single. In 1983 she became the first Canadian to have a gold record in France and she won a gold medal at the Yamaha songwriting competition in Japan. Her worldwide reputation was in the making, but success in the United States was not yet forthcoming., 37417=Debuting in early 2003, the campaign dovetailed into the March release of One Heart, Dion's first album since 2001's A New Day Has Come, which in turn heralded the opening of A New Day on March 25, 2003. That live Las Vegas show was documented on the summer 2004 release New Day: Live in Las Vegas, which was followed a few months later by Miracle, a collection of family songs designed as a tandem book/CD project between Dion and photographer Anne Geddes. The two-CD compilation On Ne Change Pas appeared in 2005, featuring her most popular French-language songs and a new collaboration with the operatic pop vocal foursome Il Divo, \"I Believe in You (Je Crois en Toi).\" A new French-language album, D'Elles, arrived in May 2007 and debuted at the top of the Canadian album chart. In November of that same year, Dion released the English-language Taking Chances and announced a tour of South Africa and Europe scheduled for 2008. A range of projects consumed the next few years for her, including the release of a live audio/video set Taking Chances World Tour: The Concert, the documentary video Celine: Through the Eyes of the World, and, in 2012, a French album titled Sans Attendre., 41668=One of the hardest-working stars in show business, Dion continued to record and perform on a schedule that would kill most people. She recorded six albums between 1992 and 1996, when her album Falling into You took her to a new level of stardom. The recording was a runaway hit, winning Grammys for both Album of the Year and Best Pop Album. Another honor arrived in 1996; she was asked to perform at the opening ceremonies of the Atlanta Olympics. Dion's longest tenure on the pop charts would come the following year, however, when she recorded \"My Heart Will Go On,\" the theme song for James Cameron's blockbuster movie Titanic. \"My Heart Will Go On\" became omnipresent on the radio as Titanic fever swept the world, and when it was featured on her album Let's Talk About Love, it helped propel that recording to the top of the charts. By then, Dion had the power to gather a supporting cast of stars, and the album contained an amazing collection of artists, including Barbra Streisand, Luciano Pavarotti, and the Bee Gees. The album would win a host of awards and bring Dion a whole new world of fans., 39434=Dion returned to the public eye in a big way in March 2002 with A New Day Has Come. The album debuted at number one in over 17 countries, and was accompanied by a full-scale media blitz. But Dion's greatest challenge was yet to come. Despite millions of albums sold, the adoration of fans worldwide, and the validation of her peers, Dion's success was still hampered by image problems that had dogged her since the days of \"Canine Dion.\" While many Americans adored her, just as many snickered at her Québécois heritage and the relative unorthodoxy of her marriage. There was also the issue of her relevancy to lucrative audiences existing outside of her pop vocal constituency. To combat these issues, Dion and her management made a series of bold moves that attempted to solidify her career and ensure its continuity as she entered her mid-thirties., 42586=\"Beauty & the Beast\" reached number one on the pop charts and won both a Grammy and Academy award. The song was also featured on her second English album, 1992's Celine Dion, which launched another Top Ten American hit with \"If You Asked Me To,\" while spawning two additional Top 40 singles, \"Nothing Broken But My Heart\" and \"Love Can Move Mountains.\" During this time there were also important developments in Dion's personal life. In 1988, Angélil crossed the line from manager to romantic partner when he kissed Dion one night after a show in Dublin. Fearful that fans would find the 26-year difference in their ages unsettling, the couple kept their relationship a secret for several years. But their 1994 wedding in Montreal's Notre Dame Basilica was celebrated not only by the 250 invited guests, but by millions of fans worldwide., 36190=In 2013, Dion's English-speaking fans' six-year wait was rewarded with the announcement of the album Loved Me Back to Life. Heralded by its hip-hop-inflected title track single, the album, released in November, featured duets with Ne-Yo and Stevie Wonder alongside a cover of Daniel Merriweather's \"Water and a Flame.\" It hit the Top Ten in at least 20 countries on its way to sales of close to 1.5 million copies. The audio/video concert package Seule Fois: Live 2013 followed in May 2014., 43539=When she was 18, Dion saw Michael Jackson performing on television and told Angélil that she wanted to be a star like him. Angélil's response was to order her to take 18 months off to remake her image. Dion underwent a physical transformation, cutting her hair, plucking her eyebrows, and having her teeth capped to cover up the incisors that had caused a Quebec humor magazine to dub her \"Canine Dion.\" She was also sent off to English school to polish the language that would help her to break into the American market. When she emerged from this process, she had made an amazing transformation from teen star to adult chanteuse. The payoff came almost immediately. Her 1990 breakthrough album, Unison, was released in the U.S. by Epic Records and produced several hit songs, but it was her duet with Peabo Bryson on the theme song of Disney's Beauty & the Beast that was her true breakthrough., 38530=In early 2002, Dion announced a three-year, 600-show contract to appear five nights a week in an entertainment extravaganza at Caesar's Palace, Las Vegas, called A New Day. The production would take place in a custom-built, 4,000-seat theater and would feature Dion as the centerpiece of a multimedia program designed and orchestrated by Franco Dragone, the Belgian theater impresario behind the modern circus phenomenon Cirque du Soleil. The project united Dion, her label Sony Music, Dragone's production company Creations du Dragon, Caesar's parent Park Place Entertainment, and promoter Concerts West in a landmark multi-million-dollar alliance that hinged on Dion's ability to put fans in seats five nights a week for three years. In conjunction with the rollout of A New Day was an endorsement deal with German automaker DaimlerChrysler AG worth additional millions. The campaign placed Dion in a series of black-and-white advertisements promoting the stylish allure of Chrysler's line of upscale automobiles. The performer also recorded a brand-new song to accompany the spots.}", "TableContextTimeStampAfterTable": "{102349=30 March 1968 in Charlemagne, Quebec, Canada, 106820=© „Apple Inc.“, 2014. Visos teisės saugomos.}", "lastModified": "Sat, 01 Aug 2015 04:00:57 GMT", "textBeforeTable": "Top Songs Next 5 4 3 2 1 View In iTunes Parler à mon père - Single 20. View In iTunes Sans attendre 19. View In iTunes Loved Me Back to Life - Single 18.", "textAfterTable": "Previous 1 2 3 4 5 6 7 8 9 10 Next Top Music Videos 1. Parler à mon père View In iTunes 2. The Power of Love (Video) View In iTunes", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}