{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"], ["Name", "Tumble Home", "KT", "Good Question", "Language", "We're With You", "Leni Goes Shopping", "Roll With It", "Texas", "Who Let the Cats Out?", "All You Need", "Blue Runway"], ["Artist", "Mike Stern", "Mike Stern", "Mike Stern", "Mike Stern", "Mike Stern", "Mike Stern", "Mike Stern", "Mike Stern", "Mike Stern", "Mike Stern", "Mike Stern"], ["Time", "8:14", "7:57", "4:17", "7:03", "5:48", "4:38", "5:02", "7:04", "7:44", "6:57", "8:37"], ["Price", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99", "$0.99"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - Who Let the Cats Out? by Mike Stern", "title": "", "url": "https://itunes.apple.com/us/album/who-let-the-cats-out/id187511533?i%3D187513384%26uo%3D4%26at%3D11l79Y", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00329-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 878415135, "recordOffset": 878388542, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{126769=Copyright © 2014 Apple Inc. All rights reserved., 28362=Born: January 10, 1953 in Boston, MA}", "lastModified": "Sat, 01 Aug 2015 04:34:01 GMT", "textBeforeTable": "Open iTunes to preview, buy, and download music. View More by This Artist Mike Stern Who Let the Cats Out? iTunes for Mac + PC Already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from Who Let the Cats Out? by Mike Stern, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn't open, click the iTunes application icon in your Dock or on your Windows desktop. Opening", "textAfterTable": "11 Songs Album Review More than two decades into his solo career, Mike Stern, on his 13th album as a leader, continues to prove why he's earned so many \"Best Jazz Guitarist\" honors through the years. Stern's skills are undeniable, and new ideas never fail to materialize when he's at work. But what makes Stern stand out from the pack of virtuosic guitar technicians is that he always insists on letting his, and his support team's, abilities serve the music, not vice versa. On Who Let the Cats Out?, Stern and his well-chosen crew spill out lick upon impressive lick, but they never get so carried away with themselves that they lose sight of the tune's purpose and structure. Grandiosity is never a factor here, although there are dozens of occasions to applaud these musicians' chops. Richard Bona, the Cameroonian bassist, has worked with Stern before, but here he is given an expanded role, appearing on four tracks and contributing his falsetto-style, scat-like vocals to three of them: On \"All You Need,\" one of the prettiest tracks on the record, Bona provides an uplifting sensuality. He also shines on \"We're with You,\" a ballad featuring Stern on acoustic guitar. Devoid of pyrotechnics, this song of support to those hurting utilizes synth-derived orchestration and a mournful, quiet tone to bring home", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}