{"relation": [["Author", "Arne Mueller", "Gary Grossman and Marco Molinaro", "Philippe Valadon", "Herbert J. Bernstein"], ["Version, Date", "RasMol 2.6x1 May 1998", "RasMol 2.5-ucb November 1995 RasMol 2.6-ucb November 1996", "RasTop 1.3 August 2000", "RasMol 2.7.0 March 1999 RasMol 2.7.1 June 1999 RasMol 2.7.1.1 January 2001 RasMol 2.7.2 August 2000 RasMol 2.7.2.1 April 2001 RasMol 2.7.2.1.1 January 2004 RasMol 2.7.3 February 2005"], ["Copyright", "© Arne Mueller 1998", "© UC Regents/ModularCHEM Consortium 1995, 1996", "© Philippe Valadon 2000", "© Herbert J. Bernstein 1998-2005"]], "pageTitle": "RasMol V2.7.3 Mac Binaries", "title": "", "url": "http://www.rasmol.org/software/RasMol_2.7.3.MAC/index.html", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 2, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988061.16/warc/CC-MAIN-20150728002308-00252-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 657718502, "recordOffset": 657710300, "tableOrientation": "HORIZONTAL", "TableContextTimeStampBeforeTable": "{1=Thanks to translations by Fernando Gabriel Ranea in late 2000 and early 2001, RasMol is now capable of rendering most menu items and messages in Spanish. Jean-Pierre Demailly provided French translations of menus and messages in January 2001. Giuseppe Martini and Giovanni Paolella with contributions by A. Davassi, M. Masullo and C. Liotto provided Italian translations of menus and messages in March 2001.}", "TableContextTimeStampAfterTable": "{15491=with RasMol 2.7.3 incorporating changes by Clarice Chigbo, Ricky Chachra, and Mamoru Yamanishi. Work on RasMol 2.7.3 supported in part by grants DBI-0203064, DBI-0315281 and EF-0312612 from the U.S. National Science Foundation and grant DE-FG02-03ER63601 from the U.S. Department of Energy., 17487=The original RasMol manual was created by Roger Sayle. In July 1996, Dr. Margaret Wong of the Chemistry Department, Swinburne University of Technology, Australia, made extensive revisions to the RasMol 2.5 manual to accurately reflect the operation of RasMol 2.6. Eric Martz of the University of Massachusetts made further revisions. In May 1997, William McClure of Carnegie Mellon University reorganized the HTML version of the manual into multiple sections which could be downloaded quickly and added use of frames. Portions of the 2.7.1 version of the RasMol manual were derived with permission from William McClure's version using Roger Sayle's rasmol.doc for version 2.6.4 as the primary source. Changes were made in August 2000 for RasMol version 2.7.2, January 2001 for RasMol version 2.7.1.1 and April 2001 for RasMol version 2.7.2.1.}", "lastModified": "Tue, 26 Apr 2005 22:59:22 GMT", "textBeforeTable": "and Based on Mods by Copyright © Roger Sayle 1992-1999 Version 2.6, August 1995, Version 2.6.4, December 1998 Biomolecular Structures Group, Glaxo Wellcome Research & Development, Stevenage, Hertfordshire, UK Based on RasMol 2.6 by Roger Sayle     rasmol.hlp Apple Macintosh (Mac OS X 10.3.9), 8 bit display for X-windows system, NOT CLASSIC, using xforms in /sw/lib/libforms rasmol_XFORMS_8BIT     rasmol.hlp Apple Macintosh (Mac OS X 10.3.9), 32 bit display for X-windows system, NOT CLASSIC, using xforms in /sw/lib/libforms rasmol_XFORMS_32BIT     rasmol.hlp Apple Macintosh (Mac OS X 10.3.9), 16 bit display for X-windows system, NOT CLASSIC, using xforms in /sw/lib/libforms rasmol_XFORMS_16BIT     rasmol.hlp Apple Macintosh (Mac OS X 10.3.9), 8 bit display for X-windows system, NOT CLASSIC, no xforms rasmol_8BIT     rasmol.hlp Apple Macintosh (Mac OS X 10.3.9), 32 bit display for X-windows system, NOT CLASSIC, no xforms rasmol_32BIT", "textAfterTable": "with RasMol 2.7.3 incorporating changes by Clarice Chigbo, Ricky Chachra, and Mamoru Yamanishi. Work on RasMol 2.7.3 supported in part by grants DBI-0203064, DBI-0315281 and EF-0312612 from the U.S. National Science Foundation and grant DE-FG02-03ER63601 from the U.S. Department of Energy. and Incorporating Translations by Author Item Language Isabel Serván Martínez, José Miguel Fernández Fernández 2.6 Manual Spanish José Miguel Fernández Fernández 2.7.1 Manual Spanish Fernando Gabriel Ranea 2.7.1 menus and messages Spanish Jean-Pierre Demailly 2.7.1 menus and messages French Giuseppe Martini, Giovanni Paolella, A. Davassi, M. Masullo, C. Liotto 2.7.1 menus and messages 2.7.1 help file Italian This Release by Herbert J. Bernstein, Bernstein + Sons, P.O. Box 177, Bellport, NY, USA yaya@bernstein-plus-sons.com Copyright © Herbert J. Bernstein 1998-2005 The original RasMol manual was created by Roger Sayle. In July 1996, Dr. Margaret Wong of the Chemistry Department, Swinburne University of Technology, Australia, made extensive revisions to the RasMol 2.5 manual to accurately", "hasKeyColumn": true, "keyColumnIndex": 0, "headerRowIndex": 0}