{"relation": [["", "1", "2", "3", "4", "5", "6", "7", "8", "9", "10", "11"], ["Name", "The Girl I Am", "Come to Bed (Featuring John Rich)", "One of the Boys", "You Don't Have to Go Home", "Heaven Help Me", "There's a Place In the Whiskey", "If You Want a Mother", "Pain Killer", "There Goes the Neighborhood", "Good Ole Boy", "To Tell You the Truth"], ["Artist", "Gretchen Wilson", "Gretchen Wilson featuring John Rich", "Gretchen Wilson", "Gretchen Wilson", "Gretchen Wilson", "Gretchen Wilson", "Gretchen Wilson", "Gretchen Wilson", "Gretchen Wilson", "Gretchen Wilson", "Gretchen Wilson"], ["Time", "3:29", "3:53", "3:37", "3:17", "3:24", "3:01", "3:32", "3:42", "2:57", "2:51", "3:31"], ["Price", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €", "0,99 €"], ["", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes", "View In iTunes"]], "pageTitle": "iTunes - Music - One of the Boys by Gretchen Wilson", "title": "", "url": "https://itunes.apple.com/sk/album/one-of-the-boys/id252864732", "hasHeader": true, "headerPosition": "FIRST_ROW", "tableType": "RELATION", "tableNum": 0, "s3Link": "common-crawl/crawl-data/CC-MAIN-2015-32/segments/1438042988458.74/warc/CC-MAIN-20150728002308-00135-ip-10-236-191-2.ec2.internal.warc.gz", "recordEndOffset": 874371623, "recordOffset": 874338503, "tableOrientation": "HORIZONTAL", "TableContextTimeStampAfterTable": "{30492=One of the Boys isn't only the most diverse record from Wilson thus far, it's her most adventurous. It reveals so much, yet leaves the listener yearning to know more because it asks profound questions. Its songs are tight and wonderfully produced; these songs embrace the modern guise of the current country scene, even as the writing and singing put her squarely inside the music's grand tradition. She's offering the listener so much more of herself than she has before by admitting that she's still trying to find her way in truly dark times as well as joyous ones. This is a portrait of an artist who arrives here fully mature, with a clear vision and an uncompromising sense of direction. One of the Boys is the record Gretchen Wilson has been waiting to deliver since she came to Nashville, maybe since she dreamed of becoming a country singer and songwriter. We all benefit from her restlessness and her relentless pursuit of excellence. This is as good as it gets right now; it'll be the country album to beat in 2007., 127138=Copyright © 2014 Apple Inc. Všetky práva vyhradené., 22339=Since 2005, Wilson has written a book — named for her first single — and absorbed the whirlwind of her life in the studio and as an internationally renowned celebrity. Rather than follow formulas, Wilson decided to do everything her way on One of the Boys, and that meant change. Once again producing with aid from Rich and Wright, Wilson shines this time out as a songwriter as well as a singer. She co-wrote nine of the album's 11 songs with Rich, longtime collaborator Vicky McGehee, and Rivers Rutherford. She says in the small note in the booklet that this is the most important recording she's ever made; it's her diary set to music. She's telling the truth. While there are excellent rockers on this set, there are also poignant ballads. One of the Boys (the title track is a great song with an intentionally misleading title) is a true country album. It has steel guitars, fiddles, and mandolins everywhere. It touches the heart of the tradition deeply from the opening cut, particularly in the ballads. Wilson is following her own muse, the one that comes from the lineage of Haggard, Parton, Lynn, and Strait as much as it does Hank Jr., Daniels, Skynyrd, and Kid Rock. The former side of her inspiration comes through loud and clear without sacrificing the persona her fans have come to know and love. This means one thing: that Wilson is the real deal: 100 percent authentic. She has become an artist without compromise, and it's obvious from the first note of \"The Girl I Am,\" the set's opening cut. Fiddles and electric guitars announce her lyrics and it's in the final verse that she lays it out bare: \"Sometimes I know there's somethin' missing/Sometimes I want to start again/Sometimes I scream and no one listens/Sometimes I feel like givin' in.\" There's confession and self-doubt here, but in the refrain she states: \"And I never make apologies, 'cause I don't give a damn/I guess I'll always be the girl I am.\" The end result: she expresses the complexities of being human and claims radical self-acceptance. The artist who revealed herself early on is speaking from the other side, from her femininity and vulnerability, but there's great strength here, too, as the Don Rich-style guitars spit and roll, with a whining pedal steel, and the fiddle accents every line., 31639=Born: 26 June 1973 in Pocahontas, IL}", "lastModified": "Sat, 01 Aug 2015 04:14:43 GMT", "textBeforeTable": "Open iTunes to preview, buy and download music. View More by This Artist Gretchen Wilson One of the Boys iTunes for Mac + PC Do you already have iTunes? Click I Have iTunes to open it now. We are unable to find iTunes on your computer. To preview and buy music from One of the Boys by Gretchen Wilson, download iTunes now. iTunes is the world's easiest way to organize and add to your digital media collection. iTunes Progress Indicator If iBooks doesn't open, click the iBooks app in your Dock. Opening the iBooks Store. Progress Indicator If iTunes doesn’t open, click the iTunes icon in your Dock or on your Windows desktop. Opening the iTunes", "textAfterTable": "11 Songs Album Review Gretchen Wilson set the country music charts on fire with her smash single \"Redneck Woman\" and her debut album, Here for the Party (2004). The track — though composed by colleague John Rich (of Big & Rich) — became an anthem for women all over America. Written especially for Wilson, it is from-the-gut, working-class feminism for the post-feminist age, straightforwardly sung with a celebratory vengeance. As a slice-of-life singer who embodied and brought to life each cut on the album, she became an \"overnight sensation.\" Her follow-up, All Jacked Up (2005), was recorded and rushed out by Sony a year later. Certainly the marketing department wanted to capture Wilsonmania, since her debut sold five-million copies. During the process, Wilson fought for the songs she wanted and got her way, and she co-produced with Rich and Mark Wright. Once more, she didn't write a single track on the set, but made her own song choices. The problem was (and remains true for virtually any artist) that following a debut phenomenon like Here for the Party is not only difficult, it's all but impossible. It went platinum, and concert tours sold out everywhere she played, but didn't hit the same mark despite being a better album song for song. Since 2005, Wilson has written a book — named", "hasKeyColumn": true, "keyColumnIndex": 1, "headerRowIndex": 0}